[
  {
    "title": "Viktor Yanukovych | Facts, Biography, Maidan Protests, & Flight to Russia | Britannica",
    "url": "https://www.britannica.com/biography/Viktor-Yanukovych",
    "snippet": "As the 2004 presidential election approached, Yanukovych was presented as Kuchma’s clear successor, and Russian Pres. Vladimir Putin offered support for his candidacy. During the campaign Yanukovych’s chief opponent, the pro-Western Viktor Yushchenko, became ill after an apparent assassination attempt, and the race drew international attention.",
    "published": "February 9, 2010"
  },
  {
    "title": "Viktor Yanukovych - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Viktor_Yanukovych",
    "snippet": "Viktor Fedorovych Yanukovych (born 9 July 1950) is a Ukrainian former politician who served as the fourth president of Ukraine from 2010 to 2014. He also served as the prime minister of Ukraine several times between 2002 and 2007 and was a member of the Verkhovna Rada (parliament) from 2006 to 2010.",
    "published": "1 week ago"
  },
  {
    "title": "Yanukovych Wins Ukraine’s Presidential Election",
    "url": "https://www.oscepa.org/en/news-a-media/press-releases/press-2010/yanukovych-wins-ukraines-presidential-election",
    "snippet": "Yanukovych promised to cut taxes to lift the nation out of recession, unfreeze a $16.4 billion bailout loan and improve relations with Russia and the European Union. He replaces <strong>Viktor Yushchenko</strong>, whose fortunes plunged over political gridlock. Uncertainty may be prolonged after Timoshenko ...",
    "published": null
  },
  {
    "title": "Ukraine After Yanukovych | YaleGlobal Online",
    "url": "https://archive-yaleglobal.yale.edu/content/ukraine-after-yanukovych",
    "snippet": "After hours of negotiation, Yanukovych and the opposition leaders agreed to adopt within 48 hours a special law restoring the Constitution of 2004; create a coalition and form a national unity government within 10 days; enact a constitutional reform to rebalance the powers of the president, government and parliament by September; and hold presidential elections as soon as the constitutional reform was completed by no later than December.",
    "published": null
  },
  {
    "title": "Profile: Ukraine's ousted President Viktor Yanukovych - BBC News",
    "url": "https://www.bbc.com/news/world-europe-25182830",
    "snippet": "As Ukraine&#x27;s protest leaders and opposition moved to fill the power vacuum, Mr Yanukovych, 63, maintained he was still the lawfully elected president.",
    "published": "February 28, 2014"
  }
]