[
  {
    "title": "Stanford",
    "url": "https://hai.stanford.edu/",
    "snippet": "We have a historical opportunity ... a human-centered frameworkfor AI research, education, practice and policy. At HAI, we view the field of AI as spanning the entire university. Unless we tap into the full gamut of disciplinary expertise we cannot hope to realize the potential of the technology while avoiding its pitfalls. ... HAI was established to support innovative AI research that bridges disciplines and fields. The Institute aims to appoint ...",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/company/stanfordhai",
    "snippet": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | 91,795 followers on LinkedIn. Advancing AI research, education, policy, and practice to improve humanity. | At Stanford HAI, our vision for the future is led by our commitment to studying, guiding and developing human-centered ...",
    "published": null
  },
  {
    "title": "Human-Centered Artifical Intelligence | Stanford Momentum",
    "url": "https://momentum.stanford.edu/initiatives/human-centered-artificial-intelligence",
    "snippet": "Drawing on expertise from faculty across the university, including Stanford’s renowned computer science department, and collaborating closely with industry and government, the institute aims to guide the development of AI systems that are groundbreaking, ethical, and equitable—an AI moonshot to serve and uplift humanity. Stanford HAI’s leaders share a commitment to the mission of guiding human-centered AI.",
    "published": null
  },
  {
    "title": "At five years old, Institute for Human-Centered AI looks to the future",
    "url": "https://stanforddaily.com/2024/11/05/stanford-hai-five-years/",
    "snippet": "An area of future work for the institute is transparency of data in large AI systems, Landay said. But, he added, this is something companies likely do not want to do since they view data as proprietary information or as protection from legal liability for “having used data illegally against people’s ownership or copyright,” he said. Landay is also co-leading a partnership established last week between HAI and the Stanford Robotics Center...",
    "published": "November 5, 2024"
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | Stanford Online",
    "url": "https://online.stanford.edu/schools-centers/stanford-institute-human-centered-artificial-intelligence-hai",
    "snippet": "<strong>Stanford founded the Institute for Human-Centered AI in 2019 to guide and build the future of AI.HAI advances AI research, education, policy and practice to improve the human condition. Led by faculty from multiple departments across Stanford</strong>, ...",
    "published": "October 17, 2024"
  }
]