[
  {
    "title": "European Bank for Reconstruction and Development - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Bank_for_Reconstruction_and_Development",
    "snippet": "Consequently, the two divisions ... compose this board, they have authority power. Currently (2024-2025) <strong>Slovenia is the Chair of Board of Governors, while Iceland and Turkey are the Vice Chairs</strong>....",
    "published": "2 weeks ago"
  },
  {
    "title": "Odile Renaud-Basso | World Bank Live",
    "url": "https://live.worldbank.org/en/experts/o/odile-renaud-basso",
    "snippet": "In this position, she also served as Vice-President of the European Economic and Financial Committee, deputy to the G7 and G20 groups and French Governor or Alternate Governor of the World Bank, EBRD and African Development Bank. She was also Chair of the Paris Club.",
    "published": null
  },
  {
    "title": "Odile Renaud-Basso - European Commission",
    "url": "https://commission.europa.eu/persons/odile-renaud-basso_en",
    "snippet": "As part of her role, she also served as Vice-President of the European Economic and Financial Committee, deputy to the G7 and G20 groups and French Governor or Alternate Governor of the World Bank, EBRD and African Development Bank. She was also Chair of the Paris Club.",
    "published": null
  },
  {
    "title": "EBRD governance and leadership",
    "url": "https://www.ebrd.com/who-we-are/our-structure.html",
    "snippet": "Odile Renaud-Basso is the current President of the Bank. The President manages the work of the Bank under the guidance of the Board of Directors. ... The EBRD is owned by 77 countries, the European Union and the European Investment Bank.",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development | Ministry of Foreign Affairs",
    "url": "https://mae.ro/en/node/52924",
    "snippet": "Croatia, Cyprus, Czech Republic, Egypt, Estonia, Georgia, Greece, Hungary, Iraq, Jordan, Kazakhstan, Kenya, Kosovo, Kyrgyz Republic, Latvia, Lebanon, Lithuania, Rep. of Moldova, Mongolia, Montenegro, Morocco, Nigeria, North Macedonia, Poland, Romania, Senegal, Serbia, Slovak Republic, Slovenia, Tajikistan, Tunisia, Türkiye, Turkmenistan, Ukraine, Uzbekistan, West Bank and the Gaza. Starting from 2018, the EBRD went through a process of conceptual reorientation, beyond the initially mandated space, extending to the region of the Middle East and North Africa, given that in many of the countries where the Bank has made investments the economic development reached a level that allows it to reduce or even eliminate financial support.",
    "published": null
  }
]