[
  {
    "title": "Westfalenstadion - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Westfalenstadion",
    "snippet": "The city of Dortmund, initially burdened with 6 million DM, only had to pay 800,000 DM, and quickly profited from the stadium&#x27;s high revenues. On 2 April 1974, Borussia Dortmund officially moved into their new home and has played in <strong>the Westfalenstadion</strong> ever since.",
    "published": "1 week ago"
  },
  {
    "title": "Borussia Dortmund - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Borussia_Dortmund",
    "snippet": "The stadium currently hosts up to 81,359 spectators (standing and seated) for league matches and 65,829 seated spectators for international matches. For these, the characteristic southern grandstand is re-equipped with seats to conform to FIFA regulations. In 1974, <strong>the Westfalenstadion</strong> replaced ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Borussia Dortmund Stadium | Signal Iduna Park | Football Ground Guide",
    "url": "https://footballgroundguide.com/leagues/europe-1/germany/borussia-dortmund.html",
    "snippet": "A guide to Borussia Dortmund stadium, the <strong>Signal Iduna Park</strong> which is also known as the Westfalenstadion and is home to the famous Yellow Wall",
    "published": "1 month ago"
  },
  {
    "title": "Stadium Guide: Westfalenstadion (Borussia Dortmund) | Jobs In Football",
    "url": "https://jobsinfootball.com/blog/stadium-guide-westfalenstadion-borussia-dortmund/",
    "snippet": "Officially titled <strong>Signal Iduna Park</strong> due to sponsorship reasons and referred to as BVB Stadion Dortmund during UEFA competitions (such as the Champions League), Westfalenstadion is the biggest stadium in Germany, with a total capacity that exceeds ...",
    "published": null
  },
  {
    "title": "Signal Iduna Park (2025) - All You Need to Know BEFORE You Go (with Reviews)",
    "url": "https://www.tripadvisor.com/Attraction_Review-g187372-d1965679-Reviews-Signal_Iduna_Park-Dortmund_North_Rhine_Westphalia.html",
    "snippet": "This is one to check off, visit this stadium during a game. The whole city is walking around in yellow, everyone is cozy and everywhere puppet tents for a snack and a drink. At the stadium everyone goes into the stadium on the same side, this can cause some crowds, but there are also all people clearly present to help with questions.",
    "published": null
  }
]