[
  {
    "title": "Ethiopia's PM Abiy appoints new leader of Tigray administration | Reuters",
    "url": "https://www.reuters.com/world/africa/ethiopias-pm-abiy-appoints-new-leader-tigray-administration-2025-04-08/",
    "snippet": "Ethiopia&#x27;s Prime Minister Abiy Ahmed on Tuesday appointed <strong>Tadesse Worede</strong> to lead the interim administration in the northern Tigray region, where divisions in the ruling party have sparked fears of a renewed war between Ethiopia and Eritrea.",
    "published": "April 8, 2025"
  },
  {
    "title": "Ethiopia - World Leaders",
    "url": "https://www.cia.gov/resources/world-leaders/foreign-governments/ethiopia",
    "snippet": "All Foreign Governments · Last Updated: 3/10/2025 · <strong>TAYE Atske Selassie</strong> · ABIY Ahmed Ali · TEMESGEN Tiruneh Dinku · GIRMA Amente · ALEMTSEHAY Paulos · SHEWIT Shanka · Aisha MOHAMMED · BIRHANU Nega · Ahmed SHIDE · GEDION Timothewos ...",
    "published": null
  },
  {
    "title": "Ethiopia Country Strategic Plan (2020-2025) - Ethiopia | ReliefWeb",
    "url": "https://reliefweb.int/report/ethiopia/ethiopia-country-strategic-plan-2020-2025",
    "snippet": "Pursuit of Sustainable Development ... strong government leadership and ownership in both. Significant gaps remain, however, especially at the regional and subregional levels. The more prominent role in Ethiopia’s development envisioned for the private sector will require key policy and institutional reforms that create a more conducive environment for resource mobilization and investment. While Ethiopia’s goal of achieving middle-income status by 2025 continues ...",
    "published": null
  },
  {
    "title": "Ethiopia's new president: Taye Atske Selassie replaces Sahle-Work Zewde",
    "url": "https://www.bbc.com/news/articles/c4g401e086no",
    "snippet": "Taye Astike Selassie, foreign minister since February, has taken up the largely ceremonial role. In Ethiopia, political power lies with the prime minister - currently <strong>Abiy Ahmed</strong>.",
    "published": "October 7, 2024"
  },
  {
    "title": "Politics - ENA English - ENA",
    "url": "https://www.ena.et/web/eng/politics",
    "snippet": "The meeting reaffirmed the Governments commitment to an inclusive, transparent, and well-coordinated COP32 planning process. Throughout November 2025, <strong>Prime Minister Abiy Ahmed</strong> demonstrated results-driven leadership by advancing national priorities in irrigation, tourism, artificial intelligence, ...",
    "published": null
  }
]