[
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "Presidents Daniel Burley Woolfall, Rodolphe Seeldrayers, and Arthur Drewry died during their term in office. The current president is Swiss-Italian <strong>Gianni Infantino</strong>, elected on 26 February 2016 during ...",
    "published": "1 month ago"
  },
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/organisation/president/past-presidents",
    "snippet": "He brought together representatives of the first seven member countries in Paris for the signing of FIFA&#x27;s foundation act and agreement of the first FIFA statutes. On 22 May 1904, Guerin - then just 28 - was elected president at the inaugural FIFA Congress and remained in his post for two years, during which time another eight associations came on board, including the English Football Association.",
    "published": null
  },
  {
    "title": "Gianni Infantino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gianni_Infantino",
    "snippet": "<strong>Giovanni Vincenzo Infantino</strong> (born 23 March 1970) is a Swiss-Italian football administrator and the president of FIFA since 2016. He has also been an International Olympic Committee member since 2020. Following his initial election to the FIFA presidency on 26 February 2016, he was re-elected ...",
    "published": "1 day ago"
  },
  {
    "title": "Sepp Blatter | Biography, FIFA, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Sepp-Blatter",
    "snippet": "<strong>Sepp Blatter</strong> (born March 10, 1936, Visp, Switzerland) is a Swiss sports executive who served as the president (1998–2015) of FIFA (Fédération Internationale de Football Association), the governing body of international football (soccer) ...",
    "published": null
  },
  {
    "title": "FIFA Presidents - My Football Facts",
    "url": "https://www.myfootballfacts.com/world-football/fifa/world-cup/fifa-all-time-world-cup/fifa-presidents/",
    "snippet": "The current FIFA president name is Gianni Infantino. The 2015 election took place on 29th May with <strong>Sepp Blatter</strong> winning a 5th term in office (to 2019) while",
    "published": "April 30, 2025"
  }
]