[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en-m-wikipedia-org.translate.goog/wiki/Die_Linke?_x_tr_sl=en&_x_tr_tl=tr&_x_tr_hl=tr&_x_tr_pto=tc",
    "snippet": "Negotiations for a formal merger of the PDS and WASG continued through the next year until a final agreement was reached on 27 March 2007.[14] The new party, called The Left (Die Linke), held its founding congress in Berlin on <strong>16 June 2007.</strong>",
    "published": "January 7, 2007"
  },
  {
    "title": "Oskar Lafontaine leaves the Left Party - World Socialist Web Site",
    "url": "https://www.wsws.org/en/articles/2022/03/22/lafo-m22.html",
    "snippet": "On March 17, the 78-year-old declared his resignation from Die Linke (Left Party), which he jointly founded in <strong>2007</strong> with Gregor Gysi.",
    "published": null
  },
  {
    "title": "Work and Social Justice-The Electoral Alternative _ AcademiaLab",
    "url": "https://academia-lab.com/encyclopedia/work-and-social-justice-the-electoral-alternative/",
    "snippet": "Therefore, in these elections the ... Linkspartei). It obtained 8.7% of votes and 54 seats. <strong>Their joint parliamentary group appointed Gregor Gysi, leader of the PDS/Linkspartei, and Oskar Lafontaine, for the WASG, as spokespersons</strong>....",
    "published": null
  },
  {
    "title": "Oskar Lafontaine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Oskar_Lafontaine",
    "snippet": "On <strong>24 May 2005</strong> Lafontaine left the SPD. After two weeks of speculation it was announced on 10 June that he would run as the lead candidate for The Left party (Die Linke), a coalition of the Labor and Social Justice Party (WASG), which was based ...",
    "published": "November 12, 2025"
  },
  {
    "title": "Oskar Lafontaine and the troubled German Left",
    "url": "https://peoplesworld.org/article/oskar-lafontaine-and-the-troubled-german-left/",
    "snippet": "<strong>Die Linke was formed when the Party of Democratic Socialism</strong>, a reformed child of the old ruling party in the German Democratic Republic, known best for its witty, mercurial leader Gregor Gysi, joined three years ago with a new West German party, ...",
    "published": "January 28, 2010"
  }
]