[
  {
    "title": "Juventus Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_Stadium",
    "snippet": "Juventus Stadium (Italian ... simply known in Italy as the Stadium (Italian: Lo Stadium), is <strong>an all-seater football stadium in the Vallette borough of Turin, Italy, and the home of Juventus</strong>....",
    "published": "October 14, 2025"
  },
  {
    "title": "Allianz Stadium Juventus",
    "url": "https://www.juventus.com/en/allianz-stadium/",
    "snippet": "<strong>One of the most advanced and technological systems in the world, one of the major tourist attractions and architectural symbol of contemporary Turin</strong>, the Allianz Stadium falls into the UEFA category 4 and is the first Italian football structure ...",
    "published": null
  },
  {
    "title": "Juventus | Allianz Stadium (Turin) | Football Ground Guide",
    "url": "https://footballgroundguide.com/leagues/europe-1/italy/allianz-stadium.html",
    "snippet": "UEFA have confirmed that Allianz Stadium — officially referred to as Juventus Stadium in continental competitions — is <strong>among the potential host venues for the Europa League and Conference League finals in both 2028 and 2029</strong>, according to ...",
    "published": "November 3, 2025"
  },
  {
    "title": "Juventus Museum & Allianz Stadium | Museum | Turismo Torino e Provincia",
    "url": "https://turismotorino.org/en/visit/things-to-do-and-things-to-see/museums-and-heritage/juventus-museum-allianz-stadium",
    "snippet": "Juventus Museum was inaugurated on 16 May 2012. Designed by a group of undertakings under the supervision of Architect Benedetto Camerana, the stadium was conceived according to cutting-edge standards, prioritising technology and interaction while respecting its nature of exhibition space for objects of cultural and historical interest.",
    "published": "July 3, 2017"
  },
  {
    "title": "Case Study – Sports | Allianz Stadium - Juventus Football Club | Bose Professional",
    "url": "https://boseprofessional.com/applications/case-studies/allianz-stadium",
    "snippet": "<strong>Home to Juventus, the stadium holds over 41,500 boisterous spectators passionate about European football</strong>. Allianz Stadium is the first stadium owned by a Series A team, the highest level of competition in Italian football.",
    "published": "April 9, 2025"
  }
]