[
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "His victory margin was the second lowest ever (in percentage points) for a sitting prime minister in India after Chandra Sekhar. The National Democratic Alliance secured a total of 292 seats, 20 seats ahead of simple majority, and the BJP solely winning 240 seats. Modi thanked the voters for reposing faith in his government for the 3rd consecutive time. In the 2025 Indian electoral controversy, Rahul Gandhi, leader of the opposition in Lok Sabha, claimed widespread electoral fraud and accused the Election Commission of India (ECI) of collusion with the ruling BJP during the 2024 general election.",
    "published": "2 days ago"
  },
  {
    "title": "Know the PM | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/pms-profile/",
    "snippet": "Shri Modi believes that no Indian should be homeless and to realise this vision, over 4.2 crore houses were sanctionedunder the PM Awas Yojana between 2014 and 2024. In June 2024, after assuming office for the third term, one of the first decisions of the Cabinet was to assist 3 crore additional rural and urban households for the construction of houses, underscoring Shri Narendra Modi’s commitment to addressing the nation’s housing needs and ensuring dignity and a quality life for every citizen.",
    "published": null
  },
  {
    "title": "Narendra Modi | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Narendra-Modi",
    "snippet": "Last updated Dec. 9, 2025 •History Table of Contents · Table of Contents Quick Summary Ask the Chatbot a Question ... Narendra Modi served as the chief minister of Gujarat from 2001 to 2014. Narendra Modi was first elected prime minister of India in 2014.",
    "published": "April 14, 2014"
  },
  {
    "title": "Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/",
    "snippet": "Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership.",
    "published": null
  },
  {
    "title": "Narendra Modi | Latest News on Narendra Modi | Who is Narendra Modi?",
    "url": "https://www.business-standard.com/about/who-is-narendra-modi",
    "snippet": "Tuesday, December 16, 2025 | 07:25 PM ISTहिंदी में पढें ... <strong>Narendra Modi is the current Prime Minister of India</strong>. He represents Varanasi constituency in the Lok Sabha.",
    "published": "4 hours ago"
  }
]