[
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "In his address marking Ukrainian Armed Forces Day, President of Ukraine <strong>Volodymyr Zelenskyy</strong> spoke about Ukrainian warriors honored through murals in Ukraine and around the world. ... The parties covered multiple aspects and went through key ...",
    "published": "1 week ago"
  },
  {
    "title": "Zelenskyy appoints Yulia Svyrydenko as new prime minister for war-weary Ukraine | PBS News",
    "url": "https://www.pbs.org/newshour/world/zelenskyy-appoints-yulia-svyrydenko-as-new-prime-minister-for-war-weary-ukraine",
    "snippet": "Svyrydenko and Shmyhal are among a wider group of officials taking on new leadership roles as Zelenskyy aims to reenergize a war-weary nation. But to Ukrainians, the reshuffling of the Cabinet is not seen as a major shift in direction for Zelenskyy, who will still be mostly relying on the same experienced officials, as opposed to introducing new faces to his leadership team.",
    "published": "July 17, 2025"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... nation&#x27;s head of government. The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "Ukraine: new government led by Yuliia Svyrydenko | OSW Centre for Eastern Studies",
    "url": "https://www.osw.waw.pl/en/publikacje/analyses/2025-07-18/ukraine-new-government-led-yuliia-svyrydenko",
    "snippet": "On 17 July, the Verkhovna Rada voted (with 262 in favour and 22 against) to appoint <strong>Yuliia Svyrydenko</strong> as Prime Minister and approved the composition of her government. Mykhailo Fedorov, the former Minister for Digital Transformation, became ...",
    "published": "July 18, 2025"
  },
  {
    "title": "Zelensky’s Government Sabotaged Oversight, Allowing Corruption in Ukraine to Fester - The New York Times",
    "url": "https://www.nytimes.com/2025/12/05/world/europe/ukraine-corruption-zelensky.html",
    "snippet": "Ukrainian leaders blame independent advisers for failing to prevent graft. A Times investigation found that <strong>President Volodymyr Zelensky</strong>’s own administration removed guardrails.",
    "published": "2 weeks ago"
  }
]