[
  {
    "title": "USNC/IAU Committee | American Astronomical Society",
    "url": "https://aas.org/comms/usnc-iau-committee",
    "snippet": "Chair: <strong>Martha P. Haynes</strong> ... Secretary: Alice K. B. Monet · NASEM Staff Officer: Ana Ferreras, Category V (Ex officio, non-voting) Charge: Effects appropriate participation by the United States in International Astronomical Union through the National Academy of Sciences-National Research Council.",
    "published": null
  },
  {
    "title": "U.S. National Committee for the International Astronomical ...",
    "url": "https://www.nationalacademies.org/our-work/us-national-committee-for-the-international-astronomical-union-usnc-iau",
    "snippet": "This site requires JavaScript to be enabled",
    "published": null
  },
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "The IAU is affiliated with the ... and international scientific unions. They often encourage countries to become members of the IAU. The Commission further seeks to development, information or improvement of astronomical education. Part of Commission 46, is Teaching Astronomy for Development (TAD) program in countries where there is currently very little ...",
    "published": "5 days ago"
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "&quot;It is a great honour and a pleasure ... in which the IAU will play a leading role as a catalyst and a coordinator,&quot; said <strong>Catherine Cesarsky</strong>....",
    "published": null
  },
  {
    "title": "About",
    "url": "https://www.iau.org/Iau/Iau/About/About.aspx",
    "snippet": "The International Astronomical Union (IAU) was founded in 1919. Its mission is to promote and safeguard the science of astronomy in all its aspects, including research, communication, education and development, through international cooperation. Its individual Members — structured into Divisions, Commissions, and Working Groups — are professional astronomers from all over the world, at the Ph.D.",
    "published": null
  }
]