[
  {
    "title": "German chancellor: Some of US security plan 'unacceptable' – DW – 12/09/2025",
    "url": "https://www.dw.com/en/german-chancellor-some-of-us-security-plan-unacceptable/a-75074744",
    "snippet": "&quot;<strong>Some of it is plausible, some of it is understandable, and some of it is unacceptable for us from a European point of view</strong>,&quot; Merz said of the US strategy. &quot;I see no need for the Americans to now try to save democracy in Europe.",
    "published": "4 days ago"
  },
  {
    "title": "NATO Secretary General with the Chancellor of Germany 🇩🇪 Friedrich Merz, 11 DEC 2025 - YouTube",
    "url": "https://www.youtube.com/watch?v=L-KWFYyLqUU",
    "snippet": "Joint press conference by the NATO Secretary General and the Federal Chancellor of Germany, Mr Friedrich Merz on 11 December 2025.🗣 | NATO Secretary General...",
    "published": "5 days ago"
  },
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "In September 2024, he became the Union&#x27;s candidate for Chancellor of Germany ahead of the following year&#x27;s federal election. The CDU/CSU won a plurality of the seats and subsequently reached an agreement to form a coalition with the SPD. <strong>Merz was elected chancellor on 6 May 2025</strong>, taking two ...",
    "published": "2 days ago"
  },
  {
    "title": "Germany's Merz secures pensions bill, but row highlights leadership weakness | Reuters",
    "url": "https://www.reuters.com/world/europe/german-parliament-vote-pensions-tests-merzs-authority-2025-12-05/",
    "snippet": "[1/5]German Chancellor Friedrich Merz and Christian Democratic Union&#x27;s Jens Spahn, the CDU/CSU parliamentary group leader, ahead of a session of the lower house of parliament, the Bundestag, on the day of <strong>a vote on a contentious pensions package</strong>, in ...",
    "published": "1 week ago"
  },
  {
    "title": "Germany's Merz Is Doing Better as Chancellor Than Everyone Thinks",
    "url": "https://foreignpolicy.com/2025/12/12/friedrich-merz-germany-chancellor-economy-ukraine-trump-america/",
    "snippet": "He implicitly rebuked previous chancellors—particularly Angela Merkel—for ducking hard decisions. He conspicuously praised his coalition partners, the Social Democrats (SPD), even though they are the ones who have been forcing him to tone down his present government’s agenda. Merz was most impassioned when talking about Russia and the rapid transformation in firepower, soldiers, and mindset that Germany needs to undertake if it is to cope with the chills emanating from Russian President Vladimir Putin and U.S.",
    "published": "4 days ago"
  }
]