[
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "Newly elected President Cristina Kirchner appointed him to her cabinet as Minister of Justice, Security and Human Rights following her inauguration in December 2007. La Nación, in an editorial entitled “Justice: A Bad Start,” opined that the selection of Fernández as Minister of Justice “cannot enthuse those who hope for progress” in Argentinian justice.",
    "published": "November 15, 2025"
  },
  {
    "title": "Últimas noticias de Aníbal Fernández | TN",
    "url": "https://tn.com.ar/tags/anibal-fernandez/",
    "snippet": "<strong>El ministro de Seguridad, Aníbal Fernández, remarcó que sacará a los agentes a las calles cada vez que el ministro de Economía le “plantee el tema”.</strong> La divisa paralela saltó el miércoles y marcó un nuevo récord en medio de las demoras por un nuevo acuerdo con el FMI.",
    "published": null
  },
  {
    "title": "Aníbal Fernández | perfil, información y las últimas noticias",
    "url": "https://elagora.digital/perfiles/anibal-fernandez/",
    "snippet": "<strong>Retornó a la función pública de la mano del gobierno de Alberto Fernández, desempeñándose inicialmente como Interventor de Yacimientos Carboníferos Río Turbio</strong>.",
    "published": null
  },
  {
    "title": "Aníbal Fernández (@FernandezAnibal) / X",
    "url": "https://twitter.com/FernandezAnibal",
    "snippet": "JavaScript is not available · We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center · Help Center · Terms of Service Privacy Policy ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández - YouTube",
    "url": "https://www.youtube.com/user/VideoAnibalFernandez",
    "snippet": "Canal de YouTube del dirigente peronista Aníbal Fernández. Ministro de Seguridad de la Nación.",
    "published": null
  }
]