[
  {
    "title": "John Garamendi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Garamendi",
    "snippet": "In the general election, he defeated ... Johnston (D-Stockton) for the upcoming special election to replace him. In 1991, while serving as <strong>California Insurance Commissioner</strong>, Garamendi seized Executive Life, a failing life insurance company, and resold it to French investors who ...",
    "published": "2 weeks ago"
  },
  {
    "title": "About John Garamendi | Congressman John Garamendi",
    "url": "https://garamendi.house.gov/about",
    "snippet": "From 1991 to 1995, and again from 2003 to 2006, Garamendi served as the <strong>California Insurance Commissioner</strong>, earning a reputation as the most effective protector of consumer interests in the nation. He successfully forced insurance companies to pay claims to policyholders and significantly curtailed ...",
    "published": "August 22, 2023"
  },
  {
    "title": "John Garamendi | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/john-garamendi/G000559",
    "snippet": "John Garamendi, the Representative from California - in Congress from 2009 through Present",
    "published": null
  },
  {
    "title": "John Garamendi - Ballotpedia",
    "url": "https://ballotpedia.org/John_Garamendi",
    "snippet": "Garamendi (Democratic Party) is running for re-election to the U.S. House to represent California&#x27;s 8th Congressional District. He declared candidacy for the 2026 election.[source] ... John Garamendi was born in Camp Blanding, Florida. Garamendi earned a B.A.",
    "published": null
  },
  {
    "title": "A Life of Service | John Garamendi",
    "url": "https://www.garamendi.org/about",
    "snippet": "In his 12 years in the Senate, Garamendi served as <strong>Senate Majority Leader and the Chair of three standing committees: the Health and Human Services Committee, Joint Committee on Science and Technology, and Revenue and Taxation Committee</strong>.",
    "published": null
  }
]