[
  {
    "title": "Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Google",
    "snippet": "Google began in January 1996 as a research project by <strong>Larry Page and Sergey Brin</strong> while they were both PhD students at Stanford University in California, United States. The project initially involved an unofficial &quot;third founder&quot;, Scott Hassan, the original lead programmer who wrote much of ...",
    "published": "3 days ago"
  },
  {
    "title": "How we started and where we are today - Google - About Google",
    "url": "https://about.google/company-info/our-story/",
    "snippet": "Find out where it all began. Read the history of how Google has grown since <strong>Larry Page and Sergey Brin</strong> founded the company in 1998.",
    "published": null
  },
  {
    "title": "Google | History & Facts; Products & Services | Britannica Money",
    "url": "https://www.britannica.com/money/Google-Inc",
    "snippet": "Google is an American search engine company, founded in 1998 by <strong>Sergey Brin and Larry Page</strong>. Since 2015, Google has been a subsidiary of the holding company Alphabet, Inc. More than 70% of worldwide online search requests are handled by Google, ...",
    "published": "2 days ago"
  },
  {
    "title": "How Google founders Larry Page and Sergey Brin built their combined $257 billion net worth, and how they spend it",
    "url": "https://www.businessinsider.com/google-founders",
    "snippet": "Google founders <strong>Larry Page and Sergey Brin</strong> are worth a combined $257 billion. Here&#x27;s how they made their fortune and what they spend money on.",
    "published": "June 5, 2024"
  },
  {
    "title": "History of Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Google",
    "snippet": "Google was officially launched in 1998 by <strong>Larry Page and Sergey Brin</strong> to market Google Search, which has become the most used web-based search engine. <strong>Larry Page and Sergey Brin</strong>, students at Stanford University in California, developed a search algorithm first (1996) known as &quot;BackRub&quot;, with ...",
    "published": "14 hours ago"
  }
]