[
  {
    "title": "List of Arsenal F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Arsenal_F.C._managers",
    "snippet": "On 29 November 2019, with Arsenal ... as interim head coach. In December 2019, Arsenal appointed former club captain <strong>Mikel Arteta</strong> as the new head coach....",
    "published": "6 days ago"
  },
  {
    "title": "Arsenal Coaching Staff | Team Behind the Team",
    "url": "https://www.arsenalinsider.com/club/coaching-staff/",
    "snippet": "But the north London outfit awarded him the title of manager in 2020 after winning the FA Cup. Arteta had no previous head coaching experience before returning to Arsenal having served as their captain while a player. He retired as the Gunners’ skipper in 2016 before joining Pep Guardiola’s coaching staff at Manchester City.",
    "published": "July 8, 2025"
  },
  {
    "title": "Arsenal F.C. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Arsenal_F.C.",
    "snippet": "On 29 November 2019, Emery was dismissed as manager and former player and assistant first team coach Freddie Ljungberg was appointed as interim head coach. On 20 December 2019, Arsenal appointed former club captain <strong>Mikel Arteta</strong> as the new head coach. Arsenal finished the 2019–20 season in ...",
    "published": "5 days ago"
  },
  {
    "title": "Mikel Arteta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikel_Arteta",
    "snippet": "Interim head coach Freddie Ljungberg remained as assistant coach, and goalkeeping coach Sal Bibbo stayed to work with Caña. On 26 December 2019, Arteta took charge for the first time as an Arsenal manager for their Premier League match against Bournemouth which ended in a 1–1 draw, thanks to a second half equaliser from Pierre-Emerick Aubameyang.",
    "published": "9 hours ago"
  },
  {
    "title": "Arsenal FC - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/arsenal-fc/mitarbeiterhistorie/verein/11",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  }
]