[
  {
    "title": "Northwest Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Northwest_Stadium",
    "snippet": "<strong>Northwest Stadium</strong> is a multi-purpose stadium in Landover, Maryland, located within the census-designated place of Summerfield 2.5 miles (4 km) east of Washington, D.C. It is the home venue of the National Football League (NFL) team Washington Commanders.",
    "published": "1 month ago"
  },
  {
    "title": "Northwest Stadium | Washington Commanders, Concerts & Events | Northwest Stadium",
    "url": "https://northweststadium.com/",
    "snippet": "<strong>Northwest Stadium</strong> in Landover, MD, hosts Washington Commanders games, top concerts, and major events. Get tickets, schedules, and venue information!",
    "published": null
  },
  {
    "title": "Stadium Guide | Washington Commanders - Commanders.com",
    "url": "https://www.commanders.com/stadium/stadium-guide",
    "snippet": "If you or someone you are with has questions about accommodations for fans in need of accessibility assistance, you may reach us at tickets@commanders.com, (301) 276-6050, or by visiting any of our Guest Services booths, located across from Sections 104, 124, 304, 324, 404, and 431 inside the stadium at Gate A and Bank of America Gate (Gate E), on the day of the game. Please note that accessible seating and parking is limited, so please call ahead and/or arrive early to ensure availability. For further information regarding accessibility, please click here. ... All children under the age of 3 may attend a Washington Commanders game free of charge with a lap pass in lieu of an issued ticket.",
    "published": null
  },
  {
    "title": "Sources: Trump wants Commanders' new D.C. stadium named for him - ESPN",
    "url": "https://www.espn.com/nfl/story/_/id/46892115/trump-wants-commanders-stadium-named-him",
    "snippet": "The Commanders currently play at <strong>Northwest Stadium in Landover, Maryland</strong>, a venue 9 miles from the RFK site that was the team&#x27;s home for three Super Bowl wins. The RFK Stadium site is a deeply sentimental one for Washington fans and members ...",
    "published": "November 8, 2025"
  },
  {
    "title": "New Stadium | Washington Commanders - Commanders.com",
    "url": "https://www.commanders.com/new-commanders-stadium",
    "snippet": "On June 26th, Bisnow hosted an event focused on the future of the <strong>RFK Stadium</strong>, its impact on surrounding neighborhoods, redevelopment opportunities, and what this transformation means for the district&#x27;s next wave of growth.",
    "published": "November 13, 2025"
  }
]