[
  {
    "title": "TSV 1860 Munich - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TSV_1860_Munich",
    "snippet": "1860 came close to insolvency for a second time in five years in 2011 when it needed €8 million to survive. Help was offered to the club by local rival Bayern Munich, to the disgust of the supporters of each club, since Bayern was to lose €50 million in future stadium rent if the club defaulted on its rental contract obligations until 2025...",
    "published": "2 weeks ago"
  },
  {
    "title": "Germany: TSV 1860 could expand stadium to 25,000 seats – StadiumDB.com",
    "url": "https://stadiumdb.com/news/2025/12/germany_tsv_1860_could_expand_stadium_to_25000_seats",
    "snippet": "During the construction period, <strong>Grünwalder Stadium</strong> will be unavailable for matches, meaning TSV 1860 would have to temporarily move to the Olympiastadion. The club plans to carefully evaluate this option as well.",
    "published": null
  },
  {
    "title": "TSV 1860 Munich - Stadium - Städtisches Stadion an der Grünwalder Straße | Transfermarkt",
    "url": "https://www.transfermarkt.com/tsv-1860-munich/stadion/verein/72",
    "snippet": "This page provides you with information about the stadium of the selected club. In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights.",
    "published": null
  },
  {
    "title": "TSV 1860 Munich - Stadium - Olympiastadion München | Transfermarkt",
    "url": "https://www.transfermarkt.us/tsv-1860-munchen/stadion/verein/72/stadion_id/2411",
    "snippet": "This page provides you with information about the stadium of the selected club. In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights.",
    "published": null
  },
  {
    "title": "Grünwalder Stadion - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gr%C3%BCnwalder_Stadion",
    "snippet": "The stadium is known for its curved western terrace known as the Westkurve, where currently 9,000 1860 Munich fans stand creating an impressive atmosphere. Bayern Munich II also play at the stadium, but only open the covered seated Nordtribune to home fans for matches.",
    "published": "June 5, 2025"
  }
]