[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "De Havilland Aircraft of Canada Limited (DHC) is a Canadian aircraft manufacturer founded in 2018 that purchased the aircraft programs of the original the de Havilland Canada, which was founded in 1928. The aircraft types currently in production or planned for production include the DHC-6 Twin Otter, DHC-8 Dash 8, and DHC-515 Firefighter turboprop aircraft.",
    "published": "1 month ago"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "It has designed and built iconic Canadian bush planes such as the Beaver, the Otter and the Twin Otter, as well as transport and commuter aircraft. Owned by <strong>Longview Aviation Capital</strong>, de Havilland currently manufactures the Dash 8 commuter plane.",
    "published": null
  },
  {
    "title": "De Havilland Aircraft of Canada 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/292700-62",
    "snippet": "The deal was made on 01-Apr-2025. To view De Havilland Aircraft of Canada’s complete acquisitions history, request access » ... De Havilland Aircraft of Canada was founded in 1928. De Havilland Aircraft of Canada is headquartered in Calgary, Canada. De Havilland Aircraft of Canada has 1,218 total employees. De Havilland Aircraft of Canada’s primary industry is Aerospace and Defense. De Havilland Aircraft of Canada is a Private company. The current valuation of De Havilland Aircraft of Canada is .",
    "published": null
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "The deal, which closed on 3 June ... a new holding company bearing a name almost identical to the original, <strong>De Havilland Aircraft of Canada Limited</strong>....",
    "published": "November 1, 2025"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited",
    "url": "https://www.baesystems.com/en/heritage/de-havilland-canada",
    "snippet": "In 1980, the Canadian Government forced the privatisation of De Havilland Aircraft of Canada and in 1986 it sold the company to Boeing. The company and name is now in the ownership of <strong>Bombardier Aerospace</strong>.",
    "published": null
  }
]