[
  {
    "title": "The Carlyle Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Carlyle_Group",
    "snippet": "In February 2008, California legislators targeted Carlyle and Mubadala, proposing a bill that would have barred CalPERS from investing money &quot;with private-equity firms that are partly owned by countries with poor records on human rights.&quot; The bill, which was intended to draw attention to the connection between Carlyle and Mubadala Development, was later withdrawn.",
    "published": "November 13, 2025"
  },
  {
    "title": "The Carlyle Group investment portfolio | PitchBook",
    "url": "https://pitchbook.com/profiles/investor/10048-15",
    "snippet": "The Carlyle Group has made numerous investments in companies like KFC Korea, Automotive Compliance, and Elder Research within the Restaurants and Bars, Consulting Services (B2B), and Media and Information Services (B2B) industries.",
    "published": null
  },
  {
    "title": "The Carlyle Group | LinkedIn",
    "url": "https://www.linkedin.com/company/the-carlyle-group",
    "snippet": "At Carlyle, we&#x27;re excited to partner ... the country’s journey and contribute to India’s 2047 Viksit Bharat Vision. Watch his full presentation below. #MIIS2024 ... #MIIS2024 | Unlock the opportunities &amp; challenges of investing in India with a keynote by Amit Jain, MD &amp; Head of The Carlyle Group at the Mint ...",
    "published": null
  },
  {
    "title": "Our Firm | Carlyle",
    "url": "https://www.carlyle.com/our-firm",
    "snippet": "Our team invests across asset classes, regions and industries on behalf of more than 3,200 investors from 87 countries, which further reflects our ability to reach all corners of the globe. Our investors range from public and private pension funds to wealthy individuals and families to sovereign wealth funds, unions and corporations. Through our reach, we are able to meet the dynamic needs of the world’s most sophisticated investors. ... At Carlyle, we lead with our depth of knowledge and industry expertise.",
    "published": null
  },
  {
    "title": "Carlyle | Global Investment Firm",
    "url": "https://www.carlyle.com/",
    "snippet": "Global Private Equity Creating Global Opportunities Through Local Insight Global Credit Carlyle AlpInvestCreating Custom Opportunities",
    "published": null
  }
]