[
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "He has two younger brothers, Jens Scholz, an anesthesiologist and CEO of the University Medical Center Schleswig Holstein; and Ingo Scholz, a tech entrepreneur. Scholz attended the <strong>Bekassinenau elementary school in Oldenfelde</strong>, and then switched to the Großlohering elementary school in Großlohe.",
    "published": "2 weeks ago"
  },
  {
    "title": "Olaf Scholz | Military Wiki | Fandom",
    "url": "https://military-history.fandom.com/wiki/Olaf_Scholz",
    "snippet": "Scholz was born on 14 June 1958, ... and Ingo Scholz, a tech entrepreneur. Olaf Scholz attended the <strong>Bekassinenau elementary school in Oldenfelde</strong> but then switched to the Großlohering elementary school in Großl...",
    "published": null
  },
  {
    "title": "Olaf Scholz Politician Biography - Brief About Chancellor of Germany",
    "url": "https://biograpihy.com/olaf-scholz-politician-biography/",
    "snippet": "Olaf attended <strong>Bekassinenau Elementary School in Oldenfelde</strong> before transferring to Großlohering Elementary School in Großlohe.",
    "published": "October 27, 2024"
  },
  {
    "title": "OLAF SCHOLZ – Smartencyclopedia | ENG",
    "url": "https://smartencyclopedia.org/content/olaf-scholz/",
    "snippet": "He has two younger brothers, Jens Scholz, an anesthesiologist and CEO of the University Medical Center Schleswig Holstein; and Ingo Scholz, a tech entrepreneur. Olaf Scholz attended the <strong>Bekassinenau elementary school in Oldenfelde</strong> but then switched to the Großlohering elementary school in ...",
    "published": "September 15, 2021"
  },
  {
    "title": "Learn Olaf Scholz facts for kids",
    "url": "https://kids.kiddle.co/Olaf_Scholz",
    "snippet": "His parents worked in the textile industry. He has two younger brothers. Scholz went to <strong>elementary school and then high school</strong>. After finishing high school in 1977, he studied law at the University of Hamburg ...",
    "published": null
  }
]