[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the secretary of the <strong>Democratic Party (PD)</strong> since 12 March 2023. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "1 week ago"
  },
  {
    "title": "8th parliamentary term | Elly SCHLEIN | MEPs | European Parliament",
    "url": "https://www.europarl.europa.eu/meps/en/124804/ELLY_SCHLEIN/history/8",
    "snippet": "Profile page - Elly SCHLEIN - Profile page of a current <strong>Member of the European Parliament</strong> - History of parliamentary service during the 8th legislative term including memberships in political groups, national parties, parliamentary committees ...",
    "published": null
  },
  {
    "title": "Elly Schlein: The first woman and LGBTIQ+ leader of Italy’s left | openDemocracy",
    "url": "https://www.opendemocracy.net/en/5050/italy-left-elly-schlein-woman-lgbtiq-democratic-party/",
    "snippet": "Another woman has shaken up Italy’s male-dominated political scene – but this time, she’s a feminist, openly queer and left-wing. Say hello to Elly Schlein, 37, the new head of the <strong>progressive Democratic Party</strong> (PD).",
    "published": "March 9, 2023"
  },
  {
    "title": "Elena Ethel \"Elly\" Schlein - UJE - Ukrainian Jewish Encounter",
    "url": "https://ukrainianjewishencounter.org/en/elena-ethel-elly-schlein/",
    "snippet": "Schlein was elected secretary of the <strong>Democratic Party</strong> in February 2023. The <strong>Democratic Party</strong> received 24.1 percent in the European Parliament elections in April 2024. This is the party&#x27;s best result in recent history, and it was achieved partly ...",
    "published": "April 8, 2025"
  },
  {
    "title": "Learn Elly Schlein facts for kids",
    "url": "https://kids.kiddle.co/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (born 4 May 1985) is an Italian politician. She has been the leader, or &quot;secretary,&quot; of the <strong>Democratic Party (PD)</strong> since March 12, 2023.",
    "published": null
  }
]