[
  {
    "title": "IMU Leadership 2023 – 2026 | International Mathematical Union",
    "url": "https://www.mathunion.org/organization/imu-leadership-2023-2026",
    "snippet": "Hiraku Nakajima · <strong>ICMI EC Ex-officio Member (IMU President) Japan</strong> · Christoph Sorger · ICMI EC Ex-officio Member (IMU Secretary General) France · *CoP was formerly known as the Committee on Electronic Information and Communication (CEIC). Terms of membership are staggered.",
    "published": null
  },
  {
    "title": "Hiraku Nakajima - The chair of ICM 2026 is announced!",
    "url": "https://twitter.com/hirakunakajima/status/1575789673745481730",
    "snippet": "JavaScript is not available · We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center · Help Center · Terms of Service Privacy Policy ...",
    "published": null
  },
  {
    "title": "Hiraku Nakajima",
    "url": "https://member.ipmu.jp/hiraku.nakajima/",
    "snippet": "Although I send emails to ask help as the President of the IMU, they are sent from a special email address which has mathunion.org after @. They are also digitally signed · I would ask you to be careful for suspicious requests. Link to Nakajima&#x27;s website",
    "published": null
  },
  {
    "title": "Hiraku Nakajima elected President of the International Mathematical Union | Kavli IPMU-カブリ数物連携宇宙研究機構",
    "url": "https://www.ipmu.jp/en/20220704-IMU",
    "snippet": "Nakajima has served on several IMU-related committees since 2006. <strong>He will take over as IMU President from 2023 and serve for four years</strong>. About Hiraku Nakajima Hiraku Nakajima received his PhD in Science from the University of Tokyo in 1991.",
    "published": null
  },
  {
    "title": "Nakajima, Sorger, others emerge IMU new exco – International Year of Basic Sciences for Development",
    "url": "https://www.iybssd2022.org/en/nakajima-sorger-others-emerge-imu-new-exco/",
    "snippet": "The elections held at the 19th IMU General Assembly in Helsinki for the IMU President, the IMU Secretary General, and the IMU Executive Committee for the period 2023–2026 had the following results: <strong>President: Hiraku Nakajima (Japan)</strong> Secretary ...",
    "published": null
  }
]