[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Left_(Germany)",
    "snippet": "The party was founded in 2007 as ... the Socialist Unity Party of Germany (SED). Since October 2024, Die Linke&#x27;s co-chairpersons have been <strong>Ines Schwerdtner and Jan van Aken</strong>....",
    "published": "January 7, 2007"
  },
  {
    "title": "How Die Linke Turned the Tide - Rosa-Luxemburg-Stiftung",
    "url": "https://www.rosalux.de/en/news/id/53139/how-die-linke-turned-the-tide",
    "snippet": "<strong>Ines Schwerdtner and Jan van Aken</strong> have served as co-chairs of Die Linke since October 2024 and were both elected to parliament in the 2025 federal election.",
    "published": "February 25, 2025"
  },
  {
    "title": "How Die Linke Turned the Tide - RLS Geneva",
    "url": "https://rosalux-geneva.org/how-die-linke-turned-the-tide/",
    "snippet": "We see this as our mission, and it’s one we wouldn’t trade for anything. <strong>Ines Schwerdtner and Jan van Aken</strong> have served as co-chairs of Die Linke since October 2024 and were both elected to parliament in the 2025 federal election.",
    "published": "February 27, 2025"
  },
  {
    "title": "The Improbable Resurgence of Die Linke",
    "url": "https://jacobin.com/2025/02/die-linke-germany-renewal-strategy/",
    "snippet": "But becoming a party of the working class will take a lot more than a last-minute turnaround at the polls. <strong>Jan van Aken</strong> (L), federal chairman of Die Linke, and member of the Bundestag Gregor Gysi speak at a press conference in Berlin on February ...",
    "published": null
  },
  {
    "title": "Expats.one - What to make of Die Linke",
    "url": "https://expats.one/news/what-to-make-of-die-linke",
    "snippet": "At a televised debate on September 13th, <strong>Janine Wissler</strong>, the co-head of Die Linke, proclaimed again that her party wants to dissolve NATO and turn it into a collective security alliance that includes Russia.",
    "published": "September 18, 2021"
  }
]