[
  {
    "title": "Taye Atske Selassie - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taye_Atske_Selassie",
    "snippet": "Taye Atske Selassie Amde (Amharic: ታዬ አጽቀሥላሴ, born 13 January 1956) is an Ethiopian diplomat and politician who is the President of Ethiopia since 2024.",
    "published": "November 6, 2025"
  },
  {
    "title": "Ambassador Taye Atske-Selassie sworn in as new president of Ethiopia – Welcome to Fana Media Corporation S.C",
    "url": "https://www.fanamc.com/english/ambassador-taye-atske-selassie-sworn-in-as-new-president-of-ethiopia/",
    "snippet": "Addis Ababa, October 7, 2024 (FBC) – Ambassador Taye Atske-Selassie has been endorsed today, 7th October 2024, as the new president of the Federal Democratic Republic of Ethiopia, replacing his predecessor <strong>Sahle-Work Zewde</strong>, who completed her ...",
    "published": "October 8, 2024"
  },
  {
    "title": "Taye Atske-Selassie Amde - MultiFactCheck",
    "url": "https://multifactcheck.org/data-stories/taye-atske-selassie-amde/",
    "snippet": "Taye Asteke-Selasie Amde President, Federal Democratic Republic of Ethiopia: Taye Atske-Selassie Amde has served as the President of the Federal Democratic Republic of Ethiopia since October 7, 2024, succeeding former President <strong>Sahle-Work Zewde</strong>.",
    "published": "May 15, 2025"
  },
  {
    "title": "Taye Atske Selassie facts for kids",
    "url": "https://kids.kiddle.co/Taye_Atske_Selassie",
    "snippet": "Taye Atske Selassie Amde (Amharic: ታዬ አጽቀሥላሴ) was born on January 13, 1956. He is an important Ethiopian diplomat and politician. Since October 2024, he has been the President of Ethiopia. Before becoming president, he worked in many different roles.",
    "published": null
  },
  {
    "title": "Taye Atske Selassie sworn in as president of Ethiopia",
    "url": "https://www.aa.com.tr/en/africa/taye-atske-selassie-sworn-in-as-president-of-ethiopia/3354408",
    "snippet": "Selassie&#x27;s appointment as the country&#x27;s sixth president was unexpected. He was later sworn in as president, a largely ceremonial position in the country, and received the constitution from his predecessor <strong>Zewde</strong>.",
    "published": null
  }
]