[
  {
    "title": "Alphabet Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
    "snippet": "Before it became a subsidiary of Alphabet, <strong>Google Inc.</strong> was first structured as the owner of Alphabet. The roles were reversed after a placeholder subsidiary was created for the ownership of Alphabet, at which point the newly formed subsidiary was merged with Google.",
    "published": "1 week ago"
  },
  {
    "title": "Who Currently Owns Alphabet? A Deep Dive Investigation",
    "url": "https://surgegraph.io/business/who-currently-owns-alphabet",
    "snippet": "Try the same AI Humanizer for free!Try Free AI Humanizer · Share this post: Alphabet Inc., the parent company of Google, is a publicly traded company, meaning it’s owned by <strong>its shareholders</strong>.",
    "published": null
  },
  {
    "title": "Who owns Alphabet in 2025? GOOGL shareholders explained | Capital.com",
    "url": "https://capital.com/en-int/analysis/alphabet-shareholder-who-owns-most-googl",
    "snippet": "As of June 2025, the largest institutional holders include <strong>The Vanguard Group (7.73%), BlackRock (6.55%) and State Street Global Advisors (3.47%), followed by FMR LLC, Capital Research and Management Company, and T.</strong>",
    "published": null
  },
  {
    "title": "Alphabet Investor Relations - Home",
    "url": "https://abc.xyz/",
    "snippet": "As Sergey and I wrote in the original founders letter 11 years ago, “Google is not a conventional company. We do not intend to become one” · As part of that, we also said that you could expect us to make “smaller bets in areas that might seem very speculative or even strange when compared ...",
    "published": null
  },
  {
    "title": "Alphabet, Inc. | History, Products, & Business Segments | Britannica Money",
    "url": "https://www.britannica.com/money/Alphabet-Inc",
    "snippet": "Google&#x27;s parent buys data center energy specialist Intersect for $4.75 billion to help power AI • Dec. 22, 2025, 1:12 PM ET(AP)...(Show more) Alphabet Inc. is an American technology conglomerate and holding company formed in 2015 as a strategic restructuring of Google and its various subsidiaries.",
    "published": null
  }
]