[
  {
    "title": "Gabriel Boric - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gabriel_Boric",
    "snippet": "<strong>As of June 2025, there is no scheduled date for a parliamentary vote</strong>, and the bill&#x27;s future is uncertain due to limited support in Congress and the approaching 2025 Chilean general election. Boric took office with a 50% approval rating. After his first 100 days, his approval rating plummeted ...",
    "published": "2 days ago"
  },
  {
    "title": "Presidency: Gabriel Boric - Gob.cl - Gobierno de Chile",
    "url": "https://www.gob.cl/en/institutions/presidency/",
    "snippet": "With this, the citizens were mobilized, ... at stake was greater than the presidential post. In this way, <strong>on December 19, he managed to win in the polls in the second round with a wide advantage over his opponent.</strong>...",
    "published": null
  },
  {
    "title": "Gabriel Boric, the Victory of the Pinochetist Far Right in Chile, and Donald Trump",
    "url": "https://colombiaone.com/2025/12/15/chile-gabriel-boric-victory-pinochetist-far-right-donald-trump/",
    "snippet": "But in all of this, there is a clear culprit: Chile’s current president, the leftist Gabriel Boric, incapable of delivering a single one of his major projects or transformation promises over four years.",
    "published": "1 day ago"
  },
  {
    "title": "What Happened to Gabriel Boric’s Leftist Promises for Chile? - The New York Times",
    "url": "https://www.nytimes.com/2025/11/15/world/americas/gabriel-boric-chile-president.html",
    "snippet": "President Gabriel Boric of Chile is <strong>not eligible for re-election this year because of term limits</strong>.Credit...Dave Sanders for The New York Times ... Nov. 15, 2025",
    "published": "November 15, 2025"
  },
  {
    "title": "2025 Chilean general election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Chilean_general_election",
    "snippet": "In a press conference after meeting President Gabriel Boric at La Moneda, <strong>Orrego ruled out a presidential run</strong>, stating, &quot;My only plan is to be governor for the next four years,&quot; and said, &quot;We&#x27;ll have to look for other leaderships.&quot;",
    "published": "3 hours ago"
  }
]