[
  {
    "title": "Emre Can Transfer News, History, Market Value (ETV) & Career Stats",
    "url": "https://www.footballtransfers.com/en/players/emre-can",
    "snippet": "<strong>Dortmund paid Juventus €25M for Emre Can</strong> . Emre Can latest transfers and transfer rumours, season statistics and career statistics are available on FootballTransfers.",
    "published": null
  },
  {
    "title": "Emre Can stats and transfer history - AiScore",
    "url": "https://m.aiscore.com/player-emre-can/oj7x9iw0oltg7g3",
    "snippet": "Emre Can Transfer History and Transfer Fee <strong>2020/06/30, from Juventus to Borussia Dortmund, Transfer transfer fee</strong>. 2020/06/29, from Borussia Dortmund to Juventus, End of loan transfer fee. 2020/01/30, from Juventus to Borussia Dortmund, Loan transfer fee. 2018/06/30, from Liverpool to Juventus, ...",
    "published": null
  },
  {
    "title": "Emre Can: Juventus confirm signing of midfielder from Liverpool - BBC Sport",
    "url": "https://www.bbc.com/sport/football/44560115",
    "snippet": "<strong>Emre Can has finalised his move to Juventus from Liverpool on a four-year deal. The 24-year-old Germany international joins the Italian champions on a free transfer</strong>.",
    "published": "June 21, 2018"
  },
  {
    "title": "Emre Can transfer rumours and news",
    "url": "https://www.footballtransferleague.co.uk/players/emre_can",
    "snippet": "<strong>Paris St-Germain are in talks with Juventus over a swap deal for Germany midfielder Emre Can, 25,</strong> which could see Argentina midfielder Leandro Paredes, 25, move in the opposite direction ... Please note that by viewing our site you agree to our use of cookies (see Privacy for details).",
    "published": null
  },
  {
    "title": "Juventus sign Emre Can on four-year contract - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/37557004/juventus-sign-emre-four-year-contract",
    "snippet": "&quot;The versatile midfielder, who can also operate in defence, <strong>joins Juventus after four years with Liverpool FC</strong>,&quot; an announcement on the Juventus website said.",
    "published": "June 21, 2018"
  }
]