[
  {
    "title": "Britta Ernst - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Britta_Ernst",
    "snippet": "<strong>Britta Ernst</strong> (born 23 February 1961) is a German politician of the Social Democratic Party of Germany (SPD) who served as the State Minister for Education and Youth of Brandenburg from 2017 to 2023. She was a member of the Hamburg Parliament from 1997 to 2011, served as School Minister of ...",
    "published": "3 weeks ago"
  },
  {
    "title": "1,924 Britta Ernst Photos & High Res Pictures - Getty Images",
    "url": "https://www.gettyimages.com/photos/britta-ernst",
    "snippet": "Olaf Scholz, chancellor candidate of the German Social Democrats , waves to supporters next to his wife <strong>Britta Ernst</strong> in reaction to initial results...",
    "published": null
  },
  {
    "title": "Olaf scholz wife hi-res stock photography and images - Alamy",
    "url": "https://www.alamy.com/stock-photo/olaf-scholz-wife.html?sortBy=relevant",
    "snippet": "Find the perfect olaf scholz wife stock photo, image, vector, illustration or 360 image. Available for both RF and RM licensing.",
    "published": null
  },
  {
    "title": "Olaf Scholz and wife Britta in New York",
    "url": "https://www.picture-alliance.com/en/webseries/olaf-scholz-and-wife-britta-in-new-york-w400009",
    "snippet": "Federal Chancellor Olaf Scholz (SPD) arrives at New York airport with his wife <strong>Britta Ernst</strong> on 17 September 2023 and is welcomed by Ambassador Antje Leendertse (l), Permanent Representative of Germany to the United Nations. It is only the second official trip the couple has made together in ...",
    "published": null
  },
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "Olaf Scholz (born 14 June 1958) is a German politician who served as the Chancellor of Germany from 2021 to 2025. A member of the Social Democratic Party (SPD), he previously served as Vice Chancellor in the fourth Merkel cabinet and as Federal Minister of Finance from 2018 to 2021.",
    "published": "2 weeks ago"
  }
]