[
  {
    "title": "Installation ceremony formally welcomes new Western Sydney University Chancellor, Professor Jennifer Westacott AO | Western Sydney University",
    "url": "https://www.westernsydney.edu.au/newscentre/news_centre/story_archive/2023/installation_ceremony_formally_welcomes_new_western_sydney_university_chancellor_professor_jennifer_westacott_ao",
    "snippet": "The following address was deliverd by Western Sydney University Chancellor, Professor Jennifer Westacott AO at the Women UNLIMITED Leadership Summit on Wednesday, 1 October 2025.",
    "published": null
  },
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "In 2018, Westacott was awarded an Officer of the Order of Australia (AO) for her service to policy development and reform, cross sector collaboration, equity and business. <strong>Westacott was later elevated in the 2025 King&#x27;s Birthday Honours to a Companion in the Order of Australia (AC) for eminent</strong> ...",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott - Public and Proud - Business Council of Australia",
    "url": "https://www.bca.com.au/jennifer_westacott_public_and_proud",
    "snippet": "Response to the Productivity Commission&#x27;s Interim Report – Delivering quality care more efficiently 2 October 2025 Read more ... Jennifer Westacott is one of Australia’s most powerful women. She grew up in public housing in NSW, and studied at the University of New South Wales and the London School of Economics.",
    "published": null
  },
  {
    "title": "Wesfarmers Limited Announces Cessation of Jennifer Anne Westacott as Director, Effective 30 October 2025 | MarketScreener Australia",
    "url": "https://au.marketscreener.com/news/wesfarmers-limited-announces-cessation-of-jennifer-anne-westacott-as-director-effective-30-october-ce7d5cdbdd8ff623",
    "snippet": "<strong>Wesfarmers Limited announced cessation of Jennifer Anne Westacott as director</strong>. Date that director ceased to be director: 30 October 2025....",
    "published": "October 31, 2025"
  },
  {
    "title": "Future Generation Global appoints Jennifer Westacott as new chair",
    "url": "https://www.proactiveinvestors.com/companies/news/1034279/future-generation-global-appoints-jennifer-westacott-as-new-chair-1034279.html",
    "snippet": "<strong>Former Business Council of Australia chief Jennifer Westacott has been appointed as the new chair of Future Generation Global Ltd</strong>, a listed investment...",
    "published": "November 27, 2023"
  }
]