[
  {
    "title": "r/fivethirtyeight on Reddit: Future of the subreddit after 538’s disbandment",
    "url": "https://www.reddit.com/r/fivethirtyeight/comments/1j3v5li/future_of_the_subreddit_after_538s_disbandment/",
    "snippet": "434 votes, 129 comments. Howdy kits, In case you have not heard, <strong>Disney is officially shuttering 538</strong>, which is the namesake of this subreddit. Its…",
    "published": "March 5, 2025"
  },
  {
    "title": "Daring Fireball: ABC Shuts Down FiveThirtyEight, and Pulls the Plug on Its Website",
    "url": "https://daringfireball.net/2025/03/abc_shuts_down_fivethirtyeight",
    "snippet": "He simply thanked the employees ... after, employees had their access to ABC News’ systems shut off and <strong>the FiveThirtyEight website was pulled offline</strong>....",
    "published": null
  },
  {
    "title": "The New York Times picks up the shuttered FiveThirtyEight’s poll tracking work | Nieman Journalism Lab",
    "url": "https://www.niemanlab.org/2025/03/the-new-york-times-picks-up-the-shuttered-fivethirtyeights-poll-tracking-database/",
    "snippet": "To make the transition as easy as possible, we are providing the data in about the same format as 538 did. There are some differences, which are noted at the bottom of this page. Davis told me that The New York Times hasn’t made any deal with FiveThirtyEight — “the data the Times is using so far has been collected by the Times,” he said.",
    "published": null
  },
  {
    "title": "FiveThirtyEight is shutting down as part of broader cuts at ABC and Disney | Nieman Journalism Lab",
    "url": "https://www.niemanlab.org/2025/03/fivethirtyeight-is-shutting-down-as-part-of-broader-cuts-at-abc-and-disney/",
    "snippet": "Though Nate Silver left in 2023, <strong>FiveThirtyEight still offered election forecasts, a presidential approval tracker, and other tools</strong>.",
    "published": null
  },
  {
    "title": "Polling website FiveThirtyEight closes | News | Research live",
    "url": "https://www.research-live.com/article/news/polling-website-fivethirtyeight-closes/id/5136753",
    "snippet": "US – American political polling news website FiveThirtyEight ( 538 ) has <strong>closed down</strong>, with owner The Walt Disney Company rolling it into ABC News. Disney closed 538 and laid off around 15 employees as part of wider cuts, The Wall Street Journal ...",
    "published": null
  }
]