[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "Their son, born in 1981, holds a doctorate in philosophy, their elder daughter is a physician, and their younger daughter is a lawyer. Merz has seven grandchildren. In 2005, Merz and his wife established the Friedrich und <strong>Charlotte Merz</strong> Stiftung, a foundation supporting projects in the education ...",
    "published": "1 week ago"
  },
  {
    "title": "549 Charlotte Friedrich Merz Stock Photos, High-Res Pictures, and Images - Getty Images",
    "url": "https://www.gettyimages.com/photos/charlotte-friedrich-merz",
    "snippet": "<strong>Charlotte Merz</strong> and Friedrich Merz attend the &quot;Ein Herz für Kinder&quot; Gala at Studio Berlin Adlershof on December 07, 2024 in Berlin, Germany. ... Ex-Fraktionsvorsizender der CDU Friedrich Merz, Ehefrau Charlotte, &quot;Ball des Sports&quot;, Frankfurter ...",
    "published": null
  },
  {
    "title": "The Turbulent Times of Friedrich Merz - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/europe/friedrich-merz-germany.html",
    "snippet": "Friedrich Merz, the German chancellor, in June in Washington.Credit...Kenny Holston/The New York Times",
    "published": "1 week ago"
  },
  {
    "title": "Charlotte Merz: Age, Net Worth, Family & Career Highlights - Mabumbe",
    "url": "https://mabumbe.com/people/charlotte-merz-age-net-worth-family-career-highlights/",
    "snippet": "<strong>Charlotte Merz (née Gass),</strong> born in 1961 in Saarland, Germany, is a distinguished German judge and the wife of Friedrich Merz, the leader of the Christian Democratic Union (CDU) and Germany’s Chancellor as of May 2025.",
    "published": "May 6, 2025"
  },
  {
    "title": "Cdu politician friedrich merz with wife charlotte merz hi-res stock photography and images - Alamy",
    "url": "https://www.alamy.com/stock-photo/cdu-politician-friedrich-merz-with-wife-charlotte-merz.html?sortBy=relevant",
    "snippet": "Find the perfect cdu politician friedrich merz with wife <strong>charlotte merz</strong> stock photo, image, vector, illustration or 360 image. Available for both RF and RM licensing.",
    "published": null
  }
]