[
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "In 1990, the organization was renamed the European Film Academy and registered as a non-profit association. In 1996, Wim Wenders succeeded Bergman as president, and <strong>Nik Powell</strong>, a British producer, was elected chairman. Mike Downey, an Irish-British film producer, was elected chairman in 2020.",
    "published": "September 3, 2025"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "Solomon is no newcomer to the Academy board, since she served for 6 years as deputy chair herself alongside outgoing chair <strong>Mike Downey</strong>, and was a regular board member before. Leontine Petit has been a regular board member since 2021.",
    "published": "2 weeks ago"
  },
  {
    "title": "Story - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/story/",
    "snippet": "<strong>Wim Wenders (1996-2020) Agnieszka Holland (2020-2024) and Juliette Binoche (2024- )</strong> followed in Bergman’s footsteps as Presidents of the Academy. The current chair of the Board is Mike Downey.",
    "published": "June 13, 2025"
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "Solomon has served on the Academy board for six years as deputy chair herself alongside outgoing chair <strong>Mike Downey</strong>, and was a regular board member before. Petit has been a regular board member since 2021, while Darras has been elected without ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Its leadership has included <strong>Wim Wenders, Agnieszka Holland, and, since 2024, Juliette Binoche</strong>. ... Producer Ada Solomon has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian ...",
    "published": "2 weeks ago"
  }
]