[
  {
    "title": "Contact Richard Dawkins, Email: ****@companyx.com & Phone Number | Worker at Company-X - ZoomInfo",
    "url": "https://www.zoominfo.com/p/Richard-Dawkins/8825059920",
    "snippet": "<strong>Richard Dawkins is a Worker at Company-X based in San Francisco, California</strong>.Explore more · Company-X · 2025-present (4 months) Founded in 2012 by software specialists David Hallett and Jeremy Hughes, New Zealand software specialist Company-X immediately won contracts with New Zealand government ...",
    "published": null
  },
  {
    "title": "OPEN DISCUSSION MARCH 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/2025/03/open-discussion-march-2025/",
    "snippet": "I happen to think that government service is an honorable profession, based partially on a 30 year career and even longer dealing with government workers while I was at a private law firm. Government employees work very hard every day to provide the services their agencies were designed for.",
    "published": "April 1, 2025"
  },
  {
    "title": "RICHARD DAWKINS LIMITED overview - Find and update company information - GOV.UK",
    "url": "https://find-and-update.company-information.service.gov.uk/company/06936950",
    "snippet": "RICHARD DAWKINS LIMITED - Free company information from Companies House including registered office address, filing history, accounts, annual return, officers, charges, business activity",
    "published": null
  },
  {
    "title": "Richard Dawkins (@RichardDawkins) / ...",
    "url": "https://twitter.com/RichardDawkins",
    "snippet": "JavaScript is not available · We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center · Help Center · Terms of Service Privacy Policy ...",
    "published": null
  },
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "Teaching the Value of Science and Advancing Secularism Founded in 2006 by Richard Dawkins, the foundation’s mission is to realize Richard’s vision to remove ...",
    "published": "July 17, 2025"
  }
]