[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "<strong>Viktor Yushchenko, Petro Poroshenko, and Viktor Yanukovych served one term, with the latter being replaced by acting president Oleksandr Turchynov</strong>, who then also served as Chairman of the Ukrainian Parliament, on 21 February 2014. Oleksandr Turchynov was the only acting president in Ukraine&#x27;s ...",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "<strong>The current office was formed when the Verkhovna Rada of the Ukrainian Soviet Socialist Republic passed a law on 5 July 1991 establishing the office of the &quot;President of the Ukrainian Soviet Socialist Republic.&quot;</strong>",
    "published": "6 days ago"
  },
  {
    "title": "Ukraine’s Presidents, Power Elites, and the Country’s Evolution | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/ukraines-presidents-power-elites-and-countrys-evolution",
    "snippet": "As president, <strong>Leonid Kravchuk (1991–94)</strong> is remembered as the founder of independent Ukraine, and signer of the 1994 Budapest Memorandum on Security Assurances that renounced Ukraine’s nuclear status.",
    "published": null
  },
  {
    "title": "List of Presidents of Ukraine (1991 - 2022)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-presidents-of-ukraine-1646021751-1",
    "snippet": "Its capital is Kyiv (Kiev) which is located on the Dnieper River in north-central Ukraine. <strong>In July 1991, the Verkhovna Rada of the Ukrainian Soviet Socialist Republic passed a law and the modern Ukrainian presidency was formed</strong>.",
    "published": "February 28, 2022"
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "In February 2014 the government of Ukrainian Pres. <strong>Viktor Yanukovych was toppled after months of popular protests, and that May billionaire Petro Poroshenko was elected president of Ukraine</strong>.",
    "published": "September 27, 2019"
  }
]