[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "On 26 February 2023, she was elected as the new <strong>Democratic Party</strong> secretary with 54% of the vote, becoming the first woman to lead the party. Elena Ethel Schlein was born on 4 May 1985 in Lugano, Switzerland. Her father, Melvin Schlein, is an American academic and political scientist of Ashkenazi ...",
    "published": "1 week ago"
  },
  {
    "title": "Elly Schlein: The first woman and LGBTIQ+ leader of Italy’s left | openDemocracy",
    "url": "https://www.opendemocracy.net/en/5050/italy-left-elly-schlein-woman-lgbtiq-democratic-party/",
    "snippet": "It may seem odd that the deeply conservative <strong>Brothers of Italy party</strong> managed to elect a woman leader before the PD, but political analysts have argued that left-wing women often face even greater hurdles than their right-wing counterparts.",
    "published": "March 9, 2023"
  },
  {
    "title": "8th parliamentary term | Elly SCHLEIN | MEPs | European Parliament",
    "url": "https://www.europarl.europa.eu/meps/en/124804/ELLY_SCHLEIN/history/8",
    "snippet": "Elly SCHLEIN · Italy · Date of birth : 04-05-1985, Lugano (CH) 01-07-2014 / 01-07-2019 : Group of the <strong>Progressive Alliance of Socialists and Democrats</strong> in the European Parliament - Member · 01-07-2014 / 08-07-2015 : Partito Democratico (Italy) ...",
    "published": null
  },
  {
    "title": "Biography - Elly Schlein",
    "url": "https://www.ellyschlein.it/en/biography",
    "snippet": "Elly wins the Mep Awards 2017 for ... (SDGs) and on the link between migration and development. In 2016 Elly was appointed rapporteur for the <strong>Socialist and Democratic Group</strong> on the reform of the Dublin Regulation, the rule that establishes which Member State is responsible for each ...",
    "published": "February 16, 2022"
  },
  {
    "title": "Meet the Italian left’s rising star",
    "url": "https://www.politico.eu/article/meet-the-italian-left-rising-star-elly-schlein-pd/",
    "snippet": "While Schlein rejects the parallel with the U.S. Democratic congresswoman, she has — much like Ocasio-Cortez — called for a “Green New Deal” and is very popular among millennials and women. Schlein, who was born and raised in Switzerland before moving to Bologna 15 years ago, also volunteered on Barack Obama’s two presidential campaigns in the United States.",
    "published": "February 13, 2020"
  }
]