[
  {
    "title": "H.E Taye ATSKE-SELASSIE - Africa CEO Forum 2025",
    "url": "https://www.theafricaceoforum.com/forum-2025/en/intervenant/h-e-taye-atske-selassie/",
    "snippet": "On October 7, 2024, Taye Atske-Selassie Amde was sworn in as the <strong>President of the Federal Democratic Republic of Ethiopia</strong>.",
    "published": "April 25, 2025"
  },
  {
    "title": "Taye Atske Selassie - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taye_Atske_Selassie",
    "snippet": "Taye Atske Selassie Amde (Amharic: ታዬ አጽቀሥላሴ, born 13 January 1956) is an Ethiopian diplomat and politician who is the <strong>President of Ethiopia since 2024</strong>. Prior to his presidency he served in multiple diplomatic roles, including ambassador to Egypt and Permanent representative ...",
    "published": "November 6, 2025"
  },
  {
    "title": "Ethiopia's new president: Taye Atske Selassie replaces Sahle-Work Zewde",
    "url": "https://www.bbc.com/news/articles/c4g401e086no",
    "snippet": "Taye Astike Selassie, <strong>foreign minister</strong> since February, has taken up the largely ceremonial role.",
    "published": "October 7, 2024"
  },
  {
    "title": "Taye Atske Selassie sworn in as president of Ethiopia",
    "url": "https://www.aa.com.tr/en/africa/taye-atske-selassie-sworn-in-as-president-of-ethiopia/3354408",
    "snippet": "In a surprising move, <strong>Ethiopia&#x27;s two houses of parliament elected Taye Atske Selassie as president</strong> on Monday, succeeding the country&#x27;s first woman head of state, Sahle-Work Zewde, who hinted at his resignation in a social media post just two ...",
    "published": null
  },
  {
    "title": "Ethiopia: New president signals willingness to dialogue",
    "url": "https://www.dw.com/en/ethiopia-new-president-signals-willingness-to-dialogue/a-70436953",
    "snippet": "<strong>Ethiopia&#x27;s new President</strong>, Taye Atske Selassie, has vowed to pursue peace in Ethiopia and beyond. The veteran diplomat replaced the first female president, Sahle-Work Zewde, who fell out with Prime Minister Abiy.",
    "published": "October 9, 2024"
  }
]