[
  {
    "title": "Luis Enrique - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Luis_Enrique",
    "snippet": "<strong>Luis Enrique Martínez García</strong> (Spanish pronunciation: [lwis enˈrike maɾˈtineθ ɡaɾˈθia]; born 8 May 1970), known as Luis Enrique, is a Spanish football manager and former player. He is currently the head coach of Ligue 1 club Paris Saint-Germain. A versatile player with good technique, ...",
    "published": "15 hours ago"
  },
  {
    "title": "List of Paris Saint-Germain FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Paris_Saint-Germain_FC_managers",
    "snippet": "^ On November 4, 1978, Paris Saint-Germain visited Monaco for a league match of the 1978–79 season. Manager <strong>Pierre Alonzo</strong> had unexpectedly resigned, and his replacement, Velibor Vasović, had yet to arrive. Club president Francis Borelli announced ...",
    "published": "5 days ago"
  },
  {
    "title": "Paris Saint-Germain 2025: Magnificent And Historic Year In Review - myKhel",
    "url": "https://www.mykhel.com/football/paris-saint-germain-2025-magnificent-historic-year-011-402710.html",
    "snippet": "The 50 victories achieved by PSG in 2025 set a new benchmark for Ligue 1 clubs in a calendar year, and the side coached by <strong>Luis Enrique</strong> added weight to that statistic with silverware, lifting six trophies, including the Champions League in May, ...",
    "published": "19 hours ago"
  },
  {
    "title": "Paris Saint-Germain - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/paris-saint-germain/mitarbeiterhistorie/verein/583",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  },
  {
    "title": "Luis Enrique appointed Paris Saint-Germain head coach after Christophe Galtier exit - The Athletic",
    "url": "https://www.nytimes.com/athletic/4620275/2023/07/05/luis-enrique-psg-head-coach/",
    "snippet": "Paris Saint-Germain have confirmed the appointment of <strong>Luis Enrique</strong> as their new head coach. <strong>Luis Enrique</strong> succeeds Christophe Galtier, whose departure after one year in charge was announced just hours earlier on Wednesday.",
    "published": "July 5, 2023"
  }
]