[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "On 5 July 2015, Kasyanov was elected as the only leader of RPR-PARNAS, and the party was renamed to just PARNAS. He added he would like to eventually re-establish the institution of co-chairmanship, adding, &quot;Neither Alexei Navalny nor Mikhail Khodorkovsky will enter our party today and be elected as co-chairmen.",
    "published": "1 week ago"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "The <strong>People&#x27;s Alliance party</strong> was founded on 15 December 2012 at the party&#x27;s founding congress. Initially, Russian opposition figure Alexei Navalny declined to join the political party which was formed mostly by his followers.",
    "published": "1 month ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. In 2000, while he was still a student, Navalny joined <strong>Yabloko</strong>, ...",
    "published": "March 7, 2023"
  },
  {
    "title": "The Two Layers of Alexei Navalny | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/two-layers-alexei-navalny",
    "snippet": "His first political home in the early 2000s was the <strong>Yabloko party</strong>, founded in 1993 on the ideals that blended traditional European social democracy with elements of economic liberalism.",
    "published": null
  },
  {
    "title": "Alexei Navalny - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.m.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Navalny was born in Butyn to a Ukrainian father and Russian mother. In 1993 he started his law degree at Peoples’ Friendship University, in Moscow. In 1998 he graduated. In 2000, Navalny joined the <strong>Russian United Democratic Party</strong>, &quot;Yabloko&quot;.",
    "published": "August 30, 2025"
  }
]