[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... nation&#x27;s head of government. The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "7 December 2025 - 14:00 · On Local Self-Government Day, President of Ukraine <strong>Volodymyr Zelenskyy</strong> signed a decree awarding state honors to heads and employees of local authorities. 7 December 2025 - 13:53 ·",
    "published": "1 week ago"
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "15 December 2025 - 16:31 · The Head of State thanked <strong>Julia Klöckner</strong> and the entire Bundestag for allocating €11.5 billion in defense assistance to Ukraine for next year. 15 December 2025 - 16:08 ·",
    "published": "13 hours ago"
  },
  {
    "title": "About the President of Ukraine — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/president/about-president",
    "snippet": "9 December 2025 - 13:15 Go to all galleries · Home · President · The status and powers of the President of Ukraine, as well as the election procedure are stipulated by the Constitution of Ukraine., which defines the rights and responsibilities of the President as Head of State, the election procedure, and provides for the possibility of his/her dismissal from office and termination of his/her powers.",
    "published": "6 days ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "On 17 October, Donald Trump indicated interest in meeting Zelenskyy at the 2025 Budapest Summit in Hungary, but that their meeting would be separate from Trump&#x27;s meeting with Putin as Trump noted, &quot;These two leaders do not like each other, and we want to make it comfortable for everybody.&quot; On Meet the Press, Zelenskyy confirmed that he was interested in joining the summit meeting, emphasizing the importance of Ukraine as being part the dialogue in order &quot;to have just and lasting peace.&quot;",
    "published": "1 day ago"
  }
]