[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "Both Mussi and Angius refused to join the PD and, following the congress, founded a new party called Democratic Left (SD). On 22 May 2007, the organising committee of the nascent party was formed. It consisted of 45 members, mainly politicians from the two aforementioned major parties and the leaders of the other six minor parties. Also leading external figures such as Giuliano Amato, Marcello De Cecco, Gad Lerner, Carlo Petrini and Tullia Zevi were included.",
    "published": "1 day ago"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "This is true even under new segretaria (party leader) Elly Schlein, who raised many hopes when she was elected to this post in March 2023. But this also tells us something wider about the Democrats and their current position. The Italian center left’s many damaging choices were not individual follies or even outbreaks of collective madness.",
    "published": null
  },
  {
    "title": "Political cheat sheet: What to know about Italy's Democratic Party",
    "url": "https://www.thelocal.it/20170904/what-is-italys-ruling-democratic-party-politics-ideology",
    "snippet": "Italy had a PD-led government between 2013 and 2018, headed by three different prime ministers from the party; <strong>Enrico Letta, Matteo Renzi, and Paolo Gentiloni</strong>. The party brings together a broad range of political groups, and as such, its short ...",
    "published": "September 8, 2022"
  },
  {
    "title": "Democratic Party | political party, Italy | Britannica",
    "url": "https://www.britannica.com/topic/Democratic-Party-political-party-Italy",
    "snippet": "…party, known simply as the Democratic Party (Partito Democratico), emerged when the DS merged with the centrist Daisy (Margherita) party. Soon afterward the FI joined with the AN to create the new center-right People of Freedom (Popolo della Libertà; PdL) party.",
    "published": null
  },
  {
    "title": "Sergio Mattarella - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sergio_Mattarella",
    "snippet": "In October 2000, the PPI joined with other centrist parties to form an alliance called The Daisy (DL), later to merge into a single party in March 2002. Mattarella was re-elected to the Italian Parliament in the 2001 and 2006 general elections, standing as a candidate for The Daisy in two successive centre-left coalitions: The Olive Tree and The Union (L&#x27;Unione). In 2007, Mattarella was one of the founders of the Democratic Party (PD), a big tent centre-left party formed from a merger of left-wing and centrist parties that had been part of The Olive Tree, including The Daisy and the Democrats of the Left (heirs of the PCI).",
    "published": "1 day ago"
  }
]