[
  {
    "title": "Presidential Election 2025 Greece",
    "url": "https://www.robert-schuman.eu/en/monitor/6474-konstantinos-tasoulas-is-elected-president-of-greece",
    "snippet": "<strong>Konstantinos Tasoulas</strong> is elected President of Greece",
    "published": null
  },
  {
    "title": "Greece Elects New President Despite MPs' Walkout Over Train Crash | Balkan Insight",
    "url": "https://balkaninsight.com/2025/02/12/greece-elects-new-president-despite-mps-walkout-over-train-crash/",
    "snippet": "Greece · <strong>Kyriakos Mitsotakis</strong> · New Democracy · PASOK · presidential elections · Syriza · January 15, 2025 · January 7, 2025 · December 13, 2024 · VIEW ALL POSTS · October 31, 2025 · Analysis · October 31, 2025 · Review · October ...",
    "published": "February 12, 2025"
  },
  {
    "title": "The Prime Minister of the Hellenic Republic | Kyriakos Mitsotakis",
    "url": "https://www.primeminister.gr/en/home",
    "snippet": "A gathering that over the years has become an important bridge between Greece and the US investment community. ... 2 December 2025 · Prime Minister Kyriakos Mitsotakis visited Oxford University, where he participated in a discussion with Ngaire Woods, founding Dean of the Blavatnik School of Government and Professor of Global Economic Governance. During the event, the... 1 December 2025 · Prime Minister Kyriakos Mitsotakis participated in a conversation with Clare Woodman, Head of Morgan Stanley for Europe, Middle East, and Africa (EMEA), Latin America and Canada, and CEO of Morgan Stanley &amp; Co.",
    "published": "October 4, 2017"
  },
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "The president of Greece, officially the president of the Hellenic Republic (Greek: Πρόεδρος της Ελληνικής Δημοκρατίας, romanized: Próedros tis Ellinikís Dimokratías), commonly referred to in Greek as the president of the Republic (Πρόεδρος της Δημοκρατίας, Próedros tis Dimokratías, ΠτΔ), is the head of state of Greece.",
    "published": "2 weeks ago"
  },
  {
    "title": "2025 Greek presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Greek_presidential_election",
    "snippet": "A third round of voting was held on 6 February 2025, where no candidate reached the reduced required majority of 180. The fourth round was held on 12 February 2025, where <strong>Konstantinos Tasoulas</strong> was elected as President of Greece.",
    "published": "September 8, 2025"
  }
]