[
  {
    "title": "Prime Minister of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Saudi_Arabia",
    "snippet": "Due to unrest within the royal family over his rule, Saud was forced to appoint his half-brother, <strong>Crown Prince Faisal</strong>, as prime minister. An ongoing power struggle between the two led to Faisal&#x27;s resignation in 1960, allowing Saud to reclaim the reins of government, but continued discontent ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing - HOG",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?OpenForm=&ExpandView=&RestrictToCategory=Saudi+Arabia",
    "snippet": "The Heads of Government listing is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers and in some cases, ministers responsible for development assistance.",
    "published": null
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed heads a repressive authoritarian government in Saudi Arabia. Human rights activists and women&#x27;s rights activists in Saudi Arabia have faced abuse and torture by the regime. Critics, journalists and former insiders are tortured and killed. The government has targeted Saudi dissidents who are located abroad.",
    "published": "11 hours ago"
  },
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "<strong>Mohammed bin Salman</strong> (born August 31, 1985) is the de facto ruler of Saudi Arabia, known for his aggressive foreign policy, ambitious economic vision, and controversial social reforms.",
    "published": "July 17, 2019"
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?RestrictToCategory=Saudi+Arabia",
    "snippet": "The heads of government list is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers, trade ministers and in some cases, ministers responsible for development assistance.&amp;nbsp It has been prepared using information provided by ...",
    "published": null
  }
]