[
  {
    "title": "National Regeneration Movement | political party, Mexico",
    "url": "https://www.britannica.com/topic/National-Regeneration-Movement",
    "snippet": "Founded in <strong>2014</strong> by Mexican politician Andrés Manuel López Obrador, it stresses an anti-corruption agenda, supports energy nationalism, and advocates policies traditionally associated with left-wing ...",
    "published": "February 25, 2025"
  },
  {
    "title": "Morena (political party) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Morena_(political_party)",
    "snippet": "The National Regeneration Movement (Spanish: Movimiento de Regeneración Nacional), commonly referred to by its syllabic abbreviation Morena ([moˈɾena]), is a left-wing political party in Mexico. Founded in <strong>2011 by Andrés Manuel López Obrador</strong> as a civil association and registered as a political ...",
    "published": "5 days ago"
  },
  {
    "title": "Morena | Political Party, Mexico, Andrés Manuel López Obrador, & Claudia Sheinbaum | Britannica",
    "url": "https://www.britannica.com/topic/Morena-political-party",
    "snippet": "Founded in <strong>2014</strong> by Mexican politician Andrés Manuel López Obrador, it stresses an anti-corruption agenda, supports energy nationalism, and advocates policies traditionally associated with left-wing ideologies in Latin America.",
    "published": "February 25, 2025"
  },
  {
    "title": "National Regeneration Movement | Historica Wiki | Fandom",
    "url": "https://historica.fandom.com/wiki/National_Regeneration_Movement",
    "snippet": "The National Regeneration Movement (MORENA) is a social democratic political party in Mexico which was founded in <strong>2014 by Andres Manuel Lopez Obrador</strong>. The party originated as a nonprofit organization founded in 2012 to support Lopez Obrador&#x27;s ...",
    "published": "October 29, 2024"
  },
  {
    "title": "Mexico: The rise of Morena: In one decade, the political party has wiped the PRI from Mexico’s electoral map | International | EL PAÍS English",
    "url": "https://english.elpais.com/international/2023-06-04/the-rise-of-morena-in-one-decade-the-political-party-has-wiped-the-pri-from-mexicos-electoral-map.html",
    "snippet": "The expert recalls the Maximato: the years following the Mexican Revolution, during which <strong>Plutarco Elías Calles</strong> — the man who founded the PRI and governed from 1924 until 1928 — controlled the presidents who succeeded him.",
    "published": "June 4, 2023"
  }
]