[
  {
    "title": "Newsmax Broadcasting LLC, 805 3rd Ave, New York, NY 10022, US - MapQuest",
    "url": "https://www.mapquest.com/us/new-york/newsmax-broadcasting-llc-351739683",
    "snippet": "Get more information for Newsmax Broadcasting LLC in <strong>New York, NY</strong>. See reviews, map, get the address, and find directions.",
    "published": null
  },
  {
    "title": "Driving directions to Newsmax Media, 750 Park of Commerce Dr, Boca Raton - Waze",
    "url": "https://www.waze.com/live-map/directions/us/fl/boca-raton/newsmax-media?to=place.ChIJBRb1Ex7W2IgRASixP1axeCQ",
    "snippet": "Realtime driving directions to Newsmax Media, <strong>750 Park of Commerce Dr, Boca Raton</strong>, based on live traffic updates and road conditions – from Waze fellow drivers",
    "published": null
  },
  {
    "title": "NEWSMAX MEDIA - Updated December 2025 - 1900 K St NW, Washington, District of Columbia - Mass Media - Phone Number - Yelp",
    "url": "https://www.yelp.com/biz/newsmax-media-washington",
    "snippet": "NEWSMAX MEDIA, <strong>1900 K St NW, Washington, DC 20006</strong>, (202) 452-4024, Mon - 9:00 am - 5:00 pm, Tue - 9:00 am - 5:00 pm, Wed - 9:00 am - 5:00 pm, Thu - 9:00 am - 5:00 pm, Fri - 9:00 am - 5:00 pm, Sat - Closed, Sun - Closed",
    "published": null
  },
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "Newsmax, Inc. (or Newsmax.com, previously styled NewsMax) is an American cable news, political opinion commentary, and digital media company founded by Christopher Ruddy in 1998. It has been variously described as conservative, right-wing, and far-right. Newsmax Media divisions include its ...",
    "published": "1 week ago"
  },
  {
    "title": "Newsmax TV - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax_TV",
    "snippet": "DirecTV subsequently replaced Newsmax TV with the competing conservative network The First TV. While DirecTV isn&#x27;t required by law to carry cable news channels with differing political agendas, this particular carriage dispute invoked stroke rebukes from conservative lawmakers like Florida governor Ron DeSantis, who characterised the dispute as &quot;censorship.&quot;",
    "published": "2 weeks ago"
  }
]