[
  {
    "title": "NIST Director Updates | NIST",
    "url": "https://www.nist.gov/pml/owm/nist-director-updates",
    "snippet": "<strong>Locascio</strong> has been selected as the new president and chief executive officer of the American National Standards Institute (ANSI), a private non-profit 501(c)(3) organization that administers and coordinates the U.S. voluntary standardization ...",
    "published": "January 21, 2025"
  },
  {
    "title": "National Institute of Standards and Technology",
    "url": "https://www.nist.gov/",
    "snippet": "NIST promotes U.S. innovation and industrial competitiveness by advancing measurement science, standards, and technology in ways that enhance economic security and improve our quality of life",
    "published": null
  },
  {
    "title": "NIST Director Laurie Locascio to depart in January | FedScoop",
    "url": "https://fedscoop.com/nist-director-laurie-locascio-to-depart-in-january/",
    "snippet": "This feature uses an automated voice, which may result in occasional errors in pronunciation, tone, or sentiment. NIST Director <strong>Laurie Locascio</strong> testifies during a House Science, Space and Technology Committee hearing on May 22, 2024, in Washington, ...",
    "published": "October 18, 2024"
  },
  {
    "title": "NIST director to exit in January - Nextgov/FCW",
    "url": "https://www.nextgov.com/people/2024/10/nist-director-exit-january/400360/",
    "snippet": "NIST confirmed the departure to Nextgov/FCW. “Dr. <strong>Laurie Locascio</strong> will be joining the American National Standards Institute (ANSI) as its CEO in January,” a Department of Commerce spokesperson said on Thursday.",
    "published": "October 17, 2024"
  },
  {
    "title": "National Institute of Standards and Technology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/National_Institute_of_Standards_and_Technology",
    "snippet": "The National Institute of Standards and Technology (NIST) is an agency of the United States Department of Commerce whose mission is to promote American innovation and industrial competitiveness. NIST&#x27;s activities are organized into physical science laboratory programs that include nanoscale ...",
    "published": "1 month ago"
  }
]