[
  {
    "title": "EBRD governance and leadership",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership.html",
    "snippet": "<strong>Odile Renaud-Basso</strong> is the current President of the Bank. The President manages the work of the Bank under the guidance of the Board of Directors. ... The EBRD is owned by 77 countries, the European Union and the European Investment Bank.",
    "published": null
  },
  {
    "title": "EBRD Board of Directors",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership/ebrd-board-of-directors.html",
    "snippet": "While retaining overall authority over the Bank, <strong>the Board of Governors delegates most powers to the Board of Directors</strong>, which is responsible for approving the EBRD&#x27;s country, sector and thematic strategies, policies and operations.",
    "published": null
  },
  {
    "title": "EBRD: staff, structure, history",
    "url": "https://www.ebrd.com/home/who-we-are.html",
    "snippet": "Each shareholder is represented on the Board of Governors, which has overall authority over the Bank. Our President is <strong>Odile Renaud-Basso</strong> (left). The President manages our work under the guidance of the Board of Directors.",
    "published": null
  },
  {
    "title": "Corporate governance",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership/corporate-governance.html",
    "snippet": "These include first and foremost the Bank&#x27;s high standards of business ethics and its established system of internal controls, checks and balances and segregation of duties. These are supplemented with: ... Responsibility for developing the operational risk framework and for monitoring its implementation resides within the Risk Management Vice Presidency. Risk Management is responsible for the overall framework and structure to support line managers who control and manage operational risk as part of their day-to-day activities.",
    "published": null
  },
  {
    "title": "Directors of the EBRD",
    "url": "https://www.ebrd.com/directors-of-the-ebrd.html",
    "snippet": "He has overall responsibility for ... of EBRD policy engagement activities. Mr Patrone previously held the post of Managing Director, Eastern Europe and Caucasus. In that role, he was responsible for the Bank’s operations and policy engagement initiatives in Armenia, Azerbaijan, Georgia and Moldova and for spearheading the Bank&#x27;s crisis response to the war on Ukraine. His 30-year career includes senior management and leadership positions ...",
    "published": null
  }
]