[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "In the 2022 Italian general election, the PD-led coalition achieved similar results to 2018 and returned to the opposition. However, the PD consolidated as one of the two major political parties in Italy during the 2020s along with the Brothers of Italy. Prominent Democrats include former leaders Walter Veltroni, Dario Franceschini, Nicola Zingaretti and Enrico Letta.",
    "published": "1 day ago"
  },
  {
    "title": "Revista Española de Ciencia Política. Núm. 44. Julio 2017, pp. 275-299",
    "url": "https://dialnet.unirioja.es/descarga/articulo/6089213.pdf",
    "snippet": "The Italian Democratic Party, its nature and its Secretary\b ... Party (PCI), whose heirs can be considered the main founders of the Democratic Party.",
    "published": null
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "The party was founded in 2007 as a result of the convergence of <strong>the Democrats of the Left (direct heirs of the Italian Communist Party) and the Margherita (heir to part of Christian Democracy).</strong>",
    "published": null
  },
  {
    "title": "A Brief History of the Italian Democratic Party and Its (Declining) Support | SpringerLink",
    "url": "https://link.springer.com/chapter/10.1007/978-3-031-54059-2_2",
    "snippet": "The creation of the Democratic Party (PD), from a certain point of view, was the realisation of Moro’s and Berlinguer’s dream of the past century, the so-called Compromesso storico (“Historic Compromise”), an attempt to achieve an agreement between what had been the most popular political traditions in Italian society: progressive Catholicism on the one hand and socialism-communism on the other.",
    "published": null
  },
  {
    "title": "Democratic Party | political party, Italy | Britannica",
    "url": "https://www.britannica.com/topic/Democratic-Party-political-party-Italy",
    "snippet": "…party, known simply as the Democratic Party (Partito Democratico), emerged when the DS merged with the centrist Daisy (Margherita) party. Soon afterward the FI joined with the AN to create the new center-right People of Freedom (Popolo della Libertà; PdL) party.",
    "published": null
  }
]