[
  {
    "title": "Minister for Children, Disability and Equality - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_for_Children,_Disability_and_Equality",
    "snippet": "Hildegarde Naughton, TD – Minister of State at the Department of Children, Disability and Equality with responsibility for disability. The office was <strong>created in 1956 as the Minister for the Gaeltacht</strong>. Its title and functions have changed several times, with the current title adopted in 2025.",
    "published": "September 7, 2025"
  },
  {
    "title": "Department of Children, Equality, Disability, Integration and ...",
    "url": "https://www.earlychildhoodireland.ie/wp-content/uploads/2023/08/Explainers_DCEDIY.pdf",
    "snippet": "The Office of the Minister of Children was <strong>established in December 2005</strong>, allowing the · Minister to attend Cabinet meetings, but this did not change the functions of the role. The · last Minister of State for Children was Barry Andrews.",
    "published": null
  },
  {
    "title": "Children’s Rights in Ireland",
    "url": "https://www.gov.ie/en/department-of-children-disability-and-equality/publications/childrens-rights-in-ireland/",
    "snippet": "Since ratification of the UNCRC in 1992, Ireland has made significant steps in its laws, policy and service development to further progress children’s rights. Here are some key milestones over the past three decades. • <strong>1994 - Appointment of the first Minister of State for Children</strong>.",
    "published": "April 12, 2025"
  },
  {
    "title": "Minister for Children, Equality, Disability, Integration and Youth - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_for_Children_and_Youth_Affairs",
    "snippet": "... The department was <strong>created in 1956 as the Department of the Gaeltacht</strong>. Its title and functions have changed several times, with the current title adopted in 2020. An office of minister of state for children existed from 1994 to 2011.",
    "published": "July 2, 2024"
  },
  {
    "title": "Minister of State for Children - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_of_State_for_Children",
    "snippet": "<strong>There has not been a Minister of State with this responsibility since the creation of the full cabinet position of Minister for Children and Youth Affairs in March 2011.</strong> ^ The last minister was styled in full: Minister of State at the Department of Health and Children, at the Department of ...",
    "published": "October 17, 2023"
  }
]