[
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "Sebastian Newbold Coe, Baron Coe, CH, KBE, Hon FRIBA (born 29 September 1956), often referred to as Seb Coe, is a British sports administrator, former politician and retired track and field athlete. As a middle-distance runner, Coe won four Olympic medals, including 1500 metres gold medals at the Olympic Games in 1980 and 1984.",
    "published": "November 18, 2025"
  },
  {
    "title": "Seb Coe and his glamourous fiancée - who would have been wife number 3 - 'separate nine months after announcing engagement' | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/news/article-12579461/Seb-Coe-glamourous-fianc-e-wife-number-3-separate-nine-months-announcing-engagement.html",
    "snippet": "He then married journalist <strong>Carole Annett</strong> in 2011 after an eight-year romance. Ms Annett&#x27;s first husband, Andy, branded Coe a &#x27;marriage wrecker&#x27; in 2004 for allegedly romancing his wife of 15 years before they had split.",
    "published": "September 30, 2023"
  },
  {
    "title": "Back on track after break-up, Seb Coe and his glamorous Los Angeles fiancee - as 68-year-old Olympian is set to wed for the third time | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/news/article-14878961/Back-track-break-Seb-Coe-glamorous-Los-Angeles-fiancee-68-year-old-Olympian-set-wed-time.html",
    "snippet": "The 68-year-old Olympian has &#x27;quietly reunited&#x27; with glamorous Los Angeles PR woman <strong>Sarah Robarts</strong> and the pair are &#x27;happier than ever&#x27; and planning their future.",
    "published": "July 6, 2025"
  },
  {
    "title": "Wedding Of Sebastian Coe To His Long Time Girlfriend",
    "url": "http://weddingdelivery.blogspot.com/2011/07/wedding-of-sebastian-coe-to-his-long.html",
    "snippet": "Lord Sebastian Coe or mainly known by his nick name Seb Coe and head of working group that organize 2012 London Olympics has wed his long time girlfriend <strong>Carole Annett</strong> into a quiet ceremonial in Surrey England on Saturday.",
    "published": null
  },
  {
    "title": "Sebastian Coe finds love with Los Angeles PR boss | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/lifestyle/article-10532807/Sebastian-Coe-finds-love-Los-Angeles-PR-boss.html",
    "snippet": "The double Olympic gold winner Lord Coe, 65, is clearly back on track with his love life as he shows off his new girlfriend, Los Angeles PR boss <strong>Sarah Robarts</strong> · Former flames: It is not known whether Ms Robarts has been married before but she ...",
    "published": "February 21, 2022"
  }
]