[
  {
    "title": "Hans-Joachim Watzke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hans-Joachim_Watzke",
    "snippet": "<strong>Hans-Joachim &quot;Aki&quot; Watzke</strong> (born 21 June 1959, Marsberg, North Rhine-Westphalia) is a German businessman and football official. He served as the CEO of Borussia Dortmund from 2005 until 2025 and is the club&#x27;s elected president since November 23, 2025.",
    "published": "1 month ago"
  },
  {
    "title": "Ownership of Borussia Dortmund | Download Scientific Diagram",
    "url": "https://www.researchgate.net/figure/Ownership-of-Borussia-Dortmund_fig5_344375289",
    "snippet": "Ownership Landscape: an RBV perspective of football leagues’ configurations diversity · Article · Feb 2025 · Ricardo Gúdel · View · ... Members&#x27; associations, also known as supporter-owned or community-owned clubs, are primarily found in Germany (e.g., FC Bayern Munich and BV Borussia Dortmund) and, to some extent, in Spain (e.g., Real Madrid CF and FC Barcelona) [16]. These clubs operate under models where the majority of voting rights are held by the club&#x27;s members, who are typically fans [17]. ...",
    "published": null
  },
  {
    "title": "Who Owns Borussia Dortmund? BVB Shareholders - Investing.com",
    "url": "https://www.investing.com/equities/borussia-dortmund-gmbh-co-kgaa-ownership",
    "snippet": "DORTMUND - German football club Borussia Dortmund achieved its highest-ever consolidated revenue in the 2024/2025 financial year,...",
    "published": null
  },
  {
    "title": "Who owns Borussia Dortmund (BVB)? Owners' net worth, source of wealth and ownership history",
    "url": "https://www.interestingfootball.com/2025/05/who-owns-borussia-dortmund-bvb-owners.html",
    "snippet": "Borussia Dortmund is currently owned by a publicly traded company with major shareholders including <strong>Bernd Geske, Evonik Industries AG, Signal Iduna, Ralph Dommermuth Beteiligungen GmbH and Puma SE</strong>.",
    "published": null
  },
  {
    "title": "Borussia Dortmund GmbH : Shareholders Board Members Managers and Company Profile | DE0005493092 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/BORUSSIA-DORTMUND-GMBH-435951/company/",
    "snippet": "Borussia Dortmund GmbH &amp; Co KGaA is a Germany-based company engaged in the operation of Ballspielverein Borussia (BVB), a professional football club based in Dortmund, Germany. The Company has around 8 functional areas such as sports, communications, human resources, organization, finance, legal and IR, marketing and digitalization, commercial partnerships.",
    "published": null
  }
]