[
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "Robert Nicholas Burns (born January 28, 1956) is an <strong>American diplomat and international relations scholar</strong>. He served as the United States ambassador to China from 2022 to 2025. He is now Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations at Harvard ...",
    "published": "September 26, 2025"
  },
  {
    "title": "BIOGRAPHY: Nicholas Burns",
    "url": "https://2009-2017.state.gov/s/p/fapb/185577.htm",
    "snippet": "He worked for five years (1990–1995) on the National Security Council at the White House where he was Senior Director for Russia, Ukraine and Eurasia Affairs and Special Assistant to President Clinton and Director for Soviet Affairs in the Administration of President George H.W. Bush. Burns also served in the American Consulate General in Jerusalem (1985–1987) where he coordinated U.S.",
    "published": null
  },
  {
    "title": "R. Nicholas Burns - Former Under Secretary of State for Political Affairs",
    "url": "https://georgewbush-whitehouse.archives.gov/government/nburns-bio.html",
    "snippet": "Ambassador R. Nicholas Burns was the Under Secretary of State for Political Affairs, the Department of State’s third ranking official. Appointed by President Bush, he was confirmed by the U.S. Senate on March 17, 2005 and was sworn into office by Secretary of State Condoleezza Rice.",
    "published": null
  },
  {
    "title": "Biography: Amb. R. Nicholas Burns",
    "url": "https://1997-2001.state.gov/about_state/biography/burns.html",
    "snippet": "R. Nicholas Burns is <strong>United States Ambassador to Greece</strong>. Appointed by President Clinton, he was sworn into office by Secretary of State Madeleine Albright on November 10, 1997. As Ambassador, he oversees all U.S. government programs at the U.S.",
    "published": null
  },
  {
    "title": "Nicholas Burns | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty/nicholas-burns",
    "snippet": "Ambassador Nicholas Burns is the ... Harvard University’s Kennedy School of Government. He is the <strong>Founder and Faculty Chair of the Future of Diplomacy Project</strong>. He is also a Faculty Affiliate at Harvard’s Fairbank Center for ...",
    "published": null
  }
]