[
  {
    "title": "Current Shareholding - Juventus Football Club",
    "url": "https://www.juventus.com/en/club/investor-relations/shareholding-title/current-shareholding",
    "snippet": "As of 7 November 2025 the shareholding structure of Juventus Football Club S.p.A.",
    "published": null
  },
  {
    "title": "Juventus FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_FC",
    "snippet": "Founded with the name of Sport-Club Juventus, initially as an athletics club, it is the second oldest of its kind still active in the country after Genoa&#x27;s football section (1893) and has competed every season of the premier club division (reformulated in different formats until the Serie A inception in 1929) since its debut in 1900 with the exception of the 2006–07 season, being managed by the industrial Agnelli family almost continuously since 1923.",
    "published": "1 week ago"
  },
  {
    "title": "Juventus Owners: Past & Present Ownership Details",
    "url": "https://www.sportsdunia.com/football-teams/juventus-owners",
    "snippet": "The owner of Juventus football club is also known for their activities in the automobile industry by investing in Ferrari, Lancia, Alfa Romeo, and Chrysler, taken over by the Agnelli after it filed for Bankruptcy in 2009. Sometimes, the family has been described in the American media as the Kennedys of Italy for their role in the country&#x27;s modern history and their activity in funding modern art and sports.",
    "published": "June 27, 2025"
  },
  {
    "title": "Juventus Football Club S.p.A.: Shareholders Board Members Managers and Company Profile | IT0005572778 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/JUVENTUS-FOOTBALL-CLUB-S--95660/company/",
    "snippet": "The Companyâs core business is participation in national and international competitions and the organization of matches while exploiting sports events, the Juventus brand and the team image including also the licensing of television and media rights, sponsorship, selling of advertising space, licensing and merchandising.",
    "published": null
  },
  {
    "title": "About Juventus | Juventus.com",
    "url": "https://www.juventus.com/en/about-us-app",
    "snippet": "All club’s records have been achieved under the ownership of <strong>the Agnelli&#x27;s family</strong>, a record itself as, with 96 and counting years, it is the longest active ownership of a professional sport entities in the world.",
    "published": null
  }
]