[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Larive has been the subject of ... hours of May 31st, 2024, <strong>Larive authorized hundreds of police officers clad in riot gear from 13 different California police departments to disperse Pro-Palestinian protesters at the base of the UCSC campus</strong>....",
    "published": "July 15, 2025"
  },
  {
    "title": "Cynthia Larive to become 11th chancellor of UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2019/05/chancellor-designate/",
    "snippet": "The University of California Board of Regents approved today (May 16) Dr. Cynthia K. Larive as the <strong>eleventh chancellor of UC Santa Cruz</strong>.",
    "published": "May 13, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "She gained approval for the campus Long Range Development Plan that will serve as a blueprint for development on campus over the next two decades and completed “Leading the Change: The UC Santa Cruz Strategic Plan,” which details the campus community’s collective vision for the university over the next decade. An accomplished bioanalytical chemist, Larive served as the primary mentor to 30 doctoral and master’s students with whom she co-authored more than 160 scientific publications.",
    "published": null
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "UC Santa Cruz Chancellor Cynthia Larive is <strong>set to undergo an overdue five-year performance review</strong>, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  },
  {
    "title": "Chancellor Larive assumes position as new Board Chair for Monterey Bay Economic Partnership - News",
    "url": "https://news.ucsc.edu/2022/04/chancellor-larive-mbep/",
    "snippet": "University of California, Santa Cruz Chancellor Cynthia K. Larive <strong>will assume the role of incoming board chair for the Monterey Bay Economic Partnership</strong>.",
    "published": "March 18, 2025"
  }
]