[
  {
    "title": "Mediocredito Centrale 2025 Company Profile: Valuation, Funding & Investors | PitchBook",
    "url": "https://pitchbook.com/profiles/company/62465-14",
    "snippet": "The deal was made on 28-Oct-2025. To view Mediocredito Centrale’s complete investments and acquisitions history, request access » ... Mediocredito Centrale was founded in 1952. Mediocredito Centrale is headquartered in Rome, Italy. Mediocredito Centrale has 435 total employees. Mediocredito Centrale’s primary industry is Specialized Finance. Mediocredito Centrale is a Private company. The current revenue for Mediocredito Centrale is .",
    "published": null
  },
  {
    "title": "Banca del Mezzogiorno – MedioCredito Centrale - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banca_del_Mezzogiorno_–_MedioCredito_Centrale",
    "snippet": "In August 2017 the ownership of the bank was entirely transferred to <strong>Invitalia S.p.A.</strong>, a development agency owned by the Ministry of Economy and Finance. In 2020, following the bailout of Banca Popolare di Bari, Mediocredito Centrale took the control of Popolare di bari, which led in 2021 to ...",
    "published": "April 5, 2025"
  },
  {
    "title": "Mediocredito Centrale Company Overview, Contact Details & Competitors | LeadIQ",
    "url": "https://leadiq.com/c/mediocredito-centrale/6010f38f881cc9057f4bc493",
    "snippet": "Mediocredito Centrale, <strong>controllata da Invitalia</strong>, da impulso alla crescita del Paese sostenendo le Persone e le Imprese, puntando sui settori strategici per lo sviluppo e l’occupazione, impegnandosi nel rilancio delle aree del Mezzogiorno. Nel 2021 siamo diventati un Gruppo bancario a seguito ...",
    "published": null
  },
  {
    "title": "Mediocredito Centrale|Invitalia",
    "url": "https://www.invitalia.it/en/chi-siamo/il-gruppo/mediocredito-centrale",
    "snippet": "Mediocredito Centrale - Banca del Mezzogiorno was acquired by <strong>Invitalia</strong> in August 2017 to develop synergies with the offer of incentives to enterprises and to promote growth policies.",
    "published": null
  },
  {
    "title": "Mediocredito Centrale - Banca del Mezzogiorno Spa (Italy) - Bank Profile",
    "url": "https://thebanks.eu/banks/15695",
    "snippet": "17 April 2025 Revolut Bank’s €3.5M fine highlights the growing regulatory scrutiny faced by digital banks in Europe. Explore this and other AML fines in the sector. ... In 2023 total assets of Mediocredito Centrale - <strong>Banca del Mezzogiorno Spa</strong> ...",
    "published": null
  }
]