[
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "Olaf Scholz (born 14 June 1958) is a <strong>German politician who served as the Chancellor of Germany from 2021 to 2025</strong>. A member of the Social Democratic Party (SPD), he previously served as Vice Chancellor in the fourth Merkel cabinet and as Federal Minister of Finance from 2018 to 2021.",
    "published": "2 weeks ago"
  },
  {
    "title": "Olaf Scholz",
    "url": "https://www.bruegel.org/people/olaf-scholz",
    "snippet": "Olaf Scholz has been Federal Minister of Finance and Vice-Chancellor of the Federal Republic of Germany since March 2018. Scholz was <strong>born in the German city of Osnabrück in 1958, grew up in Hamburg and is married</strong>. In 1985, he completed his ...",
    "published": null
  },
  {
    "title": "Olaf Scholz | Facts, Biography, Cabinet, & Chancellor of Germany | Britannica",
    "url": "https://www.britannica.com/biography/Olaf-Scholz",
    "snippet": "Olaf Scholz is a German politician who became chancellor of Germany in 2021. A longtime member of Germany’s center-left Social Democratic Party (SPD), Scholz served as finance minister and vice chancellor (2018–21) in the ‘grand coalition’ government of Angela Merkel before succeeding her as chancellor.",
    "published": "March 31, 2022"
  },
  {
    "title": "Olaf Scholz Biography: Age, Net Worth, Family & Career Highlights - Mabumbe",
    "url": "https://mabumbe.com/people/olaf-scholz-biography-age-net-worth-family-career-highlights/",
    "snippet": "As Chancellor, Scholz prioritized climate change initiatives, supporting renewable energy transitions, green technologies, and international climate agreements. Olaf Scholz has been <strong>married to Britta Ernst since 1998</strong>.",
    "published": "December 17, 2024"
  },
  {
    "title": "Olaf Scholz - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1496322/bio/",
    "snippet": "Olaf Scholz. Self: Farbe bekennen. Olaf Scholz was born on 14 June 1958 in Osnabrück, Germany. He has been <strong>married to Britta Ernst since 1998</strong>.",
    "published": null
  }
]