[
  {
    "title": "David Hurley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley",
    "snippet": "General David John Hurley (born 26 August 1953) is an Australian former politician and military officer. A senior officer in the Australian Army, he served as the 27th <strong>governor-general of Australia</strong> from 2019 to 2024. He was previously the 38th governor of New South Wales from 2014 to 2019.",
    "published": "October 31, 2025"
  },
  {
    "title": "Contact David Hurley, Email: d***@oldcastle.com & Phone Number | Manager, Market Development at OldCastle APG - ZoomInfo",
    "url": "https://www.zoominfo.com/p/David-Hurley/2085980815",
    "snippet": "David Hurley’s latest job experience is <strong>Builder Surfaces Manager</strong> at COSENTINO GLOBAL, S.L.U.",
    "published": null
  },
  {
    "title": "Contact David Hurley, Email: d***@essexind.com & Phone Number | Vice President, Operations at Essex Industries - ZoomInfo",
    "url": "https://www.zoominfo.com/p/David-Hurley/-1057196296",
    "snippet": "David Hurley is <strong>Senior Manager, Operations at Essex Industries</strong>, bringing extensive experience in operations management. Their background includes a progression of responsibilities at Essex Industries, where they advanced to Vice President, Operations. During their tenure at Essex Industries, ...",
    "published": null
  },
  {
    "title": "Contact David Hurley, Email: d***@fmpsd.ab.ca & Phone Number | Director of PEAK Athletic Academy at Fort McMurray Public School District - ZoomInfo",
    "url": "https://www.zoominfo.com/p/David-Hurley/2757813885",
    "snippet": "David Hurley is the <strong>Director of PEAK Athletic Academy</strong> within the Fort McMurray Public School District, bringing expertise backed by a Doctor of Education degree. Their background reflects a strong focus on educational leadership and athletic program development within the Alberta education system.",
    "published": null
  },
  {
    "title": "David Hurley facts for kids",
    "url": "https://kids.kiddle.co/David_Hurley",
    "snippet": "After leaving the army in June 2014, Hurley became the <strong>Governor of New South Wales</strong>. He took over from Marie Bashir in October 2014. His time as Governor ended in May 2019. He was then chosen by Queen Elizabeth II to be the Governor-General.",
    "published": null
  }
]