[
  {
    "title": "List of prime ministers of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Canada",
    "snippet": "The most recent former prime minister to die was <strong>Brian Mulroney</strong>, on 29 February 2024. The office is not outlined in any of the documents that constitute the written portion of the Constitution of Canada; executive authority is formally vested ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Prime Ministers of Canada",
    "url": "https://lop.parl.ca/sites/ParlInfo/default/en_CA/People/primeMinisters",
    "snippet": "This page provides general details on Canada&#x27;s prime ministers since 1867.",
    "published": null
  },
  {
    "title": "List of prime ministers of Canada | Britannica",
    "url": "https://www.britannica.com/place/list-of-prime-ministers-of-Canada-1800352",
    "snippet": "This is a chronologically ordered list of the prime ministers, from the earliest to the most recent. <strong>Sir John Alexander Macdonald</strong> (1867–73; 1st time) ... W.L. Mackenzie King (1921–26; 1st time) ...",
    "published": "November 4, 2011"
  },
  {
    "title": "Prime Minister of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Canada",
    "snippet": "The governor general may still, on the advice of the prime minister, dissolve parliament and issue the writs of election prior to the date mandated by the constitution or Canada Elections Act; the King–Byng Affair was the only time since Confederation that the governor general refused the prime minister&#x27;s request for a general vote.",
    "published": "October 20, 2025"
  },
  {
    "title": "Government Ministries and Prime Ministers of Canada Since 1867 - House of Commons Procedure and Practice, Third edition, 2017 - ProceduralInfo - House of Commons of Canada",
    "url": "https://www.ourcommons.ca/procedure/procedure-and-practice-3/App06-e.html",
    "snippet": "... The government of Sir John A. Macdonald resigned on November 5, 1873, as a result of the Canadian Pacific Railway scandal. On November 7, 1873, the Liberals under Alexander Mackenzie formed a government. ... <strong>Sir John Abbott</strong> served as Prime Minister from the Senate.",
    "published": null
  }
]