[
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "The last election was held in October 2019 at the 2019 World Athletics Championships. Following doping and corruption issues, a Code of Ethics was agreed in 2013 and an Ethics Commission was appointed in 2014. The Council appoints the chairperson from the elected members, and in turn, the chairperson appoints a deputy chair.",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "Led successful campaigns in Canada to secure athlete representation and financing · Chair of the Jury of Appeal for all World Athletics Championships and Olympic Games since 2009",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "He was the director of the Dutch Olympic Committee between 1965 and 1970 but retained an extensive involvement with athletics, becoming the European Athletics Association president upon its formation in 1970 until 1976, when he was elected as the third IAAF president. Curiously, at the age of 73, he was two years older than the man he was succeeding but Paulen was active in addressing many of the relevant issues of the changing times. The first IAAF World Cup in 1977 was contested during his brief presidency and he set in motion events that lead to the first IAAF World Championships in 1983.",
    "published": null
  },
  {
    "title": "The Past Presidents of the IAAF | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/the-past-presidents-of-the-iaaf",
    "snippet": "He was elected president of FIDAL, the Italian athletics federation, in 1969 and three years later he was also elected to the IAAF Council before becoming president in 1981. Nebiolo expanded the IAAF calendar into the form we know it today, especially with the introduction of events such as the IAAF World Junior Championships, as well as moving the show piece IAAF World Championships to a two-yearly cycle. A pivotal moment in the political history of the IAAF came in 1987 when Nebiolo insisted on changes to the voting structure of Congress, which had been biased towards the &#x27;traditional&#x27; powers&#x27;, to one-member one-vote.",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "World Athletics Development Commission member · Chairperson of Athletics New Zealand, 2007-2018 · Oceania Area Development Commission member · National Olympic Committee Board member, 2017-present · Sport New Zealand High Performance Board member, 2020-present ·",
    "published": null
  }
]