[
  {
    "title": "Ukraine war briefing: Britain’s spy chief to warn of Russia’s ‘expansionist threat’ as Berlin talks enter second day | Ukraine | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/ukraine-war-briefing-britains-spy-chief-to-warn-of-russias-expansionist-threat-as-berlin-talks-enter-second-day",
    "snippet": "<strong>The Ukrainian leader called on Sunday for a “dignified” peace and guarantees that Russia would not attack Ukraine as he attended talks with US figures in Berlin</strong> – the latest efforts to end the war with Russia.",
    "published": "1 day ago"
  },
  {
    "title": "Speeches — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/speeches",
    "snippet": "13 December 2025 - 20:49 Go to all news · pgPhoto gallery · <strong>Working Trip of the President of Ukraine to the Kharkiv Region</strong> · 12 December 2025 - 16:25 Go to all galleries · Home · News · 13 December 2025 - 20:49 · We are currently preparing ...",
    "published": "2 days ago"
  },
  {
    "title": "Russian Offensive Campaign Assessment, December 13, 2025",
    "url": "https://understandingwar.org/research/russia-ukraine/russian-offensive-campaign-assessment-december-13-2025/",
    "snippet": "<strong>Ukrainian President Volodymyr Zelensky announced that he will hold discussions regarding a peace settlement with US and European delegations in Berlin in the coming days</strong>.[21] Two White House officials told Axios on December 13 that US Special ...",
    "published": "20 hours ago"
  },
  {
    "title": "Leaders’ statement on Ukraine - Consilium",
    "url": "https://www.consilium.europa.eu/en/press/press-releases/2025/12/15/leaders-statement-on-ukraine/",
    "snippet": "15 December 2025 21:10 · This statement was adopted by President Costa, President von der Leyen, Prime Minister Frederiksen, President Stubb, President Macron, Chancellor Merz, Prime Minister Meloni, Prime Minister Schoof, Prime Minister Støre, Prime Minister Tusk, Prime Minister Kristersson, and Prime Minister Starmer. The Leaders welcomed significant progress on President Trump’s efforts to secure a just and lasting peace in Ukraine.",
    "published": null
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "15 December 2025 - 15:17 · On the occasion of Court Employees’ Day, <strong>President of Ukraine Volodymyr Zelenskyy signed decrees appointing judges to local and appellate courts following the results of open competitions</strong>.",
    "published": "13 hours ago"
  }
]