[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "He studied agriculture in a school 20 miles from home. When he was 13, Pochettino was scouted by Jorge Griffa, director of football at Newell&#x27;s Old Boys, and his future manager Marcelo Bielsa, then the reserve team coach at Newell&#x27;s. Although he was happy at Rosario Central who were interested in signing him, he was persuaded to try out for their rivals Newell&#x27;s Old Boys in Rosario, Santa Fe. He was quickly placed in a team attending ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Sebastiano Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastiano_Pochettino",
    "snippet": "Sebastiano Pochettino (born 24 January 1995) is a Spanish-Argentine football manager who is currently the fitness coach and sports scientist of the U.S. men&#x27;s national soccer team. Pochettino attended <strong>St. Paul&#x27;s School</strong> in Barcelona, Spain. He is the son of the Argentine football manager Mauricio ...",
    "published": "August 15, 2025"
  },
  {
    "title": "USMNT coach Mauricio Pochettino's career honors, trophies - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/41191490/usmnt-manager-mauricio-pochettino-career-honors-trophies",
    "snippet": "Mauricio Pochettino is the new manager for the United States men&#x27;s national team. Here&#x27;s a look at some of the accomplishments in his coaching career.",
    "published": "September 16, 2024"
  },
  {
    "title": "Mauricio Pochettino - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/mauricio-pochettino/profil/trainer/9044",
    "snippet": "This is the profile site of the manager Mauricio Pochettino. The site lists all clubs he coached and all clubs he played for.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino (USA) - Bio, stats and news",
    "url": "https://www.365scores.com/en-us/football/player/mauricio-pochettino-46122",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  }
]