[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The paper was founded with the 1897 merger of the Summit Beacon, first published in 1839, and the Akron Evening Journal, founded in 1896. In 1903, the Beacon Journal was purchased by <strong>Charles Landon Knight</strong>. His son John S. Knight inherited the paper, in 1933, on Charles&#x27; death.",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "<strong>The Akron paper was owned by the Knight family for nearly seven decades starting in 1907, and then the Knight Ridder company beginning in 1974</strong>. That company sold the Beacon Journal to McClatchy Co.",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media | Crain's Cleveland Business",
    "url": "https://www.crainscleveland.com/article/20180411/news/157966/akron-beacon-journal-sold-gatehouse-media",
    "snippet": "The Beacon has a daily circulation of 68,000. <strong>The award-winning paper had long been owned by Knight Ridder, but was sold to Black Press when Knight Ridder was McClatchy Co.</strong>",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media, owner of Canton and Columbus papers | wkyc.com",
    "url": "https://www.wkyc.com/article/news/local/akron/akron-beacon-journal-sold-to-gatehouse-media-owner-of-canton-and-columbus-papers/95-537352145",
    "snippet": "<strong>Black Press bought the Akron Beacon Journal in 2006 following the sale of the Beacon Journal’s former corporate parent Knight Ridder to California-based newspaper chain McClatchy Co</strong>.",
    "published": null
  },
  {
    "title": "Akron Beacon Journal",
    "url": "https://grokipedia.com/page/Akron_Beacon_Journal",
    "snippet": "In 1903, <strong>Charles Landon Knight, then editor of Women&#x27;s Home Companion, acquired the Beacon Journal in partnership with T.J. Kirkpatrick</strong>, establishing the operational framework for the modern Akron Beacon Journal through consolidated ownership ...",
    "published": null
  }
]