[
  {
    "title": "Alphabet Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
    "snippet": "On 15 September 2025, Alphabet became the fourth company—trailing Nvidia, Microsoft, and Apple—to top $3 trillion in market cap. At the time, shares were up more than 32% for the year amid optimism for AI adoption and a more-favorable-than-expected antitrust ruling that did not require the company to divest its Chrome browser platform. Alphabet Inc...",
    "published": "1 week ago"
  },
  {
    "title": "Who owns Alphabet in 2025? GOOGL shareholders explained | Capital.com",
    "url": "https://capital.com/en-int/analysis/alphabet-shareholder-who-owns-most-googl",
    "snippet": "As of June 2025, the largest institutional holders include The <strong>Vanguard Group (7.73%), BlackRock (6.55%) and State Street Global Advisors (3.47%), followed by FMR LLC, Capital Research and Management Company, and T.</strong>",
    "published": null
  },
  {
    "title": "GOOGL - Alphabet Inc. Stock - Stock Price, Institutional Ownership, Shareholders (NasdaqGS)",
    "url": "https://fintel.io/so/us/googl",
    "snippet": "Major shareholders can include <strong>individual investors, mutual funds, hedge funds, or institutions</strong>. The Schedule 13D indicates that the investor holds (or held) more than 5% of the company and intends (or intended) to actively pursue a change in business strategy.",
    "published": null
  },
  {
    "title": "Alphabet Investor Relations - Investors - 2025 Annual Meeting of Stockholders",
    "url": "https://abc.xyz/investor/annual-meeting/",
    "snippet": "We held our 2025 Annual Meeting of Stockholders on June 6, 2025. For more information about the proposals that were submitted to the stockholders at the 2025 Annual Meeting, see our 2025 Proxy Statement · Holders of the shares of Class A common stock were entitled to one vote per share held ...",
    "published": null
  },
  {
    "title": "Alphabet Inc.: Shareholders Board Members Managers and Company Profile | US02079K3059 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/ALPHABET-INC-24203373/company/",
    "snippet": "Alphabet Inc.: Company profile, business summary, shareholders, managers, financial ratings, industry, sector and market information | Nasdaq: GOOGL | Nasdaq",
    "published": null
  }
]