[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "The launch meeting of the Left Party was held on 29 November in Saint-Ouen, in the presence of Die Linke&#x27;s co-chairman Oskar Lafontaine. <strong>Mélenchon became the party president</strong>. Until 2014, he was also co-president alongside Martine Billard. A political outsider, Mélenchon was the candidate ...",
    "published": "1 week ago"
  },
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "Beginning in late 2018, Mélenchon and the leadership of <strong>La France Insoumise</strong> made a significant shift by abandoning their sovereigntist and ultra-secularist stances. This decision led to the expulsion of key members, marking a clear change in the party&#x27;s ideological direction.",
    "published": "5 days ago"
  },
  {
    "title": "France in Crisis: an Interview with Jean Luc Melenchon and La France Insoumise - CounterPunch.org",
    "url": "https://www.counterpunch.org/2025/10/29/france-in-crisis-an-interview-with-jean-luc-melenchon-and-la-france-insoumise/",
    "snippet": "When he visited Paris in July 2025, Walden Bello interviewed some of the leaders of LFI, including Nadege Abomangoli, vice president of the National Assembly; Aurelie Trouve, chairwoman of the Economic Affairs Committee of the Assembly; and members of parliament Arnaud Le Gall, Aurelien Tache, and Aurelien Saintoul. This was followed in September 2025 by an email interview with LFI leader Jean Luc Melenchon (JLM).",
    "published": "October 29, 2025"
  },
  {
    "title": "The Crisis Engulfing the French Left | The Nation",
    "url": "https://www.thenation.com/article/world/french-left-split-new-popular-front-melonchon-socialists/",
    "snippet": "“A share of the party is moderate on economic questions and thinks LFI’s platform is too left-wing. But they also disagree on questions related to secularism, like whether or not Islamophobia is a problem. LFI and its leader Jean-Luc Mélenchon himself have evolved on these questions too.”",
    "published": "March 7, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon Explains How His Party Took Down a Right-Wing Government | The Nation",
    "url": "https://www.thenation.com/article/world/jean-luc-melenchon-interview/",
    "snippet": "For Jean-Luc Mélenchon, the head of the left-wing <strong>France Insoumise</strong>, the hope is that this turmoil can change France’s political direction and the country will break out of a binary contest between the neoliberal center and a rising far right.",
    "published": "May 21, 2025"
  }
]