[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "Their son, born in 1981, holds a doctorate in philosophy, their elder daughter is a physician, and their younger daughter is a lawyer. Merz has seven grandchildren. In 2005, Merz and his wife established the Friedrich und Charlotte Merz Stiftung, a foundation supporting projects in the education sector.",
    "published": "1 week ago"
  },
  {
    "title": "Wife of would-be German chancellor only sees him on TV or Instagram",
    "url": "https://www.yahoo.com/news/wife-german-chancellor-only-sees-191829133.html",
    "snippet": "Charlotte Merz, the <strong>wife of the front-runner to become Germany&#x27;s next chancellor</strong>, said on Friday she hardly sees her husband Friedrich during the ongoing election campaign, only catching glimpses of him on television or Instagram.",
    "published": "February 21, 2025"
  },
  {
    "title": "Friedrich Merz‘ Frau: Das ist seine schöne Partnerin Charlotte & ihre Kinder",
    "url": "https://www.tz.de/stars/merz-und-tochter-constanze-friedrich-und-charlotte-zr-93984262.html",
    "snippet": "<strong>Charlotte Merz ist die Ehefrau des Bundeskanzlers Friedrich Merz</strong>. Wir stellen euch die Partnerin des CDU-Politikers näher vor.",
    "published": "October 23, 2025"
  },
  {
    "title": "Charlotte Merz: Age, Net Worth, Family & Career Highlights - Mabumbe",
    "url": "https://mabumbe.com/people/charlotte-merz-age-net-worth-family-career-highlights/",
    "snippet": "<strong>Charlotte Merz (née Gass), born in 1961 in Saarland, Germany, is a distinguished German judge and the wife of Friedrich Merz</strong>, the leader of the Christian Democratic Union (CDU) and Germany’s Chancellor as of May 2025.",
    "published": "May 6, 2025"
  },
  {
    "title": "Charlotte Merz - IMDb",
    "url": "https://www.imdb.com/name/nm13128780/",
    "snippet": "Charlotte Merz. Self: Inside CDU. Charlotte Merz was born in 1961 in Saarland, Germany. <strong>She has been married to Friedrich Merz since June 1981</strong>. They have three children.",
    "published": null
  }
]