[
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "<strong>Programmer, designer, author, and manager in high tech R&amp;D</strong>. Specialties: internet… · Experience: Stanford Institute for Human-Centered Artificial Intelligence (HAI) · Location: Palo Alto · 500+ connections on LinkedIn.",
    "published": "1 week ago"
  },
  {
    "title": "Peter Norvig",
    "url": "https://norvig.com/",
    "snippet": "Distinguished Education Fellow at Stanford HAI, <strong>Research Director at Google</strong>. Co-author of Artificial Intelligence: A Modern Approach, the leading AI textbook used in 1,500+ universities worldwide. peter@norvig.com / resume / github / medium / photo gallery / legacy homepage",
    "published": null
  },
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Peter Norvig (born 14 December 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google. Norvig is the co-author with Stuart J. Russell of the most ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Norvig",
    "url": "https://research.google/people/author205/",
    "snippet": "Peter Norvig is a <strong>Director of Research</strong> at Google Inc; previously he directed Google&#x27;s core search algorithms group.",
    "published": null
  },
  {
    "title": "Peter Norvig: Today's Most Pressing Questions in AI Are ...",
    "url": "https://hai.stanford.edu/news/peter-norvig-todays-most-pressing-questions-ai-are-human-centered",
    "snippet": "Artificial intelligence expert Peter Norvig is joining the Stanford Institute for Human-Centered AI this fall as a <strong>Distinguished Education Fellow</strong>, with the task of developing tools and materials to explain the key concepts of artificial intelligence.",
    "published": null
  }
]