[
  {
    "title": "EBRD: staff, structure, history",
    "url": "https://www.ebrd.com/home/who-we-are.html",
    "snippet": "The EBRD is owned by 77 countries, as well as the European Union and the European Investment Bank. Each shareholder is represented on the Board of Governors, which has overall authority over the Bank. Our President is Odile Renaud-Basso (left). The President manages our work under the guidance of the Board of Directors.",
    "published": null
  },
  {
    "title": "Directors of the EBRD",
    "url": "https://www.ebrd.com/directors-of-the-ebrd.html",
    "snippet": "His 30-year career includes senior management and leadership positions in merchant banking, private equity, management consulting and engineering. He <strong>joined the EBRD in 2008 as a senior banker with the Corporate Equity team</strong>.",
    "published": null
  },
  {
    "title": "EBRD governance and leadership",
    "url": "https://www.ebrd.com/who-we-are/our-structure.html",
    "snippet": "<strong>Odile Renaud-Basso</strong> is the current President of the Bank. The President manages the work of the Bank under the guidance of the Board of Directors. ... The EBRD is owned by 77 countries, the European Union and the European Investment Bank.",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Bank_for_Reconstruction_and_Development",
    "snippet": "<strong>In January 1990</strong>, negotiations about the EBRD objectives, its lending policy regarding the public and private sectors, started and involved all the EU countries at the time, as well as various other European countries, non-European countries ...",
    "published": "1 week ago"
  },
  {
    "title": "EBRD Board of Directors",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership/ebrd-board-of-directors.html",
    "snippet": "While retaining overall authority over the Bank, the Board of Governors delegates most powers to the Board of Directors, which is responsible for approving the EBRD&#x27;s country, sector and thematic strategies, policies and operations.",
    "published": null
  }
]