[
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "He won the election with <strong>73.23 percent of the vote in the second round</strong>, defeating Poroshenko in the biggest landslide in the history of Ukrainian presidential elections. As president, Zelenskyy has been a proponent of e-government and of unity between the Ukrainian- and Russian-speaking parts ...",
    "published": "4 days ago"
  },
  {
    "title": "2019 Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2019_Ukrainian_presidential_election",
    "snippet": "The President of the United States, Donald Trump, called the president-elect to congratulate him and &quot;the Ukrainian people for a peaceful [and] democratic election.&quot; A joint letter of congratulations was issued by both Tusk and Jean Claude Juncker, the President of the European Commission. The European Union (EU) leaders stated that they hoped Zelenskyy&#x27;s victory would speed up the implementation of the remaining parts of the EU-Ukraine Association Agreement, including the Deep and Comprehensive Free Trade Area.",
    "published": "1 week ago"
  },
  {
    "title": "Ukraine election: Comedian Zelensky wins presidency by landslide",
    "url": "https://www.bbc.com/news/world-europe-48007487",
    "snippet": "Political novice Volodymyr Zelensky <strong>wins by a landslide</strong> as incumbent Petro Poroshenko admits defeat.",
    "published": "April 22, 2019"
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "Snap elections were held on July 21, and Zelensky himself characterized the contest as “maybe more important than the presidential election.” <strong>Servant of the People won an absolute majority, capturing 254 of 450 seats</strong> (26 seats, representing ...",
    "published": "September 27, 2019"
  },
  {
    "title": "Geography of the Presidential Elections in Ukraine – ERI",
    "url": "https://www.eurasian-research.org/publication/geography-of-the-presidential-elections-in-ukraine/",
    "snippet": "According to the Central Election Commission of Ukraine. Volodymyr Zelensky won the elections by taking <strong>73.22% of the vote</strong> whereas the incumbent president Petro Poroshenko took only 24.45% of the vote.",
    "published": null
  }
]