[
  {
    "title": "Minister for Children, Disability and Equality - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_for_Children,_Equality,_Disability,_Integration_and_Youth",
    "snippet": "Hildegarde Naughton, TD – Minister of State at the Department of Children, Disability and Equality with responsibility for disability. The office was created in 1956 as the Minister for the Gaeltacht. Its title and functions have changed several times, with the current title adopted in 2025. An office of minister of state for children existed from 2005 to 2011.",
    "published": "September 7, 2025"
  },
  {
    "title": "Ministers and government departments",
    "url": "https://www.citizensinformation.ie/en/government-in-ireland/how-government-works/national-government/departments-of-state/",
    "snippet": "You are here: Home &gt; Government in Ireland &gt; How Government works in Ireland &gt; National government &gt; Ministers and government departments ... Each minister of the Government is responsible for running and managing the department they have been allocated. As well as the cabinet minister assigned to the department, The Taoiseach may also appoint junior ministers, or ministers of state, to help run departments. You can view the list of ministers and ministers of state.",
    "published": null
  },
  {
    "title": "Government Ministers",
    "url": "https://www.gov.ie/en/department-of-the-taoiseach/organisation-information/government-ministers/",
    "snippet": "Minister of State at the Department of Children, Disability and Equality with responsibility for Disability: <strong>Emer Higgins</strong>",
    "published": "December 18, 2018"
  },
  {
    "title": "Department of Children, Equality, Disability, Integration and ...",
    "url": "https://www.earlychildhoodireland.ie/wp-content/uploads/2023/08/Explainers_DCEDIY.pdf",
    "snippet": "The Office of the Minister of Children was established in December 2005, allowing the · Minister to attend Cabinet meetings, but this did not change the functions of the role. The · last Minister of State for Children was Barry Andrews.",
    "published": null
  },
  {
    "title": "Minister for Children, Equality, Disability, Integration and Youth - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_for_Children,_Disability,_Equality_and_Integration",
    "snippet": "The Minister for Children, Disability ... in the government of Ireland and leads the Department of Children, Disability and Equality. The current Minister for Children, Disability and Equality is <strong>Norma Foley, TD</strong>. She is assisted by a minister ...",
    "published": "February 8, 2025"
  }
]