[
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "He first came to power after a successful motion of no confidence against former prime minister <strong>Mariano Rajoy</strong>. Since then, Sánchez has led three governments, the most—along with Adolfo Suárez—just behind fellow socialist Felipe González, prime minister from 1982 to 1996.",
    "published": "3 weeks ago"
  },
  {
    "title": "List of prime ministers of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Spain",
    "snippet": "In contemporary Spain, the first prime minister of the Kingdom of Spain since the approval of the Constitution of 1978 was <strong>Adolfo Suárez</strong>. Due to the gradual evolution of the post, the title has been applied to early prime ministers retroactively.",
    "published": "6 days ago"
  },
  {
    "title": "Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pedro_S%C3%A1nchez",
    "snippet": "<strong>Pedro Sánchez Pérez-Castejón</strong> ... as Prime Minister of Spain since 2018. He has also been Secretary-General of the Spanish Socialist Workers&#x27; Party (PSOE) since July 2017, having previously held that office from 2014 to 2016, and has also been serving as the ninth president of the Socialist ...",
    "published": "4 days ago"
  },
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "<strong>Mariano Rajoy</strong> (born March 27, 1955, Santiago de Compostela, Spain) is a Spanish politician who served as prime minister of Spain from 2011 to 2018.",
    "published": "December 6, 2011"
  },
  {
    "title": "La Moncloa. Presidents of the Government of Spain since 1978 [Presidents since 1978]",
    "url": "https://www.lamoncloa.gob.es/lang/en/presidente/presidents/paginas/index.aspx",
    "snippet": "Photo galleries Photo galleries of the President of the Government of Spain ... Government Organisational Structure President, Vice-Presidents and Ministers of the current Government of Spain",
    "published": null
  }
]