[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The McClatchy Company bought Knight Ridder in June 2006 with intentions of selling 12 Knight Ridder newspapers. On August 2, 2006, McClatchy sold the Beacon Journal to Black Press. In 2018, <strong>GateHouse Media</strong> bought the newspaper. On November 11, 2013, the Akron Beacon Journal printed its last ...",
    "published": "6 days ago"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media | Crain's Cleveland Business",
    "url": "https://www.crainscleveland.com/article/20180411/news/157966/akron-beacon-journal-sold-gatehouse-media",
    "snippet": "<strong>Black Press Group Ltd.</strong> sold the newspaper and its website, Ohio.com, to GateHouse for $16 million. The paper, a longtime Knight Ridder property, was sold to Black Press in 2006. GateHouse also owns the Columbus Dispatch, the Canton Repository ...",
    "published": "April 11, 2018"
  },
  {
    "title": "The Akron Beacon Journal (Akron, Ohio) 1903-Current | Library of Congress",
    "url": "https://www.loc.gov/item/sn84028149/",
    "snippet": "Daily 34th year, no. 288 (Nov. 6, 1903)- Republican. Also issued on microfilm from Ohio Historical Society and Microfilming Corp. of America. Subject and personal name index: 1929-1938. 10 v. Weekly ed.: Summit County beacon, 1903-1910. 162nd year, no. 139 (Aug. 31, 2000).",
    "published": null
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "The Pulitzer Prize-winning Akron Beacon Journal and its Ohio.com website are joining the <strong>GateHouse Media</strong> family, which owns The Columbus Dispatch, The Canton Repository, and about 60 other Ohio publications and their websites – all among the ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal Sold to GateHouse Media, Owner of Columbus Dispatch, Canton Repository",
    "url": "https://www.clevescene.com/news/akron-beacon-journal-sold-to-gatehouse-media-owner-of-columbus-dispatch-canton-repository-17221068/",
    "snippet": "The Akron Beacon Journal has been sold to <strong>Gatehouse Media</strong>, the largest publisher of daily newspapers in the United States and the owner of the Columbus Dispatch, the Canton Repository and a preponderance of smaller-town dailies.",
    "published": "June 2, 2025"
  }
]