[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "In 1995, he was appointed Simonyi ... of some scientific field&quot;, and that its first holder should be Richard Dawkins. He held that <strong>professorship from 1995 until 2008.</strong>...",
    "published": "3 days ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and doctorate degrees in zoology in 1966 at the University of Oxford under famed ethologist Nikolaas Tinbergen (who was best known for his work with both instinctive and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins: A Biography | Discovery Institute",
    "url": "https://www.discovery.org/a/10291/",
    "snippet": "The most readily recognizable figure in the Darwin debate, Dawkins retired in 2008 as <strong>Professor for Public Understanding of Science at Oxford University</strong>, a position he held from 1995, by which time he had effectively discontinued his career ...",
    "published": "October 15, 2024"
  },
  {
    "title": "Richard Dawkins facts for kids",
    "url": "https://kids.kiddle.co/Richard_Dawkins",
    "snippet": "From 1967 to 1969, Dawkins was an <strong>assistant professor of zoology at the University of California, Berkeley</strong>. He then returned to the University of Oxford in 1970 as a lecturer. In 1995, he became Oxford&#x27;s first Professor for the Public Understanding ...",
    "published": null
  },
  {
    "title": "Richard Dawkins | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/richarddawkins/",
    "snippet": "One of the most respected scientists ... the catalyst who galvanizes it. From 1995 to 2008 Richard Dawkins was the <strong>Charles Simonyi Professor of the Public Understanding of Science at Oxford University</strong>....",
    "published": "April 21, 2022"
  }
]