[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "100. Six past IAU Presidents in the period 1976–2003 also contributed their recollections in IAU Information Bulletin No.",
    "published": "5 days ago"
  },
  {
    "title": "Executive Leadership Programme — International Association of Universities",
    "url": "https://iau.global/elp",
    "snippet": "Former Rector Gothenburg University and IAU Immediate Past President · Read Bio · Professor of Higher Education, University of Ljubljana, Slovenia, and Fellow at Harvard University, USA · Read Bio · Principal and Vice Chancellor, Queen’s University, Canada · Read Bio · IAU Deputy Secretary General · Read Bio · President and Rector, Central European University, Austria · Read Bio · The first iteration of the IAU Executive Leadership Programme was launched at the IAU 2023 International Conference in Doha, Qatar.",
    "published": null
  },
  {
    "title": "Leadership - IAU",
    "url": "https://www.iau-aiu.net/Leadership",
    "snippet": "Current and Former Programme Facilitators Include: Andrew Deeks, President of Murdoch University, Australia and IAU President Tawana Kupe, Former Vice Chancellor, University of Pretoria, South Africa Fanta Aw, Executive Director and CEO, NAFSA, USA Patrick Deane, Principal and Vice Chancellor, Queen’s University, Canada Paul Tiyambe Zeleza, Senior Advisor for Strategic Initiatives, Howard University, USA, and former Vice Chancellor, United States International University - Africa, Kenya Teri Balser, Immediate past Provost and Vice President, University of Calgary, Canada Jacob Blasius, Executive Director, Global Student Forum, Denmark Manja Klemenčič, Professor of Higher Education, University of Ljubljana, Slovenia Enzo M.",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://www.iau.org/administration/executive_bodies/past_committees/executive_committee/",
    "snippet": "IAU Executive Bodies · Past Committees · Executive Committee · Debra Meloy Elmegreen · Willy Benz · Piero Benvenuti (Interim General Secretary) José Miguel Rodriguez Espinosa · Diana Mary Worrall · Laura Ferrarese Hyesung KANG Daniela Lazzaro Solomon Belay Tessema Ilya G.",
    "published": null
  },
  {
    "title": "First Executive Committee | IAU",
    "url": "https://www.iau.org/about/first_executive_committee/",
    "snippet": "The IAU was the result of a process that started long before World War I to encourage cooperation between astronomers all over the world, at that time primarily led by the American astronomer <strong>George Ellery Hale</strong>.",
    "published": null
  }
]