[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist ... spectroscopy (NMR) and mass spectrometry. She was <strong>previously a professor of chemistry and provost and executive vice chancellor at the University of California, Riverside</strong>....",
    "published": "July 15, 2025"
  },
  {
    "title": "Cynthia K. Larive - Executive Bio, Work History, and Contacts - Equilar ExecAtlas",
    "url": "https://people.equilar.com/bio/person/cynthia-larive-university-of-california-santa-cruz/31451310",
    "snippet": "A su llegada a Santa Cruz en el 2019, Larive inmediatamente dio prioridad a mejorar las tasas de graduación y a la eliminación de deficiencias en graduación de estudiantes de bajos recursos y de primera generación, así como de estudiantes procedentes de grupos tradicionalmente sub-representados en la enseñanza superior.",
    "published": null
  },
  {
    "title": "Provost Cynthia K. Larive | Inside UCR",
    "url": "https://insideucr.ucr.edu/tag/provost-cynthia-k-larive",
    "snippet": "When Cynthia K. Larive <strong>joined UC Riverside as a bioanalytical chemistry professor in 2005</strong>, she had no aspirations of an administrative role. She was happy as a faculty member and busy with a productive lab.",
    "published": null
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Siendo la <strong>undécima rectora de la Universidad de California en Santa Cruz</strong>, Cynthia Larive encabeza una institución mundialmente reconocida por sus investigaciones de alto impacto, en pos de soluciones interdisciplinarias a los mayores retos mundiales, y por su compromiso con la justicia social ...",
    "published": null
  },
  {
    "title": "Meet the New Chancellor - City on a Hill Press",
    "url": "https://cityonahillpress.com/2019/05/23/meet-the-new-chancellor/",
    "snippet": "Cynthia Larive <strong>got her doctorate from UC Riverside in 1992</strong>. This year she will replace George Blumenthal as UCSC chancellor. Photo by Yvonne Gonzalez.When she was 9 years old, Cynthia, or Cindy,",
    "published": "May 23, 2019"
  }
]