[
  {
    "title": "Alexander Van der Bellen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_Van_der_Bellen",
    "snippet": "Despite the far-right Freedom Party winning a plurality, Van der Bellen asked caretaker Chancellor Karl Nehammer of the People&#x27;s Party to form the next government instead, citing other parties&#x27; refusals to join a coalition with the Freedom Party. After the Nehammer-led coalition talks collapsed, however, Van der Bellen reversed course and asked Herbert Kickl to attempt to form a coalition government with the People&#x27;s Party on 5 January 2025.",
    "published": "5 days ago"
  },
  {
    "title": "The Federal President of the Republic of Austria — Austria in USA",
    "url": "https://www.austria.org/the-federal-president",
    "snippet": "Dr. Alexander Van der Bellen was inaugurated as the Federal President of the Republic of Austria on January 26, 2017, and <strong>re-elected in October 2022</strong> for a second six-year term. As a member of the Green Party, he served as Federal Spokesperson ...",
    "published": null
  },
  {
    "title": "Alexander Van der Bellen – POLITICO",
    "url": "https://www.politico.eu/person/alexander-van-der-bellen/",
    "snippet": "Latest news from POLITICO about Alexander Van der Bellen",
    "published": null
  },
  {
    "title": "Alexander Van der Bellen",
    "url": "https://wsa-global.org/person/alexander-van-der-bellen/",
    "snippet": "Alexander Van der Bellen, born 18 January 1944, also referred to by the abbreviation VDB, is the current <strong>president of Austria</strong>.",
    "published": "March 3, 2025"
  },
  {
    "title": "Alexander Van der Bellen Net Worth 2025: Money, Salary, Bio | CelebsMoney",
    "url": "https://www.celebsmoney.com/net-worth/alexander-van-der-bellen/",
    "snippet": "Alexander Van der Bellen (born January 18, 1944) is famous for being world leader. He <strong>resides in Vienna, Austria</strong>. Politician who began serving as the President of Austria in January 2017.",
    "published": "January 31, 2024"
  }
]