[
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "<strong>Milliken will initiate the review as Larive is due for her first one this fall, “but it has not been confirmed yet</strong>,” UC Office of the President spokesperson Stett Holbrook told Lookout via email this week.",
    "published": "August 22, 2025"
  },
  {
    "title": "Office of the Chancellor – The Office of the Chancellor at UC Santa Cruz.",
    "url": "https://chancellor.ucsc.edu/",
    "snippet": "Chancellor Cynthia Larive · <strong>Campus notification procedures for immigration enforcement (SB 98)December 4, 2025</strong> · Announcing Inspiring Change: The Campaign for UC Santa CruzNovember 16, 2025 · Campus Provost and Executive Vice Chancellor recruitment underwayNovember 7, 2025 ·",
    "published": null
  },
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "On August 6th, 2024, UCSC released a report that an investigation conducted by the UC Santa Cruz Police Department found no evidence of mechanical failure on the bus that could have resulted in the December crash and therefore attributed it to driver error. Concerns over the safety of on-campus transportation remain in the student body, exacerbated by incidents such as a loop bus catching on fire while transporting students in November 2023. In April 2022, Student Organizers hosted a rally at Kerr Hall over Chancellor Larive&#x27;s raise of $105,286.",
    "published": "July 15, 2025"
  },
  {
    "title": "Chancellor Larive assumes position as new Board Chair for Monterey Bay Economic Partnership - News",
    "url": "https://news.ucsc.edu/2022/04/chancellor-larive-mbep/",
    "snippet": "“MBEP’s goals — equitable economic development, high-quality educational and health-care systems, and environmental preservation — align with what many of us in this region are working toward,” Chancellor Cynthia Larive said. “Convening local leaders and working together is how we can advance this vision and ensure our communities thrive.” · Campus News · Share on Facebook · Share on LinkedIn · Share on Reddit · Print this Page · Campus News · October 10, 2025 ·",
    "published": "March 18, 2025"
  },
  {
    "title": "UC Santa Cruz chancellor explains decision to have law enforcement clear protesters",
    "url": "https://www.ksbw.com/article/uc-santa-cruz-chancellor-explains-decision-have-law-enforcement-protesters/60963734",
    "snippet": "This is a dangerous precedent and ... vandalism, and intentional harming of our community.&quot;<strong>There will be a continued larger law enforcement presence on campus</strong>, said Larive....",
    "published": "May 31, 2024"
  }
]