[
  {
    "title": "John Elkann - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Elkann",
    "snippet": "Elkann is the chief executive officer of Exor, <strong>the chairman of Stellantis</strong>, general partner of Giovanni Agnelli B.V., and the executive chairman of Ferrari. Additionally, he is the chairman of the Giovanni Agnelli Foundation. He is also a trustee of MOMA, a member of Pinacoteca Giovanni e Marella ...",
    "published": "1 week ago"
  },
  {
    "title": "John Elkann Chairman Executive Director",
    "url": "https://www.stellantis.com/content/dam/stellantis-corporate/group/governance/leadership/bio/eng/John-Elkann.pdf",
    "snippet": "Elkann is a <strong>board member of Meta, and a trustee of MoMA</strong>.",
    "published": null
  },
  {
    "title": "John Elkann - Chairman at Stellantis | The Org",
    "url": "https://theorg.com/org/stellantis/org-chart/john-elkann",
    "snippet": "John Elkann was appointed Executive Director of Stellantis with effect from January 17, 2021 and <strong>Chairman on January 17, 2021</strong>.",
    "published": null
  },
  {
    "title": "Board of Directors | Stellantis",
    "url": "https://www.stellantis.com/en/company/governance/board-of-directors",
    "snippet": "John Elkann was <strong>appointed Chairman of Stellantis on January 17, 2021</strong>. He had previously been Chairman of Fiat S.p.A.",
    "published": null
  },
  {
    "title": "John Elkann",
    "url": "https://www.forbes.com/profile/john-elkann/",
    "snippet": "He oversaw deals including FIAT&#x27;s 2009 acquisition of a stake in Chrysler and its merger with Peugeot in January 2021 to form Stellantis. Exor&#x27;s portfolio includes Italian football team Juventus and media organizations including the Economist and several leading Italian newspapers. The family dynasty began in 1899 when Giovanni Agnelli, John&#x27;s great-great-grandfather, founded FIAT in the northern Italian city of Turin. ... Elkann was born in New York and went to high school in Paris; he reportedly speaks English, French, Italian and Portuguese.",
    "published": null
  }
]