[
  {
    "title": "Omar al-Bashir - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Omar_al-Bashir",
    "snippet": "Omar Hassan Ahmad al-Bashir (born 1 January 1944) is a Sudanese former military officer and politician who served as Sudan&#x27;s head of state under various titles from 1989 until 2019, when he was <strong>deposed in a coup d&#x27;état</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Removal of President Omar al-Bashir and the Continued Pursuit of Justice - United States Holocaust Memorial Museum",
    "url": "https://www.ushmm.org/genocide-prevention/countries/sudan/removal-of-president-omar-al-bashir",
    "snippet": "In <strong>April 2019</strong> he was removed from office, and by August a civilian-military transitional government had formed. Since then, the difficult process of forming a new government has continued.",
    "published": null
  },
  {
    "title": "2019 Sudanese coup d'état - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2019_Sudanese_coup_d'%C3%A9tat",
    "snippet": "A coup d&#x27;état took place in Sudan in the late afternoon on <strong>11 April 2019,</strong> when President Omar al-Bashir was overthrown by the Sudanese Armed Forces after popular protests demanded his departure.",
    "published": "2 weeks ago"
  },
  {
    "title": "Sudan after Omar al-Bashir’s overthrow | The Political Studies ...",
    "url": "https://www.psa.ac.uk/psa/news/sudan-after-omar-al-bashir’s-overthrow",
    "snippet": "This led the people to demand Omar Al-Bashir’s resignation and fresh elections. In February 2019, Bashir declared a state of emergency followed by replacing all of the regional governors with members of the army and security forces loyal to him. Faced with rising discontent and rising civilian deaths Sudan’s military intervened in April removing Omar Al-Bashir from office and placing him and his allies under house arrest.",
    "published": null
  },
  {
    "title": "Sudan’s Bashir in Nigeria | Council on Foreign Relations",
    "url": "https://www.cfr.org/blog/sudans-bashir-nigeria",
    "snippet": "The ICC justices in The Hague also issued a statement reminding Nigeria of its obligation to “honor its warrants” and hand over Bashir. A Sudanese government spokesman was quoted by the New York Times saying that Bashir’s departure had nothing to do with fear of arrest but that “he had matters to attend to in Khartoum.” Reuben Abati, Nigerian president Goodluck Jonathan’s press spokesman, said that Nigeria had not invited Bashir to come.",
    "published": "July 23, 2013"
  }
]