[
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "[zaza patʃʰulia] born Zaur Pachulia; ... professional career in Turkey as a teenager, Pachulia was drafted in the second round of the 2003 NBA draft by the <strong>Orlando Magic</strong>. He played for seven teams in his 16-year ......",
    "published": "November 6, 2025"
  },
  {
    "title": "Zaza Pachulia on what lured him to join Golden State Warriors - Basketball Network",
    "url": "https://www.basketballnetwork.net/latest-news/zaza-pachulia-on-what-lured-him-to-join-the-golden-state-warriors",
    "snippet": "However, the Dubs’ mantra was always “Strength in Numbers,” referring to the small but important roles of the rest of the guys. Sure, <strong>Andre Iguodala</strong> is the first name that pops up, but center Zaza Pachulia actually played a great role ...",
    "published": "April 17, 2025"
  },
  {
    "title": "Zaza Pachulia facts for kids",
    "url": "https://kids.kiddle.co/Zaza_Pachulia",
    "snippet": "He scored 22 points and grabbed 21 rebounds, which was a record for the Bucks team. In 2015, Zaza was traded to the <strong>Dallas Mavericks</strong>. In his first game with them, he scored 10 points and had 10 rebounds.",
    "published": null
  },
  {
    "title": "Zaza Pachulia Stats, Height, Weight, Position, Draft Status and more | Basketball-Reference.com",
    "url": "https://www.basketball-reference.com/players/p/pachuza01.html",
    "snippet": "&gt; Zaza Pachulia · Welcome · Your Account · Logout · Ad-Free Login · Create Account · The most viewed basketball player and team in your state is here! Check it out. Pronunciation: \\Za-Za Pa-CHUL-e-ya\\ Zaur Pachulia · Position: Center ▪ Shoots: Right ·",
    "published": null
  },
  {
    "title": "Zaza Pachulia | Center | Atlanta Hawks",
    "url": "https://www.nba.com/player/2585/zaza-pachulia",
    "snippet": "Follow the action on NBA scores, schedules, stats, news, teams, and players. Buy tickets or watch the games anywhere with NBA League Pass.",
    "published": null
  }
]