[
  {
    "title": "Mediocredito Centrale|Invitalia",
    "url": "https://www.invitalia.it/en/chi-siamo/il-gruppo/mediocredito-centrale",
    "snippet": "Mediocredito Centrale - Banca del Mezzogiorno was <strong>acquired by Invitalia in August 2017</strong> to develop synergies with the offer of incentives to enterprises and to promote growth policies.",
    "published": null
  },
  {
    "title": "Banca del Mezzogiorno – MedioCredito Centrale - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banca_del_Mezzogiorno_–_MedioCredito_Centrale",
    "snippet": "Banca del Mezzogiorno – MedioCredito Centrale (BdM-MCC) is <strong>an Italian bank based in Rome, Lazio region</strong>. The bank is entirely controlled by Invitalia S.p.A., which in turn is owned by the Ministry of Economy.",
    "published": "April 5, 2025"
  },
  {
    "title": "Dati societari - Mediocredito Centrale",
    "url": "https://www.mcc.it/dati-societari/",
    "snippet": "Società con socio unico Società soggetta all’attività di direzione e coordinamento di Invitalia S.p.A. Società iscritta all’Albo delle Banche al n. 74762.60 e <strong>capogruppo del Gruppo Bancario Mediocredito Centrale</strong>, iscritto all’Albo ...",
    "published": "October 3, 2023"
  },
  {
    "title": "Mediocredito Centrale | Conti deposito MCC ONE fino al 3,75% e finanziamenti PMI | Facile.it",
    "url": "https://www.facile.it/banche-finanziarie/mediocredito-centrale.html",
    "snippet": "Mediocredito Centrale, oggi noto anche come Banca del Mezzogiorno – Mediocredito Centrale S.p.A., <strong>è una banca italiana con sede a Roma, interamente controllata da Invitalia S.p.A.</strong>, l’Agenzia nazionale per l’attrazione degli investimenti e lo sviluppo d’impresa.",
    "published": "September 1, 2025"
  },
  {
    "title": "Mediocredito Centrale: le nuove nomine del Consiglio di Amministrazione - Invitalia",
    "url": "https://www.invitalia.it/chi-siamo/area-media/notizie-e-comunicati-stampa/mcc-nuovo-cda",
    "snippet": "L’ Assemblea ordinaria dei soci di Mediocredito Centrale ha nominato i nuovi Consiglieri di Amministrazione e il Presidente.",
    "published": null
  }
]