[
  {
    "title": "Real Madrid firing Alonso would be easy. Replacing him? Much harder - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/47312994/real-madrid-firing-alonso-easy-replacing-much-harder",
    "snippet": "In his match report for Diario AS, Luis Nieto wrote that &quot;it&#x27;s impossible to say how long Xabi Alonso will cling to his position, but the match at Mendizorroza, result aside, won&#x27;t help his chances,&quot; while Marca&#x27;s Juan Ignacio Garcia-Ochoa wrote: &quot;Xabi Alonso is suffering. A lot ... He had a terrible time at Mendizorroza. Alavés equalized, and every minute felt like a death sentence, living with the feeling that his job was slipping away.&quot; In fairness, all the sports media reported that there continues to be a new unity between the embattled coach and one-time rebel Vini Jr., that Alonso has somehow revitalized Rodrygo (with his second goal in two matches).",
    "published": "1 day ago"
  },
  {
    "title": "Inside Real Madrid: Is Xabi Alonso still facing the sack? - The Athletic",
    "url": "https://www.nytimes.com/athletic/6881259/2025/12/11/real-madrid-alonso-sack-news-analysis/",
    "snippet": "The 44-year-old manager is under real pressure at the Santiago Bernabeu, following a terrible run of form",
    "published": "5 days ago"
  },
  {
    "title": "Real Madrid players insist head coach Xabi Alonso has their support after Manchester City defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6880115/2025/12/10/real-madrid-players-xabi-alonso/",
    "snippet": "The Athletic reported that the 25-year-old told the club that he would not sign a new contract at the club while his relationship with the head coach remains so strained. This came after Vinicius Jr reacted angrily after being substituted in the 2-1 El Clasico win over Barcelona on October 26. The Brazilian apologised for his actions on social media after the game, mentioning the fans, his team-mates and club president Florentino Perez, but not Alonso. Madrid return to action on Sunday when they visit Alaves in La Liga.",
    "published": "6 days ago"
  },
  {
    "title": "Xabi Alonso’s Real Madrid future confirmed after Man City defeat - Yahoo Sports",
    "url": "https://sports.yahoo.com/articles/xabi-alonso-real-madrid-future-224000571.html",
    "snippet": "Real Madrid head coach Xabi Alonso will not be sacked owing to the club’s defeat at the hands of Manchester City.As much has been confirmed by multiple sources across Spain late on Wednesday.Marca, ...",
    "published": "6 days ago"
  },
  {
    "title": "8 Potential Replacements for Xabi Alonso as Real Madrid Head Coach",
    "url": "https://bleacherreport.com/articles/25323948-8-potential-replacements-xabi-alonso-real-madrid-head-coach",
    "snippet": "So, let&#x27;s talk about the man at the center of all the drama: manager Xabi Alonso. The club&#x27;s former midfield maestro took charge on June 1, succeeding the most decorated coach in Madrid&#x27;s illustrious history, Carlo Ancelotti.",
    "published": null
  }
]