[
  {
    "title": "Mikel Arteta appointed Arsenal head coach | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11670/11888052/mikel-arteta-appointed-arsenal-head-coach",
    "snippet": "<strong>Arsenal have appointed Mikel Arteta as their new head coach on a three-and-a-half-year deal</strong>. Arteta leaves his role as Manchester City assistant manager and replaces Freddie Ljungberg, who took over as interim head coach following Unai Emery&#x27;s ...",
    "published": "December 21, 2019"
  },
  {
    "title": "Mikel Arteta joining as our new head coach | Club announcement | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/mikel-arteta-joining-our-new-head-coach",
    "snippet": "We&#x27;re delighted to announce <strong>Mikel Arteta is joining the club as our head coach on Sunday</strong>. Mikel, a former club captain, played for us for five seasons from 2011 to 2016 and has signed a three-and-a-half year contract.",
    "published": null
  },
  {
    "title": "Mikel Arteta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikel_Arteta",
    "snippet": "After leading the Gunners to wins in all five of their Premier League matches of August, <strong>Mikel Arteta was named Premier League Manager of the Month</strong>, winning the award for the third time following his previous successes in September 2021 and March 2022. On 16 October 2022, Arteta&#x27;s side beat ...",
    "published": "9 hours ago"
  },
  {
    "title": "Mikel Arteta: Arsenal boss has transformed Arsenal five years on from his appointment but what's next? | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/story-telling/11095/13276017/mikel-arteta-arsenal-boss-has-transformed-arsenal-five-years-on-from-his-appointment-but-whats-next",
    "snippet": "This <strong>Friday, December 20,</strong> marks the fifth anniversary of Mikel Arteta&#x27;s appointment as Arsenal manager, when the former midfielder arrived at the Emirates Stadium vowing to turn the club into major contenders again.",
    "published": null
  },
  {
    "title": "Arsenal Appoint Mikel Arteta as Manager on Contract Until 2023",
    "url": "https://bleacherreport.com/articles/2867212-arsenal-appoint-mikel-arteta-as-manager-on-contract-until-2023",
    "snippet": "(Photo by Robin Jones/Getty Images)Robin Jones/Getty Images ... <strong>Arsenal on Friday appointed former midfielder Mikel Arteta as manager on a contract that will keep him at the cub until the summer of 2023</strong>.",
    "published": null
  }
]