[
  {
    "title": "Embassy Pictures - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Embassy_Pictures",
    "snippet": "In 1985, Embassy was sold to The Coca-Cola Company, who sold the studio to Dino De Laurentiis in October of that same year. Today, StudioCanal owns ancillary rights to the majority of Embassy&#x27;s theatrical library, while <strong>Sony Pictures Television</strong> owns worldwide television syndication rights to ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "<strong>Regency Enterprises, Inc.</strong> is a multinational entertainment company formed by Arnon Milchan. It was founded on July 12, 1991 as the successor to Regency International Pictures (formerly known as Embassy International Pictures N.V.). It has offices in West Hollywood, California, London, and ...",
    "published": "4 days ago"
  },
  {
    "title": "Embassy Films Associates - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Embassy_Films_Associates",
    "snippet": "In January 1982, when TV producers Norman Lear and Jerry Perenchio acquired Avco Embassy Television and dropped &quot;Avco&quot; from its name, the film division followed suit, reverting to the previous Embassy Pictures name. In 1984, the film division was renamed Embassy Film Associates. Lord Lew Grade (who had just stepped down as head of ITC Entertainment) was brought in to run the international unit, until Lear and Perenchio sold Embassy to The Coca-Cola Company on June 18, 1985. In late 1985, Coca-Cola sold the Embassy Pictures division to Dino de Laurentiis, who folded Embassy Films Associates into his own De Laurentiis Entertainment Group the next year.",
    "published": "1 month ago"
  },
  {
    "title": "Regency Enterprises | Corus Entertainment Fandom | Fandom",
    "url": "https://corusentertainment.fandom.com/wiki/Regency_Enterprises",
    "snippet": "<strong>Arnon Milchan</strong> founded his company as Embassy International Pictures N.V. which held the name for 7 years until the named changed to Regency International Pictures. This company originally had no distribution deal producing films with various ...",
    "published": "October 29, 2024"
  },
  {
    "title": "Regency Enterprises | Chace! Dream Company Wiki | Fandom",
    "url": "https://chace-dream-company.fandom.com/wiki/Regency_Enterprises",
    "snippet": "<strong>Arnon Milchan</strong> founded his company as Embassy International Pictures N.V., which held the name for 7 years until it was changed to Regency International Pictures.",
    "published": null
  }
]