[
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "At the urging of Prime Minister ... to &quot;support a smooth exit&quot; from the EU, and to a further two months for an orderly transition to his successor, <strong>Andrew Bailey</strong>....",
    "published": "6 hours ago"
  },
  {
    "title": "Mark Carney: An experienced and pragmatic economist to succeed Trudeau (and take on Trump) | International | EL PAÍS English",
    "url": "https://english.elpais.com/international/2025-03-11/an-experienced-and-pragmatic-economist-to-succeed-trudeau-and-take-on-trump.html",
    "snippet": "The change at the head of the Liberal Party, staged this Sunday with a vote in which the economist and former governor of two central banks, Mark Carney, <strong>obtained 89.6% of support to succeed Prime Minister Justin Trudeau</strong>, was another great symbol. Once the succession was confirmed, Carney, ...",
    "published": "March 11, 2025"
  },
  {
    "title": "Succession de Justin Trudeau | Mark Carney se lance dans la course à la direction du PLC | La Presse",
    "url": "https://www.lapresse.ca/actualites/politique/2025-01-16/succession-de-justin-trudeau/mark-carney-se-lance-dans-la-course-a-la-direction-du-plc.php",
    "snippet": "Après des années de flirt avec la politique fédérale et le gouvernement de Justin Trudeau, <strong>Mark Carney se lance finalement dans la course à la direction du Parti libéral du Canada</strong>.",
    "published": "January 16, 2025"
  },
  {
    "title": "Carney names ex-Blackrock executive Mark Wiseman as new US ambassador",
    "url": "https://www.bbc.com/news/articles/ceq1z9llng8o",
    "snippet": "Canada&#x27;s prime minister, Mark Carney, has appointed financier and former BlackRock executive <strong>Mark Wiseman</strong> as Canada&#x27;s ambassador to the US, ahead of major trade talks with the Trump administration.",
    "published": "5 hours ago"
  },
  {
    "title": "I quit Mark Carney’s cabinet. This is what I hope happens next",
    "url": "https://www.thestar.com/opinion/contributors/i-quit-mark-carneys-cabinet-this-is-what-i-hope-happens-next/article_9d6ae260-89ed-48ca-854b-7aace652a5ee.html",
    "snippet": "<strong>Steven Guilbeault</strong> is the Liberal member of Parliament for Laurier–Sainte-Marie. He previously served as the minister of Canadian identity and culture under Mark Carney.",
    "published": "2 weeks ago"
  }
]