[
  {
    "title": "Governor Brian P. Kemp Office of the Governor",
    "url": "https://gov.georgia.gov/",
    "snippet": "Governor <strong>Brian P.</strong>",
    "published": null
  },
  {
    "title": "2026 Georgia gubernatorial election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2026_Georgia_gubernatorial_election",
    "snippet": "Republicans also control both the state senate and house of representatives, together with Kemp&#x27;s governorship establishing a government trifecta, alongside complete Republican pick on the state&#x27;s supreme court. A year prior to the elections, the 2025 Georgia Public Service Commission special ...",
    "published": "5 days ago"
  },
  {
    "title": "Governor of Georgia - Ballotpedia",
    "url": "https://ballotpedia.org/Governor_of_Georgia",
    "snippet": "Georgia has a Republican triplex. The Republican Party controls the offices of governor, secretary of state, and attorney general. See also: Georgia State Legislature, Georgia House of Representatives, Georgia State Senate ... The current Governor of Georgia is <strong>Brian Kemp (R).</strong>",
    "published": null
  },
  {
    "title": "Brian Kemp - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Brian_Kemp",
    "snippet": "There was speculation that he would run in the 2026 United States Senate election in Georgia to challenge incumbent senator Jon Ossoff; in May 2025, he declined to run and endorsed Derek Dooley. Kemp was inaugurated as governor in a public ceremony in Atlanta on January 14, 2019.",
    "published": "1 week ago"
  },
  {
    "title": "Bookman: Democrats have a chance to flip governor's seat in Georgia, with the right candidate • Georgia Recorder",
    "url": "https://georgiarecorder.com/2025/10/28/bookman-democrats-have-a-chance-to-flip-governors-seat-in-georgia-with-the-right-candidate/",
    "snippet": "With Gov. <strong>Brian Kemp</strong> term-limited and unable to run again, the governor&#x27;s office will be up for grabs next year. Photo by John McCosh/Georgia Recorder",
    "published": "October 28, 2025"
  }
]