[
  {
    "title": "Office of the Chancellor – The Office of the Chancellor at UC Santa Cruz.",
    "url": "https://chancellor.ucsc.edu/",
    "snippet": "Chancellor Cynthia Larive · <strong>Campus notification procedures for immigration enforcement (SB 98)December 4, 2025</strong> · Announcing Inspiring Change: The Campaign for UC Santa CruzNovember 16, 2025 · Campus Provost and Executive Vice Chancellor recruitment underwayNovember 7, 2025 ·",
    "published": null
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Under Chancellor Larive’s leadership, <strong>UC Santa Cruz has cemented its place as preeminent research university, with research support now surpassing $200 million annually. She advanced regional economic development by establishing the Innovation and Business Engagement Hub to connect industry with the campus innovation ecosystem</strong>...",
    "published": null
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "<strong>UC Santa Cruz Chancellor Cynthia Larive is set to undergo an overdue five-year performance review</strong>, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  },
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "On August 6th, 2024, UCSC released a report that an investigation conducted by the UC Santa Cruz Police Department found no evidence of mechanical failure on the bus that could have resulted in the December crash and therefore attributed it to driver error. Concerns over the safety of on-campus transportation remain in the student body, exacerbated by incidents such as a loop bus catching on fire while transporting students in November 2023. In April 2022, Student Organizers hosted a rally at Kerr Hall over Chancellor Larive&#x27;s raise of $105,286.",
    "published": "July 15, 2025"
  },
  {
    "title": "Inspiring Change: UC Santa Cruz launches $750M campaign - News",
    "url": "https://news.ucsc.edu/2025/11/inspiring-change-uc-santa-cruz-launches-750m-campaign/",
    "snippet": "“Since our founding, UC Santa Cruz has pursued solutions that benefit society, whether it’s increasing our resilience in the face of climate change, advancing health solutions, or sharing the untold stories of communities, locally and globally,” Chancellor Cynthia Larive said.",
    "published": "November 16, 2025"
  }
]