[
  {
    "title": "2018-19 Pistons Profile: Zaza Pachulia | Detroit Pistons",
    "url": "https://www.nba.com/pistons/features/2018-19-pistons-profile-zaza-pachulia",
    "snippet": "After failing to make the playoffs last season, Pistons owner Tom Gores made the call to change course. Ed Stefanski was hired to run the front office and his first big move was to hire Dwane Casey, reigning NBA Coach of the Year. The roster is set, a new coaching staff and front office is ...",
    "published": "September 29, 2021"
  },
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "On <strong>July 15, 2018,</strong> Pachulia signed with the Detroit Pistons. On August 29, 2019, Pachulia retired from playing and re-joined the Warriors as a front office consultant in their basketball operations department. He won his third NBA championship after the Warriors defeated the Boston Celtics in ...",
    "published": "November 6, 2025"
  },
  {
    "title": "Zaza Pachulia Biography - ESPN",
    "url": "https://www.espn.com/nba/player/bio/_/id/2016/zaza-pachulia",
    "snippet": "Detroit Pistons2018-2019 (1 Season) Golden State Warriors2016-2018 (2 Seasons) Dallas Mavericks2015-2016 (1 Season) Milwaukee Bucks2004-2005, 2013-2015 (3 Seasons) Atlanta Hawks2005-2013 (8 Seasons) Orlando Magic2003-2004 (1 Season) The life of Zaza · 5:10 · Zaza Pachulia joins SportsCenter ·",
    "published": null
  },
  {
    "title": "How Zaza Pachulia has been 'invaluable' for Detroit Pistons",
    "url": "https://www.freep.com/story/sports/nba/pistons/2019/03/19/detroit-pistons-zaza-pachulia/3214701002/",
    "snippet": "&quot;Obviously, from the coaching staff and my teammates and the organization, we&#x27;re not quite where we want to be. To be a part of this building process is great. I can definitely be helpful and that&#x27;s what I&#x27;ve been doing as a role player.&quot; Pachulia, 35, realized the Warriors wouldn&#x27;t re-sign him after he made just seven cameo appearances in last year&#x27;s playoffs. The new Pistons regime, led by senior advisor Ed Stefanski and head coach Dwane Casey, valued Pachulia as a veteran leader who could facilitate their efforts to turn the franchise around.",
    "published": "March 19, 2019"
  },
  {
    "title": "Zaza Pachulia - Detroit Pistons Center - ESPN",
    "url": "https://www.espn.com/nba/player/_/id/2016/zaza-pachulia",
    "snippet": "OnScene: Zaza Pachulia receives Order of Honor from Georgian president · 6Y · ESPN.com · Warriors promote Dunleavy, add Pachulia · 6Y · Pachulia fined $25K for verbally abusing official · 7Y · How much do you know about the NBA&#x27;s 2003 draft class? 7Y · Reports: Pistons get deal with center Pachulia ·",
    "published": null
  }
]