[
  {
    "title": "David Hurley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley",
    "snippet": "General David John Hurley (born 26 August 1953) is an <strong>Australian former politician and military officer</strong>. A senior officer in the Australian Army, he served as the 27th governor-general of Australia from 2019 to 2024. He was previously the 38th governor of New South Wales from 2014 to 2019.",
    "published": "October 31, 2025"
  },
  {
    "title": "Biography - The Honourable David Hurley AC CVO DSC | Governor-General of the Commonwealth of Australia",
    "url": "https://www.gg.gov.au/biography-honourable-david-hurley-ac-cvo-dsc",
    "snippet": "David Hurley was <strong>born in Wollongong, New South Wales on 26 August 1953, the son of Norma and James Hurley</strong>. His father was an Illawarra steelworker and his mother worked in a grocery store. He grew up in Port Kembla and attended Port Kembla High School where he completed his Higher School ...",
    "published": null
  },
  {
    "title": "David Hurley - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/David_Hurley",
    "snippet": "David John Hurley AC DSC (born 26 August 1953) is an <strong>Australian former army officer</strong>. Hurley was the 27th Governor-General of Australia from 2019 to 2024. He was the Governor of New South Wales from 2014 to 2019. He had a 42-year long career in the Australian Army.",
    "published": "May 3, 2025"
  },
  {
    "title": "David Hurley (singer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley_(singer)",
    "snippet": "David Hurley (born August 1962) is a <strong>British countertenor who sang with The King&#x27;s Singers from 1990 to 2016.</strong> Hurley was a chorister at Winchester Cathedral, and a choral scholar at Winchester College and New College, Oxford.",
    "published": "April 25, 2025"
  },
  {
    "title": "David Hurley facts for kids",
    "url": "https://kids.kiddle.co/David_Hurley",
    "snippet": "He was then chosen by Queen Elizabeth II to be the Governor-General. He started this role in July 2019 and finished in July 2024. Sam Mostyn took over from him. ... David John Hurley was <strong>born on 26 August 1953</strong>.",
    "published": null
  }
]