[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "In the 2022 Italian general election, the PD-led coalition achieved similar results to 2018 and returned to the opposition. However, the PD consolidated as one of the two major political parties in Italy during the 2020s along with the Brothers of Italy. Prominent Democrats include former leaders Walter Veltroni, Dario Franceschini, Nicola Zingaretti and Enrico Letta.",
    "published": "1 day ago"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "The party was founded in 2007 as a result of the convergence of <strong>the Democrats of the Left (direct heirs of the Italian Communist Party) and the Margherita (heir to part of Christian Democracy).</strong>",
    "published": null
  },
  {
    "title": "Political cheat sheet: What to know about Italy's Democratic Party",
    "url": "https://www.thelocal.it/20170904/what-is-italys-ruling-democratic-party-politics-ideology",
    "snippet": "PD was formed in its aftermath ... and 2018, headed by three different prime ministers from the party; <strong>Enrico Letta, Matteo Renzi, and Paolo Gentiloni</strong>....",
    "published": "September 8, 2022"
  },
  {
    "title": "Democratic Party | political party, Italy | Britannica",
    "url": "https://www.britannica.com/topic/Democratic-Party-political-party-Italy",
    "snippet": "…party, known simply as the Democratic Party (Partito Democratico), emerged when the DS merged with the centrist Daisy (Margherita) party. Soon afterward the FI joined with the AN to create the new center-right People of Freedom (Popolo della Libertà; PdL) party.",
    "published": null
  },
  {
    "title": "The Democrats (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Democrats_(Italy)",
    "snippet": "The party was launched in 1999 by <strong>Romano Prodi</strong>, a few months after his dismissal as Prime Minister and leader of The Olive Tree coalition. Three parties merged into The Democrats: the Democratic ...",
    "published": "October 26, 2024"
  }
]