[
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "In April 2023, amid widespread layoffs at Disney and ABC affecting FiveThirtyEight, Silver announced that his contract with ABC would not be extended. After Silver&#x27;s departure in May, a smaller FiveThirtyEight continued to operate under the data analytics division of ABC News, until being shut down in March 2025.",
    "published": "1 day ago"
  },
  {
    "title": "FiveThirtyEight 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/224397-82",
    "snippet": "FiveThirtyEight is a <strong>Private company</strong>.",
    "published": null
  },
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to <strong>ABC News</strong> pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight. On March 5, 2025, 538 was shut down by <strong>ABC News</strong> and its staff were laid off.",
    "published": "1 month ago"
  },
  {
    "title": "Daring Fireball: ABC Shuts Down FiveThirtyEight, and Pulls the Plug on Its Website",
    "url": "https://daringfireball.net/2025/03/abc_shuts_down_fivethirtyeight",
    "snippet": "I’m told he appeared to be reading from a script as he delivered the devastating news. He offered no explanation for why the Disney-owned network had decided to shutter FiveThirtyEight, which it acquired in 2018 along with data whiz and then-editor Nate Silver.",
    "published": null
  },
  {
    "title": "FiveThirtyEight joins ABC News - ABC News",
    "url": "https://abcnews.go.com/US/fivethirtyeight-joins-abc-news/story?id=54531745",
    "snippet": "<strong>ABC News</strong> announced today it has reached an agreement in principle to acquire the renowned data journalism organization FiveThirtyEight from ESPN.",
    "published": "April 17, 2018"
  }
]