[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "Newsmax, Inc. (or Newsmax.com, previously styled NewsMax) is an American cable news, political opinion commentary, and digital media company founded by <strong>Christopher Ruddy</strong> in 1998. It has been variously described as conservative, right-wing, and far-right.",
    "published": "1 week ago"
  },
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "In January 2010, Britain&#x27;s Daily Telegraph ranked Ruddy as one of the &quot;100 Most Influential Conservatives&quot; in the U.S. The paper said: &quot;<strong>Chris Ruddy</strong> is an increasingly powerful and influential player in the conservative media and beyond.&quot; Ruddy has been both a &quot;Patron&quot; and a &quot;Sustaining Donor&quot; ...",
    "published": "5 days ago"
  },
  {
    "title": "Christopher Ruddy | Long Island University",
    "url": "https://liu.edu/roosevelt/~/link.aspx?_id=CBEEEDD71542408AA2E0F8E91B527511&_z=z",
    "snippet": "Ruddy founded Newsmax in 1998 to publish online and offline content in the fields of news, politics, health and finance. Newsmax.com ranks consistently as one of the country&#x27;s most trafficked news websites. Newsmax TV, a cable and over-the-top media service news channel started in 2014, is carried in more than 70 million U.S.",
    "published": null
  },
  {
    "title": "Chris Ruddy - EarthX",
    "url": "https://earthx.org/speaker/chris-ruddy/",
    "snippet": "<strong>Christopher Ruddy</strong> founded Newsmax Media, Inc. in 1998 and serves as its CEO. Newsmax today is one of the nation’s leading broadcasting and digital media companies. The Company includes the Newsmax network, the 4th highestrated cable news channel ...",
    "published": "September 25, 2025"
  },
  {
    "title": "Newsmax stock surges after its IPO | CNN Business",
    "url": "https://www.cnn.com/2025/04/01/media/newsmax-stock-surges-after-ipo",
    "snippet": "Anchors said things like “we want you to be a co-owner” and Newsmax wants you to join us in keeping America safe and strong.” Ruddy sometimes appeared on air for the ads. He recognized a pure-play TV brand would not normally generate Wall Street excitement, so he touted Newsmax’s streaming ventures and podcasts. And he likened his IPO plans to Trump’s media company stock.",
    "published": "April 1, 2025"
  }
]