[
  {
    "title": "Health Minister announces first decision to provide psychological counseling to injured in Gen Z protests",
    "url": "https://english.nepalnews.com/s/health/health-minister-announces-first-decision-to-provide-psychological-counseling-to-injured-in-gen-z-protests/",
    "snippet": "Sudha Sharma Gautam has officially assumed her duties. Upon taking office, she announced her first decision: <strong>providing psychological counseling services to those injured during the Gen Z demonstration</strong>.",
    "published": null
  },
  {
    "title": "Sudha Sharma Gautam - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudha_Sharma_Gautam",
    "snippet": "Dr. Sudha Sharma Gautam (Nepali: डा. सुधा शर्मा गौतम) is a Nepalese politician and senior obstetrician-gynecologist who has <strong>served as a minister of health and population in the Sushila Karki led interim Government since 26 October 2025</strong>.",
    "published": "November 11, 2025"
  },
  {
    "title": "Prime Minister Karki inducts two new ministers",
    "url": "https://kathmandupost.com/national/2025/10/26/prime-minister-karki-inducts-two-new-ministers",
    "snippet": "<strong>Sudha Sharma Gautam takes charge of health and population</strong>, while Bablu Gupta is appointed minister for youth and sports.",
    "published": null
  },
  {
    "title": "New Health Minister Dr. Sudha Sharma prioritizes mental health, pledges transparency - The Himalayan Times - Nepal's No.1 English Daily Newspaper | Nepal News, Latest Politics, Business, World, Sports, Entertainment, Travel, Life Style News",
    "url": "https://thehimalayantimes.com/kathmandu/new-health-minister-dr-sudha-sharma-prioritizes-mental-health-pledges-transparency",
    "snippet": "The newly appointed Minister for Health and Population, Dr. Sudha Sharma, <strong>assumed office on Sunday</strong>.",
    "published": "October 26, 2025"
  },
  {
    "title": "Sudha Sharma Gautam - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q136650529",
    "snippet": "<strong>Nepalese Minister of Health and Population Since 2025</strong>",
    "published": null
  }
]