[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Marcia Carolyn Kaptur (/ˈkæptər/ KAP-tər; born June 17, 1946) is an American politician serving as the U.S. representative for Ohio&#x27;s 9th congressional district since 1983. A member of the Democratic Party, Kaptur is the longest-serving woman in congressional history and the dean of Ohio&#x27;s congressional delegation since 2009 when Representative Ralph Regula retired.",
    "published": "1 week ago"
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "In Washington, Kaptur fought vigorously to win a seat on the House Appropriations Committee. Today she serves as the first woman to serve as Ranking Member of the influential House Appropriations Subcommittee on Energy and Water Development, which she considers an honor given the Ninth District stretches much of the southern Lake Erie coastline. Congresswoman Kaptur is widely credited with bringing back federal dollars to partner with local communities on crucial transportation and infrastructure projects:",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Kaptur was born in Toledo, Ohio, ... with the Toledo-Lucas County Plan Commissions from 1969 to 1975 before becoming <strong>director of planning at the National Center for Urban Ethnic Affairs</strong> from 1975 to 1977....",
    "published": null
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "Marcy Kaptur, the Representative from Ohio - in Congress from 1983 through Present",
    "published": null
  },
  {
    "title": "Marcy Kaptur: Homepage",
    "url": "https://marcykaptur.com/",
    "snippet": "JavaScript is disabled in your browser · Please enable JavaScript to proceed · A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser",
    "published": null
  }
]