[
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "Prabowo Subianto is a <strong>former Indonesian army general and businessman, born on October 17, 1951, in Jakarta</strong>.",
    "published": "December 9, 2024"
  },
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "Prabowo Subianto Djojohadikusumo (born 17 October 1951) is an <strong>Indonesian politician, businessman, and retired military officer who has served as the eighth president of Indonesia since 2024</strong>. He previously served as the 26th minister of defense under President Joko Widodo from 2019 to 2024.",
    "published": "1 day ago"
  },
  {
    "title": "Official Campaign Web Site - Prabowo Subianto | Library of Congress",
    "url": "https://www.loc.gov/item/lcwaN0009998/",
    "snippet": "&quot;Prabowo Subianto Djojohadikusumo or publicly known as Prabowo Subianto (born 17 October 1951) is an <strong>Indonesian businessman, politician and former Lieutenant General in the Indonesian National Armed Forces</strong>.",
    "published": null
  },
  {
    "title": "Candidate profile: Prabowo Subianto - Runners and Riders - The Jakarta Post",
    "url": "https://www.thejakartapost.com/indonesia/2023/11/24/candidate-profile-prabowo-subianto.html",
    "snippet": "Prabowo Subianto Djojohadikusumo, 72, is a <strong>retired Army lieutenant general, a businessman and the incumbent Defense Minister (2019-present).</strong> Due to his proximity to power throughout his military career, he entered politics in 2004 to pursue his dream of becoming the nations president.",
    "published": null
  },
  {
    "title": "Life and Political Career of the Indonesian President, Prabowo Subianto",
    "url": "https://thediplomaticinsight.com/life-political-career-of-indonesian-pres-prabowo/",
    "snippet": "<strong>A former general and seasoned politician</strong>, Prabowo Subianto Djojohadikusumo became Indonesia’s 8th President in 2024, marking the culmination of a long career spanning the military, business, and politics.",
    "published": "2 weeks ago"
  }
]