[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "He is an emeritus fellow of New College, Oxford. <strong>In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008</strong>, and is on the advisory board of the University of Austin. Dawkins has won several academic and writing awards, among them ...",
    "published": "3 days ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and ... behaviour), Richard Dawkins <strong>assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley</strong>....",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins: A Biography | Discovery Institute",
    "url": "https://www.discovery.org/a/10291/",
    "snippet": "The most readily recognizable figure in the Darwin debate, Dawkins <strong>retired in 2008 as Professor for Public Understanding of Science at Oxford University, a position he held from 1995</strong>, by which time he had effectively discontinued his career ...",
    "published": "October 15, 2024"
  },
  {
    "title": "Professor Richard Dawkins FRS",
    "url": "https://royalsociety.org/people/richard-dawkins-11316/",
    "snippet": "Richard is a prominent scientist, having published bestselling books on genetics and evolution, including <strong>The Selfish Gene (1976), The Blind Watchmaker (1986)</strong> — with the latter winning a number of awards.",
    "published": null
  },
  {
    "title": "Richard Dawkins Biography - Facts, Childhood, Family Life & Achievements",
    "url": "https://www.thefamouspeople.com/profiles/clinton-richard-dawkins-2646.php",
    "snippet": "<strong>In 1990 he assumed the post of a reader in zoology at the University of Oxford</strong>. He was appointed Simonyi Professor for the Public Understanding of Science at Oxford in 1995—a position that had been endowed by Charles Simonyi with the specific ...",
    "published": null
  }
]