[
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "She earned her Ph.D. <strong>in analytical chemistry</strong> from UC Riverside while raising her daughters, Erin and Megan, with her husband, Jim. Siendo la undécima rectora de la Universidad de California en Santa Cruz, Cynthia Larive encabeza una institución mundialmente reconocida por sus investigaciones ...",
    "published": null
  },
  {
    "title": "UC Riverside Provost Cynthia K. Larive to become UC Santa Cruz’s 11th chancellor | University of California",
    "url": "https://www.universityofcalifornia.edu/press-room/uc-riverside-provost-cynthia-k-larive-become-uc-santa-cruzs-11th-chancellor",
    "snippet": "Larive has been instrumental in raising the stature of the university, including the <strong>recruitment of the first two Nobel Laureates to UC Riverside</strong>, promoting faculty success, and strengthening the administration’s collaboration with the Academic ...",
    "published": "November 8, 2021"
  },
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Larive received her Bachelor of Science from South Dakota State University in 1980, and her Master of Science degree from Purdue University in 1982. In 1992, she was <strong>awarded a Ph.D. in chemistry</strong> from the University of California, Riverside after working under the direction of Dallas L.",
    "published": "July 15, 2025"
  },
  {
    "title": "Cynthia Larive to become 11th chancellor of UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2019/05/chancellor-designate/",
    "snippet": "During this time, the campus closed ... Larive boosted UC Riverside’s progress toward <strong>enrolling one California community college transfer student for every two resident freshmen</strong>....",
    "published": "May 13, 2025"
  },
  {
    "title": "Cynthia Larive - Chancellor - Univerisity of California Santa Cruz | LinkedIn",
    "url": "https://www.linkedin.com/in/cynthia-larive-83218a8",
    "snippet": "Doctoral Scholar at UC Santa Cruz · Santa Cruz, CA · Nursing Student at the University of Portland · San Francisco Bay Area · Platform Engineer at Supplyframe · San Francisco Bay Area Show more profiles · Show fewer profiles · Serveuse chez Restaurant la boucherie la Réunion · Greater Mulhouse Area · Professor at University of California, Riverside · Riverside, CA · 2 others named Cynthia Larive are on LinkedIn See others named Cynthia Larive ·",
    "published": null
  }
]