[
  {
    "title": "Olympic legend unveils romance to Lionel Richie’s ex-wife whose divorce cost singer £15m",
    "url": "https://www.gbnews.com/sport/olympics/olympic-legend-unveils-romance-lionel-richies-ex-wife",
    "snippet": "<strong>The pair are now understood to remain friends</strong>. The couple were introduced through mutual friends and have been seeing each other for several months, according to reports. Sebastian Coe claimed 1500m gold at both the 1980 Moscow and 1984 Los ...",
    "published": "1 week ago"
  },
  {
    "title": "Back on track after break-up, Seb Coe and his glamorous Los Angeles fiancee - as 68-year-old Olympian is set to wed for the third time | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/news/article-14878961/Back-track-break-Seb-Coe-glamorous-Los-Angeles-fiancee-68-year-old-Olympian-set-wed-time.html",
    "snippet": "The 68-year-old Olympian has &#x27;<strong>quietly reunited</strong>&#x27; with glamorous Los Angeles PR woman Sarah Robarts and the pair are &#x27;happier than ever&#x27; and planning their future.",
    "published": "July 6, 2025"
  },
  {
    "title": "Sarah Robarts Wiki, Biography, Age, Spouse, Net Worth, Fast Facts Wikibious",
    "url": "https://wikibious.com/sarah-robarts/",
    "snippet": "However, the 65-year-old two-time Olympic gold medalist is in the groove again in his love life as he parades his new girlfriend. Coe is <strong>happily married</strong> to Sarah Robarts, a 52-year-old advertising chief from Los Angeles.",
    "published": "May 19, 2023"
  },
  {
    "title": "Meet Sarah Robarts, La PR Boss and Sebastian Coe New Girlfriend - 44Bars.com",
    "url": "https://44bars.com/meet-sarah-robarts-la-pr-boss-and-sebastian-coe-new-girlfriend/",
    "snippet": "However, the 65-year-old double Olympic gold medalist is back on track in his love life as he flaunts his new lover. Coe is <strong>happily married</strong> to Sarah Robarts, a 52-year-old public relations executive in Los Angeles.",
    "published": "March 14, 2022"
  },
  {
    "title": "World Athletics | Matrimonial news – Marriage of Lord Coe; First child for Freeman | News",
    "url": "https://worldathletics.org/news/iaaf-news/matrimonial-news-marriage-of-lord-coe-first",
    "snippet": "IAAF Vice-President Lord Sebastian Coe, the Chairman of the Organising Committee for Games of the XXX Olympiad, London 2012, <strong>wed Carole Annett in Surrey, England on 2 July 2011.</strong> This is the second marriage for the father of four, a two-time ...",
    "published": null
  }
]