[
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "With more than 99% of polling stations counted, Kast took 58.16% of the vote, against 41.84% for the leftist Jeannette Jara, a former labour minister under the current president, Gabriel Boric. The son of a Nazi party member, an admirer of the dictator Augusto Pinochet and a staunch Catholic known for opposing abortion and same-sex marriage, Kast built his campaign on a promise to expel tens of thousands of undocumented migrants. ‘We need an iron fist’: the Trump-inspired favourite to win Chile’s election",
    "published": "6 hours ago"
  },
  {
    "title": "President of Chile - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Chile",
    "snippet": "The president&#x27;s official seat is the La Moneda Palace in the capital Santiago. Michelle Bachelet was the first female president of Chile and served twice, from 2006 to 2010 and again from 2014 to 2018. <strong>Gabriel Boric</strong> is the current president, having won the 2021 Chilean general election and ...",
    "published": "5 hours ago"
  },
  {
    "title": "Kast’s Victory in Chile Is Another Win for Global Right-Wing Movement - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/americas/chile-kast-right-wing-movement.html",
    "snippet": "<strong>José Antonio Kast</strong>, who was elected president on Sunday, is the latest conservative to rise to power promising strict law and order measures.",
    "published": "13 hours ago"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "Pinochet was an army general who ... disappearances and free-market economic policies. ... Chile&#x27;s current left-wing President <strong>Gabriel Boric</strong>, who could not run again, had suffered from low approval ratings....",
    "published": "1 day ago"
  },
  {
    "title": "Chile’s new far-right head is latest Latin American leader to ride hardline wave to power | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-chile-election-analysis",
    "snippet": "Two of his flagship promises were directly inspired by the policies of Donald Trump: the expulsion of about 330,000 undocumented migrants – most of them Venezuelan – and the construction of detention centres and 5-metre-high walls, electric fences, 3-metre-deep trenches and an increased military presence along the border. Analysts view his victory as part of swing between the left and the right that has characterised national politics over the past 15 years – but Kast is the most far-right leader Chile has elected a president since the end of the military dictatorship in 1990.",
    "published": "16 hours ago"
  }
]