[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "In 2009–10 Earps was promoted to <strong>Leicester City</strong>&#x27;s first team squad from the centre of excellence, to provide competition for regular goalkeeper Leanne Hall. The following season Earps signed for Nottingham Forest. She was an unused substitute in Forest&#x27;s penalty shootout defeat by Barnet ...",
    "published": "4 days ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "Before arriving at Manchester United, Earps spent time playing for hometown club <strong>Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg</strong>. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in ...",
    "published": null
  },
  {
    "title": "Who is Mary Earps? Everything you need to know about the England goalkeeper",
    "url": "https://www.fourfourtwo.com/features/mary-earps-everything-you-need-to-know",
    "snippet": "Earps helped the team to the Frauen Bundesliga title and and the DFB-Porkal. Earps steady career progression meant <strong>Manchester United</strong> wanted to sign her and she joined just before their first season in the Women&#x27;s Super League in 2019.",
    "published": "October 18, 2024"
  },
  {
    "title": "Mary Earps signs for Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/womens-team/content/mary-earps-signs-for-paris-saint-germain-psg-feminines-women-mercato-2024-2025",
    "snippet": "The England international goalkeeper has signed a contract with the Parisian club until June 2026. Mary Earps began her professional career with <strong>Doncaster Rovers</strong> before moving on to a number of big-name clubs in England, including Birmingham ...",
    "published": null
  },
  {
    "title": "Mary Earps left Manchester United to become a better player at PSG, England goalkeeper tells Pitch to Pod | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13340388/mary-earps-left-manchester-united-to-become-a-better-player-at-psg-england-goalkeeper-tells-pitch-to-pod",
    "snippet": "England and Paris Saint-Germain goalkeeper Mary Earps has admitted it was a difficult decision to leave <strong>Manchester United</strong> but says she was determined to push herself out of her comfort zone in order to become a better player.",
    "published": "April 4, 2025"
  }
]