[
  {
    "title": "Italian Communist Party - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Italian_Communist_Party",
    "snippet": "The party adopted a slim structure headed by <strong>a Central Committee of 15 members</strong>, five of whom were also in the Executive Committee (EC), namely Ambrogio Belloni, Nicola Bombacci, Amadeo Bordiga (EC), Bruno Fortichiari (EC), Egidio Gennari, Antonio Gramsci, Ruggero Grieco (EC), Anselmo Marabini, ...",
    "published": "1 week ago"
  },
  {
    "title": "Pier Luigi Bersani - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pier_Luigi_Bersani",
    "snippet": "Bersani joined the Italian Communist Party and subsequently the Democratic Party of the Left. As member of the National Secretariat of the Democrats of the Left, he was <strong>responsible for the economic sector</strong>.",
    "published": "August 25, 2025"
  },
  {
    "title": "Pier Luigi Bersani",
    "url": "https://grokipedia.com/page/Pier_Luigi_Bersani",
    "snippet": "Bersani joined the Italian Communist Party (PCI) in 1972, following initial involvement in left-wing youth activism, including founding a local section of the extra-parliamentary group Avanguardia Operaia in 1970.[17][18] As a PCI militant in his native Emilia-Romagna region, he served as a municipal councilor in Piacenza and later as a party functionary before entering regional politics.[19] In 1980, Bersani was elected to the Emilia-Romagna Regional Council as a PCI representative, holding the seat until 1986 and focusing on economic and industrial policy issues amid the party&#x27;s Eurocommunis",
    "published": null
  },
  {
    "title": "The Rise and Fall of the Italian Communist Party: Introduction | Stanford University Press",
    "url": "https://www.sup.org/books/history/rise-and-fall-italian-communist-party/excerpt/introduction",
    "snippet": "Later, under Berlinguer’s leadership, the Communists were inspired by the humanist socialism of the “Prague Spring,” reversing their opposition to European integration and indeed embracing the idea of Europe as a new subject in world politics.",
    "published": null
  },
  {
    "title": "Profile: Pier Luigi Bersani - BBC News",
    "url": "https://www.bbc.com/news/world-europe-20579689",
    "snippet": "In 2009 the left was back in opposition, and the recently formed PD - which incorporated former Communists and others - held a primary to elect its leader. Mr Bersani easily beat the more centrist Dario Franceschini and took up the challenge of presenting a convincing alternative to Mr Berlusconi. After the centre-left failed to form a government following the February polls, unrest with his leadership grew within the PD, finally boiling into open revolt when MPs rejected Mr Bersani&#x27;s choices of candidate for president in the secret ballot.",
    "published": "April 19, 2013"
  }
]