[
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "Olaf Scholz (born 14 June 1958) is a German politician who served as the Chancellor of Germany from 2021 to 2025. A member of the Social Democratic Party (SPD), he previously served as <strong>Vice Chancellor in the fourth Merkel cabinet and as Federal Minister of Finance from 2018 to 2021</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Olaf Scholz | Facts, Biography, Cabinet, & Chancellor of Germany | Britannica",
    "url": "https://www.britannica.com/biography/Olaf-Scholz",
    "snippet": "A longtime member of Germany’s center-left Social Democratic Party (SPD), Scholz served as finance minister and vice chancellor (2018–21) in the ‘grand coalition’ government of <strong>Angela Merkel</strong> before succeeding her as chancellor.",
    "published": "March 31, 2022"
  },
  {
    "title": "Olaf Scholz",
    "url": "https://www.bundesregierung.de/breg-en/federal-cabinet/1988528-1988528",
    "snippet": "Olaf Scholz was Federal Chancellor from 2021 to May 2025. (Photo: Federal Government//Thomas Köhler/Photothek) Born on 14 June 1958 in Osnabrück. since 1975 Member of the Social Democratic Party of Germany (SPD)",
    "published": null
  },
  {
    "title": "Olaf Scholz – DW",
    "url": "https://www.dw.com/en/olaf-scholz/t-57304267",
    "snippet": "Olaf Scholz is a German politician from the Social Democratic Party. He was elected chancellor in 2021. He previously served as <strong>federal minister of finance and vice-chancellor under Angela Merkel from 2018 to 2021</strong>.",
    "published": null
  },
  {
    "title": "Olaf Scholz - Agenda Contributor | World Economic Forum",
    "url": "https://www.weforum.org/stories/authors/olaf-scholz/",
    "snippet": "<strong>Federal Chancellor of the Federal Republic of Germany since December 2021</strong>. 1985, degree in Law, University of Hamburg. Joined the Social Democratic Party of Germany (SPD) in 1975; since then, has served in various positions within the party.",
    "published": null
  }
]