[
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "Narendra Damodardas Modi was born on 17 September 1950 to a <strong>Gujarati family of Other Backward Class (OBC) background and Hindu faith</strong> in Vadnagar, Mehsana district, Bombay State (present-day Gujarat). He was the third of six children born to Damodardas Mulchand Modi (c.",
    "published": "1 day ago"
  },
  {
    "title": "Personal Life Story | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/personal_life_story/personal-life-story/",
    "snippet": "He was born on the 17th of September 1950; three years after India had gained its Independence. This makes him the first Prime Minister to be born in independent India. Mr. Modi is the third child born to <strong>Damodardas Modi and Hiraba Modi</strong>. Mr. Modi comes from a family of humble origins and modest ...",
    "published": null
  },
  {
    "title": "Narendra Modi Family Tree",
    "url": "https://familyrootapp.com/blog/narendra-modi-family-tree-prime-minister",
    "snippet": "Narendra Modi, born on September 17, 1950, in Vadnagar, Gujarat, is the third of six children in a <strong>Gujarati Hindu family of the Other Backward Class (OBC) Ghanchi community</strong>.",
    "published": null
  },
  {
    "title": "Narendra Modi Family Tree | MyOrigins.ai",
    "url": "https://myorigins.ai/Celebraties_details/23/23-family-tree-details.html",
    "snippet": "Narendra Damodardas Modi was born on September 17, 1950, in Vadnagar, Gujarat. He is the 14th Prime Minister of India, serving since May 26, 2014. Modi was the third of six children born to <strong>Damodardas and Heeraben Modi</strong>. He joined the RSS at age eight and became a full-time worker for the ...",
    "published": null
  },
  {
    "title": "Modi Ka Parivar trends: Know all about PM Modi's actual family - Modi ka Parivar | The Economic Times",
    "url": "https://economictimes.indiatimes.com/news/india/modi-ka-parivar-trendsknow-all-about-pm-modi-actual-family/modi-ka-parivar/slideshow/108265113.cms?from=mdr",
    "snippet": "He was the third of six children born to Damodardas Mulchand Modi and Hiraben Modi. ​ ... His six siblings were–<strong>Soma Modi, Pankaj Modi, Prahlad Modi, Vasantiben Hasmukhlal Modi, and Arvind Modi</strong>, among which Narendra Modi was the third eldest.",
    "published": null
  }
]