[
  {
    "title": "Who owns Stanford University? - Quora",
    "url": "https://www.quora.com/Who-owns-Stanford-University",
    "snippet": "Answer: The short answer, from the University Governance documents: Stanford University is <strong>a trust with corporate powers under the laws of the State of California</strong>. The university is a tax-exempt entity under section 501(c)3 of the Internal Revenue ...",
    "published": null
  },
  {
    "title": "Stanford University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stanford_University",
    "snippet": "The university&#x27;s collection of works by Auguste Rodin is among the largest in the world, with as many as 200 sculptures at the Cantor Center alone. These include an original bronze cast of The Thinker granted residence at Stanford by Cantor in 1988, with the university expected to attain full ownership sometime in the future.",
    "published": "2 weeks ago"
  },
  {
    "title": "A History of Stanford – Stanford University",
    "url": "https://www.stanford.edu/about/history/",
    "snippet": "From the start, stewardship of the founders’ extraordinary land gift has helped support university endeavors, and has made room for a multiplicity of institutes, schools and laboratories that cross-fertilize each other with innovations that have changed the world. Computer time-sharing, the first isolation of highly purified stem cells and the first synthesis of biologically active DNA, among many other breakthroughs, all originated at Stanford.",
    "published": null
  },
  {
    "title": "About Stanford University | Bondholder Information",
    "url": "https://bondholder-information.stanford.edu/about/about-stanford-university",
    "snippet": "The founding grant by Senator Leland Stanford and Jane Lathrop Stanford in 1885 conveyed to the university an endowment of approximately $20 million and the Stanfords&#x27; farm at Palo Alto.",
    "published": null
  },
  {
    "title": "Who Owns Silicon Valley: Stanford? – NBC Bay Area",
    "url": "https://www.nbcbayarea.com/news/local/who-owns-silicon-valley-stanford/2061716/",
    "snippet": "When railroad mogul Leland Stanford donated 8,000 acres of farmland to found Stanford University in 1885, he stipulated that any land owned by the school could never be sold to the public, establishing a constraint that survives to this day.",
    "published": "February 13, 2020"
  }
]