[
  {
    "title": "The President and Vice-Presidents at Université Paris-Saclay | Université Paris-Saclay",
    "url": "https://www.universite-paris-saclay.fr/en/president-and-vice-presidents-universite-paris-saclay",
    "snippet": "<strong>Camille Galap</strong>, president of Université Paris-Saclay, holds a PhD in biology from the Université du Havre and is a professor.",
    "published": "October 1, 2025"
  },
  {
    "title": "Camille Galap, élu président de l’Université Paris-Saclay | ENS-PARIS-SACLAY",
    "url": "https://ens-paris-saclay.fr/actualite/camille-galap-elu-president-de-luniversite-paris-saclay",
    "snippet": "L&#x27;ENS Paris-Saclay est l&#x27;un des membres fondateurs de l&#x27;Université Paris-Saclay. <strong>Camille Galap</strong> a été élu président de l’Université Paris-Saclay par les membres du Conseil d’administration réunis le mardi 11 juin 2024.",
    "published": "October 5, 2024"
  },
  {
    "title": "Camille Galap new president Paris-Saclay University | LERU",
    "url": "https://www.leru.org/news/camille-galap-new-president-paris-saclay-university",
    "snippet": "On Tuesday 11 June 2024, the Governing Board of Paris-Saclay University convened to elect the university’s new president. Prof. <strong>Camille Galap</strong> was elected by the members of the Governing Board. His term of office is four years, effective immediately. Prof. Galap succeeds Prof.",
    "published": null
  },
  {
    "title": "Election of the president of Université Paris-Saclay | Université Paris-Saclay",
    "url": "https://www.universite-paris-saclay.fr/en/news/election-president-universite-paris-saclay",
    "snippet": "<strong>Camille Galap</strong> was elected by the members of the Governing board (36 voting members) president of Université Paris-Saclay (with 20 votes in favour and 5 blank votes). The term of office is four years, effective immediately.",
    "published": "June 11, 2024"
  },
  {
    "title": "Camille Galap elected President of Université Paris-Saclay",
    "url": "https://ens-paris-saclay.fr/sites/default/files/Presse/2024_06_11_CP_Camille%20Galap_President_Universite_Paris-Saclay_EN.pdf",
    "snippet": "1 1st round: Yves Bernard 12 votes; <strong>Camille Galap</strong> 18 votes; Souhil Megherbi 2 votes; 4 blank votes. 2nd round: Yves Bernard 11 votes; <strong>Camille Galap</strong> 20 votes; 5 blank votes. ... University Presidents (CPU) - now known as France Universités, where he chaired the Student Life and",
    "published": null
  }
]