[
  {
    "title": "Buenos Aires Times | Aníbal Fernández: ‘I understand and share the president’s view on re-election’",
    "url": "https://www.batimes.com.ar/news/argentina/anibal-fernandez-there-will-be-a-guarantee-of-everybody-being-able-to-compete-so-that-there-are-no-complications.phtml",
    "snippet": "He did not do this driven by adversity ... what he believes and what he did. Now <strong>he must serve out his term until December 10 having resolved most things within the margin of his possibilities.</strong>...",
    "published": "April 28, 2023"
  },
  {
    "title": "\"El daño es superlativo\": Aníbal Fernández llamó a \"levantar la voz\" contra el Gobierno POLÍTICA El Intransigente",
    "url": "https://elintransigente.com/2025/12/el-dano-es-superlativo-anibal-fernandez-llamo-a-levantar-la-voz-contra-el-gobierno/",
    "snippet": "<strong>Fernández vinculó su largo proceso a una «persecución macrista» con «causas armadas» para «ensuciar gente», apuntando contra la denunciante Graciela Ocaña</strong>. El exministro defendió su accionar en FPT.",
    "published": "1 week ago"
  },
  {
    "title": "Hoy se conoce la sentencia de Fútbol Para Todos: Aníbal Fernández y Capitanich, complicados POLÍTICA El Intransigente",
    "url": "https://elintransigente.com/2025/12/anibal-fernandez-y-jorge-capitanich-complicados-por-la-sentencia-del-caso-futbol-para-todos/",
    "snippet": "Hoy saldrá un fallo muy importante: <strong>el Trib Oral Federal 1 dictará sentencia en la causa “Fútbol para Todos”.</strong> El Fiscal Osorio pidió 3 años de prisión para Aníbal Fernández y 8 meses para Jorge Capitanich pic.twitter.com/2xdD6hqPYt— ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Aníbal Fernández (@FernandezAnibal) / X",
    "url": "https://twitter.com/FernandezAnibal",
    "snippet": "JavaScript is not available · We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center · Help Center · Terms of Service Privacy Policy ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "Aníbal Domingo Fernández (born January 9, 1957) is an Argentine Justicialist Party politician, lawyer, and certified public accountant. Throughout his career, he has remained a close ally to the former Presidents Néstor Kirchner and Cristina Fernández de Kirchner.",
    "published": "November 15, 2025"
  }
]