[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "A judge ruled in April 2025 that Newsmax broadcast false and defamatory statements against Dominion about the election, and four months later, Newsmax settled Dominion&#x27;s lawsuit by agreeing to pay Dominion $67 million. Christopher Ruddy started Newsmax.com on September 16, 1998, supported by a group of investors including the family of former Central Intelligence Agency Director William J.",
    "published": "1 week ago"
  },
  {
    "title": "NewsMax Media 2025 Company Profile: Stock Performance & Earnings | PitchBook",
    "url": "https://pitchbook.com/profiles/company/43034-23",
    "snippet": "Information on stock, financials, earnings, subsidiaries, investors, and executives for NewsMax Media. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Newsmax Sees \"Big Surge\" in Q1 Ratings, Now #5 Network in All of Cable | Newsmax Media, Inc.",
    "url": "https://ir.newsmax.com/news/news-details/2025/Newsmax-Sees-Big-Surge-in-Q1-Ratings-Now-5-Network-in-All-of-Cable/default.aspx",
    "snippet": "American Agenda with Katrina Szish and Bob Brooks grew by 25%, Q1 2025 vs. Q1 2024 · Last Friday, Newsmax reported that the Company hit a recent record with 33.6 million viewers watching the network in Q1, up 50% from the same period last year. Additionally, in the key demo of Adults 35 to 64, close to 15 million viewers tuned in, up 63% from last year. &quot;Newsmax is breaking records because we&#x27;re covering the news and talking about the issues Americans care about,&quot; Christopher Ruddy, CEO of Newsmax Inc., said.",
    "published": null
  },
  {
    "title": "Newsmax stock surges after its IPO | CNN Business",
    "url": "https://www.cnn.com/2025/04/01/media/newsmax-stock-surges-after-ipo",
    "snippet": "Newsmax CEO Chris Ruddy, who is now a billionaire on paper thanks to the stock’s explosive performance, told CNN, “Last election Americans voted against the media establishment and similarly investors voted by enormously buying Newsmax stock to say they like us, they value us and they want us to grow.”",
    "published": "April 1, 2025"
  },
  {
    "title": "newsmax inc.",
    "url": "https://www.sec.gov/Archives/edgar/data/2026478/000121390025021989/ea0233655-253g1_newsmax.htm",
    "snippet": "OFFERING CIRCULAR DATED MARCH 7, 2025 · NEWSMAX INC. 750 Park of Commerce Drive, Suite 100 · Boca Raton, Florida 33487 · (561) 686-1165 · Newsmax.com · UP TO 7,500,000 SHARES OF CLASS B COMMON STOCK · PRICE: $10.00 PER SHARE · The minimum investment in this offering is 50 shares of Class B Common Stock, or $500, unless waived by the Company in its sole discretion ·",
    "published": null
  }
]