[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and ...",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and doctorate degrees in zoology in 1966 at the University of Oxford under famed ethologist Nikolaas Tinbergen (who was best known for his work with both instinctive and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins - Curriculum Manager Coach - Bayt.com People",
    "url": "https://people.bayt.com/richard-dawkins-51973545/",
    "snippet": "In supporting the government’s aspirations for a diversified Saudi economy and helping employers with developing a skilled, competent workforce, I am currently employed as the Curriculum Manager Coach as part of the Capability Building Project with the Technical and Vocational Training Corporation (TVTC) and the Colleges of Excellence (CoE) to Review, Refine and Redevelop the Diploma and Degree programme offerings at Madinah College of Technology, as well as the introduction of new curriculum programs based on labour market research, trends and statistical data obtained from the Ministry of Civil Service, Chamber of Commerce and collaboration with local Universities and employer engagement.",
    "published": null
  },
  {
    "title": "Contact Richard Dawkins, Email: ****@companyx.com & Phone Number | Worker at Company-X - ZoomInfo",
    "url": "https://www.zoominfo.com/p/Richard-Dawkins/8825059920",
    "snippet": "Richard Dawkins is a Worker at <strong>Company-X</strong> based in San Francisco, California....",
    "published": null
  },
  {
    "title": "r/biology on Reddit: Is Richard Dawkins a recognized scientist?",
    "url": "https://www.reddit.com/r/biology/comments/18pafhm/is_richard_dawkins_a_recognized_scientist/",
    "snippet": "Dawkins says he&#x27;s a cultural Christian, ... would be “truly dreadful” ... I&#x27;m <strong>Sean Faircloth, Director of Strategy and Policy with the Richard Dawkins Foundation for Reason &amp; Science US</strong>....",
    "published": "December 23, 2023"
  }
]