[
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "In February 2017, Saudi Arabia appointed its first woman to head the Saudi Stock Exchange. Muhammad bin Nayef was arrested on 6 March 2020, along with his half-brother Nawwaf bin Nayef and King Salman&#x27;s brother Ahmed bin Abdulaziz. The three princes were charged with treason. The Saudi government claimed the princes were trying to overthrow Mohammed bin Salman.",
    "published": "11 hours ago"
  },
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "He is the son of Saudi King Salman bin Abdulaziz and his third wife <strong>Fahdah bint Falāḥ ibn Sulṭān</strong>. From a young age Mohammed was interested in government, shadowing his father and remaining conscious about his image.",
    "published": "July 17, 2019"
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?RestrictToCategory=Saudi+Arabia",
    "snippet": "The heads of government list is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers, trade ministers and in some cases, ministers responsible for development assistance.&amp;nbsp It has been prepared using information provided by ...",
    "published": null
  },
  {
    "title": "Prime Minister of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Saudi_Arabia",
    "snippet": "Since the reign of King Khalid, others have done much of the &quot;heavy lifting&quot; as the king was either unwilling or unable to carry the workload, especially as the kingdom became a gerontocracy during the 1990s and 2000s. Royal favorites achieved power to become de facto prime ministers. The current one is the King&#x27;s son Mohammad, who is his father&#x27;s top aide.",
    "published": "November 10, 2025"
  },
  {
    "title": "Saudi Leadership",
    "url": "https://www.mofa.gov.sa/en/ksa/Pages/leadership.aspx",
    "snippet": "الموقع الرسمي لوزارة الخارجية للمملكة العربية السعودية والذي من خلاله يمكنك الإطلاع على كافة الأحداث الدولية والإقليمية والسياسية والدبلوماسية المتعلقة بالمملكة",
    "published": null
  }
]