[
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Charged with leading France’s golden generation of players, <strong>Fabien Galthie</strong> has overseen one of rugby’s great revolutions. With the otherworldly talents of Antoine Dupont, Damien Penaud, Romain Ntamack and Gregory Alldritt at his fingertips, ...",
    "published": "May 30, 2025"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "Although coached by <strong>Jean Desclaux between 1973 and 1980</strong>, the French team&#x27;s main influence during the late 1970 was captain Jacques Fouroux. Fouroux played scrum-half and captained France to their 1977 Five Nations Grand Slam, during which France played a very forward-oriented style of rugby.",
    "published": "2 weeks ago"
  },
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "<strong>Fabien Galthié</strong> (French pronunciation: ... national team. His usual position was at scrum-half. He played much of his club rugby for Colomiers, and later on in his career, Stade Français. Galthié won 64 caps for France, including playing in four Rugby World Cups, as well as captaining the ...",
    "published": "1 month ago"
  },
  {
    "title": "France rugby union team: Fixtures, squad and head coach",
    "url": "https://news.bet365.com/en-gb/article/france-rugby-union-team-profile/2025012409221201023",
    "snippet": "The top tryscorer in the Six Nations ... himself, receiving 64 international caps for Les Bleus as a scrum-half between 1991 and 2003, <strong>Fabien Galthie became France head coach in 2019.</strong>...",
    "published": null
  },
  {
    "title": "France national rugby union team coaches - FamousFix.com list",
    "url": "https://m.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "... Overview: Bernard Laporte (born 1 July 1964) is a rugby player, coach and former French Secretary of State for Sport. <strong>From 1999 to 2007, Laporte was the head coach of the France national team</strong>.",
    "published": null
  }
]