[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "By 1986, IRI was suffering heavy losses—with Alfa Romeo having not been profitable for the last 13 years—and IRI president Romano Prodi put Alfa Romeo up for sale. <strong>Finmeccanica, the mechanical holdings arm of IRI and its predecessors owned Alfa Romeo since 1932</strong>. Prodi first approached fellow ...",
    "published": "1 week ago"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "The name Alfa is actually an acronym for, “Anonima Lombarda Fabbrica Automobili” – A.L.F.A. <strong>In the formative years between 1932 and 1986, the Alfa was owned by an Italian state holding company</strong>, which then led to Alfa being under the Fiat ...",
    "published": "April 26, 2021"
  },
  {
    "title": "Is Alfa Romeo Part of Stellantis? | Benson Alfa Romeo",
    "url": "https://www.alfaromeousaofgreer.com/research/is-alfa-romeo-part-of-stellantis.htm",
    "snippet": "So who owned Alfa Romeo during this time? <strong>Between 1932 and 1986, an Italian state-holding company owned Alfa, and Alfa Romeo joined the Fiat Chrysler Group</strong>. The company then became Alfa Romeo Automobiles S.p.A as a subsidiary of Fiat, also known as FCA or Fiat Chrysler Automobiles.",
    "published": null
  },
  {
    "title": "Who Owns Alfa Romeo? | Who Makes Alfa Romeo? | Zeigler Alfa Romeo of Schaumburg",
    "url": "https://www.alfaromeousaofschaumburg.com/who-owns-alfa-romeo/",
    "snippet": "When Cavalier Ugo Stella decided to purchase shares of the Anonima Lombarda Fabbrica Automobili in 1910, Alfa Romeo was born. The company’s acronym comes from its original name above and later was used as an integral part of the name (A.L.F.A). Between 1932 and 1986, a state holding company in Italy owned Alfa.",
    "published": "July 13, 2019"
  },
  {
    "title": "Who Makes Alfa Romeo? | Ron Lewis Alfa Romeo",
    "url": "https://www.ronlewisalfaromeo.com/who-makes-alfa-romeo/",
    "snippet": "Who Makes Alfa Romeo: Stellantis currently oversees the production and development of Alfa Romeo vehicles. This multinational corporation was established in 2021 through the merger of <strong>Fiat Chrysler Automobiles (FCA) and PSA Group</strong>.",
    "published": "October 31, 2025"
  }
]