[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The paper was founded with the 1897 merger of the Summit Beacon, first published in 1839, and the Akron Evening Journal, founded in 1896. In 1903, the Beacon Journal was purchased by <strong>Charles Landon Knight</strong>. His son John S. Knight inherited the paper, in 1933, on Charles&#x27; death.",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "Legendary publisher <strong>John S. Knight, whose father, C.L. Knight</strong>, owned the paper before him, maintained an office at the Beacon Journal until June 16, 1981. On that day, John Knight found something in the paper he didn’t like and went to the ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Knight-ridder Inc | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/social-sciences-and-law/economics-business-and-labor/businesses-and-occupations/knight-ridder-inc",
    "snippet": "The company began as two separate newspaper groups, which merged in 1974. The Ridder group originated in 1892, when Herman Ridder purchased the Staats-Zeitung, a New York German-language paper. The Knight group began in 1903 when <strong>Charles Landon (C.L.) Knight</strong> bought the Akron Beacon Journal, ...",
    "published": null
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media | Crain's Cleveland Business",
    "url": "https://www.crainscleveland.com/article/20180411/news/157966/akron-beacon-journal-sold-gatehouse-media",
    "snippet": "The Beacon has a daily circulation of 68,000. The award-winning paper had long been owned by Knight Ridder, but was sold to <strong>Black Press</strong> when Knight Ridder was McClatchy Co.",
    "published": "April 11, 2018"
  },
  {
    "title": "Knight Ridder, Inc. -- Company History",
    "url": "https://www.company-histories.com/Knight-Ridder-Inc-Company-History.html",
    "snippet": "A second publication was acquired in 1892 when Herman Ridder purchased the Staats-Zeitung, the nation&#x27;s largest German-language paper, also based in New York. The Knight group began in 1903 when <strong>Charles Landon (C.L.) Knight</strong> bought the Akron Beacon Journal, in Ohio, which the company still owns.",
    "published": null
  }
]