[
  {
    "title": "Minister for Children, Disability and Equality - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_for_Children,_Disability_and_Equality",
    "snippet": "<strong>Hildegarde Naughton, TD</strong> – Minister of State at the Department of Children, Disability and Equality with responsibility for disability.",
    "published": "September 7, 2025"
  },
  {
    "title": "Department of Children, Equality, Disability, Integration and ...",
    "url": "https://www.earlychildhoodireland.ie/wp-content/uploads/2023/08/Explainers_DCEDIY.pdf",
    "snippet": "The Office of the Minister of Children was established in December 2005, allowing the · Minister to attend Cabinet meetings, but this did not change the functions of the role. The · last Minister of State for Children was Barry Andrews.",
    "published": null
  },
  {
    "title": "Department of Children, Disability and Equality - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Department_of_Children,_Equality,_Disability,_Integration_and_Youth",
    "snippet": "The official headquarters and ministerial offices of the department are on Baggot Street, Dublin. The departmental team consists of the following: Minister for Children, Disability and Equality: <strong>Norma Foley, TD</strong> · Minister of State for Disability: Hildegarde Naughton, TD",
    "published": "June 28, 2025"
  },
  {
    "title": "Minister for Children, Equality, Disability, Integration and Youth - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_for_Children,_Disability,_Equality_and_Integration",
    "snippet": "The department was created in 1956 as the Department of the Gaeltacht. Its title and functions have changed several times, with the current title adopted in 2020. An office of minister of state for children existed from 1994 to 2011.",
    "published": "February 8, 2025"
  },
  {
    "title": "Minister Norma Foley and Minister of State Hildegarde ...",
    "url": "https://gov.ie/en/department-of-children-disability-and-equality/press-releases/minister-norma-foley-and-minister-of-state-hildegarde-naughton-meet-with-the-disability-stakeholder-strategic-advisory-group/",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  }
]