[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "In 2021, Pochettino joined Paris Saint-Germain, where he won the Ligue 1 title and Coupe de France but left one year later. <strong>He took over as the manager of Chelsea for the 2023–24 season, mutually agreeing to part ways with the club after just one season</strong>. The same year he was appointed as ...",
    "published": "5 days ago"
  },
  {
    "title": "Mauricio Pochettino Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/4632/Mauricio-Pochettino/overview",
    "snippet": "Under Pochettino, in the second half of 2012/13, Southampton achieved impressive victories over reigning Premier League champions Manchester City as well as Liverpool and Chelsea. The following campaign proved even more successful as Pochettino led Saints to eighth, matching their highest Premier League finish. Pochettino was chosen by Tottenham Hotspur to replace Tim Sherwood as head coach for the 2014/15 season.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino to become Chelsea head coach | News | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/news/article/mauricio-pochettino-to-become-chelsea-head-coach",
    "snippet": "The 51-year-old has <strong>several seasons of Premier League experience in addition to coaching in Spain and France</strong>. He was most recently in charge at Paris Saint-Germain and guided the club to a Ligue 1 title and the Coupe de France.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/mauricio-pochettino",
    "snippet": "Welcome to the official Chelsea FC website. All the latest news, videos and ticket information as well as player profiles and information about Stamford Bridge, the home of the Blues. Browse the online shop for Chelsea FC products and merchandise.",
    "published": null
  },
  {
    "title": "Why Pochettino left Chelsea, and what it reveals about the club - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/40193855/why-chelsea-mauricio-pochettino-split-reveals-club",
    "snippet": "But the fact they are now looking for a fourth permanent head coach in two years suggests Chelsea&#x27;s structure remains problematic, yet to find a manager able to thrive in the environment they have created. Mauricio Pochettino leaves Chelsea after just one season in charge at Stamford Bridge.",
    "published": "May 22, 2024"
  }
]