[
  {
    "title": "Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en",
    "snippet": "Versão Portuguesa · Presidente da República promulgou três diplomas do Governo · 04 of December of 2025 · <strong>Presidente da República lembra Francisco Sá Carneiro e Adelino Amaro da Costa</strong> · 04 of December of 2025 · Presidente da República promulgou diploma do Governo ·",
    "published": null
  },
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "<strong>Marcelo Rebelo de Sousa</strong> was born in Lisbon, on 12 December 1948. He is a Catholic and has 2 children and 5 grandchildren. A Law Graduate, he received a Doctorate in Legal and Political Science in 1984.",
    "published": null
  },
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "<strong>The President of the Republic declares the state of siege and emergency</strong>, after hearing the Government and under authorization from the Assembly of the Republic.",
    "published": "3 days ago"
  },
  {
    "title": "Eurozone's new star: Portugal crowned 2025 'economy of the year' | Euronews",
    "url": "https://www.euronews.com/business/2025/12/10/eurozones-new-star-portugal-crowned-2025-economy-of-the-year",
    "snippet": "&quot;It is by reforming with courage and making the country more competitive and productive that we will continue to create jobs, increase wages and strengthen the welfare state,&quot; the Portuguese Prime Minister added. Government forecasts point to economic growth of 2% this year and 2.3% next year. Despite the good news, the country faces dissatisfaction around housing costs, as well as labour and employment, with a general strike called on 11 December.",
    "published": "6 days ago"
  },
  {
    "title": "Portugal's president invites caretaker PM to lead new government | Reuters",
    "url": "https://www.reuters.com/world/europe/portugals-president-invites-caretaker-pm-lead-new-government-2025-05-29/",
    "snippet": "<strong>Luis Montenegro</strong>, Social Democratic Party (PSD) and Democratic Alliance (AD) leader, meets with Portugal President Marcelo Rebelo de Sousa at Belem Palace, following the final results of the general elections in Lisbon, Portugal, May 29, 2025.",
    "published": "May 29, 2025"
  }
]