[
  {
    "title": "Ada Solomon | Producer, Production Manager, Actress",
    "url": "https://www.imdb.com/name/nm1127536/",
    "snippet": "Ada Solomon. Producer: Bad Luck Banging or Loony Porn. Ada Solomon was born on 3 June 1968 in Bucharest, Romania. She is a producer and production manager. She is married to <strong>Alexandru Solomon</strong>.",
    "published": "July 16, 2009"
  },
  {
    "title": "Ada Solomon - IMDb",
    "url": "https://www.imdb.com/name/nm1127536/bio/",
    "snippet": "Ada Solomon. Producer: Bad Luck Banging or Loony Porn. Ada Solomon was born on 3 June 1968 in Bucharest, Romania. She is a producer and production manager, known for Bad Luck Banging or Loony Porn (2021), Aferim! (2015) and Child&#x27;s Pose (2013). She is married to <strong>Alexandru Solomon</strong>.",
    "published": null
  },
  {
    "title": "Alexandru Solomon talks doc filmmaking and working with wife Ada | Features | Screen",
    "url": "https://www.screendaily.com/features/alexandru-solomon-talks-doc-filmmaking-and-working-with-wife-ada/5172055.article",
    "snippet": "As one of the three recipients of the 3x3 homages at the Transilvania International Film Festival (TIFF) this month, Romanian documentary director, DoP, producer and screenwriter <strong>Alexandru Solomon</strong> relished the chance to reflect on how filmmaking ...",
    "published": "June 27, 2022"
  },
  {
    "title": "Ada Solomon: Movies, TV, and Bio",
    "url": "https://www.amazon.com/prime-video/actor/Ada-Solomon/amzn1.dv.gti.b1863306-8e9e-4007-80cc-ecc451fac62a",
    "snippet": "She is married to <strong>Alexandru Solomon</strong>. Ada Solomon was born on June 3, 1968 in Bucharest, Romania. She is a producer and production manager, known for Bad Luck Banging or Loony Porn (2021), Aferim! (2015) and Child&#x27;s Pose (2013).",
    "published": null
  },
  {
    "title": "'Dracula': Romania Producer Ada Solomon 3 Films in Locarno Competition",
    "url": "https://www.hollywoodreporter.com/movies/movie-news/dracula-film-romania-producer-ada-solomon-interview-locarno-1236344649/",
    "snippet": "<strong>Alexandru Solomon</strong>, her husband, also has another project, called The Archive of the Archives, a film about the National Archives of Romania and the people working there. “It’s a film about memory preservation,” explains Ada Solomon.",
    "published": "August 18, 2025"
  }
]