[
  {
    "title": "Anne-Marie Slaughter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anne-Marie_Slaughter",
    "snippet": "Anne-Marie Slaughter (born September 27, 1958) is an American lawyer and political scientist, and author. She is the current president and CEO of New America (formerly the New America Foundation). Previously, Slaughter served as the <strong>dean of Princeton School of Public and International Affairs</strong> from ...",
    "published": "October 1, 2025"
  },
  {
    "title": "BIOGRAPHY: Anne-Marie Slaughter",
    "url": "https://2009-2017.state.gov/s/p/fapb/185598.htm",
    "snippet": "Prior to her government service, Dr. Slaughter was the Dean of Princeton’s Woodrow Wilson School of Public and International Affairs from 2002–2009 and the J. Sinclair Armstrong Professor of International, Foreign, and Comparative Law at Harvard Law School from 1994-2002.",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter, D.Phil, J.D. | Abt Global",
    "url": "https://www.abtglobal.com/our-people/board-of-directors/anne-marie-slaughter-dphil-jd",
    "snippet": "Anne-Marie Slaughter is the President and CEO of New America, a think tank and civic enterprise with offices in Washington and New York. She is also the Bert G. Kerstetter &#x27;66 University Professor Emerita of Politics and International Affairs at Princeton University.From 2009–2011 she served as director of Policy Planning for the United States Department of State, the first woman to hold that position.",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter",
    "url": "https://www.aspenideas.org/speakers/anne-marie-slaughter",
    "snippet": "Anne-Marie Slaughter is president and CEO of New America and Bert G. Kerstetter ’66 University Professor Emerita of Politics and International Affairs at Princeton University. From 2009 to 2011, she was the first woman policy planning director at the US State Department. Previously, she was ...",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter, The Atlantic",
    "url": "https://www.theatlantic.com/author/anne-marie-slaughter/",
    "snippet": "Anne-Marie Slaughter is the CEO ... Politics. She was previously the <strong>director of policy planning for the U.S. State Department and the dean of the School of Public and International Affairs</strong>....",
    "published": null
  }
]