[
  {
    "title": "The Official Website of the Buffalo Bills",
    "url": "https://www.buffalobills.com/team/coaches-roster/",
    "snippet": "The browser you are using is no longer supported on this site. It is highly recommended that you use the latest versions of a supported browser in order to receive an optimal viewing experience. The following browsers are supported: Chrome, Edge (v80 and later), Firefox and Safari",
    "published": null
  },
  {
    "title": "Sean McDermott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sean_McDermott",
    "snippet": "<strong>Sean Michael McDermott</strong> (born March 21, 1974) is an American professional football coach who is the head coach for the Buffalo Bills of the National Football League (NFL). He began his NFL coaching career as an assistant for the Philadelphia Eagles in 2001, serving as defensive coordinator from ...",
    "published": "1 week ago"
  },
  {
    "title": "Buffalo Bills head coach history | Pro Football History.com",
    "url": "https://pro-football-history.com/franchpos/7/1/buffalo-bills-head-coach-history",
    "snippet": "Ramsey was the head coach for the Buffalo Bills in the 1960-1961 seasons, a total of two years. Buster Ramsey was the first head coach in Bills history in 1960. Marv Levy coached the most seasons as the Bills&#x27;s head coach at eleven seasons. <strong>Sean McDermott</strong> is the current head coach, starting ...",
    "published": null
  },
  {
    "title": "Buffalo Bills Head Coach Record | StatMuse",
    "url": "https://www.statmuse.com/nfl/ask/buffalo-bills-head-coach-record",
    "snippet": "<strong>Sean McDermott</strong> has coached the Bills from 2017 to 2025.",
    "published": null
  },
  {
    "title": "Buffalo Bills finalize 2025 coaching staff",
    "url": "https://www.buffalobills.com/news/buffalo-bills-finalize-2025-coaching-staff",
    "snippet": "The Bills have finalized the coaching staff for the 2025 season: ... <strong>Mark Laurrie</strong> is recognized for his dedication to education and health for students. ... The quarterback earns his third accolade of the 2025 regular season.",
    "published": null
  }
]