[
  {
    "title": "Sophie Grégoire Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sophie_Gr%C3%A9goire_Trudeau",
    "snippet": "<strong>Sophie Grégoire Trudeau</strong> (French pronunciation: [sɔfi ɡʁeɡwɑʁ]; born April 24, 1975) is a Canadian public speaker and retired television host. She married Justin Trudeau, the 23rd prime minister of Canada, in 2005; the couple separated in 2023. She is involved in charity work, social ...",
    "published": "1 week ago"
  },
  {
    "title": "All About Justin Trudeau's Estranged Wife, Sophie Grégoire Trudeau",
    "url": "https://people.com/all-about-justin-trudeau-wife-sophie-gregoire-trudeau-11781151",
    "snippet": "Former Canadian Prime Minister Justin Trudeau announced his separation from <strong>Sophie Grégoire Trudeau</strong> in 2023. Here&#x27;s everything to know about Justin Trudeau&#x27;s wife and their split.",
    "published": "October 27, 2025"
  },
  {
    "title": "Justin Trudeau’s ex-wife Sophie Grégoire breaks silence on his romance with Katy Perry | CNN",
    "url": "https://www.cnn.com/2025/11/17/entertainment/justin-trudeau-sophie-gregoire-katy-perry",
    "snippet": "<strong>Sophie Grégoire</strong> has opened up about her life in the public as the former wife of former Canadian Prime Minister Justin Trudeau.",
    "published": "November 17, 2025"
  },
  {
    "title": "Sophie Grégoire Trudeau (@sophiegregoiretrudeau) • Instagram photos and videos",
    "url": "https://www.instagram.com/sophiegregoiretrudeau/",
    "snippet": "382K Followers, 321 Following, 976 Posts - See Instagram photos and videos from <strong>Sophie Grégoire Trudeau</strong> (@sophiegregoiretrudeau)",
    "published": null
  },
  {
    "title": "Katy Perry and Justin Trudeau’s Relationship Timeline, for Those Baffled and Seeking Answers",
    "url": "https://www.cosmopolitan.com/entertainment/celebs/a65551967/katy-perry-justin-trudeau-relationship-timeline/",
    "snippet": "Perry and former Prime Minister of Canada Justin Trudeau. The burgeoning maybe-couple were pap&#x27;d having dinner, then they were spotted having another dinner, then a source came through with more intel than we were emotionally prepared for, and now we need a timeline to sort it all out. Justin and his wife, Sophie, announce their separation after 18 years of marriage.",
    "published": "2 weeks ago"
  }
]