[
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "In the second case, <strong>the prime minister</strong>, after deliberation by the Council of Ministers, can propose a vote of confidence regarding the government&#x27;s policies in Congress. If Congress does not give <strong>the prime minister</strong> its confidence, <strong>the prime minister</strong> must resign.",
    "published": "3 weeks ago"
  },
  {
    "title": "Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pedro_S%C3%A1nchez",
    "snippet": "On 3 November 2024, <strong>Pedro Sánchez</strong>, King Felipe, Queen Letizia and Valencian president Carlos Mazón were violently confronted during a meeting with people affected by the October 2024 Spain floods in Paiporta in the Valencian Community, who threw mud and objects at them and injured two bodyguards.",
    "published": "4 days ago"
  },
  {
    "title": "Pedro Sánchez | World Leaders Forum",
    "url": "https://worldleaders.columbia.edu/directory/pedro-sanchez",
    "snippet": "Source: Office of the President of the Government of Spain, August 2025",
    "published": null
  },
  {
    "title": "Official website of the president of the Government of Spain ...",
    "url": "https://www.lamoncloa.gob.es/lang/en/paginas/index.aspx",
    "snippet": "LaMoncloa.gob.es. Official site for the President of the Government of Spain and the Council of Ministers.",
    "published": null
  },
  {
    "title": "Private Event: Pedro Sánchez, President of the Government of Spain | AS/COA",
    "url": "https://www.as-coa.org/events/private-event-pedro-sanchez-president-government-spain",
    "snippet": "(L-R) President of the Government of Spain <strong>Pedro Sánchez</strong> and AS/COA President and CEO Susan Segal. (Roey Yohai/Roey Yohai Photography) During his trip to New York for UNGA, the Spanish leader participated in his third AS/COA event.",
    "published": null
  }
]