[
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "En el 2003, durante el gobierno del Presidente Kirchner fue nombrado ministro del interior y en el 2007, durante el gobierno de Cristina Fernández, fue designado <strong>ministro de justicia, seguridad y derechos humanos</strong>.",
    "published": null
  },
  {
    "title": "ANÍBAL FERNÁNDEZ ASUME LA PRESIDENCIA DE LA CAH | Novedades | Confederación Argentina de Hockey",
    "url": "https://www.cahockey.org.ar/noticia/anibal-fernandez-asume-la-presidencia-de-la-cah/3237",
    "snippet": "Aníbal Fernández resultó electo <strong>presidente de la Confederación Argentina de Hockey</strong> luego de la realización de la Asamblea Anual Ordinaria de la institución y ocupará el máximo cargo hasta el año 2025.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "Aníbal Domingo Fernández (born January 9, 1957) is an Argentine <strong>Justicialist Party politician, lawyer, and certified public accountant</strong>. Throughout his career, he has remained a close ally to the former Presidents Néstor Kirchner and Cristina Fernández de Kirchner.",
    "published": "November 15, 2025"
  },
  {
    "title": "The disgraceful Aníbal Fernández was reelected as president of the CAH",
    "url": "https://derechadiario.com.ar/us/argentina/unpresentable-anibal-fernandez-was-reelected-as-president-cah",
    "snippet": "During the Annual Ordinary Assembly, Aníbal Fernández was reelected this Saturday as <strong>president of the Argentine Confederation of Field and Indoor Hockey (CAH) for the period 2025-2029</strong>.",
    "published": "April 27, 2025"
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "He has held many important government jobs under three different presidents. He worked in these roles for more than nine years in total. He was the <strong>Minister of Production, Interior Minister, and Minister of Justice</strong>.",
    "published": null
  }
]