[
  {
    "title": "PM meeting with Belgian Prime Minister Bart de Wever: 12 December 2025 - GOV.UK",
    "url": "https://www.gov.uk/government/news/pm-meeting-with-belgian-prime-minister-bart-de-wever-12-december-2025",
    "snippet": "The Prime Minister also welcomed agreement from Belgium to strengthen efforts to tackle the shared challenge of illegal migration, including greater collaboration on innovative solutions on returns and readmissions and enhanced law enforcement cooperation. They looked forward to speaking again soon. The following links open in a new tab · Share on Facebook (opens in new tab) Share on Twitter (opens in new tab) Published 12 December 2025 ·",
    "published": "4 days ago"
  },
  {
    "title": "2024–2025 Belgian government formation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–2025_Belgian_government_formation",
    "snippet": "<strong>Incumbent Prime Minister Alexander De Croo announced his resignation and his party&#x27;s leader Tom Ongena declared that Open Flemish Liberals and Democrats would not be a part of the next federal government</strong>. Bart De Wever was sworn in as prime minister on 3 February 2025.",
    "published": "November 4, 2025"
  },
  {
    "title": "Belgium ends political deadlock: Agreement on new federal government is near",
    "url": "https://www.belganewsagency.eu/belgium-ends-political-deadlock-agreement-on-new-federal-government-is-near",
    "snippet": "<strong>The five coalition parties reached a consensus on socio-economic reforms, budgetary measures and the structure of the government</strong>. With this crucial agreement in place, De Wever will this evening present the coalition pact to King Philippe, setting ...",
    "published": "January 31, 2025"
  },
  {
    "title": "Belgium set for new government after months of negotiations | Reuters",
    "url": "https://www.reuters.com/world/europe/belgium-set-new-government-after-months-negotiations-vrt-news-2025-01-31/",
    "snippet": "<strong>Political parties in Belgium agreed on Friday to form a new government</strong>, the office of Belgian King Philippe said, ending almost eight months of complicated talks that followed the election victory of Flemish nationalist party N-VA.",
    "published": "January 31, 2025"
  },
  {
    "title": "How Belgium’s new government could begin to reshape its economy | articles | ING Think",
    "url": "https://think.ing.com/articles/belgian-economy-2025-new-government/",
    "snippet": "<strong>Five political parties have reached an agreement to form a government in Belgium following seven months of negotiations</strong>. The government ministers have been sworn in, and new Prime Minister Bart De Wever will make his policy statement in parliament ...",
    "published": "February 3, 2025"
  }
]