[
  {
    "title": "List of Paris Saint-Germain FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Paris_Saint-Germain_FC_managers",
    "snippet": "He led Paris to back-to-back Coupe ... became the first manager to crown PSG champions of France. Since then, <strong>Artur Jorge</strong>, Carlo Ancelotti, Laurent Blanc, Unai Emery, Thomas Tuchel, Mauricio Pochettino, Christophe Galtier and Luis Enrique have ...",
    "published": "6 days ago"
  },
  {
    "title": "Luis Enrique Sets New Record As PSG Head Coach After 55 Ligue 1 Games",
    "url": "https://www.si.com/onsi/soccer/psg/news/luis-enrique-sets-new-record-as-psg-head-coach-after-55-ligue-1-games",
    "snippet": "With the win over Monaco on February 7, Enrique has just lost two Ligue 1 games, winning 38 and drawing 15. Previous managers such as <strong>Carlo Ancelotti</strong>, Thomas Tuchel, Laurent Blanc, and Unai Emery lost more games in that time during their stints ...",
    "published": "February 14, 2025"
  },
  {
    "title": "Editorial – Luis Enrique, analysis of the coach who put PSG on top of the world",
    "url": "https://en.parisfans.fr/editorial-luis-enrique-analysis-of-the-coach-who-put-psg-on-top-of-the-world.html",
    "snippet": "Points/Match · <strong>Unai Emery</strong> 114 matches, 87 wins, 15 draws, and 12 losses ~76% 2.42 points per match · Thomas Tuchel 127 matches, 96 wins, 11 draws, and 20 losses ~76% 2.35 points per match · Laurent Blanc 173 matches, 126 wins, 31 draws, and ...",
    "published": "4 days ago"
  },
  {
    "title": "'Footballing architect' - how Luis Enrique led PSG to Champions League glory - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/c3e5d9gyx04o",
    "snippet": "Away from the pitch, the coach ... Thomas Tuchel, <strong>Mauricio Pochettino</strong> and Christophe Galtier. &quot;Luis Enrique is the leader of the club,&quot; said Laurens. &quot;For a long time it was run by the superstars.",
    "published": "June 1, 2025"
  },
  {
    "title": "Luis Enrique could hold a historic agreement: PSG are reportedly open to offer a surprising renewal offer to the Spanish coach - World Soccer Talk",
    "url": "https://worldsoccertalk.com/news/luis-enrique-could-hold-a-historic-agreement-psg-are-reportedly-open-to-offer-a-surprising-renewal-offer-to-the-spanish-coach/",
    "snippet": "Even though Carlo Ancelotti, Laurent Blanc, and Thomas Tuchel had outstanding tenures with the French side, it was Luis Enrique and <strong>Luis Campos</strong> who truly transformed PSG into a European powerhouse.",
    "published": "1 day ago"
  }
]