[
  {
    "title": "Comcast’s Board Approves Separation of Versant Media Group, Inc. | Comcast Corporation",
    "url": "https://www.cmcsa.com/news-releases/news-release-details/comcasts-board-approves-separation-versant-media-group-inc",
    "snippet": "December 16, 2025 (the “record ... of Versant shares is expected to be completed after the close of trading on Nasdaq on · January 2, 2026 (the “distribution date”). The holders of Comcast Class A common stock entitled to receive the distribution will receive a book-entry account statement or a credit to their brokerage account reflecting their ownership of Versant ...",
    "published": null
  },
  {
    "title": "Versant Corporation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Versant_Corporation",
    "snippet": "In late 2012, after rejecting an offer by UNICOM Systems Inc., Versant Corporation announced it was being acquired by <strong>Actian Corporation</strong>, the commercial developer of Ingres and Vectorwise. The acquisition was promoted using the marketing term big data.",
    "published": "2 weeks ago"
  },
  {
    "title": "Versant - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Versant_(media_company)",
    "snippet": "Bravo will remain under NBCUniversal ownership, due to the network being a major provider of content to Peacock. Universal Kids was also excluded and was eventually closed on March 6, 2025. Initially referred to under the interim name &quot;SpinCo&quot;, on May 6, 2025, it was announced that the company would be known as Versant...",
    "published": "October 8, 2025"
  },
  {
    "title": "VERSANT Spin Transaction | Comcast Corporation",
    "url": "https://www.cmcsa.com/VERSANT-Spin-Transaction",
    "snippet": "The New Name of the Spin-off Was Revealed as VERSANT, Which Speaks to the Company’s Adaptability and Embraces the Opportunity to Shape a New, Modern Media Company · 05/06/25 · | <strong>David Novak</strong> to Chair Comcast’s “SpinCo” · 03/19/25 · | <strong>David Novak</strong> to Chair Comcast’s “SpinCo” ...",
    "published": null
  },
  {
    "title": "Comcast Sets Board of Directors for Versant Spin-Off Company",
    "url": "https://variety.com/2025/tv/news/versant-board-of-directors-comcast-spinoff-company-1236468998/",
    "snippet": "<strong>Comcast CEO Brian Roberts will own one-third of the voting interests in Versant</strong> (as he does in Comcast); however, Roberts will not serve on Versant board or management team. The Versant brands will reach over 65 million U.S.",
    "published": "July 24, 2025"
  }
]