[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The Executive Board has responsibility ... World Athletics Strategic Plan; adopting and monitoring the annual plan and budget; appointing and monitoring the Chief Executive; financial planning and controlling income and expenditure; identifying and managing risks; and developing internal controls, organisational policies, procedures and systems (e.g., human resources, IT). The Executive Board is currently made up of the following nine members...",
    "published": null
  },
  {
    "title": "World Athletics Executive Board re-appoints Arat, Hoffman and Sabharwal as members | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/world-athletics-executive-board-arat-hoffman-sabharwal",
    "snippet": "Along with the three re-appointed members, the Executive Board includes World Athletics <strong>President Sebastian Coe, Senior Vice President Ximena Restrepo, Vice Presidents Raul Chapado, Adille Sumariwalla and Jackson Tuwei, and CEO Jon Ridgeon</strong> ...",
    "published": null
  },
  {
    "title": "World Athletics confirms commission and Executive Board committee members | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/world-athletics-commission-executive-board-committee-members",
    "snippet": "Members are passionate about governance and improving and upholding the highest integrity, promoting better governance and ethical compliance standards, including through the development of educational materials, and ensuring that these are implementable, aligned, and embedded in World Athletics, Area Associations and Member Federations. ... Members: Yuko Arimori (JPN) Sylvia Barlag (NED) Aisha Praught-Leer (JAM) Gerardo Acosta (PAR) Carlota Castrejana (ESP) Dagmar Freitag (GER) Inaki Gomez (CAN) David Grace (AUS) Jinaro Kibet (KEN) Alexander Leung Hong Shun (HKG) Norman Wain (USA) The Executive Board also recently confirmed the appointment of the members to each of the EB Committees for the 2023-2027 period: the Audit &amp; Finance Committee, the Risk Committee and the Remuneration Committee.",
    "published": null
  },
  {
    "title": "World Athletics seeks members for Executive Board and committees | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/world-athletics-seeks-members-executive-board-committees",
    "snippet": "The three Executive Board Committees seeking candidates for membership are: ... For each committee, World Athletics is seeking to fill up to three positions.",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "The World Athletics Council has a total of 26 elected members, comprising <strong>one president, four vice-presidents (one senior), the presidents of the six area associations, two members of the Athletes&#x27; Commission and 13 Council members</strong>.",
    "published": "1 week ago"
  }
]