[
  {
    "title": "Olaf Scholz feiert 10 Jahre Hamburg Open Online University",
    "url": "https://www.shz.de/deutschland-welt/hamburg/artikel/olaf-scholz-feiert-10-jahre-hamburg-open-online-university-49227134",
    "snippet": "Vor zehn Jahren gab Olaf Scholz den Anstoß zur Gründung der <strong>Hamburg Open Online University</strong> - damals noch als Bürgermeister. Mittlerweile ist er Altkan",
    "published": "September 4, 2025"
  },
  {
    "title": "Olaf Scholz",
    "url": "https://www.bruegel.org/people/olaf-scholz",
    "snippet": "Olaf Scholz has been Federal Minister ... grew up in Hamburg and is married. In 1985, he completed his law degree at the <strong>University of Hamburg</strong>....",
    "published": null
  },
  {
    "title": "Bildung: Olaf Scholz feiert 10 Jahre Hamburg Open Online University | DIE ZEIT",
    "url": "https://www.zeit.de/news/2025-09/04/olaf-scholz-feiert-10-jahre-hamburg-open-online-university",
    "snippet": "Viele Menschen müssten zunächst herausfinden, ob akademische Bildung und Wissenschaft überhaupt etwas für sie seien, sagte der SPD-Politiker bei einer Veranstaltung zum zehnjährigen Bestehen der <strong>Hamburg Open Online University</strong> (HOOU).",
    "published": "September 4, 2025"
  },
  {
    "title": "Speech by Federal Chancellor Olaf Scholz at the Charles University in Prague on Monday, 29 August 2022 – European Sources Online",
    "url": "https://www.europeansources.info/record/speech-by-federal-chancellor-olaf-scholz-at-the-charles-university-in-prague-on-monday-29-august-2022/",
    "snippet": "Transcript of the speech delivered by Germany&#x27;s Federal Chancellor Olaf Scholz at the <strong>Charles University</strong> (Czech Republic) on 29 August 2022 · The historical turning point to which German Chancellor Olaf Scholz referred in the wake of Russia&#x27;s invasion in Ukraine earlier in the year is understood ...",
    "published": null
  },
  {
    "title": "Olaf Scholz",
    "url": "https://grokipedia.com/page/Olaf_Scholz",
    "snippet": "Olaf Scholz (born 14 June 1958) ... center-left Social Democratic Party (SPD) since 1975, Scholz studied law at the <strong>University of Hamburg</strong>, earning his degree in 1985, ......",
    "published": null
  }
]