[
  {
    "title": "1.FC Union Berlin - Staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/1-fc-union-berlin/mitarbeiter/verein/89",
    "snippet": "Trainer, Manager und Co.: Diese Statistik listet alle Mitarbeiter, gegliedert nach ihrer Funktion, von dem Verein Union Berlin auf, die aktuell für den Verein arbeiten.",
    "published": null
  },
  {
    "title": "2023–24 1. FC Union Berlin season",
    "url": "https://grokipedia.com/page/2023%E2%80%9324_1._FC_Union_Berlin_season",
    "snippet": "The 2023–24 season for 1. FC Union Berlin began under <strong>head coach Urs Fischer with a core coaching team that included assistant coach Markus Hoffmann</strong>, who focused on tactical preparation and training sessions.",
    "published": null
  },
  {
    "title": "1.FC Union Berlin - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/bundesliga/mitarbeiterhistorie/verein/89/personalie_id/7",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along. Under &quot;Position&quot;, you can select a specific role from the drop-down menu. 2023-07-012023-02-012019-07-012018-11-012018-07-012018-07-012018-02-152011-08-03",
    "published": null
  },
  {
    "title": "Steffen Baumgart is Union's New Head Coach | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/steffen-baumgart-is-unions-new-head-coach-SmIvQK",
    "snippet": "1. FC Union Berlin have signed up <strong>Steffen Baumgart</strong> as new head coach for the men&#x27;s professional team. The 52-year-old will prepare the team for the rest of the Bundesliga season from 2 January.",
    "published": null
  },
  {
    "title": "How Union's co-coaching team collaborates | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/how-unions-co-coaching-team-collaborates-CvSQEZ",
    "snippet": "Those who currently observe the training of the professional men&#x27;s team of 1. FC Union Berlin quickly notice: On the sidelines stands not only head coach Steffen Baumgart. Four assistant coaches accompany the daily work – with different tasks, characters, and competencies, but with a common goal:",
    "published": null
  }
]