[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "<strong>In 2000, following the announcement of a new law that raised the electoral threshold for State Duma elections, Navalny joined the Russian United Democratic Party Yabloko</strong>. According to Navalny, the law was stacked against Yabloko and Union of Right Forces, and he decided to join, even though ...",
    "published": "1 week ago"
  },
  {
    "title": "The Two Layers of Alexei Navalny | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/two-layers-alexei-navalny",
    "snippet": "His first political home in the early 2000s was the Yabloko party, <strong>founded in 1993 on the ideals that blended traditional European social democracy with elements of economic liberalism</strong>.",
    "published": null
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "<strong>Navalny joined the Russian United Democratic Party</strong>, also known as “Yabloko.” It was immediately clear to him that the new law was directed at Yabloko, encouraging him to take a more active role in the party, despite him claiming in an interview ...",
    "published": null
  },
  {
    "title": "‘We Are Not Revolutionaries’: Russia’s Last Liberal Party Operates Under No Illusions - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/07/06/we-are-not-revolutionaries-russias-last-liberal-party-operates-under-no-illusions-a74440",
    "snippet": "<strong>Expelled from Yabloko in 2007</strong> for attending an ultranationalist, anti-immigration demonstration and agitating against the party’s founder and informal leader Grigory Yavlinsky, Navalny won the lasting enmity of his former colleagues.",
    "published": "October 22, 2025"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice ... of the Russian Federation. <strong>In 2000, while he was still a student, Navalny joined Yabloko, a political party that promoted liberal democracy and a market economy</strong>....",
    "published": "March 7, 2023"
  }
]