[
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Fabien Galthié (French pronunciation: [fabjɛ̃ ɡaltie]; born 20 March 1969) is a French rugby union coach and former player, currently the head coach of the France national team. His usual position was at scrum-half. He played much of his club rugby for Colomiers, and later on in his career, ...",
    "published": "3 weeks ago"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Appointed in December 2017 after a year with Bordeaux Begles, <strong>Jacques Brunel</strong>’s first game as France rugby coach saw his side lose 15-13 to Ireland following a last-minute Johnny Sexton drop goal.",
    "published": "May 30, 2025"
  },
  {
    "title": "Fabien Galthié | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/11932",
    "snippet": "Galthié is a former French Rugby union scrum-half. He played for Colomiers and Stade Francais. Galthié won 64 caps for France, including 4 Rugby World Cup appearances, as well as captaining France at the 2003 World Cup. Former French national coach Ber…",
    "published": null
  },
  {
    "title": "Fabien Galthié, the perfectionist masterminding France's Rugby World Cup tilt",
    "url": "https://www.france24.com/en/sport/20230921-fabien-galthi%C3%A9-the-perfectionist-masterminding-france-s-rugby-world-cup-tilt",
    "snippet": "In his three years at the helm, the former scrum-half and captain has turned Les Bleus into a ruthless winning machine, finding a worthy successor in skipper <strong>Antoine Dupont</strong>. ... Fabien Galthié has reached an impressive tally of 33 wins out ...",
    "published": "September 21, 2023"
  },
  {
    "title": "Fabien Galthie: Ten things you should know about the France head coach",
    "url": "https://www.rugbyworld.com/countries/france-countries/fabien-galthie-ten-things-you-should-know-about-the-france-head-coach-134810",
    "snippet": "3. Overall Galthie played in 64 Tests for France between 1991 and 2003, scoring ten tries during his international career. 4. Galthie started coaching in 2004 with his first post at his former team <strong>Stade Francais</strong>.",
    "published": "January 12, 2024"
  }
]