[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The president wields high power in the legislative branch of government compared to other European heads of state. They may disband the parliament and call for early elections. This power has only been used twice to date, first by president <strong>Viktor Yushchenko</strong> in 2007, and by president Volodymyr ...",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "Every president of Ukraine except for Volodymyr Zelenskyy has been a People&#x27;s Deputy of the Verkhovna Rada prior to their election, with <strong>Kuchma, Yushchenko, and Yanukovych</strong> all previously serving as Prime Minister and Kravchuk as well as acting ...",
    "published": "October 25, 2025"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "Zelenskyy announced his candidacy in the 2019 presidential election on the evening of 31 December 2018, alongside the New Year&#x27;s Eve address of then-president <strong>Petro Poroshenko</strong> on the TV channel 1+1. A political outsider, Zelenskyy positioned himself as an anti-establishment and anti-corruption ...",
    "published": "1 day ago"
  },
  {
    "title": "Tracking Ukraine's Former Presidents During The War: Stepping Up Or Ducking Out? - Worldcrunch",
    "url": "https://worldcrunch.com/focus/russia-ukraine-war/former-ukraine-president/",
    "snippet": "Former Presidents of Ukraine <strong>Viktor Yushchenko, Petro Poroshenko, and Leonid Kuchma</strong> take part in the farewell ceremony after the death of the first president of independent Ukraine, Leonid Kravchuk.",
    "published": "May 21, 2025"
  },
  {
    "title": "List of Presidents of Ukraine (1991 - 2022)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-presidents-of-ukraine-1646021751-1",
    "snippet": "In August 1991, after the proclamation of Ukrainian independence from the Soviet Union, the title was changed to the &quot;President of Ukraine&quot;. On 1 December 1991, the first election of the President of Ukraine took place and was won by <strong>Leonid Kravchuk</strong>.",
    "published": "February 28, 2022"
  }
]