[
  {
    "title": "Tele2 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tele2",
    "snippet": "Tele2 AB is <strong>a provider of mobile and fixed connectivity, telephony, data network services, TV, streaming and global Internet of things services, to consumers and enterprises</strong>. It is headquartered in Kista Science City, Stockholm, Sweden. It is a major mobile network operator in Sweden, Estonia, ...",
    "published": "November 2, 2025"
  },
  {
    "title": "Tele2 AB Company Profile - Overview - GlobalData",
    "url": "https://www.globaldata.com/company-profile/tele2-ab/",
    "snippet": "Gain competitive edge with triggers that tell you when and how to engage with Tele2 AB. ... Tele2 AB (Tele2) is <strong>a provider of integrated telecommunication services</strong>. The company offers mobile and fixed connectivity, telephony, data network services, TV, streaming, and global IoT solutions.",
    "published": null
  },
  {
    "title": "Tele2 AB (publ) (TEL2-A.ST) Company Profile & Facts - Yahoo Finance",
    "url": "https://finance.yahoo.com/quote/TEL2-A.ST/profile/",
    "snippet": "Tele2 AB (publ) <strong>provides fixed and mobile connectivity, handset related data services, and entertainment services in Sweden, Lithuania, Latvia, and Estonia</strong>. The company offers mobile telephony and data, fixed broadband, fixed telephony, switch ...",
    "published": null
  },
  {
    "title": "Tele2 AB Company Profile | Kista, Stockholm | Competitors, Financials & Contacts - Dun & Bradstreet",
    "url": "https://www.dnb.com/business-directory/company-profiles.tele2_ab.4497217481c090e92612ec7641f52687.html",
    "snippet": "Home/Business Directory/Administrative And Support And Waste Management And Remediation Services/Administrative And Support Services/Business Support Services/Sweden/Stockholm/Kista/Tele2 AB ... Company Description: <strong>Callers, clickers, and cable aficionados connect with Tele2.</strong>",
    "published": null
  },
  {
    "title": "Tele2 AB (publ) (TEL2-B.ST) Company Profile & Facts - Yahoo Finance",
    "url": "https://finance.yahoo.com/quote/TEL2-B.ST/profile/",
    "snippet": "Tele2 AB (publ) <strong>provides fixed and mobile connectivity and entertainment services in Sweden, Lithuania, Latvia, and Estonia</strong>. The company offers handset related data services, linear and streaming services, mobile telephony and data, fixed broadband ...",
    "published": null
  }
]