[
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "Ajax would end the season second to PSV, despite being nine points clear of their rivals with five matches to go. Due to the late collapse that cost them the title and escalating tensions over transfers, tactics and finances, Farioli decided to leave Ajax on 19 May 2025.",
    "published": "2 weeks ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "Date: 31.05.2025 · Photographer: AFC Ajax · #Heitinga · Heitinga (Alphen aan den Rijn, November 15, 1983) has spent the past two seasons working in the English Premier League as an assistant coach at West Ham United and Liverpool. Before his move to England in the summer of 2023, the former Ajax player served as interim head coach of Ajax 1 for several months.",
    "published": null
  },
  {
    "title": "2024–25 AFC Ajax season - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–25_AFC_Ajax_season",
    "snippet": "^ Originally loan agreed until 30 June 2025, but terminated earlier due to Ünüvar&#x27;s transfer to FC Twente. On 23 May, Ajax signed the contract with new manager <strong>Francesco Farioli</strong>. His new assistant managers will be Daniele Cavalletto, Dave Vos and Felipe Sanchez Mateos.",
    "published": "September 19, 2025"
  },
  {
    "title": "Francesco Farioli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Francesco_Farioli",
    "snippet": "Taking charge following a disappointing 2023–24 campaign, Farioli sought to stabilise the squad by implementing a disciplined defensive structure similar to that of his previous tenure at Nice. His emphasis on organisation, tactical flexibility, and youth development contributed to Ajax holding the best defensive record in the league and reaching first place in the 2024–25 Eredivisie by March 2025.",
    "published": "20 hours ago"
  },
  {
    "title": "Ajax hires Liverpool assistant John Heitinga as new head coach | AP News",
    "url": "https://apnews.com/article/ajax-coach-heitinga-liverpool-c894f54c8f6ecf0949d3962a5d3e353e",
    "snippet": "Ajax has hired <strong>John Heitinga</strong> as head coach to replace Francesco Farioli nearly two weeks after the Italian resigned following the team’s late-season collapse.",
    "published": "May 31, 2025"
  }
]