[
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "... In Warsaw, President of Ukraine <strong>Volodymyr Zelenskyy</strong> held a meeting with President of Poland Karol Nawrocki. This was the first official visit by a foreign leader to the incumbent Polish President since his inauguration in August this year.",
    "published": "3 days ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The current president is <strong>Volodymyr Zelenskyy</strong>, who took the oath of office on 20 May 2019. Due to martial law, elections in the country have been suspended. The president is also the supreme commander-in-chief of the Ukrainian Armed Forces, and heads the National Security and Defence Council, ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Volodymyr Zelensky’s biography — Official web site of the ...",
    "url": "https://www.president.gov.ua/en/president",
    "snippet": "<strong>Volodymyr Zelensky</strong>’s biography on Official web site of the President of Ukraine",
    "published": "1 day ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "Zelenskyy appointed <strong>Andriy Bohdan</strong> as head of the Presidential Administration of Ukraine. Before this, Bohdan had been the lawyer of Ukrainian oligarch Ihor Kolomoyskyi. Under the rules of lustration in Ukraine, introduced in 2014 following ...",
    "published": "4 days ago"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "Early presidential elections were held on 25 May 2014 and won by <strong>Petro Poroshenko</strong>; Poroshenko was inaugurated as the fifth president on 7 June 2014. On 18 June 2015, Yanukovych was officially deprived of the title of President of Ukraine.",
    "published": "6 days ago"
  }
]