[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Jesse Ventura (born James George Janos; July 15, 1951) is an American politician, political commentator, actor, media personality, and retired professional wrestler. After achieving fame in the World Wrestling Federation (WWF, now WWE), he served as the 38th governor of Minnesota from 1999 to 2003.",
    "published": "2 days ago"
  },
  {
    "title": "Jesse Ventura | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/jesse-ventura",
    "snippet": "During the 1990s, Ventura became increasingly involved in state politics. <strong>He joined the Minnesota Independence Party (later affiliated with H. Ross Perot as the Minnesota Reform Party) and supported MIP candidate Dean Barkley for the US Senate</strong>.",
    "published": null
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Jesse Ventura was the Governor of Minnesota. Ventura assumed office on January 8, 1999.",
    "published": null
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th Governor of Minnesota on November 3, 1998 defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He served as Governor for one term. Shocking the political establishment, Ventura became the only <strong>Reform Party</strong> candidate to ...",
    "published": null
  },
  {
    "title": "Jesse Ventura – Bio, Birthday, Age, Video | Cameo",
    "url": "https://www.cameo.com/govjventura",
    "snippet": "From honoring retiring lawyers to wishing fellow veterans a happy birthday, Jesse takes requests to the next level, often putting his own unique spin on things. And for the conspiracy theorists out there, he&#x27;s always happy to share his thoughts on government cover-ups and extraterrestrial activity. Just don&#x27;t expect him to hold back - when Jesse Ventura speaks, he tells it like it is!",
    "published": null
  }
]