[
  {
    "title": "Alexander De Croo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_De_Croo",
    "snippet": "Alexander De Croo was born on 3 November 1975 in Vilvoorde in Flemish Brabant, Belgium, and was one of two children of the politician and Minister of State Herman De Croo and his wife Françoise Desguin. In 1993, he attended the <strong>Vrije Universiteit Brussel</strong> where he graduated in 1998 in Business ...",
    "published": "1 week ago"
  },
  {
    "title": "From Business Leader to Belgian Prime Minister | Spring/Summer 2021 Kellogg Magazine",
    "url": "https://www.kellogg.northwestern.edu/magazine/features/spring-summer-2021/from-business-leader-to-belgian-prime-minister.aspx",
    "snippet": "As a world leader, Alexander De Croo ’04 is applying the lessons he learned at Kellogg and as an entrepreneur",
    "published": null
  },
  {
    "title": "Hubert Pierlot - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hubert_Pierlot",
    "snippet": "Hubert Pierlot was educated in ... later attended the prestigious <strong>Jesuit Collège Saint-Michel secondary school</strong> in Brussels. He studied at the Catholic University of Louvain where he received a licence in Political Science and a doctorate in Law. During his early life, he travelled to the United ...",
    "published": "October 22, 2025"
  },
  {
    "title": "Prime Minister of Belgium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Belgium",
    "snippet": "The first head of government in Belgian history was Henri van der Noot in 1790, during the brief existence of the United Belgian States. Although Leaders of Government (French: Chefs de Cabinet) had been appointed since Belgium&#x27;s independence, it was not until after World War I that the modern role of prime minister began to take shape.",
    "published": "September 11, 2025"
  },
  {
    "title": "Biography of Herman Van Rompuy - Consilium",
    "url": "https://www.consilium.europa.eu/en/european-council/former-euco-presidents/herman-van-rompuy/biography/",
    "snippet": "1980-1987 Lecturer <strong>Handelshogeschool Antwerpen</strong> 1978-1980 Adviser Cabinet Minister of Finance G. Geens 1975-1978 Adviser Cabinet Prime Minister L. Tindemans 1972-1975 Attaché Internal Affairs National Bank of Belgium",
    "published": null
  }
]