[
  {
    "title": "Mike Downey (producer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mike_Downey_(producer)",
    "snippet": "Michael Downey OBE is an Irish-British film producer. He is the co-founder and CEO of Film and Music Entertainment and as of 2020 the Chairman of the European Film Academy. Downey was born in Devon, England, the son of Brigid Downey (née Flood) and Thomas Downey, who were economic migrants ...",
    "published": "July 19, 2025"
  },
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "In 2019 Mike took over the chairmanship and he was joined by <strong>Agnieszka Holland</strong> as President 2020 taking over from Wim Wenders. ... The European Film Awards have been presented annually since 1988 by the European Film Academy to recognize excellence ...",
    "published": null
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "Solomon is no newcomer to the Academy board, since she served for 6 years as deputy chair herself alongside outgoing chair Mike Downey, and was a regular board member before. <strong>Leontine Petit</strong> has been a regular board member since 2021.",
    "published": "3 weeks ago"
  },
  {
    "title": "Biography — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/biography/",
    "snippet": "An EFA member for almost a quarter of a century and board member of the European Film Academy for nearly two decades years Mike served three 2 year terms as deputy Chairman alongside chair Agnieszka Holland, president Wim Wenders and co-deputy Antonio Saura. In 2020 he was elected to become Chairman of the European Film Academy.",
    "published": null
  },
  {
    "title": "Taunton film producer, and Chairman of the Board of the European Film Academy, has been awarded an OBE",
    "url": "https://www.somersetcountygazette.co.uk/news/19368833.taunton-film-producer-mike-downey-awarded-obe/",
    "snippet": "&quot;Even more importantly, Mike is ... its impact and helps people who need it most.” · Along with producing partner <strong>Samantha Taylor</strong>, Mr Downey was the founder of Film and Music Entertainment (F&amp;ME) as part of an IPO on ...",
    "published": "June 12, 2021"
  }
]