[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Die_Linke",
    "snippet": "Through the PDS, the party is the direct descendant of the Marxist–Leninist ruling party of former East Germany, the Socialist Unity Party of Germany (SED). Since October 2024, Die Linke&#x27;s co-chairpersons have been <strong>Ines Schwerdtner and Jan van Aken</strong>. The party holds 64 seats out of 630 in ...",
    "published": "January 7, 2007"
  },
  {
    "title": "The Improbable Resurgence of Die Linke",
    "url": "https://jacobin.com/2025/02/die-linke-germany-renewal-strategy/",
    "snippet": "But becoming a party of the working class will take a lot more than a last-minute turnaround at the polls. <strong>Jan van Aken</strong> (L), federal chairman of Die Linke, and member of the Bundestag Gregor Gysi speak at a press conference in Berlin on February ...",
    "published": null
  },
  {
    "title": "The Left faction (Bundestag) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Left_faction_(Bundestag)",
    "snippet": "On 14 November 2023, the parliamentary ... on 6 December 2023. The reason was the resignation of ten parliamentary group members around Sahra Wagenknecht as part of the founding of the Sahra Wagenknecht alliance. With its remaining 28 MPs, Die Linke could no longer form a parliamentary group in the Bundestag, as this would have required at least 37 MPs (5% of parliamentarians). The Left group was then formed. On 25 February 2025, two days ...",
    "published": "July 13, 2025"
  },
  {
    "title": "German elections: The Left party advocates for 'fair immigration society', right to asylum - InfoMigrants",
    "url": "https://www.infomigrants.net/en/post/62864/german-elections-the-left-party-advocates-for-fair-immigration-society-right-to-asylum",
    "snippet": "<strong>Jan van Aken</strong>, federal chairman of the party Die Linke, and Heidi Reichinnek, lead candidate of Die Linke for the 2025 federal election, stand on stage during the party&#x27;s federal convention for the 2025 parliamentary election | Photo: picture-alliance",
    "published": null
  },
  {
    "title": "Die Linke / The Left Party (Germany) - The Democratic Socialist Project",
    "url": "https://democratic-socialist.net/die-linke-the-left-germany/",
    "snippet": "Growth accelerated all throughout the 2025 election campaign, with membership numbers going from about 60,000 in January 20252 to 112,000 in May. <strong>Heidi Reichinnek</strong>, the party’s leader in the Bundestag, became a social media star, playing an important role in the youth-centered membership growth.",
    "published": "September 18, 2025"
  }
]