[
  {
    "title": "Political Leadership for Democratic Transition in Kyrgyzstan | Club de Madrid",
    "url": "https://clubmadrid.org/political-leadership-for-democratic-transition-in-kyrgyzstan/",
    "snippet": "During a meeting with President Otunbaeva, the current political situation in the country, reconstruction of southern Kyrgyzstan after last year’s inter-ethnic clashes, as well as the oncoming presidential elections were discussed. The President underlined the importance of reforming civil service and the judiciary, and welcomed the Club de Madrid’s expertise in these areas.",
    "published": "April 9, 2011"
  },
  {
    "title": "Kyrgyzstan is losing its status as Central Asia’s only democracy",
    "url": "https://www.economist.com/asia/2025/12/04/kyrgyzstan-is-losing-its-status-as-central-asias-only-democracy",
    "snippet": "KYRGYZSTAN USED to be an exception in Central Asia: the sole democracy in a region run by strongmen, albeit a flawed one. That is rapidly ceasing to be the case. It regressed a bit closer to the mean on November 30th, when a parliamentary election produced victory for candidates loyal to Sadyr Japarov, the increasingly authoritarian president.",
    "published": "2 weeks ago"
  },
  {
    "title": "BTI 2024 Kyrgyzstan Country Report: BTI 2024",
    "url": "https://bti-project.org/en/reports/country-report/KGZ",
    "snippet": "Public approval of democracy in Kyrgyzstan remains stable and moderately positive. However, following the overthrow of the previous government in late 2020 and the rise to power of a new leadership that advocated for a strong government centered on the presidency, public approval of democracy could be assumed to have declined.",
    "published": null
  },
  {
    "title": "(PDF) On transition and revolution in Kyrgyzstan",
    "url": "https://www.researchgate.net/publication/44096425_On_transition_and_revolution_in_Kyrgyzstan",
    "snippet": "In contrast with the previous Kyrgyz revolutions, <strong>the October 2020 revolution failed to establish clear leadership from among the established elites and was chaotic</strong>. In the paper we challenge the existing scholarship on protests in Central Asia ...",
    "published": "November 1, 2005"
  },
  {
    "title": "The Declining Role of Political Elites in Revolutions in Post-communist Eurasia: The October Revolution in Kyrgyzstan",
    "url": "https://www.researchgate.net/publication/372988093_The_Declining_Role_of_Political_Elites_in_Revolutions_in_Post-communist_Eurasia_The_October_Revolution_in_Kyrgyzstan",
    "snippet": "The question remains, who knows where the money goes? ... ... <strong>The 2020 Kyrgyz revolution led to President Sooronbai Jeenbekov&#x27;s resignation, allowing Sadyrbek Japarov, previously in prison, to assume power</strong>.",
    "published": "July 14, 2023"
  }
]