[
  {
    "title": "Princeton University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Princeton_University",
    "snippet": "Princeton University is a private Ivy League research university in Princeton, New Jersey, United States. <strong>Founded in 1746 in Elizabeth as the College of New Jersey</strong>, Princeton is the fourth-oldest institution of higher education in the United States and one of the nine colonial colleges chartered ...",
    "published": "September 10, 2001"
  },
  {
    "title": "History of Princeton University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Princeton_University",
    "snippet": "Princeton University was <strong>founded at Elizabeth, New Jersey, in 1746</strong> as the College of New Jersey.",
    "published": "September 15, 2024"
  },
  {
    "title": "The Early Years | Princetoniana - Princeton University",
    "url": "https://princetoniana.princeton.edu/history/early-years",
    "snippet": "Courtesy of Princeton University Archives The founding of Princeton, originally the College of New Jersey, followed the Great Awakening, the series of religious revivals that swept the English colonies in America in the 18th century. On <strong>October 22, 1746</strong>, which is celebrated as the day of ...",
    "published": null
  },
  {
    "title": "Princeton University | History, Location, & Notable Alumni | Britannica",
    "url": "https://www.britannica.com/topic/Princeton-University",
    "snippet": "Princeton University was <strong>originally founded as the College of New Jersey in Elizabeth, New Jersey, in 1746</strong> and moved to nearby Newark in 1747. Its inception was a direct outgrowth of the Great Awakening, a religious movement to revitalize ...",
    "published": "July 20, 1998"
  },
  {
    "title": "Founding of Princeton 1746",
    "url": "https://www.ancestry.com/historical-insights/social-religion/education/founding-princeton-1746",
    "snippet": "<strong>In 1746, Princeton University was founded when the College of New Jersey moved to Princeton and was renamed after the town</strong>. Four local landowners helped finance the move, donating over 200 acres for what would become the fourth university in British North America.",
    "published": null
  }
]