[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The Executive Board has responsibility for all decisions related to the business of World Athletics including developing and reviewing the World Athletics Strategic Plan; adopting and monitoring the annual plan and budget; appointing and monitoring the Chief Executive; financial planning and controlling income and expenditure; identifying and managing risks; and developing internal controls, organisational policies, procedures and systems (e.g., human resources, IT). The Executive Board is currently made up of the following nine members:",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "Included in its charge is the ... of athletics competitions, including the World Athletics Championships. The organisation&#x27;s current president is <strong>Sebastian Coe</strong> of the United Kingdom, who was elected to the four-year position in 2015, and re-elected twice in 2019 and 2023 for ...",
    "published": "1 week ago"
  },
  {
    "title": "Coe re-elected and will preside over historic gender equal Council | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/sebastian-coe-president-congress-2023-gender-equal-council",
    "snippet": "World Athletics President <strong>Sebastian Coe</strong> was elected for a third term at the 54th World Athletics Congress in Budapest on Thursday (17). Ximena Restrepo was re-elected as a Vice President and will be joined by newly elected Vice Presidents Raul ...",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "He was the director of the Dutch Olympic Committee between 1965 and 1970 but retained an extensive involvement with athletics, becoming the European Athletics Association president upon its formation in 1970 until 1976, when he was elected as the third IAAF president. Curiously, at the age of 73, he was two years older than the man he was succeeding but Paulen was active in addressing many of the relevant issues of the changing times. The first IAAF World Cup in 1977 was contested during his brief presidency and he set in motion events that lead to the first IAAF World Championships in 1983.",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Council has the powers and responsibilities to develop the World Plan for athletics and approve and review the World Athletics Strategic Plan; adopt, amend and repeal rules and regulations; decide all matters relating to the competition calendar and World Athletics competitions, world records, bidding procedures and selection of host cities; develop policies for training and appointing technical officials; review and monitor the global athletics development programme; appoint Commissions and Working Groups and make recommendations to Congress on membership of various independent panels and bodies of World Athletics. ... Chaired British Government Sports Honours Committee (2010-2018) and served within the Cabinet Office as Legacy Ambassador for the London 2012 Games (2012-2017)",
    "published": null
  }
]