[
  {
    "title": "History of ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_ESPN",
    "snippet": "ESPN is an American-based global cable and satellite television channel that focuses on sports-related programming. ESPN was <strong>founded by Bill Rasmussen, his son Scott Rasmussen, and 43 year old eye doctor and Aetna insurance agent Ed Eagan</strong>. Bill, who had an affinity with sports for much of his ...",
    "published": "November 11, 2025"
  },
  {
    "title": "ESPN Milestones - ESPN Press Room U.S.",
    "url": "https://espnpressroom.com/us/espn-milestones/",
    "snippet": "<strong>August 16, 1978 An around-the-clock sports network via satellite is conceived by Bill Rasmussen and his son, Scott</strong>. August 17, 1978 Property in Bristol, Conn., recommended and plans for construction for the base of operations is devised. February 22, 1979 Getty Oil Company agrees in principle ...",
    "published": "August 21, 2025"
  },
  {
    "title": "ESPN Inc | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/sports-and-leisure/espn-inc",
    "snippet": "<strong>Founded in 1979</strong> as the world’s first 24-hour all-sports cable network, ESPN has grown into a major player in the sports entertainment industry, with the Walt Disney Company holding an 80% stake and Hearst Communications owning 20%. Over the ...",
    "published": null
  },
  {
    "title": "ESPN - Serving Sports Fans. Anytime. Anywhere.",
    "url": "https://www.espn.com/",
    "snippet": "Visit ESPN for live scores, highlights and sports news. Stream exclusive games on ESPN and play fantasy sports.",
    "published": "1 day ago"
  },
  {
    "title": "ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ESPN",
    "snippet": "ESPN (<strong>an initialism of their original name, Entertainment and Sports Programming Network until 1985)</strong> is an American basic cable sports broadcasting network and the flagship property of ESPN Inc., a joint venture of the Walt Disney Company (80% ...",
    "published": "4 days ago"
  }
]