[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "In February 2017, Larive was appointed <strong>interim provost and executive vice chancellor</strong> for University of California, Riverside, and the appointment was made permanent in October.",
    "published": "July 15, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Ella comenzó su carrera académica ... Larive es una <strong>graduada universitaria de primera generación, que obtuvo su licenciatura en ciencias en la Universidad Estatal de Dakota del Sur y su maestría en la Universidad de Purdue, ambos diplomas en química</strong>....",
    "published": null
  },
  {
    "title": "UC Riverside Provost Cynthia K. Larive to become UC Santa Cruz’s 11th chancellor | University of California",
    "url": "https://www.universityofcalifornia.edu/press-room/uc-riverside-provost-cynthia-k-larive-become-uc-santa-cruzs-11th-chancellor",
    "snippet": "Currently the <strong>provost and executive vice chancellor</strong> at UC Riverside, Larive has served the UC community for nearly a decade and a half as a faculty member, administrator and leader.",
    "published": "November 8, 2021"
  },
  {
    "title": "Cynthia Larive - Chancellor - Univerisity of California Santa Cruz | LinkedIn",
    "url": "https://www.linkedin.com/in/cynthia-larive-83218a8",
    "snippet": "<strong>Professor at University of California, Riverside</strong> · Riverside, CA · 2 others named Cynthia Larive are on LinkedIn See others named Cynthia Larive · See all courses · Include this LinkedIn profile on other websites · Chancellor at Univerisity ...",
    "published": null
  },
  {
    "title": "Provost Cynthia K. Larive | Inside UCR",
    "url": "https://insideucr.ucr.edu/tag/provost-cynthia-k-larive",
    "snippet": "UC Riverside on Facebook UC Riverside on X UC Riverside on YouTube UC Riverside on Instagram UC Riverside on LinkedIn · When Cynthia K. Larive joined UC Riverside as a <strong>bioanalytical chemistry professor</strong> in 2005, she had no aspirations of an administrative role.",
    "published": null
  }
]