[
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "At the urging of Prime Minister Theresa May and Chancellor of the Exchequer Philip Hammond, Carney agreed to extend his term while the UK undertook Brexit negotiations, but only for one year. He further agreed to an additional seven months in September 2018, to &quot;support a smooth exit&quot; from the EU, and to a further two months for an orderly transition ...",
    "published": "1 day ago"
  },
  {
    "title": "Another Conservative crosses the floor, bringing Liberals 1 MP shy of majority | CBC News",
    "url": "https://www.cbc.ca/news/politics/mp-crosses-floor-to-liberals-9.7012767",
    "snippet": "Prime Minister Mark Carney raises the hand of Michael Ma, who crossed the floor from the Conservatives to the Liberals, at the Liberal caucus holiday party on Thursday.",
    "published": "5 days ago"
  },
  {
    "title": "Surprise defection leaves Carney’s Liberals just one seat short of majority - POLITICO",
    "url": "https://www.politico.com/news/2025/12/11/carney-short-liberal-majority-00688193",
    "snippet": "OTTAWA — Canadian Prime Minister Mark Carney is just one seat short of a majority government after <strong>a Toronto Conservative lawmaker quit the party Thursday afternoon to join the Liberals</strong>.",
    "published": "5 days ago"
  },
  {
    "title": "Who is Liberal leader Mark Carney, Canada's new prime minister?",
    "url": "https://www.bbc.com/news/articles/c3911lv1pzko",
    "snippet": "Unlike most PM-hopefuls, Carney had never held political office. Still, <strong>he handily won the Liberal Party contest to replace outgoing Prime Minister Justin Trudeau in early March</strong>, and has now been elected by the people.",
    "published": "April 29, 2025"
  },
  {
    "title": "Canada's next PM Mark Carney vows transition will be 'seamless and quick' after meeting Trudeau - The Times of India",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/mark-carney-vows-seamless-and-quick-transition-to-canadas-new-government-after-meeting-trudeau/articleshow/118860575.cms",
    "snippet": "Canada&#x27;s Prime Minister designate Mark Carney on Monday said that <strong>he will assume leadership from Justin Trudeau</strong> following his decisive victory in the Liberal Party&#x27;s leadership contest.",
    "published": "March 10, 2025"
  }
]