[
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "Throughout his career, he has remained a close ally to the former Presidents Néstor Kirchner and Cristina Fernández de Kirchner. Between 2021 and 2023, he served as <strong>Argentina&#x27;s Minister of Security in the cabinet of President Alberto Fernández</strong>. He has held several cabinet positions under ...",
    "published": "November 15, 2025"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Durante el gobierno del Presidente Duhalde, Fernández fue designado <strong>secretario de Gobierno de la Provincia de Buenos Aires, secretario general de la Presidencia y ministro de producción</strong>.",
    "published": null
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "He worked in these roles for more than nine years in total. He was the <strong>Minister of Production, Interior Minister, and Minister of Justice</strong>. He also served as the President&#x27;s Cabinet Chief.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/anibal-fernandez/profil/trainer/22238",
    "snippet": "Without Club Last position: President Quilmes AC Date left: Jun 30, 2016 ... No information available. This is an overview of the career of a manager.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Age, Family, Bio | Famous Birthdays",
    "url": "https://www.famousbirthdays.com/people/anibal-fernandez.html",
    "snippet": "He has served in several positions within the Argentinian government including <strong>Minister of Production, Minister of Justice, and Interior Minister</strong>. His career in politics began in public service when he started working for the municipalities ...",
    "published": null
  }
]