[
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "They hired <strong>Francesco Farioli</strong> as new head coach, the first foreign coach since 1998. Under his leadership, Ajax reached the league phase of the Europa League, where it finished eleventh. On 9 February 2025, Ajax finished the weekend on the first place for the first time since November 2022.",
    "published": "2 weeks ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "Ajax has reached an agreement with <strong>John Heitinga</strong> regarding the coach’s move to Amsterdam. Heitinga is signing a contract with Ajax as head coach until June 30, 2027. Marcel Keizer will be his assistant and is signing a contract of the same ...",
    "published": null
  },
  {
    "title": "r/soccer on Reddit: [VI] Fred Grim will be Ajax first team head coach until at least the winter break",
    "url": "https://www.reddit.com/r/soccer/comments/1p2uetc/vi_fred_grim_will_be_ajax_first_team_head_coach/",
    "snippet": "Ajax coach <strong>John Heitinga</strong>: &quot;Galatasaray is a strong team. They have very fast players. You must not give this team too much space. We need to play very tightly. We must not lose the ball.",
    "published": "4 weeks ago"
  },
  {
    "title": "Ajax hires Liverpool assistant John Heitinga as new head coach | AP News",
    "url": "https://apnews.com/article/ajax-coach-heitinga-liverpool-c894f54c8f6ecf0949d3962a5d3e353e",
    "snippet": "Ajax has hired <strong>John Heitinga</strong> as head coach to replace Francesco Farioli nearly two weeks after the Italian resigned following the team’s late-season collapse.",
    "published": "May 31, 2025"
  },
  {
    "title": "Francesco Farioli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Francesco_Farioli",
    "snippet": "Taking charge following a disappointing 2023–24 campaign, Farioli sought to stabilise the squad by implementing a disciplined defensive structure similar to that of his previous tenure at Nice. His emphasis on organisation, tactical flexibility, and youth development contributed to Ajax holding the best defensive record in the league and reaching first place in the 2024–25 Eredivisie by March 2025.",
    "published": "20 hours ago"
  }
]