[
  {
    "title": "Droupadi Murmu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Droupadi_Murmu",
    "snippet": "On 9 March 2025, she inaugurated the second edition of Vividhta Ka Amrit Mahotsav at Rashtrapati Bhavan, a cultural festival celebrating South Indian traditions, crafts, and cuisines. The event aimed to promote unity in diversity and local artisanship. After the inauguration of C. P. Radhakrishnan as the new vice president...",
    "published": "2 days ago"
  },
  {
    "title": "Home | President of India",
    "url": "https://www.presidentofindia.gov.in/",
    "snippet": "DROUPADI MURMU ON THE OCCASION OF INAUGURATION OF THE 1066TH… · 14 Dec 25 भारत की राष्ट्रपति, <strong>श्रीमती द्रौपदी मुर्मु</strong> का राष्ट्रीय ऊर्जा संरक्षण दिवस समारोह ...",
    "published": "1 day ago"
  },
  {
    "title": "President of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_India",
    "snippet": "The president of India (ISO: Bhārata kē Rāṣṭrapati) is the head of state of the Republic of India. The president is the nominal head of the executive, the first citizen of the country, and the supreme commander of the Indian Armed Forces. <strong>Droupadi Murmu</strong> is the 15th and current president, ...",
    "published": "2 days ago"
  },
  {
    "title": "President of India | Facebook",
    "url": "https://www.facebook.com/PresidentofIndia/",
    "snippet": "President of India. 6,393,056 likes · 78,816 talking about this. Official Facebook page of <strong>Smt Droupadi Murmu</strong>, President of India.",
    "published": null
  },
  {
    "title": "Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/",
    "snippet": "<strong>Shri Narendra Modi</strong> was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership.",
    "published": "20 hours ago"
  }
]