[
  {
    "title": "2025 Portuguese legislative election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Portuguese_legislative_election",
    "snippet": "A leadership convention was scheduled for 1 and 2 February 2025, with party leader <strong>Rui Rocha</strong> running for another term. After the withdrawal of Mayan Gonçalves, Rui Malheiro, a party councillor, announced his bid against Rocha. On 2 February 2025, during the party&#x27;s convention held in Loures ...",
    "published": "1 week ago"
  },
  {
    "title": "Next Portuguese legislative election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Portuguese_legislative_election",
    "snippet": "After achieving a disappointing result and finishing in third place, then secretary-general Pedro Nuno Santos resigned on election night, 18 May 2025, leaving the party&#x27;s president <strong>Carlos César</strong> as interim leader. A leadership election was ultimately called for 27 and 28 June 2025.",
    "published": "4 days ago"
  },
  {
    "title": "The Portuguese Government in 2025: What Expats Should Know",
    "url": "https://www.portugalresidencyadvisors.com/the-political-system-in-portugal-an-expat-guide/",
    "snippet": "<strong>Luís Montenegro</strong>, leader of the centre-right Democratic Alliance (AD) and head of the Social Democratic Party (PSD), was appointed Prime Minister after his bloc won the most seats (91) in parliament.",
    "published": "September 29, 2025"
  },
  {
    "title": "General Elections 2025 Portugal",
    "url": "https://www.robert-schuman.eu/en/monitor/6520-the-social-democratic-party-of-outgoing-prime-minister-luis-montenegro-favourite-in-the-general-election-in-portugal-on-18-may",
    "snippet": "... On 13 March 2025, the President of the Portuguese Republic, <strong>Marcelo Rebelo de Sousa</strong>, announced the dissolution of the Assembly of the Republic, the sole chamber of parliament, and called on his fellow citizens to go to the polls on 18 May.",
    "published": null
  },
  {
    "title": "Portugal’s shift to the right is accelerating. What does that mean for its future? - Atlantic Council",
    "url": "https://www.atlanticcouncil.org/blogs/new-atlanticist/portugals-shift-to-the-right-is-accelerating-what-does-that-mean-for-its-future/",
    "snippet": "US President Donald Trump invited André Ventura, Chega’s leader, to attend the presidential inauguration in January, while Chega vowed to “privilege the transatlantic link” and prioritize its alliance with the United States as part of its 2025 election campaign foreign policy program. Montenegro has often critiqued Chega as unreliable, but he may have to adapt to the new reality of the Portuguese political landscape.",
    "published": "May 20, 2025"
  }
]