[
  {
    "title": "Josep Borrell | CIDOB",
    "url": "https://www.cidob.org/en/expertos/josep-borrell",
    "snippet": "<strong>President of CIDOB (Barcelona Centre for International Affairs).</strong> From 2019 to 2024 he served as the High Representative of the Union for Foreign Affairs an",
    "published": null
  },
  {
    "title": "Josep Borrell será el nuevo presidente del CIDOB | CIDOB,",
    "url": "https://www.cidob.org/cidob-en-medios/josep-borrell-sera-el-nuevo-presidente-del-cidob",
    "snippet": "<strong>El veterano político Josep Borrell se pondrá al frente del CIDOB</strong>, el &#x27;think tank&#x27; con sede en Barcelona dedicado a la investigación en el ámbito de las rel",
    "published": null
  },
  {
    "title": "Josep Borrell begins his term as President of CIDOB | CIDOB",
    "url": "https://www.cidob.org/en/news/josep-borrell-begins-his-term-president-cidob",
    "snippet": "CIDOB Apr 02 2025 · Following his appointment by the institution’s Board on 13 December, <strong>the former head of European diplomacy has begun his agenda as President of CIDOB</strong>, a leading think tank in international relations based in Barcelona. In his first hours as President of the institution, ...",
    "published": null
  },
  {
    "title": "Josep Borrell, nou president del CIDOB",
    "url": "https://www.vilaweb.cat/noticies/josep-borrell-president-cidob/",
    "snippet": "L’ex-ministre espanyol Josep Borrell serà el nou president del think tank Centre d’Estudis i Documentació Internacionals a Barcelona (CIDOB), en substitució de l’historiador Antoni Segura. Així ho ha decidit el patronat de la institució, quan només fa uns dies que Borrell va deixar ...",
    "published": "December 13, 2024"
  },
  {
    "title": "Borrell debuts as President of the CIDOB think tank",
    "url": "https://thediplomatinspain.com/en/2025/04/04/borrell-debuts-as-president-of-the-cidob-think-tank/",
    "snippet": "Josep Borrell, former Spanish Minister of Foreign Affairs and former High Representative of the European Union for Foreign Affairs and Security Policy, <strong>took office this Wednesday as President of CIDOB</strong>, the Barcelona-based think tank specializing ...",
    "published": "April 2, 2025"
  }
]