[
  {
    "title": "Inside Real Madrid: Have Vinicius Jr and Rodrygo saved Xabi Alonso from the sack? - The Athletic",
    "url": "https://www.nytimes.com/athletic/6890596/2025/12/15/real-madrid-xabi-alonso-job-vinicius-jr-rodrygo/",
    "snippet": "When asked about the improvement in their relationship, those closest to the Brazilian pointed out how, since the Olympiacos game on November 26, <strong>the coach has been substituting Vinicius Jr less, and later on in games when he has done it.</strong>",
    "published": "1 day ago"
  },
  {
    "title": "Next Real Madrid manager candidates: Ranking best options to replace Xabi Alonso as coach, including Zidane | Sporting News",
    "url": "https://www.sportingnews.com/us/soccer/real-madrid/news/next-real-madrid-manager-candidates-ranking-replace-xabi-alonso/245f89eb8df943951a2cd9d0",
    "snippet": "There&#x27;s almost no chance of Zidane committing to the Real Madrid job long-term given the prospect of taking over France. However, <strong>it&#x27;s entirely possible that Zidane signs on to coach his old club for the rest of the 2025/26 season</strong> while he waits ...",
    "published": "6 days ago"
  },
  {
    "title": "Real Madrid players insist head coach Xabi Alonso has their support after Manchester City defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6880115/2025/12/10/real-madrid-players-xabi-alonso/",
    "snippet": "Dec. 10, 2025 ... Real Madrid players have said that they continue to back head coach <strong>Xabi Alonso</strong> following the team’s 2-1 Champions League defeat against Manchester City on Wednesday.",
    "published": "6 days ago"
  },
  {
    "title": "What do Real Madrid actually want? - The Athletic",
    "url": "https://www.nytimes.com/athletic/6881911/2025/12/12/real-madrid-perez-alonso-future-champions-league/",
    "snippet": "It makes for an incredibly challenging environment for a coach and his staff to work in. Unsurprisingly, Alonso and his assistants have found it difficult to convince everyone — in the dressing room and the boardroom — to immediately accept the changes they are trying to make. The atmosphere is markedly different from the patience and support they received when working together at Bayer Leverkusen. The only thing that really matters at Madrid is winning, and failure to do that is just not acceptable.",
    "published": "4 days ago"
  },
  {
    "title": "Álvaro Arbeloa drawn on replacing Xabi Alonso as Real Madrid boss - Yahoo Sports",
    "url": "https://ca.sports.yahoo.com/news/lvaro-arbeloa-drawn-replacing-xabi-183500418.html",
    "snippet": "Sat, December 13, 2025 at 6:35 p.m. UTC· ... Real Madrid Castilla head coach <strong>Álvaro Arbeloa</strong> has responded to the media speculation that he is being lined up to replace Xabi Alonso as the club’s first-team manager.",
    "published": "3 days ago"
  }
]