[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "World Athletics Gender Leadership Taskforce (2018-present) Athletes’ Commission Member (2001-2003) World Athletics Human Rights Working Group Member (2020-2021) World Athletics Bid Evaluation Panel Member (2021-present) World Athletics Risk Committee Member (2020-present) Atletismo Suramericano Board Member (2019-present) ConSudAtle Athletes’ Commission Member (2017-2023) Universidad Catolica track and field Team head coach (2006-2011) Club Deportivo Universidad Católica Track and Field Board Member (2011-present) Organising Committee of Santiago 2023 Pan-American Games Technical Director ·",
    "published": null
  },
  {
    "title": "The Past Presidents of the IAAF | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/the-past-presidents-of-the-iaaf",
    "snippet": "In 1901, he was elected as the president of the Swedish Athletic Association and two years later was one of the founders of the Swedish National Sports Foundation. He was among the organisers of the 1912 Olympic Games in Stockholm and in this capacity sent written invitations to interested parties to attend the inaugural Congress on July 17, 1912, which lead to the formation of the IAAF. The hallmark of his 34 years as president was a staunch defence of amateurism but his highly skilful leadership, aided by residing in a neutral country and linguistic skills which included speaking fluent German and English, helped the IAAF steadily expand its scope and influence as well as weather the storms brought about by two World Wars.",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "However, the organization retained the word amateur in its name until its 2001 congress, at which it changed its name to the International Association of Athletics Federations. In June 2019 the organization chose to rebrand as World Athletics, with a rollout beginning after the 2019 World Championships in Doha.",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "In 1901, he was elected as the president of the Swedish Athletic Association and two years later was one of the founders of the Swedish National Sports Foundation. He was among the organisers of the 1912 Olympic Games in Stockholm and in this capacity sent written invitations to interested parties to attend the inaugural Congress on 17 July 1912, which lead to the formation of the IAAF. The hallmark of his 34 years as president was a staunch defence of amateurism but his highly skilful leadership, aided by residing in a neutral country and linguistic skills which included speaking fluent German and English, helped the IAAF steadily expand its scope and influence as well as weather the storms brought about by two World Wars.",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Honorary President of the Association of the Balkan Athletics Federations (since 2021) Lecturer at the National Sports Academy in Sports Management since 1994 ... Served as Secretary for Uganda Sports Women Association, (1998-2000) an organisation whose functions were later mainstreamed in National Olympic Committee and National Federations for purposes of sustainability · Chef de Mission XXI Commonwealth Games, Gold Coast 2018, Australia ... Secretary LOC, IAAF World Cross Country Kampala 2017 for a period of three years (2014-2017) from bid process to implementation of the project;",
    "published": null
  }
]