[
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "Mahathir bin Mohamad (Jawi: محاضر بن محمد; IPA: [mahaðɪ(r) bɪn mohamad]; born 10 July 1925) is a Malaysian politician, author and doctor who served as the fourth and seventh prime minister of Malaysia from 1981 to 2003 and again from 2018 to 2020.",
    "published": "3 days ago"
  },
  {
    "title": "Malaysia's Mahathir, 95, forms new party to fight old ally | AP News",
    "url": "https://apnews.com/article/mahathir-mohamad-malaysia-najib-razak-asia-pacific-870cd69ba2edbbdf2b6ed29bca3ff095",
    "snippet": "Two-time former Malaysian Prime Minister Mahathir Mohamad says he is forming a new ethnic Malay party more than two months after he was sacked from his previous party during a political struggle with his successor.",
    "published": "December 9, 2023"
  },
  {
    "title": "Mahathir bin Mohamad | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mahathir-bin-Mohamad",
    "snippet": "Mahathir bin Mohamad, Malaysian politician who served as prime minister of Malaysia from 1981 to 2003, during which time he oversaw the country’s transition to an industrialized nation. He retired from public life in 2008 but returned dramatically to win the 2018 parliamentary election as a reform candidate.",
    "published": "July 20, 1998"
  },
  {
    "title": "Former Malaysian PM Mahathir joins little-known party Putra | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/former-malaysian-pm-mahathir-joins-little-known-party-putra",
    "snippet": "Former Malaysian prime minister Mahathir Mohamad has joined little-known <strong>Parti Bumiputera Perkasa Malaysia (Putra).</strong>",
    "published": "November 25, 2024"
  },
  {
    "title": "Malaysia’s ex-PM Mahathir quits Pejuang party he founded, picks GTA as new political platform | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/malaysia-ex-pm-mahathir-quits-the-pejuang-party-he-founded-chooses-gta-as-new-political-platform",
    "snippet": "Dr Mahathir Mohamad is one of <strong>13 Pejuang members</strong> who said they were leaving the party.",
    "published": "November 22, 2024"
  }
]