[
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "On 30 August 2003, <strong>Aznar announced that he would retire from politics in the 2004 elections and proposed Rajoy as his successor</strong>. Rajoy was elected Secretary General of the party the following day, and led the party into the 2004 elections.",
    "published": "March 8, 2004"
  },
  {
    "title": "La Moncloa. Gobierno de la XII Legislatura [Gobierno/Gobiernos por legislaturas]",
    "url": "https://www.lamoncloa.gob.es/gobierno/gobiernosporlegislaturas/paginas/xii-legislatura.aspx",
    "snippet": "El 1 de junio de 2018 prospera ... de Mariano Rajoy. Como consecuencia de ello, <strong>Pedro Sánchez Pérez-Castejón es investido presidente del Gobierno y cesa Mariano Rajoy</strong>....",
    "published": null
  },
  {
    "title": "Mariano Rajoy - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q10819",
    "snippet": "El presidente del Gobierno tiene dos hijos varones, <strong>Mariano Rajoy Fernández nacido en 1999 y Juan Rajoy Fernández nacido en 2005.</strong>",
    "published": null
  },
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "From 1996 Rajoy served in the PP government of Prime Minister José María Aznar, holding, successively, the posts of minister of public administration, minister of education and culture, and minister of the interior, and in 2003 Aznar handpicked Rajoy as the party’s new leader.",
    "published": "December 6, 2011"
  },
  {
    "title": "La Moncloa. 17/06/2014. Rajoy stresses that succession to throne shows soundness of Spanish democracy [President/News]",
    "url": "http://www.lamoncloa.gob.es/lang/en/presidente/news/Paginas/2014/20140617_RajoyEuropaPressForum.aspx",
    "snippet": "In his speech at the presentation of the President of the Regional Government of Cantabria, Ignacio Diego, at the breakfast news programme organised by Europa Press, Mariano Rajoy defended the &quot;transparency and normality&quot; with which the succession to the Spanish throne is proceeding.",
    "published": null
  }
]