[
  {
    "title": "Anke Domscheit-Berg - Aktivistin, Publizistin, Mitglied des Deutschen Bundestages",
    "url": "https://mdb.anke.domscheit-berg.de/",
    "snippet": "... „<strong>Wir haben kein Geldmangelproblem und mehr Geld hilft nicht</strong>“, sagt auch Anke Domscheit-Berg, (Linksfraktion). Es brauche eher ein zentralgesteuertes Digitalbudget und eine Grundgesetzänderung, damit in diesem Bereich mehr Hilfen vom Bund auf föderaler Ebene ankommen.",
    "published": "March 24, 2025"
  },
  {
    "title": "Digitalexpertin vergleicht neue KI-Verordnung mit zahnlosem Tiger | MDR.DE",
    "url": "https://www.mdr.de/nachrichten/deutschland/politik/domscheit-berg-kritik-ki-gesetz-100.html",
    "snippet": "Wer ist Anke Domscheit-Berg Anke Domscheit-Berg ist eine deutsche Publizistin, ehemalige Unternehmerin und Politikerin. Von 2017-2025 war sie als digitalpolitische Sprecherin für &quot;Die Linke&quot; im Bundestag. <strong>Bei der Bundestagswahl 2025 trat sie nicht erneut an</strong>.",
    "published": "August 4, 2025"
  },
  {
    "title": "Open-Source-Workshop zum Deutschland-Stack | OSBA – Open Source Business Alliance",
    "url": "https://osb-alliance.de/verbands-news/open-source-workshop-zum-deutschland-stack",
    "snippet": "Unter den Teilnehmenden bestand ... Domscheit-Berg mahnte: „<strong>Ich halte es für wichtig, dass wir kein Souveränitätswashing betreiben und die Kriterien so gestalten, dass das auch nicht möglich ist</strong>....",
    "published": "4 days ago"
  },
  {
    "title": "Anke Domscheit-Berg: \"The most important complex is digital sovereignty\" | heise online",
    "url": "https://www.heise.de/en/news/Anke-Domscheit-Berg-The-most-important-complex-is-digital-sovereignty-10328983.html",
    "snippet": "Newsletter · heise-Bot · ... · Advertisement · Anke Domscheit-Berg, Germany&#x27;s best-known digital politician, <strong>has left the Bundestag</strong>....",
    "published": "March 26, 2025"
  },
  {
    "title": "Pressemitteilung: Verheerende Nachhaltigkeitsbilanz der Bundes-IT - Anke Domscheit-Berg",
    "url": "https://mdb.anke.domscheit-berg.de/2025/03/pm-verheerende-nachhaltigkeitsbilanz-it-bund/",
    "snippet": "<strong>Seit 10 Jahren soll die Anzahl der Rechenzentren des Bundes um 90 Prozent sinken, von 100 RZ in 2015 auf 10 RZ in 2025</strong>. Stattdessen zeigen meine Kleinen Anfragen seit Jahren, dass keine Konsolidierung stattfindet. Für Ende 2024 gab der Bund 135 RZ an und noch in diesem Jahr sollen daraus sogar ...",
    "published": "March 4, 2025"
  }
]