[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Trudeau, Justin (October 20, 2014). Common Ground. Toronto, Ontario: HarperCollins Publishers Ltd. ISBN ... ^ The Cabinet position was titled &quot;minister of infrastructure, communities and intergovernmental affairs&quot;. ^ LeBlanc succeeded Trudeau in the Cabinet position, but with the title &quot;minister of intergovernmental and northern affairs and internal trade&quot;.",
    "published": "4 days ago"
  },
  {
    "title": "Prime Ministers of Canada",
    "url": "https://lop.parl.ca/sites/ParlInfo/default/en_CA/People/primeMinisters",
    "snippet": "This page provides general details on Canada&#x27;s prime ministers since 1867. For more information on an individual prime minister, including their electoral history and parliamentary roles, click on their name to view their complete profile",
    "published": null
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "The Right Honourable <strong>Mark Carney</strong>, Prime Minister of Canada<strong>Mark Carney</strong> is Canada’s 24th Prime Minister. He was elected Leader of the Liberal Party of Canada and sworn in as Prime Minister in March 2025.",
    "published": null
  },
  {
    "title": "Electoral history of Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Electoral_history_of_Justin_Trudeau",
    "snippet": "Although Trudeau was successful in leading the party in three general elections, a political crisis led to Trudeau&#x27;s retirement early in 2025. He was succeeded by <strong>Mark Carney</strong> as prime minister and Liberal leader.",
    "published": "3 days ago"
  },
  {
    "title": "Justin Trudeau | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/justin-trudeau",
    "snippet": "Justin Pierre James Trudeau, 23rd prime minister of Canada, 2015–25, leader of the Liberal Party of Canada, educator, public policy advocate (born 25 December...",
    "published": null
  }
]