[
  {
    "title": "Sudha Sharma Gautam - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudha_Sharma_Gautam",
    "snippet": "Dr. Sudha Sharma Gautam (Nepali: डा. सुधा शर्मा गौतम) is a Nepalese politician and senior obstetrician-gynecologist who has served as a minister of health and population in the <strong>Sushila Karki</strong> led interim Government since 26 October 2025.",
    "published": "November 11, 2025"
  },
  {
    "title": "Health Minister announces first decision to provide psychological counseling to injured in Gen Z protests",
    "url": "https://english.nepalnews.com/s/health/health-minister-announces-first-decision-to-provide-psychological-counseling-to-injured-in-gen-z-protests/",
    "snippet": "A <strong>former Health Secretary</strong>, the newly appointed Minister Sharma is also an obstetrician-gynecologist and a public health specialist.",
    "published": null
  },
  {
    "title": "Amid controversy, Karki expands Cabinet for third time",
    "url": "https://kathmandupost.com/national/2025/10/27/amid-controversy-karki-expands-cabinet-for-third-time",
    "snippet": "Sudha Sharma and <strong>Bablu Gupta</strong> sworn in as health and sports ministers. Khagendra Sunar and Ganapati Lal Shrestha dropped at last moment.",
    "published": null
  },
  {
    "title": "Prime Minister Karki inducts two new ministers",
    "url": "https://kathmandupost.com/national/2025/10/26/prime-minister-karki-inducts-two-new-ministers",
    "snippet": "At a ceremony held at the President’s Office, Sheetal Niwas, President Ramchandra Paudel administered the oath of office and secrecy to Dr Sudha Sharma Gautam, minister for health and population, and <strong>Bablu Gupta</strong>, minister for youth and sports.",
    "published": null
  },
  {
    "title": "Many injured during the Gen Z protests have not been in touch",
    "url": "https://kathmandupost.com/interviews/2025/12/01/many-injured-during-the-gen-z-protests-have-not-been-in-touch-1764552191",
    "snippet": "In the third expansion of her Cabinet on October 27, Prime Minister Sushila Karki recommended former health secretary Dr Sudha Sharma Gautam as the minister for health and population. It has been just over a month since gynaecologist and obstetrician Gautam, who was active in the health sector after retiring from government service, took charge of the ministry.",
    "published": null
  }
]