[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Manmohan Singh continued the pragmatic foreign policy that was started by P.V. Narasimha Rao and continued by Bharatiya Janata Party&#x27;s Atal Bihari Vajpayee. Singh continued the peace process with Pakistan initiated by his predecessor, Atal Bihari Vajpayee. Exchange of high-level visits by top leaders from both countries have highlighted his tenure.",
    "published": "2 weeks ago"
  },
  {
    "title": "Dr. Manmohan Singh’s Defence and Foreign policies were outstanding",
    "url": "https://inc.in/congress-sandesh/tribute/dr-manmohan-singh-s-defence-and-foreign-policies-were-outstanding",
    "snippet": "But all this has become possible because the first steps were taken under the premiership of Dr. Manmohan Singh who <strong>reversed the policy of Vajpayee government that had ruled against granting permanent commission to women officers</strong>.",
    "published": null
  },
  {
    "title": "Manmohan Singh's decisions that shaped a billion lives",
    "url": "https://www.bbc.com/news/articles/cg4zg690py9o",
    "snippet": "Later, as prime minister, Singh continued to build on his <strong>economic reform measures, lifting millions of Indians out of poverty and contributing to India&#x27;s rise as one of the world&#x27;s fastest-growing major economies</strong>.",
    "published": "December 27, 2024"
  },
  {
    "title": "Manmohan Singh: India's quiet reformer | PIIE",
    "url": "https://www.piie.com/blogs/realtime-economics/2025/manmohan-singh-indias-quiet-reformer",
    "snippet": "These policies remained in place for decades and seemed impervious to reform owing to what one economist called a “witch’s brew of stale ideology, vested interests, and fear of the unknown.” · A balance of payments crisis in 1990–91 brought to power a weak government headed by Prime Minister P. V. Narasimha Rao. With the country’s foreign exchange reserves exhausted, Rao appointed the soft-spoken but highly experienced Singh as finance minister, as someone who could negotiate credibly with creditors such as the International Monetary Fund and introduce reforms to improve India’s economic performance.",
    "published": "January 3, 2025"
  },
  {
    "title": "DR. MANMOHAN SINGH",
    "url": "https://inc.in/our-inspiration/dr-manmohan-singh",
    "snippet": "This story of unprecedented growth and prosperity is the story of Dr Singh’s premiership from 2004-2014. But it began during his tenure as Finance Minister from 1991-1996 when the script first began to take shape. In July 1991, Dr Manmohan Singh ended his budget speech with the words “No ...",
    "published": null
  }
]