[
  {
    "title": "List of Saudi rulers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Saudi_rulers",
    "snippet": "This is a list of rulers of Saudi Arabia, a kingdom on the Arabian Peninsula. ... The Royal Standard consists of a green flag, with an Arabic inscription and a sword featured in white, and with the national emblem embroidered in gold in the lower right canton of the year 1973.",
    "published": "September 21, 2025"
  },
  {
    "title": "List of kings of Saudi Arabia | First Ruler, Saud Dynasty, Salman, History, Chronological Order, & Crown Prince | Britannica",
    "url": "https://www.britannica.com/topic/list-of-kings-of-Saudi-Arabia",
    "snippet": "Thus, from 1953 through the present day, the throne of Saudi Arabia has been passed among the sons of Ibn Saud (1902–53), rather than be inherited by their descendants, as senior members of the family. Mohammed bin Salman, who at a young age has jockeyed himself to a senior position in the royal family, is expected to be the first of Ibn Saud’s grandsons to take the throne and bypass the remaining sons of Ibn Saud who are still alive. ... Below is a list of kings of Saudi Arabia, including the rulers of the first, second, and third Saudi states as well as the Kingdom of Saudi Arabia that was established in 1932.",
    "published": "November 8, 2025"
  },
  {
    "title": "List of Kings of Saudi Arabia - Saudipedia",
    "url": "https://saudipedia.com/en/article/3863/royal-family/list-of-kings-of-saudi-arabia",
    "snippet": "Founding King Abdulaziz Bin Abdulrahman Al Saud The first king, founder, and unifier of the Kingdom of Saudi Arabia, he began the process of reclaiming and unifying the Kingdom in...",
    "published": "February 17, 2025"
  },
  {
    "title": "King of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/King_of_Saudi_Arabia",
    "snippet": "King Abdulaziz Al Saud, known in the West as Ibn Saud, regained his patrimony, which is known as today&#x27;s Saudi Arabia, in 1902. Restoring his family as emirs of the Emirate of Riyadh, he then established the Sultanate of Nejd as his headquarters in 1922.",
    "published": "2 weeks ago"
  },
  {
    "title": "Saudi Arabia - Monarchy, Sharia, Tribes | Britannica",
    "url": "https://www.britannica.com/place/Saudi-Arabia/Government-and-society",
    "snippet": "Saudi Arabia - Monarchy, Sharia, Tribes: Saudi Arabia is a monarchy ruled by the Saud dynasty (Āl Saʿūd), a family whose status was established by its close ties with and support for the Wahhābī religious establishment. Islamic law, the Sharia, is the primary source of legislation, but the actual promulgation of legislation and implementation of policy is often mitigated by more mundane factors, such as political expediency, the inner politics of the ruling family, and the influence of intertribal politics, which remain strong in the modern kingdom.",
    "published": "1 week ago"
  }
]