[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "Prabowo was invited by Prime Minister Narendra Modi&#x27;s government as chief guest of the Republic Day celebration in 2025. The visit is to further strengthen the strategic partnership between the two countries. The Indonesian president was welcomed by Minister of State for External Affairs Pabitra Margherita.",
    "published": "2 days ago"
  },
  {
    "title": "Joint Statement on the Visit of H.E. Prabowo Subianto, President of the Republic of Indonesia, to Pakistan (8-9 December 2025)",
    "url": "https://mofa.gov.pk/press-releases/visit-of-he-prabowo-subianto-president-of-the-republic-of-indonesia-to-pakistan-8-9-december-2025-joint-statement",
    "snippet": "<strong>Prabowo Subianto</strong>, President of the Republic of Indonesia, paid an official visit to Pakistan on 8-9 December 2025. During the visit, President <strong>Prabowo Subianto</strong> held delegation level talks with Prime Minister Shehbaz Sharif and met with H.E.",
    "published": null
  },
  {
    "title": "Curtain Raiser: Visit of the President of the Republic of Indonesia, H.E. Prabowo Subianto, to Pakistan (8-9 December 2025)",
    "url": "https://mofa.gov.pk/press-releases/curtain-raiser-visit-of-the-president-of-the-republic-of-indonesia-he-prabowo-subianto-to-pakistan-8-9-december-2025",
    "snippet": "At the invitation of the Prime Minister of Pakistan, H.E. Muhammad Shehbaz Sharif, the President of the Republic of Indonesia, <strong>H.E. Prabowo Subianto</strong>, will undertake an official visit to Islamabad from 8-9 December 2025.",
    "published": null
  },
  {
    "title": "Indonesia president expects flood-stricken Sumatra to return to normal in 2-3 months as death toll exceeds 1,000 | Reuters",
    "url": "https://www.reuters.com/business/environment/indonesia-president-expects-flood-stricken-sumatra-return-normal-2-3-months-2025-12-15/",
    "snippet": "REUTERS/Willy Kurniawan/File Photo Purchase Licensing Rights, opens new tab · JAKARTA, Dec 15 (Reuters) - Indonesia&#x27;s President <strong>Prabowo Subianto</strong> said on Monday that activities in areas on Sumatra that were hit by deadly floods may return to ...",
    "published": "1 day ago"
  },
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "<strong>Prabowo Subianto</strong> (born October 17, 1951, Jakarta, Indonesia) is a former general of the Indonesian army and businessman who is now president of Indonesia (2024– ). Prabowo is the third of four children born to Sumitro Djojohadikusumo, a Javanese ...",
    "published": "December 9, 2024"
  }
]