[
  {
    "title": "Tim Cook - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tim_Cook",
    "snippet": "As CEO of Apple, <strong>Cook</strong> met U.S. House members on 10 December 2025 to push back against a federal legislation that could require Apple to authenticate users&#x27; ages and possibly collect sensitive data on children.",
    "published": "2 days ago"
  },
  {
    "title": "Apple Leadership - Apple",
    "url": "https://www.apple.com/leadership/",
    "snippet": "Apple leadership biographies include Apple’s executive team responsibilities and experience. Learn more about Apple’s leadership team.",
    "published": null
  },
  {
    "title": "Apple announces executive transitions - Apple",
    "url": "https://www.apple.com/newsroom/2025/12/apple-announces-executive-transitions/",
    "snippet": "“Kate has been an integral part of the company for the better part of a decade, having provided critical advice while always advocating on behalf of our customers’ right to privacy and protecting Apple’s right to innovate,” said <strong>Tim Cook</strong>, ...",
    "published": "4 days ago"
  },
  {
    "title": "Tim Cook | Biography, Apple CEO, & Business Executive | Britannica Money",
    "url": "https://www.britannica.com/money/Tim-Cook",
    "snippet": "In November 2025, the Financial Times reported that Apple’s board had intensified its succession planning. By then, Cook had become the longest-serving CEO in Apple’s history, reflecting a tenure that reshaped the company into one of the world’s most valuable and influential companies.Erik Gregersen",
    "published": null
  },
  {
    "title": "Tim Cook - Apple",
    "url": "https://www.forbes.com/profile/tim-cook/",
    "snippet": "Here are 5 areas that should get more media attention in the year ahead. ... As <strong>Tim Cook</strong> prepares to launch the iPhone 17 Pro and the rest of the family, Apple must address one of the biggest challenges to its leadership in the smartphone space.",
    "published": null
  }
]