[
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "As a teenager, Lagarde was a member of the French national synchronised swimming team. After her baccalauréat in 1973, she went on an American Field Service scholarship to the Holton-Arms School in Bethesda, Maryland. During her year in the United States, Lagarde worked as an intern at the U.S.",
    "published": "2 weeks ago"
  },
  {
    "title": "Christine Lagarde | Biography, IMF, ECB, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Christine-Lagarde",
    "snippet": "Christine Lagarde (born January 1, 1956, Paris, France) is a French lawyer and politician who was the first woman to serve as France’s finance minister (2007–11), as the managing director of the International Monetary Fund (IMF; 2011–19), and as president of the European Central Bank (2019– ).",
    "published": "January 30, 2009"
  },
  {
    "title": "Christine Lagarde - Biographical Information",
    "url": "https://www.imf.org/en/about/senior-officials/archive/christine-lagarde",
    "snippet": "Christine Lagarde was named Officier in the Légion d&#x27;honneur in April 2012. A former member of the French national team for synchronized swimming, Christine Lagarde is the mother of two sons.",
    "published": null
  },
  {
    "title": "Christine Lagarde | Archives of Women's Political Communication",
    "url": "https://awpc.cattcenter.iastate.edu/directory/christine-lagarde/",
    "snippet": "Lagarde was born on January 1, 1956 in Paris, France. As a teenager, she was a member of the French national synchronized swimming team. After completing high school in 1973, she attended the Holton-Arms School for a year in Bethesda, Maryland. During that year, she was a congressional assistant intern for U.S.",
    "published": null
  },
  {
    "title": "Christine Lagarde - European Central Bank",
    "url": "https://www.forbes.com/profile/christine-lagarde/",
    "snippet": "Christine Lagarde&#x27;s is a career marked by firsts: first female chairman of a major international law firm, first woman to serve as <strong>French</strong> Finance and Economy Minister, and first woman to hold that position in any G7 country.",
    "published": null
  }
]