[
  {
    "title": "Parliamentary Under-Secretary of State for Children, Families and Wellbeing - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Parliamentary_Under-Secretary_of_State_for_Children,_Families_and_Wellbeing",
    "snippet": "The post was previously known as Minister of State for Schools and Childhood following the appointment of <strong>Kelly Tolhurst</strong> on 7 September 2022, who succeeded Brendan Clarke-Smith. Margaret Hodge was the first person to hold the position after it was announced in 2003.",
    "published": "November 18, 2025"
  },
  {
    "title": "DfE merges schools and children’s social care responsibilities under new minister - Community Care",
    "url": "https://www.communitycare.co.uk/content/news/dfe-merges-schools-and-children-s-social-care-responsibilities-under-new-minister",
    "snippet": "<strong>Robert Goodwill</strong>, in 2017-18, was the last DfE minister of state with responsibility for social care. Tolhurst, previously the deputy chief whip, used her first tweet since her portfolio was confirmed to highlight social workers’ “vital role ...",
    "published": "July 30, 2025"
  },
  {
    "title": "Minister of State for Children - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_of_State_for_Children",
    "snippet": "There has not been a Minister of State with this responsibility since the creation of the full cabinet position of Minister for Children and Youth Affairs in March 2011.",
    "published": "October 17, 2023"
  },
  {
    "title": "Minister for Children, Disability and Equality - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_for_Children,_Equality,_Disability,_Integration_and_Youth",
    "snippet": "The office was created in 1956 as the Minister for the Gaeltacht. Its title and functions have changed several times, with the current title adopted in 2025. An office of minister of state for children existed from 2005 to 2011.",
    "published": "September 7, 2025"
  },
  {
    "title": "Parliamentary Under Secretary of State (Minister for Children and Families) - GOV.UK",
    "url": "https://www.gov.uk/government/ministers/parliamentary-under-secretary-of-state-children-and-young-families",
    "snippet": "coronavirus (COVID-19) recovery for children’s services and early years · 2021 to 2022 · 2020 to 2021 · 2019 to 2020 · 2018 to 2019 · 2012 to 2015 · 2010 to 2012 · Get emails · Drive to reduce the cost of childcare for parents · 04 July 2022 · Press release · Minister&#x27;s letter to Competition and Markets Authority (CMA) 24 May 2022 · Correspondence · Minister Quince Oral Statement on children&#x27;s social care review ·",
    "published": null
  }
]