[
  {
    "title": "Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/",
    "snippet": "The Federal Reserve Bank of Minneapolis is pursuing an economy that works for all of us. Serving <strong>Montana, North and South Dakota, Minnesota, Wisconsin and the Upper Peninsula of Michigan</strong>.",
    "published": null
  },
  {
    "title": "Federal Reserve Bank of Minneapolis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Federal_Reserve_Bank_of_Minneapolis",
    "snippet": "The Federal Reserve Bank of Minneapolis, located in <strong>Minneapolis, Minnesota</strong>, in the United States, covers the 9th District of the Federal Reserve, which is made up of Minnesota, Montana, North and South Dakota, northwestern Wisconsin, and the Upper Peninsula of Michigan.",
    "published": "November 21, 2025"
  },
  {
    "title": "Visiting the Bank: Policies, Directions, and Parking | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/connect/directions-and-parking",
    "snippet": "The Fed is accessible via several Metro Transit bus routes, and is located approximately five blocks north of the Warehouse District light rail station. The Federal Reserve Bank is located at <strong>90 Hennepin, on the corner of Hennepin Ave and N 1st St</strong>.",
    "published": null
  },
  {
    "title": "Federal Reserve Bank of Minneapolis | Minneapolis MN | Facebook",
    "url": "https://www.facebook.com/MinneapolisFed/",
    "snippet": "Federal Reserve Bank of Minneapolis, Minneapolis. 2,721 likes · 81 talking about this. The Federal Reserve Bank of Minneapolis serves the Ninth Federal Reserve District.",
    "published": null
  },
  {
    "title": "Federal Reserve Board - Federal Reserve Bank of Minneapolis Contacts",
    "url": "https://www.federalreserve.gov/supervisionreg/afi/res_cont_minn.htm",
    "snippet": "FedEZFile and FedEZFile FluentFedEZFile ContactsReserve Bank Applications ContactsTypes of FilingsFiling ResourcesProcessing StagesBanking Market InformationCRA and the Applications Process · <strong>90 Hennepin Avenue</strong> P.O. Box 291 Minneapolis, MN ...",
    "published": null
  }
]