[
  {
    "title": "Chancellor of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Austria",
    "snippet": "Twenty-nine people have served as chancellor. The current holder of the office <strong>Christian Stocker</strong> was sworn in on 3 March 2025 as chancellor. Austria&#x27;s chancellor chairs and leads the cabinet, which is composed of the chancellor, the vice chancellor and the ministers.",
    "published": "September 29, 2025"
  },
  {
    "title": "New Austrian Government Sworn In — Austria in USA",
    "url": "https://www.austria.org/news/new-austrian-government-sworn-in",
    "snippet": "On March 3, 2025, Federal President <strong>Alexander Van der Bellen</strong> swore in a new Austrian Federal Government formed by the Austrian People’s Party (ÖVP), the Social Democratic Party (SPÖ) and the NEOS.",
    "published": "March 20, 2025"
  },
  {
    "title": "Austria's new gov't sworn in after months of political deadlock-Xinhua",
    "url": "https://english.news.cn/europe/20250303/dbd46b79e18348458097f740c3a748d1/c.html",
    "snippet": "In late February, the People&#x27;s Party, the Social Democratic Party, and NEOS revived their coalition talks and reached an agreement, leading to the formation of the new government. ■ · Austrian President <strong>Alexander Van der Bellen</strong> (C) and Leader of the People&#x27;s Party Christian Stocker (L) attend ...",
    "published": "March 3, 2025"
  },
  {
    "title": "Austria's new government takes office after a record 5-month wait | AP News",
    "url": "https://apnews.com/article/austria-new-government-coalition-stocker-chancellor-a5066e2102ff9993daae688074ebd308",
    "snippet": "VIENNA (AP) — Austria’s new government took office on Monday, with <strong>Christian Stocker</strong> taking over as chancellor at the head of a previously untried three-party coalition after a record five-month wait for a new administration.",
    "published": "March 3, 2025"
  },
  {
    "title": "Austria swears in new government, ending five-month political crisis – POLITICO",
    "url": "https://www.politico.eu/article/austria-swears-new-government-ending-five-month-political-crisis-christian-stocker-alexander-van-der-bellen/",
    "snippet": "Conservative People’s Party (ÖVP) leader <strong>Christian Stocker</strong> will be the prime minister, with the center-left Social Democrats (SPÖ) and the liberal Neos party also part of the coalition government.",
    "published": "March 3, 2025"
  }
]