[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Kaptur won reelection by less than one percentage point at 48.3% to Merrin&#x27;s 47.6%, which marked the first time in her political career that she failed to secure a majority of the vote. Kaptur took office on January 3, 1983. At the time, she became the first woman to represent Ohio&#x27;s 9th congressional district and was one of 24 women serving in Congress.",
    "published": "1 week ago"
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "In 1981, while <strong>pursuing a doctorate in urban planning and development finance at MIT</strong>, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the ...",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "Marcy Kaptur, the Representative from Ohio - in Congress from 1983 through Present",
    "published": null
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "↑ Congresswoman Marcy Kaptur, &quot;About Marcy,&quot; accessed August 22, 2025 · ↑ Bowling Green University, &quot;Marcy Kaptur&#x27;s story,&quot; accessed August 22, 2025 · ↑ Cleveland.com, &quot;Blue-collar roots guide Marcy Kaptur&#x27;s folksy -- and occasionally fiery -- career in Congress,&quot; accessed June 20, 2013",
    "published": null
  },
  {
    "title": "Marcy Kaptur: Homepage",
    "url": "https://marcykaptur.com/",
    "snippet": "JavaScript is disabled in your browser · Please enable JavaScript to proceed · A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser",
    "published": null
  }
]