[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Through the 1920s, Alfa Romeo produced several successful road and race cars, and was well represented in prominent European motorsport events, notably winning the inaugural AIACR World Manufacturers&#x27; Championship at the 1925 Grand Prix season. Nevertheless, the company soon faced financial troubles, leading to Romeo&#x27;s contentious departure in 1928 and Italian government ownership in 1933.",
    "published": "3 weeks ago"
  },
  {
    "title": "Is Alfa Romeo Part of Stellantis? | Benson Alfa Romeo",
    "url": "https://www.alfaromeousaofgreer.com/research/is-alfa-romeo-part-of-stellantis.htm",
    "snippet": "So who owned Alfa Romeo during this time? Between 1932 and 1986, an Italian state-holding company owned Alfa, and Alfa Romeo joined the <strong>Fiat Chrysler Group</strong>. The company then became Alfa Romeo Automobiles S.p.A as a subsidiary of Fiat, also known as FCA or Fiat Chrysler Automobiles.",
    "published": null
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "The name Alfa is actually an acronym for, “Anonima Lombarda Fabbrica Automobili” – A.L.F.A. In the formative years between 1932 and 1986, the Alfa was owned by <strong>an Italian state holding company</strong>, which then led to Alfa being under the Fiat ...",
    "published": "April 26, 2021"
  },
  {
    "title": "History of Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Alfa_Romeo",
    "snippet": "The history of Alfa Romeo, an Italian car manufacturer known for producing sports cars, began on June 24, 1910, with the founding of ALFA (an acronym for &quot;Anonima Lombarda Fabbrica Automobili&quot;) in Milan. In 1918 the company changed its name to &quot;Alfa Romeo&quot; following the acquisition of control ...",
    "published": "October 20, 2025"
  },
  {
    "title": "Who Owns Alfa Romeo? | Where is Alfa Romeo Made?",
    "url": "https://www.aristocratmotorsalfaromeo.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "In 1932, <strong>the Italian state holding company</strong> owned Alfa, which lasted until 1986. During these years, Alfa joined the Fiat group. Then in February 2007, it became Alfa Romeo Automobiles S.p.A.",
    "published": "July 25, 2025"
  }
]