[
  {
    "title": "Stefano Bonaccini - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stefano_Bonaccini",
    "snippet": "Stefano Bonaccini (Italian pronunciation: [ˈsteːfano bonatˈtʃiːni]; born 1 January 1967) is an Italian politician and member of the Democratic Party (PD), of which he is <strong>serving as president since 12 March 2023</strong>. In 2024, he was elected to the European Parliament to represent North-East Italy.",
    "published": "November 18, 2025"
  },
  {
    "title": "Bonaccini: \"With Schlein because it's time for unity.\"",
    "url": "https://www.agenzianova.com/en/news/bonaccini-con-schlein-perche-e-lora-dellunita/",
    "snippet": "December 16 2025 · © Agenzia ... The Democratic president&#x27;s mission. Stefano Bonaccini <strong>It&#x27;s about uniting the Democratic Party and working to build an alternative</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "Stefano Bonaccini",
    "url": "https://grokipedia.com/page/Stefano_Bonaccini",
    "snippet": "Stefano Bonaccini (born 1 January 1967) is an Italian social-democratic politician and member of the Democratic Party (PD), currently serving as the party&#x27;s national president and as a Member of the European Parliament.[1][2] He previously held the position of president of the Emilia-Romagna region from 2014 to 2024, overseeing one of Italy&#x27;s most economically dynamic areas known for manufacturing, agriculture, and high per capita income.[3] Bonaccini&#x27;s political career began in the post-communist Democratic Party of the Left, evolving toward pragmatic social-democratic policies focused on regional development and labor rights.",
    "published": null
  },
  {
    "title": "Bonaccini Stefano: biography of Bonaccini Stefano and Meeting Rimini attendance",
    "url": "https://www.meetingrimini.org/en/personaggi/bonaccini-stefano-2/",
    "snippet": "Since December 2015 he is also the President of the Conference of the Regions and Autonomous Provinces. Member of the Democratic Party, in the past he was first Regional Secretary and then he took part in the National Secretary of Renzi’s Democratic Party, with delegation to local authorities.",
    "published": "June 20, 2024"
  },
  {
    "title": "Home | Stefano BONACCINI | MEPs | European Parliament",
    "url": "https://www.europarl.europa.eu/meps/en/257108/STEFANO_BONACCINI/home",
    "snippet": "Stefano BONACCINI · Member · E-mail · Italy - Partito Democratico (Italy) Date of birth : 01-01-1967, Modena · AGRI · Committee on Agriculture and Rural Development · D-US · Delegation for relations with the United States · INTA · Committee on International Trade · D-UK · Delegation to the EU-UK Parliamentary Partnership Assembly · 07-10-2025 P10_CRE-REV(2025)10-07(2-0301-0000) Contributions to plenary debates ·",
    "published": null
  }
]