[
  {
    "title": "AFC Ajax » Coaching Staff List",
    "url": "https://www.worldfootball.net/teams/te64/afc-ajax/all-managers/",
    "snippet": "Football - results, news, statistics and much more...",
    "published": null
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "Heitinga is signing a contract with Ajax as head coach until June 30, 2027. <strong>Marcel Keizer</strong> will be his assistant and is signing a contract of the same duration. Date: 31.05.2025 · Photographer: AFC Ajax ·",
    "published": null
  },
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "They hired <strong>Francesco Farioli</strong> as new head coach, the first foreign coach since 1998. Under his leadership, Ajax reached the league phase of the Europa League, where it finished eleventh. On 9 February 2025, Ajax finished the weekend on the first place for the first time since November 2022.",
    "published": "1 week ago"
  },
  {
    "title": "Ajax youth coaching staff complete for the new season",
    "url": "https://english.ajax.nl/articles/ajax-youth-coaching-staff-complete-for-the-new-season",
    "snippet": "Jong Ajax From next season, Jong Ajax will also have a new coaching staff. <strong>Willem Weijs (last year with U19) started several weeks ago as head coach, and he will be assisted by Yuri Rose and Kiki Musampa</strong>.",
    "published": null
  },
  {
    "title": "r/soccer on Reddit: [VI] Fred Grim will be Ajax first team head coach until at least the winter break",
    "url": "https://www.reddit.com/r/soccer/comments/1p2uetc/vi_fred_grim_will_be_ajax_first_team_head_coach/",
    "snippet": "Ajax coach John Heitinga: &quot;Galatasaray is a strong team. They have very fast players. You must not give this team too much space. We need to play very tightly. We must not lose the ball. Galatasaray plays much better in the first halves. They have a very good goalscorer.&quot; ... Accessibility Reddit, Inc. © 2025.",
    "published": "November 21, 2025"
  }
]