[
  {
    "title": "Lingotto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lingotto",
    "snippet": "<strong>Lingotto is a building complex on Via Nizza in Turin, Italy</strong>. It once housed a car factory built by Italian automotive company Fiat and today houses the administrative headquarters of the manufacturer and a multipurpose centre projected by architect Renzo Piano.",
    "published": "August 27, 2025"
  },
  {
    "title": "Fiat - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat",
    "snippet": "Fiat launched its Motor Village flagship store concept in 2006, with its Mirafiori Motor Village in Turin, followed by London&#x27;s on Wigmore Street in 2008 and Paris&#x27;s on the Champs-Élysées in 2010. In 2009, BSM (the British School of Motoring) ended a 16-year relationship with Vauxhall Motors and signed a deal with Fiat UK to swap its learner vehicle from the Vauxhall Corsa to the new Fiat 500. Fiat UK was expected to supply 14,000 cars to BSM over four years in a marketing deal. ... ^ Originally stylized in all caps. Italian: Fabbrica Italiana Automobili Torino (FIAT), lit.",
    "published": "2 weeks ago"
  },
  {
    "title": "FCA Heritage | Places | Centro Storico Fiat",
    "url": "https://www.stellantisheritage.com/en-uk/heritage/places/centro-storico-fiat",
    "snippet": "<strong>The Centro Storico Fiat</strong> contains the brand museum and the company archive. It is based in Turin, in a fine Art Nouveau building in the area where the company&#x27;s first manufacturing workshops were set up.",
    "published": null
  },
  {
    "title": "Lingotto Factory - Discover Turin & FIAT's History - Turin Travel Blog",
    "url": "https://turinitalyguide.com/fiat-lingotto-factory-turin/",
    "snippet": "To understand Turin’s development in the 20th century, it’s necessary to speak about the Lingotto factory and FIAT (FCA as it is called now), Italy’s largest company.",
    "published": "March 5, 2018"
  },
  {
    "title": "Fiat’s Turin legacy fades as Italy’s auto industry struggles | Daily Sabah",
    "url": "https://www.dailysabah.com/business/automotive/fiats-turin-legacy-fades-as-italys-auto-industry-struggles",
    "snippet": "<strong>Located at the foot of the Alps in northwest Italy, Turin is where Fiat, now part of the multinational Stellantis, was co-founded by the Agnelli family 125 years ago</strong>.",
    "published": "October 17, 2024"
  }
]