[
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "Presidents Daniel Burley Woolfall, Rodolphe Seeldrayers, and Arthur Drewry died during their term in office. The current president is Swiss-Italian <strong>Gianni Infantino</strong>, elected on 26 February 2016 during ...",
    "published": "November 20, 2025"
  },
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/organisation/president/past-presidents",
    "snippet": "An English FA administrator from Blackburn, Daniel Burley Woolfall was elected as President on 4 June 1906. A key aim during his presidency was to achieve uniform football rules on an international level and he played a prominent role in the drafting of FIFA&#x27;s new constitution.",
    "published": null
  },
  {
    "title": "List of presidents of FIFA facts for kids",
    "url": "https://kids.kiddle.co/List_of_presidents_of_FIFA",
    "snippet": "FIFA is the main organization that controls association football (soccer) around the world. Some presidents, like Daniel Burley Woolfall, Rodolphe Seeldrayers, and Arthur Drewry, passed away while they were still in office.",
    "published": null
  },
  {
    "title": "Category:Presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Category:Presidents_of_FIFA",
    "snippet": "Wikimedia Commons has media related to Presidents of FIFA. The following 12 pages are in this category, out of 12 total. This list may not reflect recent changes. ... The following 2 files are in this category, out of 2 total. C. A. W. Hirschmann.jpg 268 × 370; 17 KB · Ernst B. Thommen.jpg ...",
    "published": null
  },
  {
    "title": "List of presidents of FIFA",
    "url": "https://grokipedia.com/page/List_of_presidents_of_FIFA",
    "snippet": "The list of presidents of FIFA ... since inception, starting with Frenchman <strong>Robert Guérin, who served briefly from 1904 to 1906, and continuing to Swiss-Italian Gianni Infantino</strong>, elected in 2016 and re-elected unopposed in ...",
    "published": null
  }
]