[
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Following a career in the NSW and Victorian public sectors, she was a <strong>senior partner at KPMG in Sydney, Australia from 2005 to 2011, before assuming the role of chief executive of the Business Council of Australia</strong>. She is also a non-executive director of Wesfarmers.",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "Jennifer Westacott has been <strong>Chief Executive of the Business Council of Australia</strong> since 2011, bringing extensive policy experience in both the public and private sectors.",
    "published": null
  },
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "Jennifer was <strong>Chief Executive of the Business Council of Australia</strong>, the leading forum for the heads of over 100 of Australia&#x27;s top companies to contribute to public policy debate, from February 2011 until October 2023. Prior to that, she was a board director and lead partner at KPMG, heading ...",
    "published": null
  },
  {
    "title": "Professor Jennifer Westacott AC | National Security College",
    "url": "https://nsc.anu.edu.au/people/professor-jennifer-westacott-ac",
    "snippet": "Under her leadership, the Business ... grow the economy for the benefit of all Australians. Jennifer <strong>built her career in the public sector, working in senior leadership positions in the NSW and Victorian governments</strong>....",
    "published": null
  },
  {
    "title": "Dr Jennifer Westacott AO | Celebrating UNSW Women",
    "url": "https://www.celebratingwomen.unsw.edu.au/profile/dr-jennifer-westacott-ao",
    "snippet": "She <strong>completed a Bachelor of Arts (Honours) in 1982 at UNSW and later received an Honorary Doctor of Letters, in 2017. She is an Adjunct Professor at UNSW’s City Futures Research Centre and a member of the UNSW Council. Jennifer built her career in the public service and was a senior partner at KPMG</strong>...",
    "published": null
  }
]