[
  {
    "title": "Stanford HAI: Home",
    "url": "https://hai.stanford.edu/",
    "snippet": "HAI founding co-director <strong>Fei-Fei Li</strong> has been named one of TIME&#x27;s 2025 Persons of the Year. From ImageNet to her advocacy for human-centered AI, Dr.",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | Stanford Online",
    "url": "https://online.stanford.edu/schools-centers/stanford-institute-human-centered-artificial-intelligence-hai",
    "snippet": "<strong>Stanford founded the Institute for Human-Centered AI in 2019 to guide and build the future of AI</strong>.HAI advances AI research, education, policy and practice to improve the human condition.",
    "published": "October 17, 2024"
  },
  {
    "title": "About - Stanford HAI",
    "url": "https://hai.stanford.edu/about",
    "snippet": "HAI seeks to develop new human-centered design methods and tools so that AI agents and applications are designed and created with the ability to communicate with, collaborate with, and augment people more effectively, and to make their work better and more enjoyable.",
    "published": null
  },
  {
    "title": "At five years old, Institute for Human-Centered AI looks to the future",
    "url": "https://stanforddaily.com/2024/11/05/stanford-hai-five-years/",
    "snippet": "In HAI’s five years of operation, ... 400 faculty, said HAI co-founder and co-director James Landay, a computer science professor. Landay highlighted HAI’s success in bringing congressional staff from across the political spectrum to Stanford to learn about AI....",
    "published": "November 5, 2024"
  },
  {
    "title": "‘Big steps ahead’ for Stanford HAI | Stanford Report",
    "url": "https://news.stanford.edu/stories/2024/03/stanford-hai-now-whats-next",
    "snippet": "Stanford HAI was <strong>founded by Sequoia Capital Professor Fei-Fei Li; Anand Rajaraman and Venky Harinarayan Professor James Landay; Thomas M.</strong>",
    "published": null
  }
]