[
  {
    "title": "Com Hem 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10876-33",
    "snippet": "Com Hem is a Private company. The current valuation of Com Hem is .",
    "published": null
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - <strong>The Carlyle Group and Providence Equity Partners</strong> today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT. Financial details were not disclosed. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  },
  {
    "title": "Com Hem AB - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn",
    "url": "https://tracxn.com/d/companies/com-hem-ab/__C72ILG9J1X0WjTdDonjKDs7MlEgXfBRoW-3D_-KNVmk",
    "snippet": "Com Hem AB - Media group providing broadband, TV and telephony services. Acquired by <strong>Tele2.</strong> Raised funding over 3 rounds from 1 investor.",
    "published": "November 11, 2025"
  },
  {
    "title": "Hem - 2025 Company Profile, Team, Funding & Competitors - Tracxn",
    "url": "https://tracxn.com/d/companies/hem/__RzsXUsLjn8V1NcFoMplSP3vCaJDKDiei-bGvoH9Lw_c",
    "snippet": "The company&#x27;s operation is limited to the US and Europe. It was created as a pivot out of the Fab.com, while carrying the funding, investors, and valuation of latter. ... Hem got acquired by <strong>Vitra</strong> on Feb 03, 2016.",
    "published": "September 15, 2025"
  },
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "Com Hem was a Swedish brand owned by <strong>Tele2 AB</strong> which supplied Triple Play services that included cable television, broadband internet and fixed-line telephone. Founded in 1983 as Televerket Kabel-TV as part of the former state-owned Televerket, ...",
    "published": "June 6, 2025"
  }
]