[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "The Union is best known for being the leading authority in assigning official names and designations to astronomical objects, and for setting uniform definitions for astronomical principles. It also coordinates with national and international partners, such as UNESCO, to fulfill its mission.",
    "published": "3 weeks ago"
  },
  {
    "title": "International Astronomical Union",
    "url": "https://www.iau.org/",
    "snippet": "The National Astronomical Observatory ... in Astronomy Communication&quot; from 2-6 November 2026 at the NAOJ Mitaka campus in Tokyo, Japan. Read more ... Don&#x27;t miss the dedicated panel discussion &quot;Science in Action: Grassroots Pathways to Development&quot; on 10 November! Read more ... Anne Thieme joins the IAU Secretariat as Membership Coordinator in November 2025. Read more · Become a part of the largest international union of professional ...",
    "published": null
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "<strong>Catherine Cesarsky</strong>, as President for a three-year period (2006-2009). The IAU is a body of distinguished professional astronomers, founded in 1919 to promote and safeguard the science of astronomy in all its aspects through international cooperation.",
    "published": null
  },
  {
    "title": "About",
    "url": "https://www.iau.org/Iau/Iau/About/About.aspx",
    "snippet": "The International Astronomical Union (IAU) was founded in 1919. Its mission is to promote and safeguard the science of astronomy in all its aspects, including research, communication, education and development, through international cooperation. Its individual Members — structured into Divisions, Commissions, and Working Groups — are professional astronomers from all over the world, at the Ph.D.",
    "published": null
  },
  {
    "title": "U.S. National Committee for the International Astronomical ...",
    "url": "https://www.nationalacademies.org/our-work/us-national-committee-for-the-international-astronomical-union-usnc-iau",
    "snippet": "This site requires JavaScript to be enabled",
    "published": null
  }
]