[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "Former members have included Giorgio Napolitano (President of Italy, 2006–2015), Sergio Mattarella (President of Italy, 2015–present), four Prime Ministers (Romano Prodi, Giuliano Amato, Massimo D&#x27;Alema and Renzi), three former leaders (Pier Luigi Bersani, Guglielmo Epifani and, again, Renzi), as well as David Sassoli (President of the European Parliament, 2019–2022), Francesco Rutelli, Pietro Grasso and Carlo Calenda. As of 2025, three regions out of 20 (Emilia-Romagna, Tuscany and Apulia) have Democratic presidents, while in three more regions (Umbria, Campania and Sardinia) the PD is part of the governing coalition.",
    "published": "1 day ago"
  },
  {
    "title": "List of presidents of the Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Presidents_of_the_Democratic_Party_(Italy)",
    "snippet": "The president of the Democratic Party is one of the leaders of the Democratic Party, the main centre-left political party in Italy. The current president is <strong>Stefano Bonaccini</strong>.",
    "published": "April 29, 2025"
  },
  {
    "title": "List of secretaries of the Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Secretaries_of_the_Democratic_Party",
    "snippet": "The secretary of the Democratic Party is the leader of the Democratic Party, the main centre-left political party in Italy.",
    "published": "May 13, 2025"
  },
  {
    "title": "Democratic Party - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q47729",
    "snippet": "Euro, Rinaldi: &quot;Nel Pd gli ultimi sacerdoti dell&#x27;europeismo. Mentre Fassina...&quot; (Italian)",
    "published": null
  },
  {
    "title": "Democratic Party (Italy) facts for kids",
    "url": "https://kids.kiddle.co/Democratic_Party_(Italy)",
    "snippet": "It believes in social democracy, which means it supports fairness and equality for everyone. The party&#x27;s current leader, called the Secretary, is <strong>Elly Schlein</strong>. She was chosen in a special election in 2023.",
    "published": null
  }
]