[
  {
    "title": "Maurice Steijn new head coach Ajax",
    "url": "https://english.ajax.nl/articles/maurice-steijn-new-head-coach-ajax",
    "snippet": "&quot;Maurice Steijn, head coach of Ajax. That sounds very nice.&quot; A big smile appears on the face of the 49-year-old coach. <strong>The former Sparta coach was presented on Wednesday as the successor of John Heitinga</strong>. Steijn feels proud that Ajax has chosen him.",
    "published": null
  },
  {
    "title": "Maurice Steijn nieuwe hoofdtrainer Ajax",
    "url": "https://www.ajax.nl/artikelen/maurice-steijn-nieuwe-hoofdtrainer-ajax",
    "snippet": "Ajax, Sparta Rotterdam en Maurice Steijn hebben overeenstemming bereikt over de overgang van de trainer naar Ajax. <strong>Steijn tekent in Amsterdam een contract dat op 1 juli 2023 ingaat en een looptijd heeft van drie jaar, tot en met 30 juni 2026</strong>.",
    "published": null
  },
  {
    "title": "Ajax announce the appointment of Maurice Steijn as new manager | Flashscore.com",
    "url": "https://www.flashscore.com/news/soccer-eredivisie-ajax-announce-the-appointment-of-maurice-steijn-as-new-manager/rRNW5pbl/",
    "snippet": "<strong>Maurice Steijn has been appointed as Ajax&#x27;s new manager on a three-year contract</strong>, the Eredivisie club said on Wednesday, following a poor season in which they failed to qualify for the Champions League for the first time in 13 seasons.",
    "published": null
  },
  {
    "title": "Maurice Steijn - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Maurice_Steijn",
    "snippet": "In the 2022–23 season, Steijn guided Sparta to a sixth-place finish and reached the final of the European play-offs. In <strong>June 2023</strong>, he departed to become head coach of Ajax after the Amsterdam club activated a clause in his contract.",
    "published": "2 weeks ago"
  },
  {
    "title": "Maurice Steijn set to take over as new Ajax manager | OneFootball",
    "url": "https://onefootball.com/en/news/maurice-steijn-set-to-take-over-as-new-ajax-manager-37661309",
    "snippet": "Sparta Rotterdam head coach <strong>Maurice Steijn is on the brink of joining Dutch giants Ajax</strong>, according to a report by De Telegraaf.",
    "published": null
  }
]