[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "Jacques Brunel (born 14 January 1954) is a French rugby union coach and former player. He was <strong>most recently the French national team head coach</strong>, having previously been assistant coach for his nation and had led the Italian national team between 2011 and 2016.",
    "published": "January 1, 2025"
  },
  {
    "title": "Jacques Brunel, entraineur de rugby de l'équipe de France de rugby",
    "url": "https://www.equipe-france.fr/rugby/jacques-brunel",
    "snippet": "Toutes les informations sur la carrière de Jacques Brunel et les résultats, entraineur de rugby de l&#x27;équipe de France de rugby.",
    "published": null
  },
  {
    "title": "L'ancien entraîneur de France Rugby, Jacques Brunel, est décédé...",
    "url": "https://www.sportnews247.co.uk/2025/01/10/repos-en-paix-lancien-entraineur-de-france-rugby-jacques-brunel-est-decede-apres-avoir-presente-le-lire-la-suite/",
    "snippet": "<strong>Jacques Brunel était une figure emblématique du rugby français, connu pour son engagement, sa passion et son expertise tactique</strong>. Né le 14 janvier 1954 à Courrensan, dans le Gers, Brunel avait débuté sa carrière en tant que joueur avant ...",
    "published": "January 10, 2025"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Coaching his side to the quarterfinals of their home Rugby World Cup a year ago, there is a sense that there is more to come from France as this talented group of players continues to mature. This could no more be seen than when France beat New Zealand 30-29 to register their third-straight win over the All Blacks in enthralling fashion. ... France’s head coach Jacques Brunel (L) before the Japan 2019 Rugby World Cup quarter-final match against Wales.",
    "published": "May 30, 2025"
  },
  {
    "title": "Jacques Brunel | Rugby Union | Players and Officials | ESPN Scrum",
    "url": "http://en.espn.co.uk/france/rugby/player/153670.html",
    "snippet": "Brunel <strong>made his mark as coach Colomiers, with whom he won the European Challenge Cup in 1998</strong>. He repeated this achievement two years later with Pau before being welcomed into the French national set-up.",
    "published": null
  }
]