[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "Later, Richard Mellon Scaife, Ruddy&#x27;s former employer at the Pittsburgh Tribune-Review, invested in the fledgling company. One of the initial board members was author James Dale Davidson, who edited a financial newsletter. Davidson&#x27;s co-editor, Lord Rees-Mogg, former editor of the Times of London, later became chairman of Newsmax.",
    "published": "1 week ago"
  },
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "<strong>Christopher Ruddy</strong> (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and majority owner of Newsmax Media.",
    "published": "5 days ago"
  },
  {
    "title": "Christopher Ruddy | Long Island University",
    "url": "https://liu.edu/roosevelt/~/link.aspx?_id=CBEEEDD71542408AA2E0F8E91B527511&_z=z",
    "snippet": "Ruddy, who grew up near Sagamore ... on current U.S. politics. Ruddy founded Newsmax in 1998 to publish online and offline content in the fields of news, politics, health and finance. Newsmax.com ranks consistently as one of the country&#x27;s most trafficked news websites. Newsmax TV, a cable and ...",
    "published": null
  },
  {
    "title": "Newsmax – Breaking News | News Videos | Politics, Health, Finance",
    "url": "https://www.newsmax.com/",
    "snippet": "Newsmax.com reports today’s news headlines, live news stream, news videos from Americans and global readers seeking the latest in current events, politics, U.S., world news, health, finance, and more.",
    "published": null
  },
  {
    "title": "Chris Ruddy '87C | St. John's University",
    "url": "https://www.stjohns.edu/news-media/success-stories/chris-ruddy-87c",
    "snippet": "Ruddy today presides over the burgeoning success of the media company that includes the news website known as Newsmax.com. The site boasts an estimated 20–30 million monthly visitors and is the third-most viewed political website in the country. Newsmax Magazine has more than 400,000 monthly readers and the company’s cable news channel, Newsmax TV, launched in 2014.",
    "published": null
  }
]