[
  {
    "title": "Petro Poroshenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Petro_Poroshenko",
    "snippet": "Poroshenko said in an interview with Germany&#x27;s Bild newspaper that, &quot;If I am elected, I&#x27;ll wipe the slate clean and will sell the Roshen concern. As president of Ukraine, I will and want to only focus on the well-being of the nation.&quot; On 23 March 2015, Ukrainian President Petro Poroshenko accepted the resignation of billionaire Ihor Kolomoisky as governor of Dnipro region over the control of oil companies.",
    "published": "1 week ago"
  },
  {
    "title": "Petro Poroshenko | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Petro-Poroshenko",
    "snippet": "In 1996 he founded the confectionery manufacturer Roshen and became one of the richest people in Ukraine. After the ouster of Pres. <strong>Viktor Yanukovych</strong> in 2014, a snap election was held and Poroshenko won a landslide victory.",
    "published": "February 13, 2015"
  },
  {
    "title": "Why Poroshenko lost - Atlantic Council",
    "url": "https://www.atlanticcouncil.org/blogs/ukrainealert/why-poroshenko-lost/",
    "snippet": "On April 21, television star <strong>Volodymyr Zelenskiy</strong> crushed incumbent president Petro Poroshenko in the second round of Ukraine’s presidential election. Even though Zelenskiy has never held elected office, voters were so tired of corruption and ...",
    "published": "August 29, 2019"
  },
  {
    "title": "Petro Poroshenko - The Fire Rises Wiki",
    "url": "https://thefireriseswiki.miraheze.org/wiki/Petro_Poroshenko",
    "snippet": "After losing re‑election to <strong>Volodymyr Zelenskyy</strong> in 2019 presidential election, Poroshenko became leader of the European Solidarity (YeS) party and returned to the Verkhovna Rada, where he remains an opposition figure.",
    "published": "September 7, 2025"
  },
  {
    "title": "List of Presidents of Ukraine (1991 - 2022)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-presidents-of-ukraine-1646021751-1",
    "snippet": "Presidents of Ukraine: <strong>Volodymyr Zelensky</strong> is the current and sixth President of Ukraine. He was elected in 2019 after defeating Petro Poroshenko. Ukraine is the second-largest continent after Russia.",
    "published": "February 28, 2022"
  }
]