[
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Peter Norvig (born 14 December 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He previously served as a <strong>director of research and search quality at Google</strong>. Norvig is the co-author with Stuart J.",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Norvig Bio",
    "url": "https://norvig.com/bio.html",
    "snippet": "Peter Norvig is a Distinguished Education Fellow at Stanford&#x27;s Human-Centered Artificial Intelligence Institute and a researcher at Google Inc; previously he directed <strong>Google&#x27;s core search algorithms group and Google&#x27;s Research group</strong>. He was head of NASA Ames&#x27;s Computational Sciences Division, ...",
    "published": null
  },
  {
    "title": "Peter Norvig",
    "url": "https://research.google/people/author205/",
    "snippet": "Peter Norvig is a Director of Research at Google Inc; previously he directed <strong>Google&#x27;s core search algorithms group</strong>.",
    "published": null
  },
  {
    "title": "Dr. Peter Norvig | Stevens Institute of Technology",
    "url": "https://www.stevens.edu/the-presidents-distinguished-lecture-series/dr-peter-norvig",
    "snippet": "BIOGRAPHY: Dr. Peter Norvig is Director of Research at Google Inc. Previously he was <strong>head of Google&#x27;s core search algorithms group, and of NASA Ames&#x27;s Computational Sciences Division</strong>, making him NASA&#x27;s senior computer scientist. He received the NASA Exceptional Achievement Award in 2001.",
    "published": null
  },
  {
    "title": "Peter Norvig | Edge.org",
    "url": "https://www.edge.org/memberbio/peter_norvig",
    "snippet": "At Google Inc he was the Director of Search Quality, responsible for the core web search algorithms from 2002-2005, and has been a Director of Research from 2005 on. Previously he was the <strong>head of the Computational Sciences Division at NASA Ames Research Center</strong>, making him NASA&#x27;s senior computer ...",
    "published": null
  }
]