[
  {
    "title": "Luís Montenegro - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lu%C3%ADs_Montenegro",
    "snippet": "Under Montenegro’s leadership, ... in the 2024 Portuguese legislative election. He was appointed prime minister by President Marcelo Rebelo de Sousa, leading the XXIV Constitutional Government, a coalition minority government. His government fell in March 2025 after losing ...",
    "published": "6 days ago"
  },
  {
    "title": "Portugal's president invites caretaker PM to lead new government | Reuters",
    "url": "https://www.reuters.com/world/europe/portugals-president-invites-caretaker-pm-lead-new-government-2025-05-29/",
    "snippet": "Luis Montenegro, Social Democratic Party (PSD) and Democratic Alliance (AD) leader, meets with Portugal President <strong>Marcelo Rebelo de Sousa</strong> at Belem Palace, following the final results of the general elections in Lisbon, Portugal, May 29, 2025.",
    "published": "May 29, 2025"
  },
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "The president of Portugal, officially the president of the Portuguese Republic (Portuguese: Presidente da República Portuguesa, pronounced [pɾɨziˈðẽtɨ ðɐ ʁɛˈpuβlikɐ puɾtuˈɣezɐ]), is the head of state and highest office of Portugal. The powers, functions and duties of prior ...",
    "published": "1 week ago"
  },
  {
    "title": "Luís Montenegro - Prime Minister - XXIV Constitutional Government",
    "url": "https://www.portugal.gov.pt/en/gc24/prime-minister",
    "snippet": "He became a member of Parliament in 2002, having been elected in four consecutive legislative elections after that date (2005, 2009, 2011, and 2015), having been in Parliament for 16 years and President of the PSD Parliamentary Group from 2011 to 2017. He has been leader of the Social Democrats (PSD) since 28 May 2022. News · 2025-04-29 at 14h57 ·",
    "published": null
  },
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "<strong>Marcelo Rebelo de Sousa</strong> was elected President of the Republic for the first time on 24 January 2016 and took office on 9 March. He was re-elected for a second term on 24 January 2021 and took office on 9 March of the same year.",
    "published": null
  }
]