[
  {
    "title": "Igor Tudor - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Igor_Tudor",
    "snippet": "<strong>On 23 March 2025, Tudor replaced Thiago Motta as head coach of Serie A club Juventus</strong>. This appointment marked the first time Juventus had appointed a foreign manager since Didier Deschamps in the 2006–07 season. He eventually guided the club to the fourth place of league table and Champions ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "Juventus Football Club announces that it has today relieved Igor Tudor of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": null
  },
  {
    "title": "Igor Tudor to remain as Juventus head coach for 2025-26 season - The Athletic",
    "url": "https://www.nytimes.com/athletic/6415592/2025/06/10/igor-tudor-juventus-next-season/",
    "snippet": "Tudor spent much of his playing career with Juventus, making <strong>174 appearances over nine years at the club and winning Serie A in 2002 and 2003.</strong> He began his coaching career with Hajduk Split in his native Croatia in 2013 and had spells with PAOK, ...",
    "published": "June 19, 2025"
  },
  {
    "title": "Back in Bianconero | All you need to know about new Juventus coach Igor Tudor - Juventus",
    "url": "https://www.juventus.com/en/news/articles/back-in-bianconero-all-you-need-to-know-about-new-juventus-coach-igor-tudor",
    "snippet": "<strong>After hanging up his boots and starting his coaching career, he returned to Turin in 2020/21 to work with Andrea Pirlo</strong>, offering his experience to the team and helping to win the Italian Cup and Italian Super Cup.",
    "published": null
  },
  {
    "title": "Juventus sack coach Igor Tudor after seven months in charge - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/46743501/juventus-sack-head-coach-igor-tudor-seven-months-charge",
    "snippet": "Tudor <strong>played for Juventus for nearly a decade from 1998-2007</strong> and he previously coached Udinese, Hellas Verona and Lazio in Italy.",
    "published": "October 27, 2025"
  }
]