[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "The site&#x27;s new owner, Disney, hired G. Elliott Morris to develop a new model. On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to <strong>ABC News</strong> pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight.",
    "published": "1 month ago"
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "On July 22, 2013, <strong>ESPN (a subsidiary of the Walt Disney Company)</strong> announced that it had acquired ownership of the FiveThirtyEight website and brand, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming ...",
    "published": "1 day ago"
  },
  {
    "title": "FiveThirtyEight Founder Nate Silver Leaving ABC News as Disney Layoffs Continue",
    "url": "https://variety.com/2023/digital/news/fivethirtyeight-nate-silver-leaves-abc-news-disney-layoffs-1235594060/",
    "snippet": "Founded in 2008, FiveThirtyEight became a licensed feature of The New York Times’ website and was renamed FiveThirtyEight: Nate Silver’s Political Calculus. <strong>ESPN acquired the brand in 2013 before it moved over to Disney sister company ABC News</strong> ...",
    "published": "April 25, 2023"
  },
  {
    "title": "Our Data | FiveThirtyEight",
    "url": "https://data.fivethirtyeight.com",
    "snippet": "We’re sharing the data and code behind some of our articles and graphics. We hope you’ll use it to check our work and to create stories and visualizations of your own.",
    "published": "February 9, 2018"
  },
  {
    "title": "About Us | FiveThirtyEight",
    "url": "https://fivethirtyeight.com/about-us/",
    "snippet": "FiveThirtyEight uses statistical analysis - hard numbers - to tell compelling stories about elections, politics and American society.",
    "published": "June 30, 2023"
  }
]