[
  {
    "title": "Current Shareholding - Juventus Football Club",
    "url": "https://www.juventus.com/en/club/investor-relations/shareholding-title/current-shareholding",
    "snippet": "As of 7 November 2025 the shareholding structure of Juventus Football Club S.p.A.",
    "published": null
  },
  {
    "title": "Who owns Juventus FC? Owners' net worth, source of wealth and ownership history",
    "url": "https://www.interestingfootball.com/2025/05/who-owns-juventus-fc-owners-net-worth.html",
    "snippet": "Juventus FC is currently owned by <strong>Exor N.V., the entity controlled by the Agnelli family with up to 63.77% of the club, while the remaining shares are held by institutional investors</strong>.",
    "published": null
  },
  {
    "title": "Juventus Owners: Past & Present Ownership Details",
    "url": "https://www.sportsdunia.com/football-teams/juventus-owners",
    "snippet": "Currently, <strong>Exor N.V. is the main owner of Juventus</strong>. However, the Agnelli Family is the owner of Exor N.V., as most family members of the Agnelli Family are the stakeholders in Exor, and the company was founded by Giovanni Agnelli.",
    "published": "June 27, 2025"
  },
  {
    "title": "Agnelli family affirms Juventus ownership and rejects buyout offer from cryptocurrency firm - The Washington Post",
    "url": "https://www.washingtonpost.com/sports/soccer/2025/12/13/juventus-exor-agnelli-ownership/fd5c4024-d844-11f0-a93c-a869cf73ebd6_story.html",
    "snippet": "TURIN, Italy — Juventus’ owners publicly rejected a buyout offer from a cryptocurrency firm on Saturday — ensuring that the most successful club in Serie A history will remain controlled by <strong>the Agnelli family</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Juventus Rejects €1.1 Billion All-Cash Takeover Bid From Tether, Says No to Crypto Ownership - HOKANEWS.COM",
    "url": "https://www.hokanews.com/2025/12/juventus-rejects-11-billion-all-cash.html",
    "snippet": "Juventus is currently controlled by EXOR, the holding company of Italy’s Agnelli family, which owns a majority stake in the club. The family’s involvement with Juventus dates back to 1923, making it one of the longest continuous ownership relationships in professional football.",
    "published": "1 week ago"
  }
]