[
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "In 2021, he was appointed as Minister of Security in replacement of <strong>Sabina Frederic</strong>, as part of a cabinet reshuffle following the government&#x27;s poor showings in the 2021 legislative primary elections. In 2006, Anibal Fernández, who was serving as the Interior Minister at the time, referred ...",
    "published": "November 15, 2025"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "During Kirchner’s government he was named minister of interior in 2003 and in 2007, and during <strong>Cristina Fernandez</strong>’s government, he was assigned as minister of justice, security and human rights.",
    "published": null
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "He has been a close supporter of former Presidents Néstor Kirchner and Cristina Fernández de Kirchner. From 2021 to 2023, he served as Argentina&#x27;s Minister of Security under President <strong>Alberto Fernández</strong>.",
    "published": null
  },
  {
    "title": "Presidency of Alberto Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Presidency_of_Alberto_Fern%C3%A1ndez",
    "snippet": "In addition, the resolution annulled ... &quot;allowed security forces to harm the rights of LGBT citizens&quot;. In April 2020, Frederic stated that the ministry would continue her predecessor&#x27;s policy of cyber surveillance to measure &quot;social humour&quot;; these statements were widely criticized by social organizations and the Opposition. As one of his initial measures in the presidency, Fernández intervened ...",
    "published": "November 7, 2025"
  },
  {
    "title": "Aníbal Fernández - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q2857937",
    "snippet": "Aníbal Fernández, nuevo abogado de Cristóbal López: lo defenderá en las causas civiles (Spanish) position held · Minister of Security · start time · 20 September 2021 · replaces · <strong>Sabina Frederic</strong> · end time · 10 December 2023 · ...",
    "published": null
  }
]