[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "Former members have included Giorgio ... Calenda. As of 2025, <strong>three regions out of 20 (Emilia-Romagna, Tuscany and Apulia) have Democratic presidents, while in three more regions (Umbria, Campania and Sardinia) the PD is part of the governing coalition</strong>....",
    "published": "1 day ago"
  },
  {
    "title": "Italy - Democrats Abroad",
    "url": "https://www.democratsabroad.org/it",
    "snippet": "Join us at our next virtual Leadership Team Meeting... ... Raise a Glass for Democracy: Wine Tasting with Democrats Abroad Italy Southern Chapter 🍷 ... ... A Personal Reflection: The Legacy of Food Insecurity When I was a child, my mother relied on food stamps to feed us. I remember standing beside her in the grocery...... ... What to Do Wednesday Your Weekly Guide to Staying Politically Active—From Abroad Wednesday, 15 October, 2025 Dear Democrats Abroad Italy Member, EVERY ELECTION MATTERS — INCLUDING 2025 Your vote matters—every......",
    "published": null
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "Italy’s Democrats have often posed as a guarantor of institutional stability and Rome’s Atlanticist line. Current leader Elly Schlein has tacked left, but it’s done little to change the party’s identity as a force for steadying Italian capitalism.",
    "published": null
  },
  {
    "title": "Democratic Party – Democratic and Progressive Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_–_Democratic_and_Progressive_Italy",
    "snippet": "Having soon conceded the election, Letta announced his resignation as party secretary, and he said that the PD–IP would provide a &quot;strong and intransigent opposition&quot;. After the 2022 Italian government formation and the establishment of the Meloni Cabinet, the PD–IDP became a parliamentary group at the opposition level and voted against Giorgia Meloni&#x27;s government in the confidence vote in both houses of the Italian Parliament on 25–26 October.",
    "published": "August 9, 2025"
  },
  {
    "title": "Matteo Renzi: a new leadership style for the Italian Democratic Party and Italian politics | Modern Italy | Cambridge Core",
    "url": "https://www.cambridge.org/core/journals/modern-italy/article/abs/matteo-renzi-a-new-leadership-style-for-the-italian-democratic-party-and-italian-politics/975FB37A259CA7C1A002FFDDE301A6C2",
    "snippet": "<strong>Matteo Renzi</strong>’s eruption on to the Italian political scene is now overcoming the inertia of the Italian political system, with a highly personalised leadership style which is challenging the Democratic Party’s (Partito Democratico, PD) ...",
    "published": "March 1, 2016"
  }
]