[
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "Sebastian Newbold Coe, Baron Coe, CH, KBE, Hon FRIBA (born 29 September 1956), often referred to as Seb Coe, is a British sports administrator, former politician and retired track and field athlete. As a middle-distance runner, Coe won four Olympic medals, including 1500 metres gold medals at the Olympic Games in 1980 and 1984. He set nine outdoor and three indoor world records in middle-distance track events – including, in 1979, setting three world records in the space of 41 days – and the world record he set in the 800 metres in 1981 remained unbroken until 1997.",
    "published": "1 month ago"
  },
  {
    "title": "Sebastian COE | Profile | World Athletics",
    "url": "https://worldathletics.org/athletes/great-britain-ni/sebastian-coe-14354392",
    "snippet": "ATHLETE OVERVIEW · STATISTICS · Sebastian COE · 800m · 1500m · 1000m · Mile · 800m sh · Great Britain &amp; N.I. Born29 SEP 1956 · Sebastian&#x27;s code14354392 · 2X · Olympic champion · 2X · Olympic Games silver medallist · 1X · European champion · 2X · European Championships silver medallist ·",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "Sebastian Coe is <strong>Chancellor of Loughborough University</strong>, Executive Chairman of CSM Sport and Entertainment and a member of the IOC Tokyo 2020 Coordination Committee and council member of the Association of Summer Olympic International Federations.",
    "published": null
  },
  {
    "title": "Lord Sebastian COE",
    "url": "https://www.olympics.com/ioc/lord-sebastian-coe",
    "snippet": "Athlete (retired 1990); Member of Parliament for Falmouth and Camborne (1992-1997); Private Secretary to the Leader of the Opposition (1997-2001); Chair, London bid to host the 2012 Olympic and Paralympic Games (2004); Chair, London Organising Committee of the Olympic Games and Paralympic Games (LOCOG) (2005-2012); Chair, British Olympic Association (2012-2016); Executive Chairman of CSM Sport and Entertainment (2013-2020); Non-Executive Chairman of CSM Sport and Entertainment (now Wasserman) (2020-); Vice-President (2007-2015) and then President, International Association of Athletics Federations (now World Athletics) (2015-2019 and 2019-)",
    "published": null
  },
  {
    "title": "Sebastian COE",
    "url": "https://www.olympics.com/en/athletes/sebastian-coe",
    "snippet": "Coe is one of the finest <strong>middle distance runners</strong> the world has ever seen; the only man to have won 1500m Olympic gold twice.",
    "published": null
  }
]