[
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "On June 14, 2022, she began hosting The Record with Greta van Susteren on Newsmax. A former <strong>criminal defense and civil trial lawyer</strong>, she appeared as a legal analyst on CNN co-hosting Burden of Proof with Roger Cossack from 1994 to 2002, playing defense attorney to Cossack&#x27;s prosecutor.",
    "published": "August 20, 2025"
  },
  {
    "title": "Greta van Susteren :: New Netherland Institute",
    "url": "https://www.newnetherlandinstitute.org/history-and-heritage/dutch_americans/greta-van-susteren",
    "snippet": "Greta Van Susteren is a journalist and well known television personality, currently on the Fox News Channel, and earlier, from 1991 to 2002, on the CNN Channel. Van Susteren started her journalistic career, on CNN, as a <strong>legal analyst</strong>, and first came into prominence with the William Kennedy ...",
    "published": null
  },
  {
    "title": "Greta Van Susteren – USC Center on Communication Leadership and Policy",
    "url": "https://communicationleadership.usc.edu/cp_school_directory/greta-van-susteren/",
    "snippet": "Prior to Fox, Greta worked at CNN for 7 years where she started out as a <strong>legal analyst</strong> then became co-host of CNN’s daily legal program Burden of Proof. She went on to host the channel’s prime time news and analysis show The Point with Greta Van Susteren.",
    "published": null
  },
  {
    "title": "Greta Van Susteren - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1336063/bio/",
    "snippet": "Van Susteren became a <strong>legal analyst at Ted Turner&#x27;s CNN network</strong> in 1991, and was also co-host of the network&#x27;s legal talk show, &quot;Burden of Proof&quot;, around the same time. A critically acclaimed journalist and TV personality (due largely to her ...",
    "published": null
  },
  {
    "title": "Greta Van Susteren",
    "url": "https://www.forbes.com/profile/greta-van-susteren/",
    "snippet": "A former <strong>criminal defense and civil trial lawyer</strong>, the Georgetown law grad got her start on TV as a legal commentator at CNN, contributing to coverage of the O.J. Simpson murder trial and the Elian Gonzalez custody battle.",
    "published": null
  }
]