[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "In 1975, she became <strong>director of planning for the National Center for Urban Ethnic Affairs</strong>, a Washington-based organization founded by Catholic priest Geno Baroni, where she worked until 1977. Afterwards, she joined the Carter administration as a domestic policy advisor on urban affairs and ...",
    "published": "1 week ago"
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "Marcy Kaptur, the Representative from Ohio - in Congress from 1983 through Present",
    "published": null
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "Congresswoman Kaptur, a native Toledoan, lives in the same modest house where she grew up. She is a Polish-American with humble, working class roots. Her family operated a small grocery store and her mother later served on the original organizing committee of a trade union at the Champion Spark Plug factory in Toledo. After graduating from St. Ursula Academy, she became the first member of her family to attend college, earning a bachelor&#x27;s degree in history from the University of Wisconsin (1968) and later a master&#x27;s degree in urban planning from the University of Michigan.",
    "published": "May 27, 2025"
  },
  {
    "title": "The Honorable Marcy Kaptur (D-OH) Biography",
    "url": "https://www.congress.gov/115/meeting/house/108368/witnesses/HHRG-115-VR03-Bio-K000009-20180613.pdf",
    "snippet": "earning a bachelor’s degree in history from the University of Wisconsin (1968) and later a master’s · degree in urban planning from the University of Michigan. <strong>After working for 15 years as a city and regional planner, primarily in Toledo and Chicago</strong>, she accepted",
    "published": null
  },
  {
    "title": "Marcy Kaptur's story",
    "url": "https://www.bgsu.edu/arts-and-sciences/political-science/trailblazing-women-in-ohio-politics/marcy-kaptur.html",
    "snippet": "Despite her underdog status, Kaptur went on to win the race. Think about a time when you were underestimated. How did you respond? A Democrat, Marcy Kaptur <strong>worked with Republicans to establish a World War II Memorial in Washington</strong>.",
    "published": null
  }
]