[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "Eurosport was closed down in May ... was saved later that month when <strong>the TF1 Group (formed after the French government privatised the post ORTF-split TF1 5 years prior to the acquisition) stepped in to replace BSkyB as joint owners</strong>....",
    "published": "2 days ago"
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "Eurosport 1 is a television sports network channel which is a division of Eurosport and a subsidiary of EMEA version of Warner Bros. Discovery. <strong>Discovery took a 20% minority interest share in December 2012, and became majority shareholder in the Eurosport venture with TF1 in January 2014</strong>, taking ...",
    "published": "1 week ago"
  },
  {
    "title": "Eurosport | Warner Bros. Entertainment Wiki | Fandom",
    "url": "https://warnerbros.fandom.com/wiki/Eurosport",
    "snippet": "Discovery through its TNT Sports ... territories, and streams on Max and Discovery+. <strong>Originally a joint venture between the European Broadcasting Union and Sky established in 1989</strong>, it was briefly shut down in 1991 following complaints ...",
    "published": null
  },
  {
    "title": "History of Télévision Françse 1 – FundingUniverse",
    "url": "https://www.fundinguniverse.com/company-histories/t%C3%A9l%C3%A9vision-fran%C3%A7se-1-history/",
    "snippet": "<strong>In 1991 the company agreed to take over operations of the struggling Eurosport channel</strong>, the first European-wide sports broadcaster, principally to the cable market; in that year TF1 added a French-language version of Eurosport.",
    "published": null
  },
  {
    "title": "Eurosport and BT Sport will disappear after TNT Sports rebrand | TNT Sports | The Guardian",
    "url": "https://amp.theguardian.com/media/2023/feb/21/eurosport-bt-sport-disappear-tnt-rebrand-tv",
    "snippet": "<strong>WBD, which has a call option to take full control of the joint venture until September 2026, took a 20% stake in Eurosport in 2012 before taking full ownership from French media group TF1 in 2015.</strong>",
    "published": "September 25, 2024"
  }
]