[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first <strong>Simonyi Professor for the Public Understanding of Science</strong>, a position he held until 2008, and ...",
    "published": "3 days ago"
  },
  {
    "title": "Richard Dawkins: A Biography | Discovery Institute",
    "url": "https://www.discovery.org/a/10291/",
    "snippet": "The most readily recognizable figure ... held from 1995, by which time he had effectively discontinued his career as a <strong>publishing research scientist</strong>....",
    "published": "October 15, 2024"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "(2006) and The Enemies of Reason (2007) and celebrating the achievements of Darwin in The Genius of Charles Darwin (2008). Sex, Death, and the Meaning of Life (2012) explores the implications of living without religious faith. In the memoir An Appetite for Wonder: The Making of a Scientist (2013), Dawkins chronicled his life up to the publication of The Selfish Gene. A second volume of memoir, Brief Candle in the Dark: My Life in Science (2015), recorded episodes from the latter part of his career.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins Says Goodbye - The Atlantic",
    "url": "https://www.theatlantic.com/science/archive/2024/09/richard-dawkins-final-bow/680018/",
    "snippet": "As his career wraps up, a man of big ideas takes on ever smaller targets. ... For nearly five decades, Richard Dawkins has enjoyed a global fame rarely achieved by scientists. He has adapted his swaggering Oxbridge eloquence to a variety of media ecosystems. He began as an explainer of nature, a David Attenborough in print.",
    "published": "October 1, 2024"
  },
  {
    "title": "Richard Dawkins facts for kids",
    "url": "https://kids.kiddle.co/Richard_Dawkins",
    "snippet": "From 1967 to 1969, Dawkins was an assistant professor of zoology at the University of California, Berkeley. He then returned to the University of Oxford in 1970 as a lecturer. In 1995, he became Oxford&#x27;s first Professor for the Public Understanding of Science. This job was created for a scientist who could explain science clearly to everyone, not just other scientists. He held this position until he retired in 2008.",
    "published": null
  }
]