[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Commission 46 is a Committee of the Executive Committee of the IAU, playing a special role in the discussion of astronomy development with governments and scientific academies. The IAU is affiliated with the International Council of Scientific Unions (ICSU), a non-governmental organization representing a global membership that includes both national scientific bodies and international scientific unions.",
    "published": "3 weeks ago"
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "<strong>Catherine Cesarsky</strong>, as President for a three-year period (2006-2009). The IAU is a body of distinguished professional astronomers, founded in 1919 to promote and safeguard the science of astronomy in all its aspects through international cooperation.",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://www.iau.org/administration/executive_bodies/past_committees/executive_committee/",
    "snippet": "Debra Meloy Elmegreen · Piero Benvenuti (Interim General Secretary) <strong>José Miguel Rodriguez Espinosa</strong>",
    "published": null
  },
  {
    "title": "USNC/IAU Committee | American Astronomical Society",
    "url": "https://aas.org/comms/usnc-iau-committee",
    "snippet": "Chair: <strong>Martha P. Haynes</strong> ... Secretary: Alice K. B. Monet · NASEM Staff Officer: Ana Ferreras, Category V (Ex officio, non-voting) Charge: Effects appropriate participation by the United States in International Astronomical Union through the National Academy of Sciences-National Research Council.",
    "published": null
  },
  {
    "title": "The History of the International Astronomical Union",
    "url": "https://adsabs.harvard.edu/full/1949PASP...61....5A",
    "snippet": "A powerful, streamlined new Astrophysics Data System",
    "published": null
  }
]