[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the <strong>secretary of the Democratic Party (PD) since 12 March 2023</strong>. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "2 weeks ago"
  },
  {
    "title": "4 Things to Know About Elly Schlein, Face of Italy's Largest Opposition Party | ITALY Magazine",
    "url": "https://www.italymagazine.com/featured-story/4-things-know-about-elly-schlein-face-italys-largest-opposition-party",
    "snippet": "<strong>On March 12, 37-year-old Elly Schlein will officially take the helm of Italy&#x27;s struggling Partito Democratico (Democratic Party or PD).</strong> Here&#x27;s a rundown of her biography and basic stats.",
    "published": "March 9, 2023"
  },
  {
    "title": "Italy's left picks 'anti-Meloni' politician Elly Schlein to lead the party | Euronews",
    "url": "https://www.euronews.com/my-europe/2023/02/27/the-anti-meloni-meet-elly-schlein-italys-breakout-left-wing-star",
    "snippet": "After cutting her political teeth across the Atlantic, Schlein <strong>became an impassioned youth activist for the Democratic Party and was elected as a member of the European Parliament in 2014.</strong>",
    "published": "March 1, 2023"
  },
  {
    "title": "Elly Schlein: The first woman and LGBTIQ+ leader of Italy’s left | openDemocracy",
    "url": "https://www.opendemocracy.net/en/5050/italy-left-elly-schlein-woman-lgbtiq-democratic-party/",
    "snippet": "Another woman has shaken up Italy’s male-dominated political scene – but this time, she’s a feminist, openly queer and left-wing. Say hello to Elly Schlein, 37, the new <strong>head of the progressive Democratic Party (PD).</strong>",
    "published": "March 9, 2023"
  },
  {
    "title": "Italy's AOC - how Elly Schlein is shaking up Italian politics",
    "url": "https://www.cnbc.com/2023/03/13/italy-aoc-elly-schlein-pd-is-reviving-italian-politics.html",
    "snippet": "Elly Schlein was elected as the <strong>center-left party Partito Democratico (PD) leader</strong> earlier this month — the first female to get the job. Born in Switzerland to an Italian mother and an American father, she became a lawmaker in the European ...",
    "published": "March 13, 2023"
  }
]