[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "In May 2015, Schlein announced through a post on Facebook that she was leaving the PD, being in deep disagreement with the new political line of the party imposed by the party secretary and Italy&#x27;s prime minister Matteo Renzi, and joined Possible, the party <strong>founded by Civati</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "8th parliamentary term | Elly SCHLEIN | MEPs | European Parliament",
    "url": "https://www.europarl.europa.eu/meps/en/124804/ELLY_SCHLEIN/history/8",
    "snippet": "01-07-2014 / 08-07-2015 : <strong>Partito Democratico (Italy)</strong>",
    "published": null
  },
  {
    "title": "Why Elly Schlein is freaking out Italy’s ‘soft’ socialists",
    "url": "https://www.politico.eu/article/elly-schlein-italy-soft-socialist-democratic-party-leader/",
    "snippet": "The expert on the Italian center-left argues that Schlein and many of her allies hail from leftist splinter groups and were not members of the PD until barely a few months ago — discrediting them in their critics’ eyes. ... Ex-Cabinet minister Giuseppe Fioroni, among the founding members of the PD, told POLITICO: “Her project has nothing to do with my history and my political culture.” Having foreseen the outcome, Fioroni left the party one day before Schlein’s victory was announced.",
    "published": "March 2, 2023"
  },
  {
    "title": "Elly Schlein Will Tilt Italy’s Democrats to the Left, but Don’t Expect Revolutionary Change",
    "url": "https://jacobin.com/2023/03/elly-schlein-italy-democratic-party-left-primary-election/",
    "snippet": "Just as they might abandon all collective participation if Schlein’s leadership proves to be an only brief interlude, as in the case of some of her predecessors. There would, in all likelihood, have been no Elly Schlein to lead the PD if there had been no Prime Minister Giorgia Meloni. The presence of a woman at the helm of the first radical-right-led government in the Republic’s history challenged the center-left at the level of leadership, producing a PD segretaria who really seems to be the opposite of Meloni in every way.",
    "published": null
  },
  {
    "title": "Elly Schlein facts for kids",
    "url": "https://kids.kiddle.co/Elly_Schlein",
    "snippet": "This was a big moment because <strong>she became the first woman and the youngest person to lead the Democratic Party</strong> since it was formed in 2007. In April 2023, Elly Schlein shared her personal views on surrogacy.",
    "published": null
  }
]