[
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "The prime minister of Spain, officially the president of the Government (Spanish: Presidente del Gobierno), is the head of government of Spain. The prime minister nominates the ministers and chairs the Council of Ministers. In this sense, the prime minister establishes the Government policies and coordinates the actions of the Cabinet members.",
    "published": "3 weeks ago"
  },
  {
    "title": "La Moncloa. Pedro Sánchez Pérez-Castejón [Biography]",
    "url": "https://www.lamoncloa.gob.es/lang/en/presidente/biografia/paginas/index.aspx",
    "snippet": "<strong>Pedro Sánchez</strong> has been President of the Government of Spain since June 2018. He holds a Doctorate in Economics and is General Secretary of the Spanish Socialist Workers&#x27; Party (Spanish acronym: PSOE), which he joined in 1993.",
    "published": null
  },
  {
    "title": "Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pedro_S%C3%A1nchez",
    "snippet": "<strong>Pedro Sánchez Pérez-Castejón</strong> (Spanish pronunciation: [ˈpeðɾo ˈsantʃeθ ˈpeɾeθ kasteˈxon] ⓘ; born 29 February 1972) is a Spanish politician and economist who has served as Prime Minister of Spain since 2018.",
    "published": "4 days ago"
  },
  {
    "title": "Spain – EU country | European Union",
    "url": "https://european-union.europa.eu/principles-countries-history/eu-countries/spain_en",
    "snippet": "During these 6 months, ministers from that country&#x27;s government chair and help determine the agenda of Council meetings in the different policy areas, and facilitate dialogue with the other EU institutions. ... The European Commissioner nominated by Spain is Teresa Ribera Rodríguez who is the Executive Vice-President for Clean, Just and Competitive Transition.",
    "published": null
  },
  {
    "title": "Pedro Sanchez - BBC News",
    "url": "https://www.bbc.com/news/topics/c5wdv20l9zzt",
    "snippet": "... <strong>Pedro Sánchez</strong> faces mounting pressure after an escalating corruption scandal brought down a senior colleague. ... <strong>Pedro Sánchez</strong> warns against &quot;double standards&quot; after Russia was banned from the song contest in 2022. ... However diversified Spain&#x27;s energy mix is, the blackout required ...",
    "published": null
  }
]