[
  {
    "title": "Sir Suma Chakrabarti | City of London School",
    "url": "https://www.cityoflondonschool.org.uk/interview/sir-suma-chakrabarti/",
    "snippet": "Sir Suma Chakrabarti was at <strong>City of London School</strong> from 1970 to 1976. After a BA in Politics, Philosophy and Economics at...",
    "published": "July 15, 2025"
  },
  {
    "title": "Suma Chakrabarti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Suma_Chakrabarti",
    "snippet": "Chakrabarti was born in 1959 in Jalpaiguri, West Bengal, India. He was educated at <strong>City of London School; New College, Oxford (BA in Philosophy, Politics, and Economics); and the University of Sussex (MA in Development Economics).</strong>",
    "published": "September 16, 2025"
  },
  {
    "title": "Suma Chakrabarti | World Bank Live",
    "url": "https://live.worldbank.org/en/experts/s/suma-chakrabarti",
    "snippet": "After studying Politics, Philosophy and Economics at the <strong>University of Oxford</strong>, Sir Suma took a Masters in Development Economics at the University of Sussex. He holds honorary doctorates from the Universities of Sussex and East Anglia, as well ...",
    "published": null
  },
  {
    "title": "Suma Chakrabarti",
    "url": "https://www.bruegel.org/people/suma-chakrabarti",
    "snippet": "After studying Politics, Philosophy and Economics at the <strong>University of Oxford</strong>, Sir Suma took a Masters in Development Economics at the University of Sussex.",
    "published": null
  },
  {
    "title": "‘The British civil service is much more open to people from a different national origin’ - Telegraph India",
    "url": "https://www.telegraphindia.com/7-days/the-british-civil-service-is-much-more-open-to-people-from-a-different-national-origin/cid/1535746",
    "snippet": "Then 10 years old, Chakrabarti was admitted to <strong>St Xavier</strong>’s School, but was unable to attend classes even for a single day “because there was a Naxalite rebellion going on,” he dimly remembers.",
    "published": "August 29, 2018"
  }
]