[
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Ada Solomon has served as <strong>deputy chair of the board for the past six years</strong> and was previously a full board member. A member of the European Film Academy since 2011, she is the first Romanian woman to hold a leadership role within the board.",
    "published": "3 weeks ago"
  },
  {
    "title": "Producer Ada Solomon elected European Film Academy board chair - AGERPRES",
    "url": "https://agerpres.ro/english/2025/12/04/producer-ada-solomon-elected-european-film-academy-board-chair--1508684",
    "snippet": "Producer Ada Solomon, recognised for a career of more than 25 years in film, has been <strong>elected board chair of the European Film Academy</strong> following votes cast by more than 5,400 members. According to a press release sent to AGERPRES on Thursday, with Ada Solomon&#x27;s appointment Romania is now ...",
    "published": null
  },
  {
    "title": "Romanian Producer Ada Solomon Elected New Chair of EFA’s Board - FilmNewEurope.com",
    "url": "https://filmneweurope.com/news/region/item/127511-romanian-producer-ada-solomon-elected-new-chair-of-efa-s-board",
    "snippet": "BERLIN: <strong>Romanian producer Ada Solomon is the new chair of the Board of the European Film Academy</strong>, as Mike Downey’s term has come to an end. Her new deputy chairs are Dutch producer Leontine Petit and French consultant Matthieu Darras.",
    "published": "2 weeks ago"
  },
  {
    "title": "Romania’s Ada Solomon elected chair of European Film Academy board | News | Screen",
    "url": "https://www.screendaily.com/news/romanias-ada-solomon-elected-chair-of-european-film-academy-board/5211635.article",
    "snippet": "<strong>Romanian producer Ada Solomon has been elected chair of the European Film Academy (EFA) board</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "In 2026, the complete board of ... Giorgos Karnavas (Greece), re-elected Austria, Germany, Liechtenstein, Switzerland <strong>Maria Schrader</strong> (current mandate until end 2026) Azerbaijan, Kazakhstan, Palestine, Turkey Najwa Najjar ...",
    "published": "3 weeks ago"
  }
]