[
  {
    "title": "Borussia Dortmund - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Borussia_Dortmund",
    "snippet": "Borussia Dortmund GmbH &amp; Co. KGaA became the first and, so far, the only publicly traded sports club on the German stock market. 4.61% of Borussia Dortmund GmbH &amp; Co. KGaA is owned by the sports club, <strong>Borussia Dortmund e.V.</strong>; 8.24% by Bernd Geske; and 67.24% widely spread shareholdings.",
    "published": "2 weeks ago"
  },
  {
    "title": "Borussia Dortmund GmbH : Shareholders Board Members Managers and Company Profile | DE0005493092 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/BORUSSIA-DORTMUND-GMBH-435951/company/",
    "snippet": "Borussia Dortmund GmbH &amp; Co KGaA is a Germany-based company engaged in the operation of Ballspielverein Borussia (BVB), a professional football club based in Dortmund, Germany. The Company has around 8 functional areas such as sports, communications, human resources, organization, finance, legal and IR, marketing and digitalization, commercial partnerships.",
    "published": null
  },
  {
    "title": "Hans-Joachim Watzke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hans-Joachim_Watzke",
    "snippet": "<strong>Hans-Joachim &quot;Aki&quot; Watzke</strong> (born 21 June 1959, Marsberg, North Rhine-Westphalia) is a German businessman and football official. He served as the CEO of Borussia Dortmund from 2005 until 2025 and is the club&#x27;s elected president since November 23, 2025.",
    "published": "1 month ago"
  },
  {
    "title": "Ownership of Borussia Dortmund | Download Scientific Diagram",
    "url": "https://www.researchgate.net/figure/Ownership-of-Borussia-Dortmund_fig5_344375289",
    "snippet": "... Members&#x27; associations, also known as supporter-owned or community-owned clubs, are primarily found in Germany (e.g., <strong>FC Bayern Munich</strong> and BV Borussia Dortmund) and, to some extent, in Spain (e.g., Real Madrid CF and FC Barcelona)",
    "published": null
  },
  {
    "title": "Who Owns Borussia Dortmund? BVB Shareholders - Investing.com",
    "url": "https://www.investing.com/equities/borussia-dortmund-gmbh-co-kgaa-ownership",
    "snippet": "DORTMUND, Germany - The Deutsche Fußball Liga (DFL) has successfully negotiated a significant media rights deal for the upcoming... ... Introduction &amp; Market Context Borussia Dortmund GmbH &amp; Co KGaA (XETRA:BVB) presented its financial results for the fiscal year...",
    "published": null
  }
]