[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "On March 24, 1999, Regency executive <strong>David Matalon</strong> joined the supervisory board of Puma AG, an international sports company. At the time, Regency Enterprises (the holding company) was the largest single shareholder in Puma, with more than a 25% stake.",
    "published": "4 days ago"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "After the incredible successes of his films “Pretty Woman” and “The War of the Roses,” Milchan founded New Regency Productions and went on to produce countless critical and box office successes including “J.F.K,” “A Time to Kill,” “Free Willy,” “The Client,” “Tin Cup,” “Under Siege,” “The Devil’s Advocate,” “The Negotiator,” “City of Angels,” “Entrapment,” “Fight Club,” “Big Momma’s House,” “Don’t Say a Word,” “Daredevil,” “Man on Fire,” “Mr.",
    "published": null
  },
  {
    "title": "ABOUT US: Regency Enterprises Services - regencystl",
    "url": "https://www.regencystl.com/about-us",
    "snippet": "<strong>Charles Brown founded Regency Enterprises Services in 2004</strong> and brings 17 years of management experience in the operations and fleet maintenance side of the trash industry. He is heavily involved in the local organization Mary Ryder Home on its Board of Directors.",
    "published": null
  },
  {
    "title": "Regency Enterprises",
    "url": "https://grokipedia.com/page/Regency_Enterprises",
    "snippet": "The division operates under the oversight of Regency Enterprises Chairman and CEO <strong>Yariv Milchan, with current domestic television leadership held by Laura Delahaye</strong>, appointed head in 2024 after serving in executive roles at Netflix.[27] In 2019, ...",
    "published": null
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between <strong>Arnon Milchan</strong>, Scriba &amp; Deyle and Canal+ to finance 20 films in five years, with New Regency Productions acting as its production and sales arm.",
    "published": "3 weeks ago"
  }
]