[
  {
    "title": "OFFICIAL: Real Madrid announce Xabi Alonso as new head coach | beIN SPORTS",
    "url": "https://www.beinsports.com/en-us/soccer/la-liga/articles-video/official-real-madrid-announce-xabi-alonso-as-new-head-coach-2025-05-25",
    "snippet": "Real Madrid confirmed this Sunday that <strong>Xabi Alonso will take over as the new head coach of the first team</strong>, replacing Italian manager Carlo Ancelotti.",
    "published": null
  },
  {
    "title": "Transcript: Xabi Alonso's Press Conference as New Real Madrid Head Coach",
    "url": "https://www.si.com/onsi/soccer/real-madrid/news/transcript-xabi-alonso-s-press-conference-as-new-real-madrid-head-coach",
    "snippet": "Since I&#x27;ve been Real Madrid&#x27;s manager, from today on, I want to share that vision with the club about how we can improve. The squad is very good, and I&#x27;m eager to start with them. I&#x27;m not coming in with demands, but rather with a desire to work as a team and improve.Xabi Alonso ... Alonso: I&#x27;ve analyzed the team, but I use it to inform my vision and the project I&#x27;m starting. Coaches depend on the players, and they&#x27;re all highly competitive.",
    "published": "May 26, 2025"
  },
  {
    "title": "Xabi Alonso named new Real Madrid coach",
    "url": "https://www.realmadrid.com/en-US/news/football/first-team/latest-news/perfil-xabi-alonso-25-05-2025",
    "snippet": "<strong>Xabi Alonso (Tolosa, 25/11/1981) is Real Madrid&#x27;s new coach</strong>. The 43-year-old Spanish manager returns to the club where he clinched six trophies as a player to become a madridista legend.",
    "published": "May 25, 2025"
  },
  {
    "title": "8 Potential Replacements for Xabi Alonso as Real Madrid Head Coach",
    "url": "https://bleacherreport.com/articles/25323948-8-potential-replacements-xabi-alonso-real-madrid-head-coach",
    "snippet": "So, let&#x27;s talk about the man at the center of all the drama: manager Xabi Alonso. The club&#x27;s former midfield maestro took charge on <strong>June 1,</strong> succeeding the most decorated coach in Madrid&#x27;s illustrious history, Carlo Ancelotti.",
    "published": null
  },
  {
    "title": "Xabi Alonso unveiled as new Real Madrid coach",
    "url": "https://www.realmadrid.com/en-US/news/football/first-team/latest-news/acto-de-presentacion-de-xabi-alonso-26-05-2025",
    "snippet": "Xabi Alonso: “I&#x27;m thrilled to be back home” The Real Madrid coach, who <strong>signs with the club for the next three seasons</strong>, followed the president at the microphone: “This is a very special day for me and one I will remember for the rest of my life.",
    "published": "May 26, 2025"
  }
]