[
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "<strong>Mario Draghi</strong> was chosen to become the next President of the ECB on 24 June 2011. Draghi was president from 1 November 2011 until 31 October 2019 (succeeded by Christine Lagarde). Pascal Canfin, Member of the European Parliament for France, asserted that Draghi had been involved in swaps for ...",
    "published": "September 25, 2025"
  },
  {
    "title": "Christine Lagarde",
    "url": "https://www.ecb.europa.eu/ecb/decisions/html/cvlagarde.en.html",
    "snippet": "President of the European Central Bank Chair of the European Systemic Risk Board Member of the Board of Directors at the Bank for International Settlements Member of the G7 Member of the G20",
    "published": "November 22, 2023"
  },
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "The loan was then disbursed very quickly, before the election, but would lead Argentina into a serious debt crisis, with the country unable to meet its debts. On 2 July 2019, Christine Lagarde was nominated by the European Council to succeed <strong>Mario Draghi</strong> as President of the European Central ...",
    "published": "6 days ago"
  },
  {
    "title": "European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Central_Bank",
    "snippet": "The executive board normally meets every Tuesday. It is composed of the President of the Bank (currently Christine Lagarde), the vice-president (currently <strong>Luis de Guindos</strong>) and four other members.",
    "published": "2 days ago"
  },
  {
    "title": "European Central Bank",
    "url": "https://www.ecb.europa.eu/",
    "snippet": "Guest lecture by <strong>Piero Cipollone</strong>, Member of the Executive Board of the ECB, at the Frankfurt School of Finance &amp; Management ... Christine Lagarde: Hearing of the Committee on Economic and Monetary Affairs of the European Parliament",
    "published": null
  }
]