[
  {
    "title": "Peter Norvig - Stanford HAI",
    "url": "https://hai.stanford.edu/people/peter-norvig",
    "snippet": "Peter Norvig, <strong>Distinguished Education Fellow</strong> at the Stanford HAI, comments on how limiting the budget at an AI agent’s disposal as well as transaction times and capabilities can help AI agents “operate safely within defined boundaries.&quot;",
    "published": null
  },
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "<strong>Programmer, designer, author, and manager in high tech R&amp;D</strong>. Specialties: internet… · Experience: Stanford Institute for Human-Centered Artificial Intelligence (HAI) · Location: Palo Alto · 500+ connections on LinkedIn.",
    "published": "2 weeks ago"
  },
  {
    "title": "Peter Norvig: Today's Most Pressing Questions in AI Are ...",
    "url": "https://hai.stanford.edu/news/peter-norvig-todays-most-pressing-questions-ai-are-human-centered",
    "snippet": "The AI expert, who joins Stanford HAI as a <strong>Distinguished Education Fellow</strong>, discusses building inclusive education and broadening access to students. Artificial intelligence expert Peter Norvig is joining the Stanford Institute for Human-Centered AI this fall as a <strong>Distinguished Education Fellow</strong>, ...",
    "published": null
  },
  {
    "title": "Peter Norvig: Education for AI and by AI - Stanford HAI",
    "url": "https://hai.stanford.edu/events/peter-norvig-education-ai-and-ai",
    "snippet": "Peter Norvig · <strong>Distinguished Education Fellow</strong>, Stanford HAINo tweets available.",
    "published": null
  },
  {
    "title": "Peter Norvig",
    "url": "https://norvig.com/",
    "snippet": "<strong>Distinguished Education Fellow at Stanford HAI, Research Director at Google</strong>. Co-author of Artificial Intelligence: A Modern Approach, the leading AI textbook used in 1,500+ universities worldwide. peter@norvig.com / resume / github / medium / photo gallery / legacy homepage",
    "published": null
  }
]