[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "Prabowo Subianto Djojohadikusumo (born 17 October 1951) is an Indonesian politician, businessman, and retired military officer who has served as the eighth president of Indonesia since 2024. He previously served as the 26th minister of defense under President Joko Widodo from 2019 to 2024.",
    "published": "1 day ago"
  },
  {
    "title": "Indonesia's first ladies have always been influential, but soon the country won't have one - ABC News",
    "url": "https://www.abc.net.au/news/2024-05-05/role-first-lady-indonesia-election-prabowo-subianto/103787902",
    "snippet": "In a country that in many ways strongly holds onto its traditional values, Mr Subianto&#x27;s lack of a partner was considered an issue ahead of the February election. Prabowo Subianto was married to <strong>Siti Hediati Hariyadi</strong>, daughter of then-president ...",
    "published": "May 4, 2024"
  },
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "Prabowo Subianto (born October 17, 1951, Jakarta, Indonesia) is a former general of the Indonesian army and businessman who is now president of Indonesia (2024– ).",
    "published": "December 9, 2024"
  },
  {
    "title": "Prabowo Subianto - The Muslim 500",
    "url": "https://themuslim500.com/profiles/prabowo-subianto/",
    "snippet": "He rose through the ranks of the Indonesian Army, becoming a lieutenant general and commander of the Army’s Strategic Reserve Command. Prabowo was also married to Suharto’s daughter, <strong>Siti Hediati Hariyadi</strong>, from 1983 to 1998, further cementing ...",
    "published": "May 29, 2018"
  },
  {
    "title": "Titiek Suharto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Titiek_Suharto",
    "snippet": "While studying at the University of Indonesia, one of Titiek&#x27;s teachers was her future father-in-law, <strong>Sumitro Djojohadikusumo</strong>. When Titiek was first introduced as Prabowo&#x27;s girlfriend, Sumitro said, &quot;She looks familiar.&quot;",
    "published": "3 days ago"
  }
]