[
  {
    "title": "EBRD holds its 2025 Annual Meeting and Business Forum in London",
    "url": "https://www.ebrd.com/home/news-and-events/news/2025/ebrd-holds-its-2025-annual-meeting-and-business-forum-in-london.html",
    "snippet": "The Board of Governors’ opening session for the event will take place at Westminster Central Hall on Wednesday 14 May. The Chair of the Board of Governors, Slovenia’s <strong>Klemen Boštjančič</strong>, and EBRD President Odile Renaud-Basso will deliver ...",
    "published": null
  },
  {
    "title": "Slovenia's Finance Minister Klemen Boštjančič Assumes Chairmanship of EBRD Board - The Region",
    "url": "https://connectingregion.com/news/slovenias-finance-minister-klemen-bostjancic-assumes-chairmanship-of-ebrd-board/",
    "snippet": "Boštjančič’s appointment as chair is viewed as a testament to his and Slovenia’s efforts on the international stage, aiming not only for presence but also influence and consideration in shaping the Bank’s direction. The Board of Governors, representing 73 EBRD members, holds significant authority over the Bank’s operations, including strategic decisions and membership considerations. Boštjančič’s tenure as chair for the 2024-2025 period signifies an important phase in the Bank’s ongoing initiatives, with vice chairs elected from Iceland and Turkey joining in the leadership role.",
    "published": "May 20, 2024"
  },
  {
    "title": "Slovenia",
    "url": "https://www.ebrd.com/home/what-we-do/where-we-invest/slovenia.html",
    "snippet": "The EBRD has been investing in Slovenia since 1992 and has an office in Ljubljana.",
    "published": null
  },
  {
    "title": "PUBLIC EUROPEAN BANK FOR RECONSTRUCTION AND DEVELOPMENT",
    "url": "https://www.ebrd.com/content/dam/ebrd_dxp/assets/pdfs/office-of-the-general-counsel/annual-meetings/annual-meeting-2025/am2025-proceedings-english.pdf",
    "snippet": "The Board of Governors took note of the Strategy Implementation Plan 2025-2027. x. 2023 Capital Increase - Delivery Against Commitments · The Board of Governors took note of the report of the Board of Directors entitled 2023 Capital · Increase - Delivery Against Commitments. xi. Amendments to the Rules for the Regular Election of Directors · The Board of Governors adopted Resolution 287, Amendments to the Rules for the Regular · Election of Directors. ... Board of Directors 2024. c. Election of Chair and Vice Chairs for 2025-2026",
    "published": null
  },
  {
    "title": "The EBRD in Slovenia",
    "url": "https://www.ebrd.com/slovenia.html",
    "snippet": "Information on the European Bank for Reconstruction and Development&#x27;s (EBRD) operations in Slovenia",
    "published": null
  }
]