[
  {
    "title": "Larry Page - Sergey Brin, Education & Age",
    "url": "https://www.biography.com/business-leaders/larry-page",
    "snippet": "Born in Michigan in 1973, Larry Page&#x27;s parents were both computer experts. Following in their footsteps, <strong>he studied computer engineering at Stanford University, where he met Sergey Brin</strong>.",
    "published": "March 26, 2021"
  },
  {
    "title": "Larry Page - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Larry_Page",
    "snippet": "Lawrence Edward Page (born March 26, 1973) is an American businessman and computer scientist who <strong>co-founded Google with Sergey Brin</strong>. Page is a centibillionaire and among the richest people in the world. Page was chief executive officer of Google from 1997 until August 2001 when he was succeeded ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Larry Page and Sergey Brin Biography - family, name, history, school, young, son, old, information, college, house",
    "url": "https://www.notablebiographies.com/news/Ow-Sh/Page-Larry-and-Brin-Sergey.html",
    "snippet": "Larry Page and Sergey Brin <strong>founded Google, the Internet search engine, while they were graduate students at Stanford University in Palo Alto, California</strong>. Since its founding in 1998, Google has become one of the most successful dot-com businesses in history.",
    "published": null
  },
  {
    "title": "Sergey Brin and Larry Page | Lemelson",
    "url": "https://lemelson.mit.edu/resources/sergey-brin-and-larry-page",
    "snippet": "<strong>Born in Moscow, Russia, on August 21, 1973, Brin emigrated to the U.S. with his family in 1979 and grew up in Maryland, where his father worked as a mathematics professor</strong>. He earned a BA from the University of Maryland in 1993 and completed his MA at Stanford in 1995.",
    "published": null
  },
  {
    "title": "Larry Page and Sergey Brin Facts, Worksheets & Biography For Kids",
    "url": "https://kidskonnect.com/people/larry-page-sergey-brin/",
    "snippet": "<strong>He graduated from the University of Maryland at College Park with a degree in mathematics and computer science</strong>. Upon graduation, he entered Stanford University for his Ph.D. In 2007, Brin married Anne Wojcicki, a biotech analyst.",
    "published": "June 18, 2021"
  }
]