[
  {
    "title": "World Report 2025: South Sudan | Human Rights Watch",
    "url": "https://www.hrw.org/world-report/2025/country-chapters/south-sudan",
    "snippet": "The arrival of hundreds of thousands fleeing conflict in Sudan, including South Sudanese refugee returnees, Sudanese, and other nationalities, compounded the crisis. Millions faced high levels of food insecurity. According to UNOCHA, climate change-induced events, like floods, affected at least 890,000 people. Attacks against aid operations continued; at least nine aid workers were killed. The government restricted the space for political parties and members of the opposition groups to campaign in the capital and elsewhere in the country.",
    "published": "January 16, 2025"
  },
  {
    "title": "Sudan: Freedom in the World 2025 Country Report | Freedom House",
    "url": "https://freedomhouse.org/country/sudan/freedom-world/2025",
    "snippet": "However, it also retained the Sovereign Council’s “oversight” role and excluded the civilian political coalition Forces of Freedom and Change (FFC) from participation in the Sovereign Council. These provisions allowed the military and al-Burhan to maintain significant control over the transitional government. In January 2022, Prime Minister Hamdok resigned following weeks of protests by the FFC, the Umma Party, and Sudanese people across the country demanding a fully civilian government.",
    "published": null
  },
  {
    "title": "Stakes rise for South Sudan: What’s happening, and why it matters | UN News",
    "url": "https://news.un.org/en/story/2025/11/1166333",
    "snippet": "By Vibhu Mishra 11 November 2025 Peace and Security · <strong>South Sudan is entering a period of rising instability marked by political polarisation, renewed armed clashes, and severe humanitarian strain</strong>, senior UN officials told the Security Council ...",
    "published": "November 11, 2025"
  },
  {
    "title": "Sudanese civil war (2023–present) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudanese_civil_war_(2023–present)",
    "snippet": "As of 5 February 2025, <strong>over 8.8 million were internally displaced and more than 3.5 million others had fled the country as refugees</strong>. Sexual violence, committed on refugees and during looting, has been widespread.",
    "published": "9 hours ago"
  },
  {
    "title": "Civil War in Sudan | Global Conflict Tracker",
    "url": "https://www.cfr.org/global-conflict-tracker/conflict/power-struggle-sudan",
    "snippet": "The SAF seized significant territory in the capital for the first time since the RSF took control at the onset of the war. As 2025 began, <strong>fighting in Khartoum state intensified, with the SAF retaking key areas around the capital</strong>.",
    "published": null
  }
]