[
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "<strong>Newly elected President Cristina Kirchner appointed him to her cabinet as Minister of Justice, Security and Human Rights</strong> following her inauguration in December 2007. La Nación, in an editorial entitled “Justice: A Bad Start,” opined that the selection of Fernández as Minister of Justice ...",
    "published": "November 15, 2025"
  },
  {
    "title": "Últimas noticias de Aníbal Fernández | TN",
    "url": "https://tn.com.ar/tags/anibal-fernandez/",
    "snippet": "<strong>El ministro de Seguridad, Aníbal Fernández, remarcó que sacará a los agentes a las calles cada vez que el ministro de Economía le “plantee el tema”.</strong> La divisa paralela saltó el miércoles y marcó un nuevo récord en medio de las demoras por un nuevo acuerdo con el FMI.",
    "published": null
  },
  {
    "title": "Últimas noticias de Aníbal Fernández en LA NACION",
    "url": "https://www.lanacion.com.ar/tema/anibal-fernandez-tid29939/",
    "snippet": "Encontrá las últimas noticias de Aníbal Fernández: Reapareció Aníbal Fernández y cargó contra Espert en medio de la polémica por sus vínculos con Machado, Skanska: la matriz originaria de la corrupción",
    "published": null
  },
  {
    "title": "Aníbal Fernández (@FernandezAnibal) / X",
    "url": "https://twitter.com/FernandezAnibal",
    "snippet": "JavaScript is not available · We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center · Help Center · Terms of Service Privacy Policy ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Aníbal Fernández is a candidate for governor of the Province of Buenos Aires and currently chief of staff of the Minister’s Cabinet for the presidency. Previously, he served in the National Senate as representative for the province of Buenos Aires. Fernández initiated his career as consultant ...",
    "published": null
  }
]