[
  {
    "title": "Jashodaben Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jashodaben_Modi",
    "snippet": "<strong>Jashodaben Narendrabhai Modi</strong> (née Chimanlal Modi; born 1952) is an Indian former school teacher and the estranged wife of Narendra Modi, the Prime Minister of India. The couple were married in 1968 when she was about 16 and Modi was 18. A couple years into the marriage, her husband, Narendra ...",
    "published": "1 month ago"
  },
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "In a custom traditional to Narendra Modi&#x27;s caste, his family arranged a betrothal to <strong>Jashodaben Chimanlal Modi</strong>, leading to their marriage when she was 17 and he was 18. Soon afterwards, he abandoned his wife, and left home. The couple never divorced but the marriage was not in his public ...",
    "published": "20 hours ago"
  },
  {
    "title": "Narendra Modi's Family: Know About PM's Ex-Wife, Jashodaben, His Four Brothers And Their Professions",
    "url": "https://www.bollywoodshaadis.com/articles/who-narendra-modi-ex-wife-jashodaben-prime-minister-four-brothers-sister-vasantiben-56302",
    "snippet": "Here&#x27;s everything you need to know about the Prime Minister of India, Narendra Modi&#x27;s ex-wife, <strong>Jashodaben</strong>, three lesser-known brothers, and his family background that often stays in the shadows.",
    "published": "September 17, 2024"
  },
  {
    "title": "Does Narendra Modi married? - Quora",
    "url": "https://www.quora.com/Does-Narendra-Modi-married",
    "snippet": "Answer (1 of 3): If you ask Modi supporters they will ignore and say it&#x27;s trivial, it does not matter and he is not. If you ask Modi’s family his brother he will say Modi was married and left the marriage after 3 months of marriage! If you had asked Modi before 2014 he would have said no. If yo...",
    "published": null
  },
  {
    "title": "The relationship between Narendra Modi and his wife ...",
    "url": "https://www.facebook.com/100085231120558/posts/the-relationship-between-narendra-modi-and-his-wife-jashodaben-has-always-been-i/754862157364815/",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  }
]