[
  {
    "title": "FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FIFA",
    "snippet": "FIFA&#x27;s worldwide organisational structure also consists of several other bodies under the authority of the FIFA Council or created by Congress as standing committees.",
    "published": "1 day ago"
  },
  {
    "title": "FIFA Council - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FIFA_Council",
    "snippet": "The FIFA Council (formerly the FIFA Executive Committee) is an institution of FIFA (the governing body of association football, futsal and beach football). It is the main decision-making body of the organization in the intervals of FIFA Congress. <strong>Its members are elected by the FIFA Congress</strong>.",
    "published": "September 15, 2025"
  },
  {
    "title": "Organisation",
    "url": "https://inside.fifa.com/organisation",
    "snippet": "Since 1904, FIFA, the Fédération Internationale de Football Association, has served as the global governing body for football. FIFA oversees and promotes the development of football at every level, from grassroots initiatives to elite international competitions.",
    "published": null
  },
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/about-fifa/organisation/committees",
    "snippet": "The official site of the international governing body of football with news, national associations, competitions, results, fixtures, development, organisation, world rankings, statistics, the International Football Association Board, history, laws of the game, futsal, publications, downloads, and contact details.",
    "published": null
  },
  {
    "title": "FIFA Management Team | Org Chart",
    "url": "https://rocketreach.co/fifa-management_b5c6586bf42e0caf",
    "snippet": "The FIFA management team includes <strong>Leonie Kpenou Aragon (Assistant member associations management (5 directors) and Deputy PA to the CEO), Balogun Omokayode (Talent Acquisition Manager), and Curtis Franks (General Counsel, FIFA World Cup).</strong>",
    "published": null
  }
]