[
  {
    "title": "Kevin Volland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kevin_Volland",
    "snippet": "On 1 November 2020, he scored his ... Ligue 1. In the first match of the 2021–22 season, against Sparta Prague in the preliminary round of the Champions League, he scored his team&#x27;s second goal with an assist from Sofiane Diop. On 17 August 2023, Volland signed a contract with Union Berlin ahead of their ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Kevin Volland: Who is the Union Berlin forward with a better record than Kai Havertz? | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/who-is-kevin-volland-union-berlin-signing-monaco-leverkusen-germany-forward-24402",
    "snippet": "Taking and making chances is the name of the game for Kevin Volland - but what else is there to know about the experienced forward now on the books of Union Berlin? ... Age: 31 (born: 30 July 1992) Club: Union Berlin Position: Forward Country: Germany (15 caps/ one goal) ... Volland&#x27;s record speaks for itself: 77 goals and 62 assists across 247 Bundesliga appearances for Hoffenheim and Bayer Leverkusen. The 5&#x27;9&quot; forward also had a direct hand in 50 goals in 86 Ligue 1 games for Monaco between 2020 and 2023.",
    "published": "August 18, 2023"
  },
  {
    "title": "Kiel Beat Union 2-1 | Professional | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/union-live/latest-news/professional/Kiel-Beat-Union-2-1-1704G/",
    "snippet": "For his first ever game in charge since his return to 1. FC Union Berlin, new head coach <strong>Steffen Baumgart</strong> started with the long-supposed change in formation, with Danilho Doekhi and Kvin Vogt in the middle of a back four flanked by Tom Rothe ...",
    "published": null
  },
  {
    "title": "1.FC Union Berlin - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/1-fc-union-berlin/mitarbeiterhistorie/verein/89",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  },
  {
    "title": "Kevin Volland | 1. FC Union Berlin | Player Profile | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/player/kevin-volland",
    "snippet": "All official season statistics and career data on Kevin Volland. With news, videos and goals from Kevin Volland in the Bundesliga this season",
    "published": null
  }
]