[
  {
    "title": "Al Hilal SFC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al_Hilal_SFC",
    "snippet": "The club&#x27;s name lasted for only one year before it was changed to its current name on 3 December 1958 by King Saud. He changed the name after he attended a tournament that was contested between the Olympic Club, Al Shabab, Al Riyadh and Al-Kawkab clubs. As soon as the club&#x27;s establishment, Al-Hilal enjoyed not only grassroots support but also royal attention.",
    "published": "3 weeks ago"
  },
  {
    "title": "Al-Hilal United FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al-Hilal_United_FC",
    "snippet": "Al-Hilal United FC was founded in 2019 in Al Lisaili, Dubai, United Arab Emirates, and around February 2020, it was announced that <strong>Abdullah bin Musa&#x27;ad bin Abdulaziz Al Saud</strong> has ownership to the newly established club.",
    "published": "August 11, 2025"
  },
  {
    "title": "Saudi Prince Alwaleed in Talks with PIF to Acquire Al Hilal FC - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-09-02/saudi-prince-alwaleed-in-talks-with-pif-to-acquire-al-hilal-fc",
    "snippet": "Saudi billionaire <strong>Prince Alwaleed bin Talal</strong> is in talks with the Public Investment Fund to acquire a majority of Al Hilal Football Club, in what would mark one of the most high-profile privatization efforts in the kingdom’s football sector.",
    "published": "September 2, 2025"
  },
  {
    "title": "Saudi Arabia's PIF takes over Al-Ittihad, Al-Nassr, Al-Hilal and Al-Ahli - BBC Sport",
    "url": "https://www.bbc.com/sport/football/65813662",
    "snippet": "Al-Ittihad, Al-Nassr and Al-Hilal - the top three in this season&#x27;s top flight - plus second-tier champions Al-Ahli - have all come under the control of <strong>the PIF</strong>, which also owns Newcastle United.",
    "published": "June 5, 2023"
  },
  {
    "title": "Al-Hilal Club - Saudipedia",
    "url": "https://saudipedia.com/en/article/1037/society/sports/al-hilal-club",
    "snippet": "On June 5, 2023, the Ministry of Sport announced the transformation of Al-Hilal Club into a company owned by <strong>the Public Investment Fund (PIF),</strong> along with the establishment of an investment fund for the company.",
    "published": "April 13, 2025"
  }
]