[
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "The European Film Academy was founded in 1989 under the name European Cinema Society by Swedish director <strong>Ingmar Bergman</strong>, along with forty other filmmakers from across Europe, including Bernardo Bertolucci, Claude Chabrol, Dušan Makavejev, István Szabó, and Wim Wenders.",
    "published": "September 3, 2025"
  },
  {
    "title": "Story - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/History.42.0.html",
    "snippet": "<strong>Wim Wenders (1996-2020) Agnieszka Holland (2020-2024) and Juliette Binoche (2024- )</strong> followed in Bergman’s footsteps as Presidents of the Academy. The current chair of the Board is Mike Downey.",
    "published": "June 13, 2025"
  },
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Founded in 1989 by Ingmar Bergman ... the continent’s film industry. Its leadership has included <strong>Wim Wenders, Agnieszka Holland, and, since 2024, Juliette Binoche</strong>....",
    "published": "2 weeks ago"
  },
  {
    "title": "Board membership restructuring for 2024 - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/european-film-academy-to-restructure-board-membership-for-2024/",
    "snippet": "The roles and responsibilities of the Academy board centre on decision-making on the annual regulations for film entries for the European Film Awards, on the Academy Selection. It validates the nominations for all categories of the European Film Awards. In three board meetings throughout the year, strategic planning under the leadership of the Academy CEO and Director is discussed and confirmed.",
    "published": "August 15, 2023"
  },
  {
    "title": "Team Members - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/team/team-members/",
    "snippet": "He is responsible for the executive management, the vision and all related programming of current and future activities of the Academy, including brand and audience development, knowledge sharing and film heritage projects, and the annual European Film Awards. Before reading and graduating with an MA in Contemporary History at Leiden University (the Netherlands) and the Royal Netherlands Institute in Rome (Italy), he worked as a magazine editor and journalist.",
    "published": "July 20, 2021"
  }
]