[
  {
    "title": "Catherine Cesarsky - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Catherine_Cesarsky",
    "snippet": "Cesarsky is a Member of the Academia Europaea, the International Academy of Astronautics, and a Foreign Member of the Royal Swedish Academy of Sciences. In 2010, she received an honorary degree from the <strong>University of Geneva</strong>.",
    "published": "December 25, 2024"
  },
  {
    "title": "Dr. Catherine Cesarsky | ESO",
    "url": "https://www.eso.org/public/about-eso/dg-office/ccesarsk/",
    "snippet": "Born in France, Catherine Cesarsky received a degree in Physical Sciences at the <strong>University of Buenos Aires</strong> and graduated with a PhD in Astronomy in 1971 from Harvard University (Cambridge, Mass., USA). She worked at the California Institute of Technology. In 1974, she moved to France, becoming ...",
    "published": null
  },
  {
    "title": "Dr Catherine Cesarsky | SKAO",
    "url": "https://www.skao.int/en/540/dr-catherine-cesarsky",
    "snippet": "After graduating from <strong>Harvard University</strong> with a PhD in astronomy in 1971, Prof Cesarsky was a research fellow at the California Institute of Technology for 3 years before joining and later taking the leadership of the astrophysics department of the Commissariat à l’énergie atomique et aux ...",
    "published": null
  },
  {
    "title": "Catherine Cesarsky",
    "url": "https://www.sheisanastronomer.org/profiles/europe/catherine-cesarsky",
    "snippet": "Born in France, Catherine Cesarsky received a degree in Physical Sciences at the <strong>University of Buenos Aires</strong> and graduated with a PhD in Astronomy in 1971 from Harvard University (Cambridge, Mass., USA). She worked at the California Institute of Technology. In 1974, she moved to France, where ...",
    "published": null
  },
  {
    "title": "The 2024 Fritz Zwicky Prize for Astrophysics & Cosmology is awarded to Dr Catherine Cesarsky - IRFU",
    "url": "https://irfu.cea.fr/en/dap/2024/03/the-2024-fritz-zwicky-prize-for-astrophysics-et-cosmology-is-awarded-to-dr-catherine-cesarsky/",
    "snippet": "He always attended seminars, and at the end he would raise his finger and say: yes, okay, I predicted or discovered that in…, and it was always true“, declares Dr. Cesarsky with joy and gratitude. Dr Catherine Cesarsky obtained a Physics degree from the <strong>University of Buenos Aires</strong>, and a ...",
    "published": "February 5, 2025"
  }
]