[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the <strong>chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "<strong>UC Santa Cruz Chancellor</strong> Cynthia Larive is set to undergo an overdue five-year performance review, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  },
  {
    "title": "Chancellor Larive assumes position as new Board Chair for Monterey Bay Economic Partnership - News",
    "url": "https://news.ucsc.edu/2022/04/chancellor-larive-mbep/",
    "snippet": "University of California, Santa Cruz Chancellor Cynthia K. Larive will assume the role of <strong>incoming board chair for the Monterey Bay Economic Partnership</strong>.",
    "published": "March 18, 2025"
  },
  {
    "title": "Office of the Chancellor – The Office of the Chancellor at UC Santa Cruz.",
    "url": "https://chancellor.ucsc.edu/",
    "snippet": "Chancellor Cynthia Larive · Campus notification procedures for immigration enforcement (SB 98)December 4, 2025 · Announcing Inspiring Change: The Campaign for UC Santa CruzNovember 16, 2025 · Campus Provost and <strong>Executive Vice Chancellor</strong> recruitment underwayNovember 7, 2025 ·",
    "published": null
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "As the <strong>11th chancellor of the University of California at Santa Cruz</strong>, Cynthia Larive leads an institution known worldwide for its high-impact research, for seeking interdisciplinary solutions to the world’s greatest challenges, and for its commitment to social and environmental justice.",
    "published": null
  }
]