[
  {
    "title": "Catherine Cesarsky - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Catherine_Cesarsky",
    "snippet": "Catherine Jeanne Cesarsky (born Catherine Jeanne Gattegno on 24 February 1943) is an <strong>Argentine and French astronomer</strong>, known for her research activities in astrophysics and for her leadership in astronomy and atomic energy. She is the current chairperson of the Square Kilometre Array&#x27;s governing ...",
    "published": "December 25, 2024"
  },
  {
    "title": "Dr. Catherine Cesarsky | ESO",
    "url": "https://www.eso.org/public/about-eso/dg-office/ccesarsk/",
    "snippet": "Born in France, Catherine Cesarsky <strong>received a degree in Physical Sciences at the University of Buenos Aires and graduated with a PhD in Astronomy in 1971 from Harvard University (Cambridge, Mass., USA).</strong> She worked at the California Institute of Technology. In 1974, she moved to France, becoming ...",
    "published": null
  },
  {
    "title": "Catherine Cesarsky",
    "url": "https://www.sheisanastronomer.org/profiles/europe/catherine-cesarsky",
    "snippet": "Born in France, Catherine Cesarsky <strong>received a degree in Physical Sciences at the University of Buenos Aires and graduated with a PhD in Astronomy in 1971 from Harvard University (Cambridge, Mass., USA).</strong> She worked at the California Institute of Technology. In 1974, she moved to France, where ...",
    "published": null
  },
  {
    "title": "Dr Catherine Cesarsky | SKAO",
    "url": "https://www.skao.int/en/540/dr-catherine-cesarsky",
    "snippet": "<strong>After graduating from Harvard University with a PhD in astronomy in 1971</strong>, Prof Cesarsky was a research fellow at the California Institute of Technology for 3 years before joining and later taking the leadership of the astrophysics department of the Commissariat à l’énergie atomique et aux ...",
    "published": null
  },
  {
    "title": "Dr Catherine Cesarsky ForMemRS",
    "url": "https://royalsociety.org/people/catherine-cesarsky-11205/",
    "snippet": "<strong>Formerly President of the International Astronomical Union, Director General of the European Southern Observatory, High Commissioner for Atomic Energy and adviser to the French government on science and energy issues</strong>, Catherine is now science ...",
    "published": null
  }
]