[
  {
    "title": "History of Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Google",
    "snippet": "Google was officially <strong>launched in 1998 by Larry Page and Sergey Brin to market Google Search</strong>, which has become the most used web-based search engine. Larry Page and Sergey Brin, students at Stanford University in California, developed a search algorithm first (1996) known as &quot;BackRub&quot;, with ...",
    "published": "14 hours ago"
  },
  {
    "title": "How we started and where we are today - Google - About Google",
    "url": "https://about.google/company-info/our-story/",
    "snippet": "The Google story <strong>begins in 1995 at Stanford University</strong>. Larry Page was considering Stanford for grad school and Sergey Brin, a student there, was assigned to show him around. By some accounts, they disagreed about nearly everything during that ...",
    "published": null
  },
  {
    "title": "Welcome to My Activity",
    "url": "https://myactivity.google.com/",
    "snippet": "Data helps make Google services more useful for you. Sign in to review and manage your activity, including things you’ve searched for, websites you’ve visited, and videos you’ve watched. Learn more",
    "published": null
  },
  {
    "title": "Google | History & Facts; Products & Services | Britannica Money",
    "url": "https://www.britannica.com/money/Google-Inc",
    "snippet": "Google is an American search engine company, <strong>founded in 1998 by Sergey Brin and Larry Page</strong>. Since 2015, Google has been a subsidiary of the holding company Alphabet, Inc. More than 70% of worldwide online search requests are handled by Google, ...",
    "published": "2 days ago"
  },
  {
    "title": "The History Of Google Search — 1998 to 2026+ ‐ sitecentre®",
    "url": "https://www.sitecentre.com.au/blog/history-of-google-search",
    "snippet": "<strong>Founded by Larry Page and Sergey Brin, the search engine launched as Google in 1998</strong>, based on their PageRank algorithm. Early milestones included incorporation via $100,000 investment from Andy Bechtolsheim and rapid growth following its 2004 IPO.",
    "published": "October 15, 2025"
  }
]