[
  {
    "title": "R. Nicholas Burns - Former Under Secretary of State for Political Affairs",
    "url": "https://georgewbush-whitehouse.archives.gov/government/nburns-bio.html",
    "snippet": "Ambassador R. Nicholas Burns was the Under Secretary of State for Political Affairs, the Department of State’s third ranking official. Appointed by President Bush, he was confirmed by the U.S. Senate on March 17, 2005 and was sworn into office by Secretary of State <strong>Condoleezza Rice</strong>.",
    "published": null
  },
  {
    "title": "Nicholas Burns | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty/nicholas-burns",
    "snippet": "During his tenure, he helped to stabilize relations with Beijing while competing with China on military, technology, economic, and human rights issues. Burns worked in the United States government for over three decades, serving six presidents and nine secretaries of state. As a career Foreign Service Officer, he was Under Secretary of State for Political Affairs from 2005 to 2008; the State Department’s third-ranking official when he led negotiations on the U.S.–India Civil Nuclear Agreement; a long-term military assistance agreement with Israel; and was the lead U.S.",
    "published": null
  },
  {
    "title": "BIOGRAPHY: Nicholas Burns",
    "url": "https://2009-2017.state.gov/s/p/fapb/185577.htm",
    "snippet": "He is also a member of the American Academy of Arts and Sciences, the Trilateral Commission, the Order of Saint John, and Red Sox Nation. <strong>Ambassador Burns</strong> served in the United States government for twenty-seven years.",
    "published": null
  },
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "Burns has had a 25-year career ... States Senate on March 17, 2005, and was sworn into office by Secretary of State <strong>Condoleezza Rice</strong>....",
    "published": "September 26, 2025"
  },
  {
    "title": "R. Nicholas Burns - Under Secretary of State for Political Affairs (Text Only)",
    "url": "https://georgewbush-whitehouse.archives.gov/government/text/nburns-bio.html",
    "snippet": "Ambassador R. Nicholas Burns is the Under Secretary of State for Political Affairs, the Department of State’s third ranking official. Appointed by President Bush, he was confirmed by the U.S. Senate on March 17, 2005 and was sworn into office by Secretary of State <strong>Condoleezza Rice</strong>.",
    "published": null
  }
]