[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "<strong>Enzo Ferrari proved a better team manager than a driver, and when the factory team was privatised, it became Scuderia Ferrari</strong>. When Ferrari left Alfa Romeo, he went on to build his own cars. Tazio Nuvolari often drove for Alfa, winning many races before the Second World War.",
    "published": "3 weeks ago"
  },
  {
    "title": "Who Owns Alfa Romeo? | Where is Alfa Romeo Made?",
    "url": "https://www.aristocratmotorsalfaromeo.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "In 1932, the Italian state holding company owned Alfa, which lasted until 1986. During these years, Alfa joined the <strong>Fiat group</strong>. Then in February 2007, it became Alfa Romeo Automobiles S.p.A.",
    "published": "July 25, 2025"
  },
  {
    "title": "Who Makes Alfa Romeo? | Ron Lewis Alfa Romeo",
    "url": "https://www.ronlewisalfaromeo.com/who-makes-alfa-romeo/",
    "snippet": "Who Makes Alfa Romeo: Stellantis currently oversees the production and development of Alfa Romeo vehicles. This multinational corporation was established in 2021 through the merger of <strong>Fiat Chrysler Automobiles (FCA) and PSA Group</strong>.",
    "published": "October 31, 2025"
  },
  {
    "title": "Who Owns Alfa Romeo: Top Shareholders – Brands Owned By",
    "url": "https://brandsownedby.com/who-owns-alfa-romeo/",
    "snippet": "He leads the brand under <strong>Stellantis N.V.</strong> and is responsible for shaping Alfa Romeo’s strategy, operational direction, and brand identity worldwide. Alfa Romeo does not operate as an independent company.",
    "published": "2 weeks ago"
  },
  {
    "title": "Who Owns Alfa Romeo? | Maserati Alfa Romeo of Daytona",
    "url": "https://www.maseratialfaromeoofdaytona.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "From 2007 on, Alfa Romeo was owned by <strong>Fiat Chrysler Automobiles (FCA).</strong> However, on January 16, 2021, FCA merged its operations with the French PSA Group, Peugeot S.A., to form Stellantis, now recognized as the fourth largest automaker globally.",
    "published": "January 28, 2025"
  }
]