[
  {
    "title": "Newsmax Inks Greta Van Susteren to Multi-Year Contract Extension - Barrett Media",
    "url": "https://barrettmedia.com/2025/04/11/newsmax-inks-greta-van-susteren-to-multi-year-contract-extension/",
    "snippet": "<strong>Newsmax has announced it has signed anchor Greta Van Susteren to a new, multi-year contract extension to remain with the cable network</strong>.",
    "published": "April 11, 2025"
  },
  {
    "title": "Greta Van Susteren Will Join Newsmax Early-Evening Lineup in June",
    "url": "https://variety.com/2022/tv/news/greta-van-susteren-newsmax-1235275722/",
    "snippet": "Greta Van Susteren says she just couldn’t stay away from the immediacy of cable news. For the past few years, Van Susteren, one of the few anchors who can say they have been employed by CNN, MSNBC and Fox News Channel, has been working as a political analyst for Gray Television and doing a show for Voice of America.",
    "published": "May 24, 2022"
  },
  {
    "title": "Greta Van Susteren Net Worth | Celebrity Net Worth",
    "url": "https://www.celebritynetworth.com/richest-businessmen/lawyers/greta-van-sustren-net-worth/",
    "snippet": "Greta Van Susteren is an American commentator, lawyer, and television news anchor who has a net worth of $15 million. During her multi-decade career, Greta Van Susteren has worked for such networks as CNN, Fox News, MSNBC, and Newsmax TV.",
    "published": "January 20, 2023"
  },
  {
    "title": "Greta Van Susteren: MSNBC Only Network That Ever Tried to Control My Show | Barrett Media",
    "url": "https://barrettmedia.com/2025/03/21/greta-van-susteren-msnbc-only-network-that-ever-tried-to-control-my-show/",
    "snippet": "(Photo: Greta Van Susteren) Television · &quot;That’s why I got fired at MSNBC. Because they said I needed to play ball, and I thought that didn’t work.&quot; By: BNM Staff · Date: March 21, 2025 · - Advertisement - Greta Van Susteren has had a long career in cable news across a variety of networks.",
    "published": "March 24, 2025"
  },
  {
    "title": "Greta Van Susteren renews contract with Newsmax By Investing.com",
    "url": "https://www.investing.com/news/company-news/greta-van-susteren-renews-contract-with-newsmax-93CH-3981349",
    "snippet": "Published 04/11/2025, 08:08 AM ... - Veteran news anchor <strong>Greta Van Susteren will continue to helm &quot;The Record with Greta Van Susteren&quot; after signing a multi-year contract extension with Newsmax Inc.</strong>...",
    "published": "April 11, 2025"
  }
]