[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The Beacon Journal has won four Pulitzer Prizes: in 1968, 1971, 1987 and 1994. The paper was founded with the 1897 merger of the Summit Beacon, first published in 1839, and the Akron Evening Journal, founded in 1896. In 1903, the Beacon Journal was purchased by <strong>Charles Landon Knight</strong>.",
    "published": "September 20, 2025"
  },
  {
    "title": "Timeline of Beacon Journal history",
    "url": "https://www.beaconjournal.com/story/lifestyle/2014/09/19/timeline-beacon-journal-history/10338934007/",
    "snippet": "22 story “Caught the Fiend.” In 1913, Peck is pardoned by the governor, who points to grave doubts about Peck’s guilt or his opportunities to establish his innocence. 1903 — The Beacon Journal is sold to <strong>Major T.J.</strong>",
    "published": "September 19, 2014"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "The Akron paper was owned by <strong>the Knight family</strong> for nearly seven decades starting in 1907, and then the Knight Ridder company beginning in 1974. That company sold the Beacon Journal to McClatchy Co. in 2006, which sold it that same year to Black ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal",
    "url": "https://grokipedia.com/page/Akron_Beacon_Journal",
    "snippet": "In 1903, <strong>Charles Landon Knight</strong>, then editor of Women&#x27;s Home Companion, acquired the Beacon Journal in partnership with T.J. Kirkpatrick, establishing the operational framework for the modern Akron Beacon Journal through consolidated ownership ...",
    "published": null
  },
  {
    "title": "The Akron Beacon Journal (Akron, Ohio) 1903-Current | Library of Congress",
    "url": "https://www.loc.gov/item/sn84028149/?st=holdings",
    "snippet": "Daily 34th year, no. 288 (Nov. 6, 1903)- Republican. Also issued on microfilm from Ohio Historical Society and Microfilming Corp. of America. Subject and personal name index: 1929-1938. 10 v. Weekly ed.: Summit County beacon, 1903-1910. 162nd year, no. 139 (Aug. 31, 2000).",
    "published": null
  }
]