[
  {
    "title": "Kevin Volland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kevin_Volland",
    "snippet": "<strong>While playing in Osnabrück on 21 January 2011</strong>, he scored his first competitive goal for 1860&#x27;s 2. Bundesliga squad. Volland found himself in the starting line-up for the remaining fifteen matches of the season. He scored a further five goals in those matches and assisted on four more.",
    "published": "3 weeks ago"
  },
  {
    "title": "Timeline of Kevin Volland's Football Career | Timepath Wiki",
    "url": "https://timepath.org/kevin-volland",
    "snippet": "Kevin Volland made his debut in the Bundesliga for TSG 1899 Hoffenheim in a match against Mainz 05. This debut marked the beginning of his professional career in Germany&#x27;s top football league. Before joining the first team of Hoffenheim, Volland had significant youth experience and was seen as a promising talent for the future.",
    "published": null
  },
  {
    "title": "Kevin Volland | MLSsoccer.com",
    "url": "https://www.mlssoccer.com/players/kevin-volland/",
    "snippet": "Kevin Volland is a young right winger scored 11 goals and assisted on 9 others in the Bundesliga this season. He is the captain of the Under-21 German national team. ... Volland made his senior international debut against Poland on May 13th. ... Volland <strong>started his career with 1860 Munich in the 2.</strong>...",
    "published": null
  },
  {
    "title": "Kevin Volland Age, Net Worth, Career Highlights, Relationships, and More - Mabumbe",
    "url": "https://mabumbe.com/people/kevin-volland-age-net-worth-career-highlights-relationships-and-more/",
    "snippet": "In this biography, we explore Kevin Volland’s journey from his early life in Germany to his rise in football, his career milestones, personal life, and achievements that have cemented his place in the sport’s elite.",
    "published": "March 14, 2025"
  },
  {
    "title": "Kevin Volland | 1. FC Union Berlin | Player Profile | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/player/kevin-volland",
    "snippet": "All official season statistics and career data on Kevin Volland. With news, videos and goals from Kevin Volland in the Bundesliga this season",
    "published": null
  }
]