[
  {
    "title": "Tele2 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tele2",
    "snippet": "Tele2 exited the German market ... launched mobile voice plans on the E-Plus (now O2 Germany) network. <strong>In December 2020 the unit was sold by a Management buyout with the Trademark Tele2 for Germany</strong>....",
    "published": "November 2, 2025"
  },
  {
    "title": "Tele2 2025 Company Profile: Stock Performance & Earnings | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10373-41",
    "snippet": "<strong>Tele2 was a pure mobile operator until 2018 when it acquired Com Hem</strong>, Sweden&#x27;s largest cable company. Tele2 is also present in the Baltic markets, where it runs a pure mobile business.",
    "published": null
  },
  {
    "title": "Mergers: Commission approves acquisition of Com Hem by Tele2",
    "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_18_6065",
    "snippet": "<strong>The European Commission has approved unconditionally, under the EU Merger Regulation, the proposed acquisition of Com Hem by Tele2.</strong> The Commission concluded that the transaction would raise no competition concerns as the companies\\&#x27; activities ...",
    "published": null
  },
  {
    "title": "Tele2 closes Com Hem acquisition - Mobile World Live",
    "url": "https://www.mobileworldlive.com/featured-content/top-three/tele2-closes-com-hem-acquisition/",
    "snippet": "In a statement, the Sweden-based operator announced <strong>Com Hem Holding has been dissolved</strong> and its assets and liabilities transferred to Tele2, around a month after the European Commission cleared the deal.",
    "published": "November 6, 2018"
  },
  {
    "title": "The European Commission has approved the merger of Tele2 and Com Hem - Inderes",
    "url": "https://www.inderes.fi/en/releases/the-european-commission-has-approved-the-merger-of-tele2-and-com-hem",
    "snippet": "Today <strong>the European Commission approved the merger of Tele2 and Com Hem unconditionally</strong>. The merger will combine two highly cash generative businesses with clear synergies to create a leading integrated connectivity provider in the Baltic Sea region.",
    "published": null
  }
]