[
  {
    "title": "Manmohan Singh Education: Former PM Schooling, Colleges, Degrees and Academic Achievements",
    "url": "https://www.jagranjosh.com/articles/manmohan-singh-education-qualification-1735280163-1",
    "snippet": "Dr. Manmohan Singh began his educational journey in Gah, a small village in Punjab (now in Pakistan). He attended the local primary school in his village.",
    "published": "December 27, 2024"
  },
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Singh was initially educated at a local gurdwara, where he began studying Urdu and Punjabi. On 17 April 1937, he was enrolled in the <strong>local Government Primary School</strong>, where he continued his Urdu-medium education until the age of 10 (Class 4), after which he and his family moved to Peshawar.",
    "published": "2 days ago"
  },
  {
    "title": "Dr Manmohan Singh’s Education: Alumnus of Panjab University, Oxford, and Cambridge",
    "url": "https://bestcolleges.indiatoday.in/news-detail/dr-manmohan-singhs-education-alumnus-of-panjab-university-oxford-and-cambridge",
    "snippet": "Born on September 26, 1932, Dr Singh embarked on his academic journey at <strong>Panjab University</strong>, completing his matriculation and intermediate education with distinction. In 1952, he earned a Bachelor’s degree in Economics (Honours) from the same ...",
    "published": "December 27, 2024"
  },
  {
    "title": "Passing of alumnus Prime Minister Manmohan Singh | Faculty of Economics",
    "url": "https://www.econ.cam.ac.uk/news/2025/passing-alumnus-prime-minister-manmohan-singh",
    "snippet": "Manmohan Singh was born in 1932, in a village in the Punjab province of the then undivided India. Dr. Singh’s academic credentials were burnished by the years he spent on the faculty of Punjab University and the prestigious <strong>Delhi School of Economics</strong>. He had a brief stint at the UNCTAD Secretariat ...",
    "published": null
  },
  {
    "title": "Manmohan Singh Death: A Timeline of Former PM Dr. Manmohan Singh Impressive Educational Qualification and Career Details",
    "url": "https://indianexpress.com/article/education/dr-manmohan-singhs-education-alumnus-of-punjab-university-oxford-cambridge-university-9746763/",
    "snippet": "Former PM Manmohan Singh Education Qualification Details: From Panjab University to Cambridge to Oxford University, here&#x27;s a look at Dr Manmohan Singh educational journey and work experience",
    "published": "December 28, 2024"
  }
]