[
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "On <strong>August 29, 2019,</strong> Pachulia retired from playing and re-joined the Warriors as a front office consultant in their basketball operations department. He won his third NBA championship after the Warriors defeated the Boston Celtics in six games in the 2022 NBA Finals.",
    "published": "November 6, 2025"
  },
  {
    "title": "r/nba on Reddit: Zaza Pachulia posts heartfelt retirement message as he begins ‘next chapter’",
    "url": "https://www.reddit.com/r/nba/comments/d24a1n/zaza_pachulia_posts_heartfelt_retirement_message/",
    "snippet": "Zaza Pachulia played in the NBA for 16 seasons, winning two championships with the Golden State Warriors. Now, however, the Georgian-born ball player is ready to retire.",
    "published": "September 10, 2019"
  },
  {
    "title": "Zaza Pachulia reveals how losing over $100K on restaurant business made him a better investor - Basketball Network",
    "url": "https://www.basketballnetwork.net/off-the-court/zaza-pachulia-reveals-how-losing-over-100k-on-restaurant-business-made-him-a-better-investor",
    "snippet": "However, off the court, Pachulia flipped the script completely, transforming into a successful businessman, but, like with everything in life, it did not come without early hiccups. As a matter of fact, those mistakes are exactly what Zaza admits made him a better and more responsible investor in the long run. “I invested in two restaurants when I was playing in Atlanta, and we didn’t reach a two year mark. We had to close both doors,” the retired ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Zaza Pachulia Retires, Joins Warriors As Consultant – SLAM",
    "url": "https://slamonline.com/nba/zaza-pachulia-retires-joins-warriors-as-consultant/",
    "snippet": "Pachulia, 34, won a pair of titles with the Warriors in 2017 and 2018 but saw his veteran role diminish in his lone year with the Pistons. <strong>His retirement as a player comes after 16 seasons in the league, many of them as a starting center</strong>.",
    "published": "August 30, 2019"
  },
  {
    "title": "Two-time NBA champion Zaza Pachulia says losing more than $100,000 made him a better investor",
    "url": "https://www.cnbc.com/2019/10/23/nba-player-zaza-pachulia-says-losing-money-made-him-a-better-investor.html",
    "snippet": "Zaza Pachulia <strong>retired from the NBA in 2019</strong> after 16 seasons, two championships and about $60 million in career earnings.",
    "published": "October 24, 2019"
  }
]