[
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "Ten people (nine men and one woman) have served as chancellor of the Federal Republic of Germany, the first being Konrad Adenauer from 1949 to 1963. (Another 26 men had served as &quot;Reich chancellors&quot; of the previous German Empire from 1871 to 1945.) The current officeholder is <strong>Friedrich Merz</strong> ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "He has served on the boards of ... Germany. A corporate lawyer and reputed multimillionaire, Merz is also a licensed private pilot and owns two aeroplanes. In 2018, he announced his return to politics. He was elected CDU leader in December 2021, assuming the office in January 2022.",
    "published": "1 week ago"
  },
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "The party won a plurality of seats in the Bundestag and formed a &quot;traffic light coalition&quot; with Alliance 90/The Greens and the Free Democratic Party. On 8 December 2021, Scholz was elected and sworn in as chancellor by the Bundestag, succeeding Angela Merkel. As chancellor, Scholz oversaw Germany&#x27;s response to the Russian invasion of Ukraine.",
    "published": "2 weeks ago"
  },
  {
    "title": "Angela Merkel | Book, Biography, Putin, Education, Freedom, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Angela-Merkel",
    "snippet": "As a result, more than one million migrants entered Germany in 2015 alone, sparing them the danger of having to return to their war-torn countries. <strong>Angela Merkel</strong> (born July 17, 1954, Hamburg, West Germany) is a German politician who served as ...",
    "published": "December 7, 2005"
  },
  {
    "title": "The Federal Chancellor of the Federal Republic of Germany | Home page",
    "url": "https://www.bundeskanzler.de/bk-en",
    "snippet": "The website of Federal Chancellor <strong>Olaf Scholz</strong>. Here you can find out more about the Federal Chancellor, his activities and the responsibilities of the Federal Chancellery.",
    "published": null
  }
]