[
  {
    "title": "NIST Director Updates | NIST",
    "url": "https://www.nist.gov/pml/owm/nist-director-updates",
    "snippet": "<strong>Locascio</strong> has been selected as the new president and chief executive officer of the American National Standards Institute (ANSI), a private non-profit 501(c)(3) organization that administers and coordinates the U.S. voluntary standardization ...",
    "published": "January 21, 2025"
  },
  {
    "title": "NIST director to exit in January - Nextgov/FCW",
    "url": "https://www.nextgov.com/people/2024/10/nist-director-exit-january/400360/",
    "snippet": "NIST confirmed the departure to Nextgov/FCW. “Dr. <strong>Laurie Locascio</strong> will be joining the American National Standards Institute (ANSI) as its CEO in January,” a Department of Commerce spokesperson said on Thursday.",
    "published": "October 17, 2024"
  },
  {
    "title": "List of directors of the National Institute of Standards and Technology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_directors_of_the_National_Institute_of_Standards_and_Technology",
    "snippet": "The National Institute of Standards and Technology succeeded the National Bureau of Standards in 1988. Following is a list of the directors of both agencies. The number of NIST directors is a continuation of the number of NBS directors since Locascio is considered the 17th NIST director ...",
    "published": "3 weeks ago"
  },
  {
    "title": "NIST Senior Leadership | NIST",
    "url": "https://www.nist.gov/director/leadership",
    "snippet": "<strong>Craig Burkhardt</strong> was appointed to serve as the Deputy Under Secretary of Commerce for Standards and Technology and NIST Deputy Director in January 2025.",
    "published": "June 2, 2025"
  },
  {
    "title": "National Institute of Standards and Technology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/National_Institute_of_Standards_and_Technology",
    "snippet": "President Theodore Roosevelt appointed <strong>Samuel W. Stratton</strong> as the first director. The budget for the first year of operation was $40,000.",
    "published": "1 month ago"
  }
]