[
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Al-Bashir served as head of state, under the title of Chairman of the Revolutionary Command Council for National Salvation from 1989 to 1993 and as president from 1993 to 2019 (and from 1996 as the leader of the National Congress Party). Al-Bashir was removed from power by the Sudanese Armed Forces on 11 April 2019, amid the Sudanese revolution after holding the office for nearly 30 years.",
    "published": "November 14, 2025"
  },
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "According to Business Insider, &quot;The two generals helped Russian President Vladimir Putin exploit Sudan&#x27;s gold resources to help buttress Russian finances against Western sanctions and fund his war in Ukraine.&quot; On 9 February 2023, al-Burhan met with Russian Foreign Minister Sergey Lavrov.",
    "published": "3 weeks ago"
  },
  {
    "title": "69. Republic of the Sudan (1956-present)",
    "url": "https://uca.edu/politicalscience/home/research-projects/dadm-project/sub-saharan-africa-region/70-republic-of-sudan-1956-present/",
    "snippet": "The RCC imposed Islamic law in northern Sudan on January 20, 1991. The RCC named Lt. General <strong>Omar Hassan Ahmad al-Bashir</strong> as president on October 16, 1993, and the RCC was dissolved on October 17, 1993.",
    "published": null
  },
  {
    "title": "Omar al-Bashir - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Omar_al-Bashir",
    "snippet": "Subsequent to al-Bashir&#x27;s promotion to the chairman of the Revolutionary Command Council for National Salvation, he allied himself with Hassan al-Turabi, the leader of the National Islamic Front, who, along with al-Bashir, began institutionalizing Sharia law in the northern part of Sudan. Further on, al-Bashir issued purges and executions of people whom he alleged to be coup leaders in the upper ranks of the army, the banning of associations, political parties, and independent newspapers, as well as the imprisonment of leading political figures and journalists. On 16 October 1993, al-Bashir increased his power when he appointed himself president of the country, after which he disbanded the Revolutionary Command Council for National Salvation and all other rival political parties.",
    "published": "2 days ago"
  },
  {
    "title": "Sudan President: Latest News, Photos, Videos on Sudan President - NDTV.COM",
    "url": "https://www.ndtv.com/topic/sudan-president",
    "snippet": "Media rights groups have called ... showing President <strong>Salva Kiir</strong> urinating on himself. India on Monday welcomed the removal of Sudan from the US list of state sponsors of terrorism as well as the normalisation of relations between the African ...",
    "published": null
  }
]