[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "In 1972, Singh was chief economic adviser in the Ministry of Finance, and in 1976 he was secretary in the Finance Ministry. In 1980–1982 he was at the Planning Commission, and in 1982, he was appointed governor of the Reserve Bank of India under then finance minister Pranab Mukherjee and held the post until 1985. He went on to become the deputy chairman of the Planning Commission (India) from 1985 to 1987. Following his tenure at the Planning Commission, he was secretary general of the South Commission, an independent economic policy think tank headquartered in Geneva, Switzerland from 1987 to November 1990.",
    "published": "2 weeks ago"
  },
  {
    "title": "Manmohan Singh | Biography, Reforms, Political Career, & Death | Britannica",
    "url": "https://www.britannica.com/biography/Manmohan-Singh",
    "snippet": "In the parliamentary elections of May 2009, the Congress Party increased its number of seats in the legislature, and Singh took office as prime minister for a second time. During his tenure Singh undertook landmark initiatives and faced significant challenges that shaped his legacy.",
    "published": "February 24, 2005"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "Over his career, Dr. Singh held several significant positions, including <strong>Secretary in the Ministry of Finance, Deputy Chairman of the Planning Commission, Governor of the Reserve Bank of India, Advisor to the Prime Minister, and Chairman of the University Grants Commission</strong>.",
    "published": null
  },
  {
    "title": "Manmohan Singh: India's quiet reformer | PIIE",
    "url": "https://www.piie.com/blogs/realtime-economics/2025/manmohan-singh-indias-quiet-reformer",
    "snippet": "The appointment seemed to fulfill destiny. In the early 1960s, Singh had completed a doctoral thesis at Oxford University on the topic of India’s exports. The thesis argued that India’s own policies were responsible for its lackluster export performance, not sluggish foreign demand.",
    "published": "January 3, 2025"
  },
  {
    "title": "Manmohan Singh's decisions that shaped a billion lives",
    "url": "https://www.bbc.com/news/articles/cg4zg690py9o",
    "snippet": "He also <strong>brought in a law that guaranteed the right to free and compulsory education for children between the ages of 6 and 14,</strong> significantly reducing the school dropout rates.",
    "published": "December 27, 2024"
  }
]