[
  {
    "title": "James L. Dolan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/James_L._Dolan",
    "snippet": "As the companies&#x27; chairman, Dolan oversees all operations within the company and supervises day-to-day operations of its professional sports teams, the New York Knicks and New York Rangers, as well as their regional sports networks, which include MSG Network and MSG Plus. Dolan was previously CEO of Cablevision, founded by his father, until its sale in June 2016 to European telecom conglomerate Altice. Dolan is one of six children of Cablevision founder Charles Dolan and his wife, Helen Ann Dolan, and nephew of Cleveland Guardians owner Larry J.",
    "published": "3 weeks ago"
  },
  {
    "title": "Who is James Dolan? Knicks owner makes waves after decision to fire Tom Thibodeau",
    "url": "https://www.usatoday.com/story/sports/nba/knicks/2025/06/03/knicks-owner-everything-to-know-james-dolan/84015908007/",
    "snippet": "FEELING SENTIMENTAL: Knicks superfan Ben Stiller &#x27;grateful&#x27; for work fired Tom Thibodeau did in New York · Dolan is officially listed as the executive chairman and chief executive officer of Madison Square Garden Sports and Madison Square Garden Entertainment. He is the owner of both the New York Knicks and the NHL&#x27;s New York Rangers.",
    "published": "June 3, 2025"
  },
  {
    "title": "Is James Dolan having fun yet? The Knicks owner had better be after latest coaching change - The Athletic",
    "url": "https://www.nytimes.com/athletic/6738319/2025/10/22/james-dolan-fired-tom-thibodeau-risk-knicks-future/",
    "snippet": "Beyond that, Thibodeau benched all those people carrying pitchforks and torches for his boss. He silenced the constant references to Dolan as the worst owner in the league and allowed him to dream the impossible dream of winning the Knicks’ first NBA championship since 1973.",
    "published": "October 22, 2025"
  },
  {
    "title": "James Dolan vs. the NBA: Why the Knicks owner is at odds with the league - The Athletic",
    "url": "https://www.nytimes.com/athletic/6226872/2025/03/25/james-dolan-adam-silver-owner-commissioner-nba/",
    "snippet": "The quote is as much a reflection of how Dolan operates as the man himself. Dolan is one of the most famous owners in professional sports, the longtime operator of the NBA’s New York Knicks and NHL’s Rangers and of Madison Square Garden.",
    "published": "March 27, 2025"
  },
  {
    "title": "New York Knicks 2025 Playoff Run Redeems Even Team Owner James Dolan - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-05-22/new-york-knicks-2025-playoff-run-redeems-even-team-owner-james-dolan",
    "snippet": "For years, <strong>James Dolan</strong> has borne the brunt of basketball-obsessed New York’s furor and frustration every time another Knicks squad failed to live up to expectations. Each spring, the daffodils blossom, the maple trees bud, the Yankees and ...",
    "published": "May 22, 2025"
  }
]