[
  {
    "title": "Com Hem",
    "url": "https://eqtgroup.com/about/current-portfolio/com-hem",
    "snippet": "<strong>EQT III acquired Com Hem AB, a Swedish cable TV operator, in 2003.</strong> Com Hem was one of the largest operators in Sweden, offering pay-TV and broadband internet access as the leading player in an attractive market. ... During EQT&#x27;s ownership, the company underwent extensive programmes of ...",
    "published": null
  },
  {
    "title": "EQT AB - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_AB",
    "snippet": "2024, Acquired digital consultancy firm Perficient for $1 billion all cash deal. The acquisition was completed in October 2024. 2024, private equity consortium led by <strong>Neuberger Berman</strong> that includes EQT AB and Canada Pension Plan Investment Board agreed to buy international private school operator ...",
    "published": "3 weeks ago"
  },
  {
    "title": "EQT sells Com Hem",
    "url": "https://eqtgroup.com/news/2005/EQT-sells-Com-Hem/",
    "snippet": "Under EQT’s ownership, Com Hem underwent extensive programmes of transformation and investment, which has propelled the company’s growth and profitability. Almost SEK 1 billion has been invested in infrastructure for broadband and telephony offering. The measures implemented have shown significant and tangible results in terms of market positions on all relevant markets. Com Hem is today the leading triple play provider in Sweden with about ...",
    "published": null
  },
  {
    "title": "Eqtgroup",
    "url": "https://eqtgroup.com/about/history",
    "snippet": "Over the course of Sweden’s modern ... family’s philosophy of responsible ownership, <strong>Conni Jonsson received a mandate from the board of Investor AB to establish EQT in 1994 with the backing from Investor AB, AEA Investors and SEB</strong>....",
    "published": null
  },
  {
    "title": "Who Owns EQT AB Company? – MatrixBCG.com",
    "url": "https://matrixbcg.com/blogs/owners/eqtgroup",
    "snippet": "EQT AB is a leading global investment organization <strong>founded in 1994 in Stockholm, Sweden, by Conni Jonsson with the backing of Investor AB, AEA Investors, and SEB</strong>. The founders&#x27; vision was rooted in the Wallenberg family&#x27;s philosophy of responsible ...",
    "published": "August 19, 2025"
  }
]