[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "In 2021, Pochettino joined Paris Saint-Germain, where he won the Ligue 1 title and Coupe de France but left one year later. He took over as the manager of Chelsea for the <strong>2023–24 season</strong>, mutually agreeing to part ways with the club after just one season. The same year he was appointed as ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Mauricio Pochettino to become Chelsea head coach | News | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/news/article/mauricio-pochettino-to-become-chelsea-head-coach",
    "snippet": "Chelsea Football Club is pleased to confirm Mauricio Pochettino will become head coach of the men’s team from the beginning of the <strong>2023/24 season</strong>.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/mauricio-pochettino",
    "snippet": "Welcome to the official Chelsea FC website. All the latest news, videos and ticket information as well as player profiles and information about Stamford Bridge, the home of the Blues. Browse the online shop for Chelsea FC products and merchandise.",
    "published": null
  },
  {
    "title": "Chelsea FC can confirm that the Club and Mauricio Pochettino have mutually agreed to part ways.",
    "url": "https://www.chelseafc.com/en/news/article/club-statement-mauricio-pochettino",
    "snippet": "Mauricio Pochettino said: &#x27;Thank you to the Chelsea ownership group and Sporting Directors for the opportunity to be part of this football club&#x27;s history. The Club is now well positioned to keep moving forward in the Premier League and Europe in the years to come.&#x27; Jesus Perez, Miguel d’Agostino, Toni Jimenez and Sebastiano Pochettino have left the club with Mauricio. The Club will be making no further comment until such time as a new Head Coach is appointed.",
    "published": null
  },
  {
    "title": "Pochettino leaves Chelsea by mutual consent",
    "url": "https://www.premierleague.com/en/news/4025501",
    "snippet": "Whoever succeeds Pochettino will become the <strong>fifth head coach or manager of Chelsea after Thomas Tuchel, Graham Potter and Frank Lampard, in a caretaker role, since the start of the 2022/23 season</strong>.",
    "published": null
  }
]