[
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "In 2017–2018 he coached Toulon. <strong>In 2019 Galthié was appointed as vice-head coach of the French national team</strong>, having been scheduled to succeed Jacques Brunel as head coach in 2020. ... ^ In France&#x27;s match against Fiji in the Autumn Nations Cup, the match was cancelled and France was awarded ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Fabien Galthié : Actualités et Biographie | TF1 Info",
    "url": "https://www.tf1info.fr/actualite/fiche-selectionneur-fabien-galthie-13427/",
    "snippet": "<strong>Le demi d&#x27;ouverture de Bordeaux a donc quitté le Centre national du rugby, dès ce mercredi, refusant d&#x27;intégrer la liste des réservistes</strong>. En réaction, le sélectionneur Fabien Galthié n&#x27;a pas mâché ses ...",
    "published": null
  },
  {
    "title": "Fabien Galthié",
    "url": "https://rmcsport.bfmtv.com/rugby/fabien-galthie_DN-202108310597.html",
    "snippet": "Fabien Galthié est né le 20 mars 1969 à Cahors. Ancien rugbymen international français de rugby à XV, il évoluait au poste de demi de mêlée. Il est actuellement le sélectionneur de l’Equipe de France depuis 2019 après avoir entraîné notamment le Stade français et Montpellier.",
    "published": "August 31, 2021"
  },
  {
    "title": "Fabien Galthié",
    "url": "https://grokipedia.com/page/Fabien_Galthi%C3%A9",
    "snippet": "Fabien Galthié was appointed head coach of the France national rugby union team in <strong>December 2019,</strong> immediately following the 2019 Rugby World Cup, where he had served as an assistant under Jacques Brunel.[37] His initial two-year contract was ...",
    "published": null
  },
  {
    "title": "French Coach Fabien Galthie Names 42-Man Rugby World Cup Training Squad - FloRugby",
    "url": "https://www.florugby.com/articles/11068893-french-coach-fabien-galthie-names-42-man-rugby-world-cup-training-squad",
    "snippet": "French Rugby coach Fabien Galthie has named a <strong>42-man training squad for Rugby World Cup 2023</strong> ahead of France&#x27;s opening match with the New Zealand All Blacks",
    "published": "June 21, 2023"
  }
]