[
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "Under Kast’s leadership, “we are confident Chile will advance shared priorities to include <strong>strengthening public security, ending illegal immigration, and revitalising our commercial relationship</strong>,” Rubio said in a statement.",
    "published": "13 hours ago"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "<strong>Her supporters fear Kast&#x27;s election marks a return to Chile&#x27;s far-right past</strong>. &quot;Kast&#x27;s family helped the dictator Augusto Pinochet,&quot; Ricardo Herrera said, adding that he lived through Pinochet&#x27;s dictatorship and it was &quot;brutal&quot;.",
    "published": "2 days ago"
  },
  {
    "title": "Kast’s Victory in Chile Is Another Win for Global Right-Wing Movement - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/americas/chile-kast-right-wing-movement.html",
    "snippet": "Kast, a stern father of nine with ... world by prioritizing strict law and order and sealing borders. He obtained <strong>58 percent of the vote on Sunday</strong>. “Chile cannot get used to fear, and Chile cannot get used to fire,” he said ...",
    "published": "19 hours ago"
  },
  {
    "title": "Conservative José Kast wins Chile presidency with 58% on security platform | Fox News",
    "url": "https://www.foxnews.com/world/trump-style-law-and-order-conservative-clinches-chiles-presidency-violent-crime-crisis-reshapes-nation",
    "snippet": "José Antonio Kast wins Chile&#x27;s presidency with 58% of the vote on a hard-right platform promising <strong>mass deportations, expanded policing and military deployment against crime</strong>.",
    "published": "1 day ago"
  },
  {
    "title": "Chile shifts sharply right as José Antonio Kast wins the presidency",
    "url": "https://www.npr.org/2025/12/14/nx-s1-5644074/chile-kast-right",
    "snippet": "José Antonio Kast, a far-right politician, who has praised Chile&#x27;s dictatorship, has won the presidency, <strong>signaling a sharp rightward shift fueled by fears over crime, migration, and the economy</strong>.",
    "published": "2 days ago"
  }
]