[
  {
    "title": "Mark Aguiar - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Aguiar",
    "snippet": "Aguiar was an assistant professor of economics at the University of Chicago Booth School of Business between 1999 and 2004, a senior economist at the Federal Reserve Bank of Boston from 2004 to 2006, and a <strong>tenured associate professor of economics</strong> at the University of Rochester from 2006 to 2011.",
    "published": "October 23, 2025"
  },
  {
    "title": "Mark Aguiar at University of Rochester - RateMyProfessors.com",
    "url": "https://www.ratemyprofessors.com/ShowRatings.jsp?tid=1421150",
    "snippet": "Mark Aguiar is a <strong>professor in the Economics department</strong> at University of Rochester - see what their students are saying about them or leave a rating yourself.",
    "published": null
  },
  {
    "title": "Fifth PIER IGIER International Conference Participant List Mark Aguiar",
    "url": "https://igier.unibocconi.eu/sites/default/files/media/attach/Participant_List_Nov2007.pdf",
    "snippet": "Mark Aguiar · <strong>Department of Economics</strong> · University of Rochester · Harkness Hall, Room 224 · Rochester, NY 14627 · Tel: 585-275-4196 · Fax: n/a · Email: maguiar@troi.cc.rochester.edu · Kartik Athreya · Research Department · Federal Reserve Bank of Richmond ·",
    "published": null
  },
  {
    "title": "Mark Aguiar | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is a consultant at the Federal Reserve Bank of Minneapolis and the Walker Professor of Economics and International Finance at Princeton University. Previously, he was a <strong>professor of economics</strong> at the University of Rochester and a ...",
    "published": null
  },
  {
    "title": "Mark Aguiar - MRDRC - University of Michigan",
    "url": "https://mrdrc.dev.isr.umich.edu/researcher/mark-aguiar/",
    "snippet": "Mark Aguiar is currently <strong>Associate Professor of Economics</strong> at the University of Rochester. His research focuses on models of consumption and savings with applications in both open- and closed-economy macroeconomics. Specific interests include life cycle consumption and savings, current account ...",
    "published": null
  }
]