[
  {
    "title": "Apple Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Apple_Inc.",
    "snippet": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, in Silicon Valley, best known for its consumer electronics, software and online services. Founded in 1976 as Apple Computer Company by <strong>Steve Jobs, Steve Wozniak and Ronald Wayne</strong>, the company was ...",
    "published": "4 hours ago"
  },
  {
    "title": "The Founding of Apple Computer, Inc. - This Month in Business History - Research Guides at Library of Congress",
    "url": "https://guides.loc.gov/this-month-in-business-history/april/apple-computer-founded",
    "snippet": "Apple Computer, Inc. was founded on April 1, 1976, by college dropouts <strong>Steve Jobs and Steve Wozniak</strong>, who brought to the new company a vision of changing the way people viewed computers.",
    "published": null
  },
  {
    "title": "History of Apple Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Apple_Inc.",
    "snippet": "On April 1, 1976, Apple Computer Company was founded by <strong>Steve Jobs, Steve Wozniak, and Ronald Wayne</strong>. The company was registered as a California business partnership. Wayne, who worked at Atari, Inc. as a chief draftsman, became a co-founder in return for a 10% stake.",
    "published": "2 weeks ago"
  },
  {
    "title": "Apple Inc. | History, Products, Headquarters, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Apple-Inc",
    "snippet": "The two decided to set up their operations in the Jobs family garage, founding Apple Inc. on April 1, 1976, along with Ronald Wayne, an experienced tech industry executive who would play a role in helping facilitate and integrate the young founders’ company vision and operational pursuits.",
    "published": "2 weeks ago"
  },
  {
    "title": "Jobs and Wozniak Found Apple Computer | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/computer-science/jobs-and-wozniak-found-apple-computer",
    "snippet": "Apple Computer was founded on April 1, 1976, by <strong>Steve Jobs and Stephen Wozniak</strong>, who initially aimed to assemble computers for friends but quickly recognized the potential of their innovation to transform the personal computer market.",
    "published": null
  }
]