[
  {
    "title": "List of Real Madrid CF managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Real_Madrid_CF_managers",
    "snippet": "The most successful coach with Real Madrid is <strong>Carlo Ancelotti</strong>, as won 15 titles with the team. Ancelotti, in two spells, won La Liga twice, Copa del Rey twice, UEFA Champions League three times, Spanish Super Cup twice, UEFA Super Cup three ...",
    "published": "September 27, 2025"
  },
  {
    "title": "2025–26 Real Madrid CF season - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025–26_Real_Madrid_CF_season",
    "snippet": "On 22 May, Madrid announced the departure of the club captain Luka Modrić after 13 years in the club, who left as Real&#x27;s most decorated player, having won 28 trophies. On 23 May, Madrid and <strong>Carlo Ancelotti</strong> announced their mutual decision to part ways after the conclusion of the 2024–25 La ...",
    "published": "2 days ago"
  },
  {
    "title": "Xabi Alonso named new Real Madrid coach",
    "url": "https://www.realmadrid.com/en-US/news/football/first-team/latest-news/perfil-xabi-alonso-25-05-2025",
    "snippet": "He returns to the club after leading Bayer Leverkusen to win the league, the cup and the German Super Cup.",
    "published": "May 25, 2025"
  },
  {
    "title": "Alonso confirmed as new Real Madrid coach",
    "url": "https://www.fifa.com/en/tournaments/mens/club-world-cup/usa-2025/articles/xabi-alonso-real-madrid-coach-appointed",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "OFFICIAL: Real Madrid announce Xabi Alonso as new head coach | beIN SPORTS",
    "url": "https://www.beinsports.com/en-us/soccer/la-liga/articles-video/official-real-madrid-announce-xabi-alonso-as-new-head-coach-2025-05-25",
    "snippet": "Real Madrid confirmed this Sunday that <strong>Xabi Alonso</strong> will take over as the new head coach of the first team, replacing Italian manager Carlo Ancelotti. The coach from Tolosa will sign a three-year deal running from June 1, 2025, through June 30, ...",
    "published": null
  }
]