[
  {
    "title": "IMU Leadership 2023 – 2026 | International Mathematical Union",
    "url": "https://www.mathunion.org/organization/imu-leadership-2023-2026",
    "snippet": "ICMI EC Ex-officio Member (IMU Secretary General) France · *CoP was formerly known as the Committee on Electronic Information and Communication (CEIC). Terms of membership are staggered. Ilka Agricola · CoP Chair 2023 – 2026 · Germany · <strong>Jean-Pierre Bourguignon</strong> ·",
    "published": null
  },
  {
    "title": "IMU Awards, Prizes, and Special Lecture | International Mathematical Union",
    "url": "https://www.mathunion.org/imu-awards/imu-awards-prizes-and-special-lecture",
    "snippet": "The IMU Executive Committee appoints - for each of its prizes and awards - a selection committee in accordance with the individual prize or award statutes, and the IMU By-Laws. The names of the selection committee members remain confidential until the ICM at which the awards are made, only the names of the chairs are made public. An overview of previous selection committees can be found on the individual prize or award webpage.",
    "published": null
  },
  {
    "title": "IMU Leadership 2011-2014 | International Mathematical Union Executive Committee",
    "url": "https://www.mathunion.org/organization/imu-representatives/imu-leadership-2011-2014",
    "snippet": "ICMI EC Ex-officio Member (IMU Secretary) Germany · * CEIC terms of membership are staggered. <strong>Peter Olver</strong> · CEIC Chair · Jul 1, 2008 – Dec 31, 2014 USA · Thierry Bouche · CEIC Member · Jan 1, 2011 – Dec 31, 2014 France · Olga Caprotti · CEIC Member ·",
    "published": null
  },
  {
    "title": "Imu | One Piece Wiki | Fandom",
    "url": "https://onepiece.fandom.com/wiki/Imu",
    "snippet": "Following the conclusion of the Egghead Incident, Imu furiously blamed Saturn for his role in allowing Luffy (whom Imu referred to as Joy Boy) and his allies to escape. As a result, Imu stripped Saturn of his apparent immortality, killing him. At the same time, they promoted Figarland Garling to Saturn&#x27;s previously held position as Warrior God of Science and Defense.[13]",
    "published": "September 24, 2025"
  },
  {
    "title": "Members and Quadrennial Reports | IMU Committee Terms & Activities",
    "url": "https://www.mathunion.org/cop/members/members-and-quadrennial-reports",
    "snippet": "<strong>Jonathan Borwein</strong> (up to 2008, chair), Simon Fraser University, Burnaby, Canada Michael Doob, University of Manitoba, Winnipeg, Canada John Ewing (up to 2008), American Mathematical Society, Providence, USA Ulf Rehmann, Universität Bielefeld, Bielefeld, Germany Alfred J. (Alf) van der Poorten ...",
    "published": null
  }
]