[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "The company also continued production of several British de Havilland aircraft and later produced a licence-built version of the American-designed Grumman S2F Tracker. In 1962 the Avro Canada aircraft production facility was transferred to de Havilland Canada by their then-merged parent company, UK-based Hawker Siddeley.",
    "published": "3 hours ago"
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "Later, Hawker Siddeley merged into what is eventually known today as <strong>BAE Systems</strong>, the British aerospace and defence business. The de Havilland name lives on in De Havilland Canada, which owns the rights to the name and the aircraft produced by de Havilland&#x27;s former Canadian subsidiary, including ...",
    "published": "November 1, 2025"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "Commuter airlines did not create ... the year before the Dash 7 first flew, <strong>the Canadian government purchased de Havilland Canada from its British owners, Hawker Siddeley Aviation</strong>....",
    "published": null
  },
  {
    "title": "Hawker Siddeley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Siddeley",
    "snippet": "In 1962, A.V. Roe Canada was dissolved and the remaining assets were transferred to the now defunct Hawker Siddeley Canada. In 1948, the company name was changed to Hawker Siddeley Group. The aircraft division became Hawker Siddeley Aviation (HSA) and the guided missile and space technology operations as Hawker Siddeley Dynamics (HSD).",
    "published": "August 29, 2025"
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "Then, in 1974, <strong>the Canadian government purchased De Havilland Canada from its British owner, Hawker Siddeley Aviation</strong>. However, DHC&#x27;s status as a &quot;Crown Corporation&quot; will not last long.",
    "published": "February 21, 2024"
  }
]