[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "On March 24, 1999, Regency executive David Matalon joined the supervisory board of Puma AG, an international sports company. At the time, Regency Enterprises (the holding company) was the largest single shareholder in Puma, with more than a 25% stake.",
    "published": "2 days ago"
  },
  {
    "title": "Regency Enterprises Services - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/regency-enterprises-services",
    "snippet": "Regency&#x27;s five areas of service are <strong>project management, facilities management, event management, environmental consulting, and business consulting</strong>. ... St Louis, Missouri, United States.",
    "published": null
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "<strong>Yariv Milchan</strong> (PRODUCER) is the Chairman and CEO of the Academy Award®-winning New Regency Productions where he oversees the day-to-day management, creative direction, and overall growth strategy of the company.",
    "published": null
  },
  {
    "title": "Regency Management - Overview, News & Similar companies | ZoomInfo.com",
    "url": "https://www.zoominfo.com/c/regency-management-inc/89296448",
    "snippet": "Regency Management, Inc. is <strong>the leading rental company in the Enterprise, Daleville, and Ozark areas</strong>, offering a diverse selection of rental options including townhomes, apartments, and homes. They provide services such as property sales, appraisals, new construction, rentals, commercial space ...",
    "published": null
  },
  {
    "title": "Regency enterprises Careers and Employment | Indeed.com",
    "url": "https://www.indeed.com/cmp/Regency-Enterprises",
    "snippet": "Find out what works well at Regency enterprises from the people who know best. Get the inside scoop on jobs, salaries, top office locations, and CEO insights. Compare pay for popular roles and read about the team’s work-life balance. Uncover why Regency enterprises is the best company for you.",
    "published": null
  }
]