[
  {
    "title": "Tiger Aspect - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tiger_Aspect",
    "snippet": "Tiger Aspect Productions (formerly known as Tiger Television from 1988 until 1993 and also known as Tiger Aspect Films for theatrical films) is a British television and film production company, particularly noted for its situation comedies. Founded by <strong>Peter Bennett-Jones</strong>, its productions have ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Tiger Television - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Tiger_Television",
    "snippet": "It was particularly known for its sitcoms (most notably Mr. Bean), though it also specialised in shows from other genres. It was later merged with <strong>Aspect Film &amp; Television</strong> to form Tiger Aspect Productions in 1993.",
    "published": "June 26, 2025"
  },
  {
    "title": "Tiger Aspect Productions - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Tiger_Aspect_Productions",
    "snippet": "Tiger Aspect Productions is a British film and television production company of Peter Bennett-Jones, founded in 1993 from the merger between Tiger Television and Aspect Film &amp; Television. In June 2006, the company was purchased by <strong>IMG Media</strong>, but ...",
    "published": "November 12, 2025"
  },
  {
    "title": "Tiger Aspect Productions (UK) | Closing Logo Group | Fandom",
    "url": "https://closinglogogroup.fandom.com/wiki/Tiger_Aspect_Productions_(UK)",
    "snippet": "In 1993, it was then merged with Aspect Film &amp; Television to form its current name. In June 2006, the company was purchased by <strong>IMG Media</strong>, but was later sold to the UK division of Endemol in November 2009. It is currently owned by Banijay since 2020.",
    "published": null
  },
  {
    "title": "Tiger Aspect Productions | Geo G. Wiki | Fandom",
    "url": "https://geo-g.fandom.com/wiki/Tiger_Aspect_Productions",
    "snippet": "Tiger Aspect Productions (formerly known as Tiger Television) is a British television production company, particularly noted for its situation comedies. Co-founded by <strong>Peter Bennett-Jones</strong>, its productions have included popular hits such as The ...",
    "published": "October 29, 2024"
  }
]