[
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "<strong>John Heitinga is the new head coach of Ajax</strong>. After years in the youth academy, hundreds of matches for Ajax’s first team, various coaching roles at the De Toekomst training complex, and a stint as assistant coach with Jong Ajax, he now embarks ...",
    "published": null
  },
  {
    "title": "John Heitinga - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Heitinga",
    "snippet": "He took charge of Liverpool for the first time in a 2–0 win over Newcastle United on 26 February 2025, whilst manager Arne Slot and assistant manager Sipke Hulshoff were suspended. That season, Liverpool, under Slot’s leadership, won the Premier League title. On <strong>31 May 2025</strong>, Heitinga agreed ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Heitinga is back: 'Really excited to get started'",
    "url": "https://english.ajax.nl/articles/heitinga-is-back-really-excited-to-get-started",
    "snippet": "Ajax has reached an agreement with John Heitinga regarding the coach’s move to Amsterdam. Heitinga is signing a contract with Ajax as head coach until <strong>June 30, 2027</strong>.",
    "published": null
  },
  {
    "title": "Heitinga: 'I see a lot of joy in the game and willingness'",
    "url": "https://english.ajax.nl/articles/heitinga-i-see-a-lot-of-joy-in-the-game-and-willingness/",
    "snippet": "John Heitinga is the new head coach of Ajax. After years in the youth academy, hundreds of matches for Ajax’s first team, various coaching roles at the De Toekomst training complex, and a stint as assistant coach with Jong Ajax, he now embarks on his second spell as the club’s head coach.",
    "published": null
  },
  {
    "title": "Heitinga: back in Mokum, back at 'his' Ajax",
    "url": "https://english.ajax.nl/articles/heitinga-back-in-mokum-back-at-his-ajax",
    "snippet": "John Heitinga has returned to Ajax. <strong>He signed a two-year contract as head coach after spending two years in England with West Ham United and Liverpool</strong>. “Francesco Farioli laid a solid foundation here.",
    "published": null
  }
]