[
  {
    "title": "Steffen Baumgart is Union's New Head Coach | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/steffen-baumgart-is-unions-new-head-coach-SmIvQK",
    "snippet": "1. FC Union Berlin have signed up <strong>Steffen Baumgart</strong> as new head coach for the men&#x27;s professional team. The 52-year-old will prepare the team for the rest of the Bundesliga season from 2 January.",
    "published": null
  },
  {
    "title": "Union Berlin appoint Bjelica as head coach | Reuters",
    "url": "https://www.reuters.com/sports/soccer/union-berlin-appoint-bjelica-head-coach-2023-11-26/",
    "snippet": "Union Berlin have appointed <strong>Nenad Bjelica</strong> as their new coach, the Bundesliga club said on Sunday.",
    "published": "November 26, 2023"
  },
  {
    "title": "1. FC Union Berlin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/1._FC_Union_Berlin",
    "snippet": "In the 2023–24 season, the club experienced a bad start including 14 winless competitive matches in a row, hence they decided to separate with coach <strong>Urs Fischer</strong> by &quot;mutual agreement&quot;. Following two consecutive defeats against relegation rivals Bochum and 1. FC Köln in the late stages of ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Bo Svensson Becomes Head Coach at 1. FC Union Berlin | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/bo-svensson-becomes-head-coach-at-1-fc-union-berlin-ySrql",
    "snippet": "1. FC Union Berlin&#x27;s preparations for the new season will start with a new head coach. From 1. July, <strong>Bo Svensson</strong> will take charge of the sporting fortunes of the men&#x27;s first team.",
    "published": null
  },
  {
    "title": "Official | Union Berlin and Urs Fischer part ways - Get German Football News",
    "url": "https://www.getfootballnewsgermany.com/2023/official-union-berlin-and-urs-fischer-part-ways/",
    "snippet": "Union Berlin have announced the departure of long-serving head coach, <strong>Urs Fischer</strong> with immediate effect after a run of 13 defeats in 14 games that leaves the south-East Capital side bottom of Bundesliga, bottom of Group C in the Champions League ...",
    "published": "November 15, 2023"
  }
]