[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Alexei Venediktov, editor-in-chief of Echo of Moscow radio station, called the arrest &quot;a political mistake: jailing Navalny transforms him from an online leader into an offline one&quot;. After his arrest, his blog became available in English. Navalny was kept in the same prison as several other activists, including Ilya Yashin and Sergei Udaltsov, the unofficial leader of the Vanguard of Red Youth, a radical Russian communist youth group.",
    "published": "1 week ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "Aleksey Navalny (1976–2024) was a Russian <strong>anti-corruption activist and politician</strong> who achieved international recognition as one of the most prominent domestic critics of Russian Pres. Vladimir Putin.",
    "published": "March 7, 2023"
  },
  {
    "title": "What is Alexei Navalny’s legacy for the people of Russia?",
    "url": "https://theconversation.com/what-is-alexei-navalnys-legacy-for-the-people-of-russia-249692",
    "snippet": "Three of Navalny’s lawyers were sentenced in January 2025 for participating in an “extremist organisation”, as the ACF was designated by a Moscow court in June 2021. The Russian legislature has also passed a barrage of legislation relating to so-called “foreign agents”, to tarnish the work of those the regime regards as foreign-backed “fifth columnists”. From left: lawyers Igor Sergunin, Alexei Liptser and Vadim Kobzev, who have all represented Navalny, in a Russian courtroom, January 2025.",
    "published": "3 weeks ago"
  },
  {
    "title": "The Power of Memory: Thinking of Alexei Navalny’s Political Legacy | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/power-memory-thinking-alexei-navalnys-political-legacy",
    "snippet": "Posted date/time:February 21, 2025 · By · Ekaterina V. Klimenko · Share · Share via Email · Share on Facebook · Share on LinkedIn · Share on X · Print · Kennan Institute · March 26, 2017 - Russian opposition leader Alexei Navalny marches on Tverskaya Street in Moscow.",
    "published": null
  },
  {
    "title": "A year after Navalny's death, Russian opposition demoralized – DW – 02/15/2025",
    "url": "https://www.dw.com/en/a-year-after-navalnys-death-russian-opposition-demoralized/a-71617836",
    "snippet": "Reznik said Navalny&#x27;s death may have discouraged people who wanted to get actively involved in the opposition and resistance. &quot;I think that, among other things, Putin&#x27;s aim was to shock society again, and the murder of Navalny was an attempt to kill hope,&quot; he said. &quot;Many people became discouraged, disillusioned, lost faith, and experienced tremendous pain.&quot; However, he added, there are others who are capable of &quot;processing this pain, who keep on going, and are doing everything to make sure Alexei&#x27;s sacrifice was not in vain.&quot;",
    "published": "February 15, 2025"
  }
]