[
  {
    "title": "New Austrian Government Sworn In — Austria in USA",
    "url": "https://www.austria.org/news/new-austrian-government-sworn-in",
    "snippet": "Austrian Federal President <strong>Van der Bellen</strong> (left) with Federal Chancellor Christian Stocker, Vice Chancellor Andreas Babler, and Foreign Minister Beate Meinl-Reisinger. ... On March 3, 2025, Federal President Alexander <strong>Van der Bellen</strong> swore in ...",
    "published": "March 20, 2025"
  },
  {
    "title": "Chancellor of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Austria",
    "snippet": "The official residence and executive ... the cabinet are appointed by the president and can be dismissed by the president. The current officeholder is <strong>Christian Stocker</strong>, who was sworn in as chancellor on 3 March 2025 by President Alexander Van der Bellen....",
    "published": "September 29, 2025"
  },
  {
    "title": "Alexander Van der Bellen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_Van_der_Bellen",
    "snippet": "After the Nehammer-led coalition talks collapsed, however, <strong>Van der Bellen</strong> reversed course and asked Herbert Kickl to attempt to form a coalition government with the People&#x27;s Party on 5 January 2025. Since August 2014 <strong>Van der Bellen</strong> has already been regarded as a presidential candidate.",
    "published": "5 days ago"
  },
  {
    "title": "Austrian far-right leader receives mandate to try to lead a government for the first time since World War II | PBS News",
    "url": "https://www.pbs.org/newshour/world/austrian-far-right-leader-receives-mandate-to-try-to-lead-a-government-for-the-first-time-since-world-war-ii",
    "snippet": "Left: FILE PHOTO: Austrian President <strong>Alexander Van der Bellen</strong> shakes hands with far-right Freedom Party (FPO) leader Herbert Kickl in Vienna, Austria, January 6, 2025.",
    "published": "January 6, 2025"
  },
  {
    "title": "2024 Austrian legislative election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024_Austrian_legislative_election",
    "snippet": "It was reported that the Green ... new elections could be called. On 4 January, after consultations with President <strong>Van der Bellen</strong>, ÖVP and SPÖ continued coalition talks without any other party....",
    "published": "September 6, 2025"
  }
]