[
  {
    "title": "Kybunpark - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kybunpark",
    "snippet": "<strong>The Kybunpark, formerly known as AFG Arena</strong>, is a multi-use stadium in St. Gallen, Switzerland, completed in 2008. It is used mostly for football matches and hosts the home matches of FC St. Gallen of the Swiss Super League. It replaces the Espenmoos stadium. The stadium has a capacity of 20,000 ...",
    "published": "July 13, 2025"
  },
  {
    "title": "FC St. Gallen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FC_St._Gallen",
    "snippet": "FC St. Gallen play their home games at <strong>the Kybunpark</strong>. The stadium has a capacity of 19,694 and it is on the west side of town.",
    "published": "November 21, 2025"
  },
  {
    "title": "Kybunpark - AFG Arena - St. Gallen - The Stadium Guide",
    "url": "https://www.stadiumguide.com/afgarena/",
    "snippet": "Club: FC St. Gallen | Opening: 2008 | Capacity: 19,568 (est. 4,500 standing) Kybunpark, previously known as <strong>AFG Arena</strong>, replaced St. Gallen’s old Espenmoos Stadion, which lacked the facilities of modern era stadiums.",
    "published": "April 25, 2017"
  },
  {
    "title": "FC St. Gallen 1879 - Stadium - kybunpark | Transfermarkt",
    "url": "https://www.transfermarkt.com/fc-st-gallen-1879/stadion/verein/257",
    "snippet": "FC St. Gallen 1879 U15 · This page provides you with information about the stadium of the selected club. In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights.",
    "published": null
  },
  {
    "title": "FC St Gallen - LiberoGuide",
    "url": "https://liberoguide.com/fc-st-gallen/",
    "snippet": "The club had long been planning a new ground on the western outskirts of the city. Following an agreement with Arbon-based building suppliers AFG, Stadium West became the <strong>AFG Arena</strong>, the first Swiss ground to take a sponsor’s name.",
    "published": "July 9, 2025"
  }
]