[
  {
    "title": "Sudanese transition to democracy (2019–2021) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudanese_transition_to_democracy_(2019–2021)",
    "snippet": "<strong>Omar al-Bashir overthrew the democratically elected government of Sadiq al-Mahdi in 1989 and was himself overthrown in the 2019 Sudanese coup d&#x27;état</strong>, in which he was replaced by the Transitional Military Council (TMC) after months of sustained street protests.",
    "published": "3 weeks ago"
  },
  {
    "title": "Power Relations in Sudan after the Fall of Bashir - Stiftung Wissenschaft und Politik",
    "url": "https://www.swp-berlin.org/10.18449/2024RP05/",
    "snippet": "The RSF under Hemedti’s leadership were already a powerful and wealthy player when Bashir was over­thrown in April 2019, especially following the luc­rative use of mercenaries in the Yemen war on behalf of the UAE. However, the influence of the RSF grew even further when the transitional government was formed.",
    "published": null
  },
  {
    "title": "Transitional Sovereignty Council - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Transitional_Sovereignty_Council",
    "snippet": "Following more than half a year of sustained civil disobedience and <strong>a shift of the presidency from Omar al-Bashir to the Transitional Military Council (TMC) in April 2019 by a coup d&#x27;état</strong>, the TMC and the Forces of Freedom and Change alliance (FFC) made a July 2019 Political Agreement and ...",
    "published": "November 11, 2025"
  },
  {
    "title": "Sudan: Political Process to Form a Transitional Civilian Government and the Shift in Disorder Trends, Situation Update - April 2023 - Sudan | ReliefWeb",
    "url": "https://reliefweb.int/report/sudan/sudan-political-process-form-transitional-civilian-government-and-shift-disorder-trends-situation-update-april-2023",
    "snippet": "<strong>Since the ouster of former President Omar al-Bashir in April 2019, Sudan has experienced a turbulent political transition</strong>.",
    "published": null
  },
  {
    "title": "Civil War in Sudan | Global Conflict Tracker",
    "url": "https://www.cfr.org/global-conflict-tracker/conflict/power-struggle-sudan",
    "snippet": "Major sticking points emerged as the transitional government began to negotiate a plan. Foremost was the role of Hemedti and the RSF; the agreement elevated Hemedti to Burhan’s equal, promoting him from general’s deputy. The deal also called for the eventual integration of the RSF into Sudan’s legitimate armed forces under civilian leadership.",
    "published": null
  }
]