[
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The International Mathematical Union is administered by an executive committee (EC) which conducts the business of the Union. The EC consists of the President, two vice-presidents, the Secretary, six Members-at-Large, all elected for a term of four years, and the Past President.",
    "published": "February 24, 2025"
  },
  {
    "title": "IMU Executive Committee | International Mathematical Union Leadership 2023-2026",
    "url": "https://www.mathunion.org/organization/imu-executive-committee",
    "snippet": "The International Mathematical Union is administered by an Executive Committee (EC) which, in accordance with the IMU Statutes and subject to the direction and review of the members, conducts the business of the Union. ... The IMU Executive Committee consists of ten voting members elected for four-year terms: the four officers (President, two Vice-Presidents, and Secretary General) and six Members-at-Large.",
    "published": null
  },
  {
    "title": "| International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/",
    "snippet": "As announced in IMU News 115, the ICM 2026 Program Committee Chair is <strong>Claire Voisin</strong>, CNRS, Institut de Mathématiques de Jussieu-Paris Rive Gauche.",
    "published": null
  },
  {
    "title": "General Assembly of the International Mathematical Union | IMU Meetings & Resolutions",
    "url": "https://www.mathunion.org/organization/general-assembly",
    "snippet": "It consists of seven people, namely <strong>the IMU President, the NC Chair (chosen by the IMU President),</strong> three other persons (chosen at random from AO nominations) and two further persons with experience of the IMU (chosen jointly by the NC Chair and IMU President).",
    "published": null
  },
  {
    "title": "International Mathematical Union - MacTutor History of Mathematics",
    "url": "https://mathshistory.st-andrews.ac.uk/Societies/IMU/",
    "snippet": "Although mathematicians from Germany, Austria, Hungary and Bulgaria did not attend, those from other countries were persuaded to attend, particularly since mathematicians from Russia, Ukraine, Georgia, India and Spain, countries which were not members of the International Research Council, were allowed to attend the Congress. The reason given was that these were countries:- ... which had not yet joined the International Research Council. Pincherle was elected President of the International Mathematical Union at the 1924 Congress.",
    "published": null
  }
]