[
  {
    "title": "Josep Borrell - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Josep_Borrell",
    "snippet": "Josep Borrell Fontelles (Western Catalan: [dʒuˈzɛb boˈreʎ fonˈteʎes]; born 24 April 1947) is a Spanish politician who served as High Representative of the Union for Foreign Affairs and Security Policy and <strong>Vice-President of the European Commission</strong> from 2019 to 2024.",
    "published": "3 weeks ago"
  },
  {
    "title": "Josep Borrell departs EU role after bolstering his Middle East legacy | The National",
    "url": "https://www.thenationalnews.com/news/europe/2024/11/29/josep-borrell-departs-eu-role-after-bolstering-his-middle-east-legacy/",
    "snippet": "<strong>EU foreign affairs chief</strong> Josep Borrell made the Middle East crisis the clear focus of his final week in the role, but offered a bleak assessment of his mandate&#x27;s legacy at the second meeting of a global alliance for a Palestinian state.",
    "published": "November 29, 2024"
  },
  {
    "title": "Who’s going to be the EU’s next top diplomat?",
    "url": "https://www.politico.eu/article/eus-top-diplomat-race-crowded-job-politics-european-comission-policy/",
    "snippet": "The <strong>high representative of the Union for foreign affairs and security policy and vice president of the European Commission</strong> chairs regular meetings of the EU’s 27 foreign, defense and development ministers, and represents the EU at G7 and G20 ...",
    "published": "June 7, 2024"
  },
  {
    "title": "Josep Borrell",
    "url": "https://www.realinstitutoelcano.org/en/biographies/josep-borrell/",
    "snippet": "Josep Borrell is Senior Distinguished ... From 2019 to 2024 he served as the <strong>High Representative of the Union for Foreign Affairs and Security Policy and Vice-President of the European Commission</strong>....",
    "published": "April 10, 2025"
  },
  {
    "title": "Borrell i Fontelles, Josep",
    "url": "https://archives.eui.eu/en/isaar/651",
    "snippet": "On June 5 2018, he was appointed as Foreign Minister in the government of Spanish Prime Minister Pedro Sánchez. High Representative of the European Union for Foreign Affairs and Security Policy: 1 December 2019 – 30 November 2024 <strong>Vice-President of the European Commission</strong> 1 December 2019 ...",
    "published": null
  }
]