[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "In August 2010, the blog became a licensed feature of The New York Times online and was renamed FiveThirtyEight: <strong>Nate Silver</strong>&#x27;s Political Calculus. In July 2013, ESPN acquired FiveThirtyEight, hiring Silver as editor-in-chief and a contributor for ESPN.com; the new publication launched on March ...",
    "published": "1 month ago"
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "On July 22, 2013, ESPN (a subsidiary of <strong>the Walt Disney Company</strong>) announced that it had acquired ownership of the FiveThirtyEight website and brand, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming ...",
    "published": "1 day ago"
  },
  {
    "title": "Nate Silver’s FiveThirtyEight Moving From ESPN To ABC News",
    "url": "https://deadline.com/2018/04/fivethirtyeight-leaving-espn-for-abc-news-nate-silver-1202366322/",
    "snippet": "<strong>Nate Silver’s data-driven news site FiveThirtyEight is changing teams, with ABC News</strong> saying it has reached an agreement in principle to acquire the site from its Disney corporate sibling ESPN.",
    "published": "April 17, 2018"
  },
  {
    "title": "FiveThirtyEight joins ABC News - ABC News",
    "url": "https://abcnews.go.com/US/fivethirtyeight-joins-abc-news/story?id=54531745",
    "snippet": "As storytelling around data and analytics remain an important way that ESPN serves sports fans every day, our team will continue to utilize Nate and the FiveThirtyEight experts to allow fans to benefit from their sports content.” · Under ESPN’s ownership, FiveThirtyEight grew from a political ...",
    "published": "April 17, 2018"
  },
  {
    "title": "Why did ABC News acquire FiveThirtyEight? - Quora",
    "url": "https://www.quora.com/Why-did-ABC-News-acquire-FiveThirtyEight",
    "snippet": "Answer (1 of 2): Short answer: Because ESPN needed to sell FiveThirtyEight, and no one outside the Disney umbrella was willing to pay a high enough price. ESPN had been looking at divesting itself of <strong>Nate Silver</strong>’s brand for at least a few ...",
    "published": null
  }
]