[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "They, in turn, stated they wanted to eventually see Navalny as a member of the party. On 15 December 2012 Navalny expressed his support of the party, saying, &quot;<strong>The People&#x27;s Alliance</strong> is my party&quot;, but again refused to join it, citing the criminal cases against him.",
    "published": "1 day ago"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "<strong>Russia of the Future</strong> (Russian: ... Прогресса, Partiya Progressa), is a banned opposition political party in Russia founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018 by Alexei Navalny, who was also the founder of the non-profit organisation ...",
    "published": "September 30, 2025"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "This alignment with the nationalist movement garnered a certain level of scrutiny, forcing him and the <strong>Yabloko party</strong> to declare that, “Yabloko condemned any ethnic or racial hatred and any xenophobia” and called on the police to oppose “any ...",
    "published": null
  },
  {
    "title": "True Beliefs and Opportunism: Navalny’s Tangled Political Development - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/02/01/true-beliefs-and-opportunism-navalnys-tangled-political-development-a72797",
    "snippet": "In 1999, Navalny made his first foray into formal politics, joining the <strong>center-left pro-European liberal party, Yabloko</strong>.",
    "published": "September 1, 2025"
  },
  {
    "title": "The political opposition in Russia - European Parliament",
    "url": "https://www.europarl.europa.eu/meetdocs/2014_2019/plmrep/COMMITTEES/AFET/DV/2020/11-27/Russian_opposition_background_note_2020_final_EN.pdf",
    "snippet": "Born 4 June 1976 in Butyn (Odintsovsky District, Moscow Oblast, Russia). Political affiliation: Yabloko (2000–2007), <strong>Progress Party/Russia of the Future</strong> (since 2013). Alexei Navalny is a Russian politician, lawyer, founder of the Anti-Corruption Foundation and",
    "published": null
  }
]