[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "The original de Havilland Aircraft of Canada, Limited was created in 1928 by the British de Havilland Aircraft Company to build Moth aircraft for the training of Canadian airmen, and subsequently after the Second World War, designed and produced indigenous designs.",
    "published": "1 month ago"
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "In November 2018, <strong>Longview Aviation Capital Corp.</strong> acquired the Dash 8 programme and the de Havilland Canada brand from Bombardier, adding them to the rights and type certificates for all of the out-of-production aircraft (DHC-1 through DHC-7) already sold to its subsidiary Viking Air in 2005.",
    "published": "November 1, 2025"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "Commuter airlines did not create the high demand that the company had expected for its 50-passenger DHC-7 Dash 7. In 1974, the year before the Dash 7 first flew, <strong>the Canadian government</strong> purchased de Havilland Canada from its British owners, ...",
    "published": null
  },
  {
    "title": "De Havilland Canada Amalgamation - De Havilland Canada",
    "url": "https://dehavilland.com/amalgamation/",
    "snippet": "On August 1, 2024, our group of ... Limited, will complete an amalgamation with our common parent corporation, <strong>Longview Aviation Capital Corp</strong>....",
    "published": "August 1, 2024"
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "Then, in 1974, <strong>the Canadian government</strong> purchased De Havilland Canada from its British owner, Hawker Siddeley Aviation. However, DHC&#x27;s status as a &quot;Crown Corporation&quot; will not last long.",
    "published": "February 21, 2024"
  }
]