[
  {
    "title": "Prime Minister of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Australia",
    "snippet": "Since its introduction in 1975, former prime ministers of Australia have been appointed to the Order of Australia and to its highest level, Companion (AC): Whitlam (1978), Fraser (1988), Gorton (1988), Howard (2008), Gillard (2017), Rudd (2019), Abbott (2020), <strong>Turnbull</strong> (2021), and Morrison (2025).",
    "published": "November 6, 2025"
  },
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "The Morrison government was widely criticised for its handling of the 2021 Australian Parliament House sexual misconduct allegations, with an Essential poll finding that 65% of respondents (including 76% of Labor supporters, 51% of Coalition supporters and 88% of Greens supporters) saying the government was more interested in protecting itself than women. As well as the Labor and Greens parties, the government faced criticism from within its own party. Former prime minister Malcolm Turnbull, who had been made aware of the allegations against Christian Porter in 2019, criticised him for taking too long to come forward.",
    "published": "1 week ago"
  },
  {
    "title": "List of prime ministers of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Australia",
    "snippet": "Three former prime ministers lost a majority in the House (Alfred Deakin on two occasions, George Reid and Andrew Fisher), six resigned following leadership spills (John Gorton, Bob Hawke, Kevin Rudd, Julia Gillard, Tony Abbott and Malcolm Turnbull) and three died in office (Joseph Lyons, John Curtin and Harold Holt, who disappeared and is presumed to have died). Two prime ministers also lost their role in a double dissolution election, a snap election where the entire Senate stands for re-election rather than the typical half to resolve deadlocks between the two houses.",
    "published": "2 weeks ago"
  },
  {
    "title": "Julia Gillard - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Julia_Gillard",
    "snippet": "She also became the longest-serving Prime Minister since John Howard&#x27;s electoral loss in 2007, a record which was not exceeded until August 2021, when <strong>Scott Morrison</strong> overtook her as the 14th longest-serving Prime Minister of Australia.",
    "published": "2 weeks ago"
  },
  {
    "title": "Prime Ministers | MOAD",
    "url": "https://apm-origin.moadoph.gov.au/prime-ministers",
    "snippet": "<strong>Anthony Albanese</strong> became Australia’s 31st Prime Minister when the Labor Party won office, replacing the Liberal-National Party Coalition government led by Scott Morrison.",
    "published": null
  }
]