[
  {
    "title": "Konstantinos Tasoulas - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Konstantinos_Tasoulas",
    "snippet": "Konstantinos Tasoulas (Greek: Κωνσταντίνος Τασούλας [konstaˈdinos taˈsulas]; born 17 July 1959) is a Greek politician and lawyer who has <strong>served as the president of the Hellenic Republic since 13 March 2025</strong>. He previously served as President of the Hellenic Parliament from ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Konstantinos Tasoulas Becomes the New President of Greece - GreekReporter.com",
    "url": "https://greekreporter.com/2025/02/12/konstantinos-tasoulas-new-president-greece/",
    "snippet": "All 156 MPs of the governing New Democracy party voted for Tasoulas, in addition to former PM Antonis Samaras and three independent lawmakers. Tasoulas will be sworn in before the Parliament on <strong>March 13, 2025</strong>, when the term of the outgoing ...",
    "published": "February 12, 2025"
  },
  {
    "title": "Greece Elects New President Despite MPs' Walkout Over Train Crash | Balkan Insight",
    "url": "https://balkaninsight.com/2025/02/12/greece-elects-new-president-despite-mps-walkout-over-train-crash/",
    "snippet": "Election by parliament of Konstantinos Tasoulas as <strong>Greece&#x27;s new president was marred by walk-outs by leftist opposition parties, which accuse him of involvement in an alleged government cover-up over the 2023 Tempi train crash</strong>.",
    "published": "February 12, 2025"
  },
  {
    "title": "Presidential Election 2025 Greece",
    "url": "https://www.robert-schuman.eu/en/monitor/6474-konstantinos-tasoulas-is-elected-president-of-greece",
    "snippet": "He was <strong>elected as a New Democracy MP in 2000 and has held this position ever since. He was Deputy Minister of Defence between 2007 and 2008 and Minister of Culture and Sport between 2014 and 2015. Appointed in 2019, he was the outgoing Speaker of Parliament. The new President of the Hellenic Republic will take office on 13 March</strong>...",
    "published": null
  },
  {
    "title": "Konstantinos Tasoulas elected new president of Greece | eKathimerini.com",
    "url": "https://www.ekathimerini.com/politics/1261471/konstantinos-tasoulas-elected-new-president-of-greece/",
    "snippet": "<strong>Tasoulas will succeed Katerina Sakellaropoulou</strong>, whose term expires on March 13.",
    "published": "February 12, 2025"
  }
]