[
  {
    "title": "Marc Grossman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marc_Grossman",
    "snippet": "At the direction of the Secretary of State, he <strong>revamped the State Department&#x27;s human resource strategies, including the Department&#x27;s strategies for training, assigning, and retaining personnel both at home and abroad</strong>. Grossman was appointed Under Secretary of State for Political Affairs, the ...",
    "published": "August 4, 2025"
  },
  {
    "title": "Marc Grossman | The Cohen Group",
    "url": "https://www.cohengroup.net/who-we-are/team/marc-grossman",
    "snippet": "As Under Secretary, he <strong>helped marshal diplomatic support for the international response to the terror attacks of September 11, 2001.</strong> He also managed US policies in the Balkans and Colombia and promoted a key expansion of the NATO alliance.",
    "published": "January 29, 2025"
  },
  {
    "title": "Ambassador Marc Grossman | Leadership, Diplomacy and National Security Lab",
    "url": "https://ldns.asu.edu/about/ambassador-marc-grossman",
    "snippet": "Ambassador Marc Grossman served ... after 29 years in the US Foreign Service. As Under Secretary, he <strong>helped marshal diplomatic support for the international response to the attacks of September 11, 2001.</strong>...",
    "published": null
  },
  {
    "title": "Marc Grossman - Yale Jackson School of Global Affairs",
    "url": "https://jackson.yale.edu/person/marc-grossman/",
    "snippet": "As Under Secretary, he <strong>helped marshal diplomatic support for the international response to the attacks of September 11, 2001.</strong> He also managed U.S. policies in the Balkans and Colombia and promoted a key expansion of the NATO alliance.",
    "published": "March 26, 2023"
  },
  {
    "title": "Marc Grossman | American Academy of Diplomacy",
    "url": "https://www.academyofdiplomacy.org/members-1/grossman/marc",
    "snippet": "He was <strong>Under Secretary of State for Political Affairs from March 26, 2001 until February 25, 2005.</strong> He also had served as Director General of the Foreign Service and Director of Human Resources, Assistant Secretary of ...",
    "published": null
  }
]