[
  {
    "title": "Banca di Roma - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banca_di_Roma",
    "snippet": "Banca di Roma was an Italian bank based in Rome, formed in 1992 by merger of Banco di Santo Spirito and Banco di Roma. From 2008 it was a subsidiary of UniCredit under the name UniCredit Banca di Roma S.p.A.. <strong>In 2010 the subsidiary was absorbed into the bank, but retained as a registered trademark</strong>.",
    "published": "June 16, 2025"
  },
  {
    "title": "BCC Roma",
    "url": "https://www.bccroma.it/",
    "snippet": "Entro il 14 luglio 2026 i proprietari di edifici situati nei comuni di Arzignano, Brogliano, Cornedo Vicentino, Recoaro Terme, Trissino e Valdagno (provincia di Vicenza) e del comune di San Giovanni Ilarione (provincia di Verona), resi inagibili dagli eccezionali eventi metereologici del 17 e 18 aprile 2025, possono fare richiesta di sospensione delle rate dei mutui.",
    "published": null
  },
  {
    "title": "Banca di roma - Enciclopedia - Treccani",
    "url": "https://www.treccani.it/enciclopedia/banca-di-roma_(Dizionario-di-Economia-e-Finanza)/",
    "snippet": "La B. di R., dopo essere stata la più importante del gruppo Capitalia, <strong>è entrata a far parte del Gruppo Bancario UniCredit</strong> (➔ Unicredit Group), che ne ha cambiato la denominazione in UniCredit Banca di Roma, per poi incorporarla (2010) nella ...",
    "published": null
  },
  {
    "title": "BANCA DI ROMA - Museo del Marchio Italiano",
    "url": "https://www.museodelmarchioitaliano.it/en/banca-di-roma-2/",
    "snippet": "The current “Banca di Roma”, present in the credit and financial world since 1539, is <strong>one of the three banks of national interest</strong> and carries out its business in Italy and around the world. From the merger of the three oldest banks in the capital, “Cassa di Risparmio di Roma”, “Banco ...",
    "published": "June 4, 2024"
  },
  {
    "title": "Banco di Roma - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banco_di_Roma",
    "snippet": "Banco di Roma was an Italian bank based in Rome, established on 9 March 1880. In the early 20th century, it was one of Italy&#x27;s four dominant universal banks, together with Banca Commerciale Italiana, Credito Italiano, and Società Bancaria Italiana. It developed a significant network throughout the Eastern Mediterranean and Italian Africa.",
    "published": "June 18, 2025"
  }
]