[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the <strong>chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Larive came to UC Santa Cruz from UC Riverside, where she was <strong>provost and executive vice chancellor</strong>. As provost, she was responsible for the academic enterprise, managing large-scale initiatives as well as the academic operations of the Riverside campus. Over her career at UCR, she served in ...",
    "published": null
  },
  {
    "title": "Cynthia Larive - Chancellor - Univerisity of California Santa Cruz | LinkedIn",
    "url": "https://www.linkedin.com/in/cynthia-larive-83218a8",
    "snippet": "2 others named Cynthia Larive are on LinkedIn See others named Cynthia Larive · See all courses · Include this LinkedIn profile on other websites · <strong>Chancellor at Univerisity of California Santa Cruz</strong> · Chancellor at Univerisity of California ...",
    "published": null
  },
  {
    "title": "Leadership – UC Santa Cruz",
    "url": "https://www.ucsc.edu/about/leadership/",
    "snippet": "As the <strong>11th chancellor of UC Santa Cruz</strong>, Cynthia Larive leads an institution known worldwide for its interdisciplinary approach to research for the public good, for seeking solutions and giving voice to the challenges of our time, and for its commitment to social and environmental justice.",
    "published": null
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "Before taking the role, she served as <strong>provost and executive vice chancellor at UC Riverside, and served in various administrative roles after beginning her career as a chemistry professor at the University of Kansas in 1992</strong>.",
    "published": "August 22, 2025"
  }
]