[
  {
    "title": "Kevin Volland - AS Monaco",
    "url": "https://www.asmonaco.com/en/joueurs/kevin-volland/",
    "snippet": "<strong>144 games, 36 goals and 39 assists later, the German international signed for Bayer Leverkusen where he first played in the Champions League. After four seasons there (50 goals and 32 assists in all competitions in 148 games), Kevin Volland joined AS Monaco on a four season deal on September</strong> ...",
    "published": "August 18, 2023"
  },
  {
    "title": "Kevin Volland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kevin_Volland",
    "snippet": "<strong>On 1 November 2020, he scored his first two goals in Monaco&#x27;s win over Girondins de Bordeaux in the Ligue 1.</strong> In the first match of the 2021–22 season, against Sparta Prague in the preliminary round of the Champions League, he scored his team&#x27;s second goal with an assist from Sofiane Diop.",
    "published": "3 weeks ago"
  },
  {
    "title": "Timeline of Kevin Volland's Football Career | Timepath Wiki",
    "url": "https://timepath.org/kevin-volland",
    "snippet": "<strong>Kevin Volland played a crucial role in helping AS Monaco secure a spot in the UEFA Champions League for the 2021-2022 season</strong>. His goal scoring and assists throughout the Ligue 1 season were vital as Monaco finished in a high position in the league, enabling them to qualify for Europe&#x27;s premier ...",
    "published": null
  },
  {
    "title": "Kevin Volland joins Union Berlin",
    "url": "https://www.asmonaco.com/en/kevin-volland-joins-union-berlin/",
    "snippet": "Kevin Volland arrived in the summer of 2020 and played for Monaco for <strong>three seasons</strong>, making 115 appearances in all competitions (39 goals, 24 assists).",
    "published": "August 17, 2023"
  },
  {
    "title": "AS Monaco: Kevin Volland lands in the principality",
    "url": "https://www.ligue1.com/Articles/NEWS/2020/09/03/as-monaco-kevin-volland-lands-in-the-principality",
    "snippet": "Germany striker Kevin Volland is now a Monegasque. On Wednesday the 28-year-old signed a four-year contract with AS Monaco that sees him linked to the club <strong>through to June 2024</strong>. The German international arrives from Bayer Leverkusen, where he ...",
    "published": null
  }
]