[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "On November 15, 2020, The Wall Street Journal reported that Hicks Equity Partners, a private equity firm with ties to a co-chair of the Republican National Committee, was exploring a buyout of Newsmax. The Hicks group identified a team of executives who would manage the network, and had been talking to former Fox News hosts including Megyn Kelly. Media analyst Michael Nathanson reported that if a competing network took 20% of Fox News&#x27; audience, it could sap about $200 million in annual profit from the company.",
    "published": "1 week ago"
  },
  {
    "title": "NewsMax Executive Team | Comparably",
    "url": "https://www.comparably.com/companies/newsmax/executive-team",
    "snippet": "<strong>Jim Tremblay serves as the Vice President - Ad Sales of NewsMax</strong>. ... Jason Villar serves as the VP of Media &amp; Market Research of NewsMax.",
    "published": null
  },
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "<strong>Christopher Ruddy</strong> (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and majority owner of Newsmax Media.",
    "published": "5 days ago"
  },
  {
    "title": "Newsmax - News Media Bias Rating | AllSides",
    "url": "https://www.allsides.com/news-source/newsmax",
    "snippet": "Learn the AllSides Media Bias Rating of Newsmax - News. AllSides rates the media bias of hundreds of media outlets, journalists, and sources.",
    "published": null
  },
  {
    "title": "Newsmax - Bias and Credibility - Media Bias/Fact Check",
    "url": "https://mediabiasfactcheck.com/newsmax-bias-credibilty-reliability/",
    "snippet": "Newsmax is an American conservative biased news and opinion website founded by <strong>Christopher Ruddy</strong> in 1998 and based in West Palm Beach, Florida. <strong>Christopher Ruddy</strong> is the president and CEO of Newsmax Media.",
    "published": "August 17, 2025"
  }
]