[
  {
    "title": "TF1 Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1_Group",
    "snippet": "TF1 Group (French: Groupe TF1) is a French media holding company. Its best-known property is the broadcast network TF1. The group was formed after TF1 was privatized in April 1987 in which the channel was launched back on 6 January 1975 twelve years prior.",
    "published": "2 weeks ago"
  },
  {
    "title": "TF1 Group",
    "url": "https://corporate-executives.com/companies/tf1-group/",
    "snippet": "Founded in 1975 by <strong>the French Government</strong> and privatized in 1987, the TF1 group is the owner of TF1, Europe’s largest private TV channel.",
    "published": "October 14, 2020"
  },
  {
    "title": "TF1 Group - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/tf1-group",
    "snippet": "TF1 Group is a television broadcasting organization that specializes in movie production as well as publishing social media services. Founded · Apr 26, 1935 · Public · Boulogne, Nord-Pas-de-Calais, France · 51-100 · www.groupe-tf1.fr/en · Broadcasting ·",
    "published": null
  },
  {
    "title": "TF1 Group | Ultimate Pop Culture Wiki | Fandom",
    "url": "https://ultimatepopculture.fandom.com/wiki/TF1_Group",
    "snippet": "Template:Expand French TF1 Group (French: [Groupe TF1] error: {{lang}}: text has italic markup (help)) is a French media holding company. Its best-known property is the broadcast network TF1. The group was formed after TF1 was privatized in April 1987. It is controlled with a 43% stake by Bouygues, and is quoted on Euronext Paris.",
    "published": null
  },
  {
    "title": "TF1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1",
    "snippet": "TF1 (French: [te ɛf œ̃] ⓘ; standing for Télévision Française 1) is a French commercial television network owned by TF1 Group, controlled by the Bouygues conglomerate. TF1&#x27;s average market share of 24% makes it the most popular domestic network. TF1 is part of the TF1 Group of mass media ...",
    "published": "1 week ago"
  }
]