[
  {
    "title": "Pier Luigi Bersani - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pier_Luigi_Bersani",
    "snippet": "Bersani <strong>joined the Italian Communist Party and subsequently the Democratic Party of the Left</strong>. As member of the National Secretariat of the Democrats of the Left, he was responsible for the economic sector.",
    "published": "August 25, 2025"
  },
  {
    "title": "Pier Luigi Bersani",
    "url": "https://grokipedia.com/page/Pier_Luigi_Bersani",
    "snippet": "Pier Luigi Bersani (born 29 September ... roles as <strong>Secretary of the Democratic Party from 7 November 2009 to 20 April 2013 and Minister of Economic Development from 17 May 2006 to 8 May 2008 in the second Prodi government</strong>.[1][2][3] ...",
    "published": null
  },
  {
    "title": "Profile: Pier Luigi Bersani - BBC News",
    "url": "https://www.bbc.com/news/world-europe-20579689",
    "snippet": "<strong>He became the party&#x27;s regional president in 1993</strong> as the Italian left was struggling to modernise, following the end of the Cold War and cross-party corruption scandals. In 1996 he entered government for the first time as industry minister under ...",
    "published": "April 19, 2013"
  },
  {
    "title": "Pier Luigi Bersani | Historica Wiki | Fandom",
    "url": "https://historica.fandom.com/wiki/Pier_Luigi_Bersani",
    "snippet": "Pier Luigi Bersani (29 September ... Party of Italy from 7 November 2009 to 20 April 2013, <strong>succeeding Dario Franceschini and preceding Guglielmo Epifani</strong>. Pier Luigi Bersani was born in Bettola, Emilia-Romagna in 1951, and he briefly worked as ...",
    "published": null
  },
  {
    "title": "Pier Luigi Bersani facts for kids",
    "url": "https://kids.kiddle.co/Pier_Luigi_Bersani",
    "snippet": "Later, he became a member of the Democratic Party of the Left. In this party, he was <strong>in charge of economic matters</strong>. When he was younger, he became the Vice-President of the Mountain Community of Piacenza.",
    "published": null
  }
]