[
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "He led the party to the 2022 election, where it was victorious over <strong>Scott Morrison</strong>&#x27;s Liberal–National Coalition. He was sworn in on 23 May 2022. In his first term, Albanese led his government&#x27;s response to Australia&#x27;s cost-of-living crisis caused by the 2021–2023 inflation surge, held an ...",
    "published": "9 hours ago"
  },
  {
    "title": "Albanese government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Albanese_government",
    "snippet": "It won a plurality of seats in the Senate at the 2025 election, though has never held a majority of seats in the upper house. Albanese succeeded the <strong>Morrison government</strong> after the Liberal–National Coalition was defeated at the 2022 election, and saw the first Labor government to be elected ...",
    "published": "1 day ago"
  },
  {
    "title": "Liberal–National Coalition - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Liberal–National_Coalition",
    "snippet": "The Queensland Liberals and Nationals ... parties agreed to merge, forming the Liberal National Party (LNP), under the leadership of former National <strong>Lawrence Springborg</strong>....",
    "published": "7 hours ago"
  },
  {
    "title": "Who's who in the current Parliament - Parliamentary Education Office",
    "url": "https://peo.gov.au/understand-our-parliament/parliament-and-its-people/people-in-parliament/whos-who-in-the-current-parliament",
    "snippet": "... <strong>Ms Ley</strong> is also the leader of the Liberal Party of Australia. The Leader of the Opposition is a member of parliament who leads the largest party or coalition of parties that is not in government.",
    "published": null
  },
  {
    "title": "Australia: Liberal-National coalition reunite a week after split",
    "url": "https://www.bbc.com/news/articles/cx2748d37k4o",
    "snippet": "Liberal leader <strong>Sussan Ley</strong> thanked the Nationals leader David Littleproud for the &quot;respectful and productive way&quot; the two parties had negotiated their reunification - the pair also announced its new shadow cabinet made up of members from both parties.",
    "published": "May 28, 2025"
  }
]