[
  {
    "title": "Left Party (France) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Left_Party_(France)",
    "snippet": "The Left Party (French: Parti de gauche, PG) is a left-wing to far-left, democratic socialist political party in France, <strong>founded in 2009 by Jean-Luc Mélenchon and Marc Dolez</strong> after their departure from the Socialist Party (PS). The PG claims to bring together personalities and groups from different ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Parti de gauche (France) — Wikipédia",
    "url": "https://fr.wikipedia.org/wiki/Parti_de_gauche_(France)",
    "snippet": "Le Parti de gauche (abrégé en PG) est un parti politique français classé à gauche, fondé le 1er février 2009. Lancé par les parlementaires <strong>Jean-Luc Mélenchon et Marc Dolez le 12 novembre 2008, après leur départ du Parti socialiste (PS) à la suite du congrès de Reims, le PG fédère</strong> ...",
    "published": "November 18, 2025"
  },
  {
    "title": "parti de Gauche - LAROUSSE",
    "url": "https://www.larousse.fr/encyclopedie/divers/parti_de_Gauche/185946",
    "snippet": "Parti politique français fondé en 2008. Formation politique issue du départ des figures de l’aile gauche du parti socialiste (PS) – <strong>Jean-Luc Mélenchon et Marc Dolez</strong> – à la suite du congrès de ce parti (novembre 2008).",
    "published": null
  },
  {
    "title": "Parti de Gauche (Political party, France)",
    "url": "https://www.crwflags.com/fotw/flags/fr%7Dpgau.html",
    "snippet": "Parti de Gauche (PG, Party of the Left) was <strong>founded on 1 February 2009 by the senator Jean-Luc Mélenchon and the representative Marc Dolez</strong> as a splinter of the Parti Socialiste (PS). Mélenchon and Dolez were the leaders of the two leftist courants (trends) of the PS called &quot;Trait d&#x27;union&quot; ...",
    "published": null
  },
  {
    "title": "Parti de Gauche — Wikirouge",
    "url": "https://wikirouge.net/Parti_de_Gauche",
    "snippet": "Le Parti de Gauche est un parti de gauche français <strong>créé en 2008, principalement organisé autour de sa figure Jean-Luc Mélenchon</strong>. Il est la 2ème force politique du Front de Gauche.",
    "published": "October 3, 2025"
  }
]