[
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "On 2 July 2019, Christine Lagarde was nominated by the European Council to succeed <strong>Mario Draghi</strong> as President of the European Central Bank (ECB) on 1 November 2019.",
    "published": "6 days ago"
  },
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "Although Axel Weber was tipped as one of the possible successors, he resigned from the ECB in protest at the bail out policies. <strong>Mario Draghi</strong> was chosen to become the next President of the ECB on 24 June 2011. Draghi was president from 1 November 2011 until 31 October 2019 (succeeded by Christine ...",
    "published": "September 25, 2025"
  },
  {
    "title": "Christine Lagarde",
    "url": "https://www.ecb.europa.eu/ecb/decisions/html/cvlagarde.en.html",
    "snippet": "Christine Lagarde, President of the European Central Bank",
    "published": "November 22, 2023"
  },
  {
    "title": "ECB faces major leadership shake-up as Lagarde and top board members near exit",
    "url": "https://www.mitrade.com/insights/news/live-news/article-3-1174720-20251006",
    "snippet": "The European Central Bank (ECB) ... Christine Lagarde, set to be replaced over the next two years. Vice President <strong>Luis de Guindos</strong> will be stepping down in May 2026, followed by Chief Economist Philip Lane a ...",
    "published": "October 6, 2025"
  },
  {
    "title": "ECB’s Lagarde says Knot would be suitable successor - report By Investing.com",
    "url": "https://www.investing.com/news/world-news/ecbs-lagarde-says-knot-would-be-suitable-successor--report-93CH-4269789",
    "snippet": "Investing.com -- European Central Bank President Christine Lagarde said <strong>Klaas Knot</strong> would be a suitable successor, according to Dutch newswire ANP, which cited a podcast episode of &quot;College Leaders in Finance&quot; set to be released on Sunday.",
    "published": "October 3, 2025"
  }
]