[
  {
    "title": "Department of Humanities, Social and Political Sciences – Department of Humanities, Social and Political Sciences | ETH Zurich",
    "url": "https://gess.ethz.ch/en/",
    "snippet": "Two teaching assistant positions are available at the Professorship for Ethics, Technology and Society.",
    "published": null
  },
  {
    "title": "Department of Humanities, Social and Political Sciences | ETH Zurich",
    "url": "https://ethz.ch/en/the-eth-zurich/organisation/who-is-who/gess.html",
    "snippet": "Homepage · Navigation · Search · Content · Footer · Contact · Sitemap · Header · Services · Student portal",
    "published": null
  },
  {
    "title": "Administrative Staff – Department of Humanities, Social and Political Sciences | ETH Zurich",
    "url": "https://gess.ethz.ch/en/the-department/organisation-and-structure/administrative-staff.html",
    "snippet": "The Departmental Administrative Staff is the central point of contact for the Department of Humanities, Social and Political Sciences (D-GESS). Its members ensure flawless operations in all operative tasks and responsibilities of the Department. Among other tasks, the Departmental Administrative Staff serves as · Point of contact for students, staff, and professors · Link between the D-GESS and other departments, the ETH Academic Services (in matters pertaining to studies), the staff units of the Executive Board, and the Infrastructure Divisions",
    "published": null
  },
  {
    "title": "Humanities, Political and Social Sciences | ETH Zurich",
    "url": "https://ethz.ch/en/studies/bachelor/bachelors-degree-programmes/management-and-social-sciences.html",
    "snippet": "During a degree course at ETH Zurich a total of eight credit points have to be earned in the area of Science in Perspective – six at bachelor’s and two at master’s level. D-GESS offers a Bachelor programme in Public Policy for Professional Officers. Department of Humanities, Social and Political Sciences",
    "published": null
  },
  {
    "title": "Faculty – Department of Humanities, Social and Political Sciences | ETH Zurich",
    "url": "https://gess.ethz.ch/en/research/faculty.html",
    "snippet": "<strong>Prof. Martina Rau</strong> (ETH Zürich / Kilian Kessler)",
    "published": null
  }
]