[
  {
    "title": "Maurice Steijn new head coach Ajax",
    "url": "https://english.ajax.nl/articles/maurice-steijn-new-head-coach-ajax",
    "snippet": "Last season Steijn finished on ... is now roughly 20 years active as a trainer in professional football, of which <strong>10 years as head coach</strong>....",
    "published": null
  },
  {
    "title": "Maurice Steijn - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Maurice_Steijn",
    "snippet": "Under his leadership, Sparta secured ... finish and reached the final of the European play-offs. <strong>In June 2023, he departed to become head coach of Ajax after the Amsterdam club activated a clause in his contract</strong>....",
    "published": "2 weeks ago"
  },
  {
    "title": "Ajax part company with head coach Maurice Steijn - The Athletic",
    "url": "https://theathletic.com/4990501/2023/10/23/maurice-steijn-ajax-steps-down/",
    "snippet": "The 36-time Dutch champions sit ... Steijn <strong>joined the club from Sparta Rotterdam in June 2023 following the departure of Johnny Heitinga and signed a contract until 2026, but won just two of his 11 games in charge</strong>...",
    "published": "October 26, 2023"
  },
  {
    "title": "Steijn latest in a long line of Ajax players and managers with past links to Sparta",
    "url": "https://english.ajax.nl/articles/steijn-latest-in-a-long-line-of-ajax-players-and-managers-with-past-links-to-sparta/",
    "snippet": "Ajax, Sparta Rotterdam, and Maurice Steijn have reached an agreement concerning the trainer&#x27;s move to Ajax. Steijn will sign a three-year contract in Amsterdam from 1 July 2023 till 30 June 2026. <strong>Steijn (Den Haag, 20 November 1973</strong>) will become ...",
    "published": null
  },
  {
    "title": "Steijn: A man from The Hague in Amsterdam service",
    "url": "https://english.ajax.nl/articles/steijn-a-man-from-the-hague-in-amsterdam-service/",
    "snippet": "Maurice Steijn is moments away from his debut as head coach of Ajax 1. With fellow Hagueneses and former Ajax players Aad de Mos, Martin Jol and Cedric van der Gun, we discuss his move to Amsterdam, Hagueneses at Ajax and the expectations.",
    "published": null
  }
]