[
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "Paris, World Athletics should focus ... for the effort and a member of the board of the bid company. With the May 2004 resignation of chairman <strong>Barbara Cassani</strong>, ......",
    "published": "November 18, 2025"
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "He also set a world record over 500m (which was then an official distance) in 1925 and was a motor sports fanatic, competing eight times in the Monte Carlo Rally. During World War II, Paulen was a member of the Dutch resistance and was made a Colonel in the US Army. After the end of hostilities, he became the Dutch athletics federation president in 1946 and held that post until 1964.",
    "published": null
  },
  {
    "title": "Lord Sebastian COE",
    "url": "https://www.olympics.com/ioc/lord-sebastian-coe",
    "snippet": "Athlete (retired 1990); Member of Parliament for Falmouth and Camborne (1992-1997); Private Secretary to the Leader of the Opposition (1997-2001); Chair, London bid to host the 2012 Olympic and Paralympic Games (2004); Chair, London Organising Committee of the Olympic Games and Paralympic Games (LOCOG) (2005-2012); Chair, British Olympic Association (2012-2016); Executive Chairman of CSM Sport and Entertainment (2013-2020); Non-Executive Chairman of CSM Sport and Entertainment (now Wasserman) (2020-); Vice-President (2007-2015) and then President, International Association of Athletics Federations (now World Athletics) (2015-2019 and 2019-)",
    "published": null
  },
  {
    "title": "Sebastian Coe | Biography, Runner, Olympics, Steve Ovett, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Sebastian-Coe",
    "snippet": "Sebastian Coe, 2022 Sebastian Coe, president of the IAAF, at the 2022 world championships in Eugene, Oregon. (more) ... Encyclopaedia Britannica&#x27;s editors oversee subject areas in which they have extensive knowledge, whether from years of experience gained by working on that content or via study for an advanced degree.... ... Last updated Nov. 1, 2025 •History ... Sebastian Coe (born September 29, 1956, London, England) is a British athlete, who won four Olympic medals and set eight world records in middle-distance running.",
    "published": "May 4, 1999"
  },
  {
    "title": "Coe re-elected and will preside over historic gender equal Council | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/sebastian-coe-president-congress-2023-gender-equal-council",
    "snippet": "World Athletics President Sebastian Coe was elected for a third term at the 54th World Athletics Congress in Budapest",
    "published": null
  }
]