[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The Beacon Journal has won four Pulitzer Prizes: in 1968, 1971, 1987 and 1994. The paper was founded with the 1897 merger of the Summit Beacon, first published in 1839, and the Akron Evening Journal, founded in 1896. <strong>In 1903, the Beacon Journal was purchased by Charles Landon Knight</strong>.",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "Announcement of the sale comes the week before the Beacon Journal’s 179th anniversary. The first edition of the Summit Beacon appeared on April 15, 1839. It merged with the Akron Evening Journal on June 7, 1897, when the first edition of the Akron Beacon Journal rolled off the presses.",
    "published": "April 11, 2018"
  },
  {
    "title": "The Akron Beacon Journal (Akron, Ohio) 1903-Current | Library of Congress",
    "url": "https://www.loc.gov/item/sn84028149/",
    "snippet": "Daily 34th year, no. 288 (Nov. 6, 1903)- Republican. Also issued on microfilm from Ohio Historical Society and Microfilming Corp. of America. Subject and personal name index: 1929-1938. 10 v. Weekly ed.: Summit County beacon, 1903-1910. 162nd year, no. 139 (Aug. 31, 2000).",
    "published": null
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media | Crain's Cleveland Business",
    "url": "https://www.crainscleveland.com/article/20180411/news/157966/akron-beacon-journal-sold-gatehouse-media",
    "snippet": "<strong>Black Press Group Ltd. sold the newspaper and its website, Ohio.com, to GateHouse for $16 million</strong>. The paper, a longtime Knight Ridder property, was sold to Black Press in 2006. GateHouse also owns the Columbus Dispatch, the Canton Repository ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Gatehouse Media purchases Akron Beacon Journal - cleveland.com",
    "url": "https://www.cleveland.com/akron/2018/04/gatehouse_media_purchases_akro.html",
    "snippet": "As part of the Beacon sale, GateHouse Media agreed, in a separate transaction, to sell Black Press several newspapers in Alaska. The Beacon Journal in downtown Akron has <strong>served the Akron community since 1839 when it launched as the Summit Beacon</strong>.",
    "published": "April 11, 2018"
  }
]