[
  {
    "title": "Power Relations in Sudan after the Fall of Bashir - Stiftung Wissenschaft und Politik",
    "url": "https://www.swp-berlin.org/10.18449/2024RP05/",
    "snippet": "The RSF under Hemedti’s leadership were already a powerful and wealthy player when Bashir was over­thrown in April 2019, especially following the luc­rative use of mercenaries in the Yemen war on behalf of the UAE. However, the influence of the RSF grew even further when the transitional government was formed.",
    "published": null
  },
  {
    "title": "Omar al-Bashir - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Omar_al-Bashir",
    "snippet": "Subsequent to al-Bashir&#x27;s promotion to the chairman of the Revolutionary Command Council for National Salvation, he allied himself with <strong>Hassan al-Turabi</strong>, the leader of the National Islamic Front, who, along with al-Bashir, began institutionalizing Sharia law in the northern part of Sudan.",
    "published": "3 days ago"
  },
  {
    "title": "Sudan after Omar al-Bashir’s overthrow | The Political Studies ...",
    "url": "https://www.psa.ac.uk/psa/news/sudan-after-omar-al-bashir’s-overthrow",
    "snippet": "Faced with rising discontent and rising civilian deaths Sudan’s military intervened in April removing Omar Al-Bashir from office and placing him and his allies under house arrest. A transitional Military Council with army generals ruled Sudan immediately after Al-Bashir’s overthrow, desiring to retain power.",
    "published": null
  },
  {
    "title": "Sudanese revolution - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudanese_revolution",
    "snippet": "<strong>The Sudanese revolution</strong> (Arabic: الثورة السودانية, romanized: al-Thawrah al-Sūdānīyah) was a major shift of political power in Sudan that started with street protests throughout Sudan on 19 December 2018 and continued with ...",
    "published": "1 week ago"
  },
  {
    "title": "Sudan’s Uprising: The Fall of a Dictator | Journal of Democracy",
    "url": "https://www.journalofdemocracy.org/articles/sudans-uprising-the-fall-of-a-dictator/",
    "snippet": "Their protest was sparked by rising prices and the lifting of subsidies on basic goods, but demonstrators linked these economic hardships to the rule of longtime president Omar al-Bashir and his autocratic Inqaz (Salvation) regime. In the following days, protests spread across the large northeast African country of 43 million people, with participants demanding an end to Bashir’s military-backed presidency and a transition to civilian rule.",
    "published": "May 7, 2024"
  }
]