[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "Martin was awarded &quot;Politician of the Year&quot; by the Journal for his performance and election result. He was elected again as <strong>Taoiseach</strong> in a 95–76 vote by the Dáil on 23 January 2025 following a coalition agreement between Fianna Fáil, Fine Gael and with the support of several independent TDs.",
    "published": "2 weeks ago"
  },
  {
    "title": "Micheál Martin returns as Irish premier, bracing for Trump fallout | Reuters",
    "url": "https://www.reuters.com/world/europe/michel-martin-returns-irish-prime-minister-amid-trump-threat-2025-01-23/",
    "snippet": "Item 1 of 2 Taoiseach Micheal Martin reacts as he is elected as Ireland&#x27;s <strong>Taoiseach (Prime Minister)</strong> in parliamentary vote, in Dublin, Ireland, January 23, 2025.",
    "published": "January 23, 2025"
  },
  {
    "title": "Micheál Martin hits back at criticism of Irish presidential election review",
    "url": "https://www.bbc.com/news/articles/cn7k1dxnk63o",
    "snippet": "Taoiseach Micheál Martin has been under pressure since Jim Gavin dropped out of the Irish presidential race earlier this year",
    "published": "16 hours ago"
  },
  {
    "title": "Micheál Martin finally appoints his new Cabinet amid temporary Dáil ceasefire – The Irish Times",
    "url": "https://www.irishtimes.com/politics/2025/01/23/temporary-ceasefire-allows-government-to-form-as-martin-seeks-to-project-fresh-energy-with-reshuffle/",
    "snippet": "After being elected Taoiseach by 95 votes to 76, Micheál Martin was cheered to the rafters by both Fianna Fáil and Fine Gaelers. Photograph: Maxwell&#x27;s · Pat Leahy · Thu Jan 23 2025 - 18:09 · An uneasy, and perhaps only interim, ceasefire between Government and Opposition parties enabled the election of Micheál Martin as Taoiseach and the formation of a new Government today after an acrimonious 24-hour delay that deepened the divisions in the 34th Dáil and soured relations across the floor of the House to an extent that feels more than temporary.",
    "published": "January 23, 2025"
  },
  {
    "title": "Micheál Martin vows to protect Ireland ‘at moment of real threat’ | Ireland | The Guardian",
    "url": "https://www.theguardian.com/world/2025/jan/23/ireland-government-micheal-martin-prime-minister-taoiseach",
    "snippet": "<strong>Fianna Fáil leader officially elected as taoiseach</strong> a day after chaotic scenes in Dáil, as thoughts turn to future and Trump",
    "published": "January 23, 2025"
  }
]