[
  {
    "title": "M. Abdelhak Saihi prend ses nouvelles fonctions à la tête du ministère de la Santé | Radio Algérienne",
    "url": "https://news.radioalgerie.dz/fr/node/14440",
    "snippet": "M. Abdelhak Saihi a pris vendredi ses nouvelles fonctions <strong>à la tête du ministère de la Santé</strong> en remplacement de M. Abderrahmane Benbouzid après le remaniement ministériel effectué par le président de la République M. Abdelmadjid Tebboune.",
    "published": null
  },
  {
    "title": "Le professeur Abdelhak Saihi prend ses fonctions à la tête du secteur du travail, de l’emploi et de la sécurité sociale",
    "url": "https://www.mtess.gov.dz/fr/le-professeur-abdelhak-saihi-prend-ses-fonctions-a-la-tete-du-secteur-du-travail-de-lemploi-et-de-la-securite-sociale/",
    "snippet": "Le professeur <strong>Abdelhak Saihi</strong> a pris aujourd’hui le Lundi 15 septembre 2025, ses fonctions de Ministre du Travail, de l’Emploi et de la Sécurité Sociale en remplacement de Monsieur Fayçal Ben Taleb.",
    "published": null
  },
  {
    "title": "Abdelhak Saihi focalise sur la prevention contre les risques professionnel - La patrie news",
    "url": "https://lapatrienews.dz/abdelhak-saihi-focalise-sur-la-prevention-contre-les-risques-professionnel/",
    "snippet": "Yahia Maouchi Le ministre du Travail, de l’Emploi et de la Sécurité sociale, Abdelhak Saihi, a présidé une réunion d’évaluation consacrée aux activités de l’Institut national de prévention des risques professionnels. Au cours de cette session, le ministre a suivi une présentation ...",
    "published": "5 days ago"
  },
  {
    "title": "Abdelhak Saihi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdelhak_Saihi",
    "snippet": "Abelhak Saihi is the Algerian <strong>Minister of Health, Population and Hospital Reform</strong>. He was appointed as minister on 9 September 2022.",
    "published": "November 19, 2024"
  },
  {
    "title": "Qui est Abdelhak Saïhi, le nouveau ministre de la Santé ? - Algerie360",
    "url": "https://www.algerie360.com/qui-est-abdelhak-saihi-le-nouveau-ministre-de-la-sante/",
    "snippet": "Dans le cadre de ce remaniement ministériel, le Président Tebboune a nommé Abdelhak Saïhi en tant que <strong>ministre de la Santé, de la Population et de la Réforme Hospitalière</strong>, et ce, en succession à Abderrahmane Benbouzid, qui occupera ...",
    "published": "September 8, 2022"
  }
]