[
  {
    "title": "USA Today Co. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gannett",
    "snippet": "USA Today Co., Inc., known until 2025 as Gannett Co., Inc. (/ɡəˈnɛt/ gə-NET), is an American mass media holding company headquartered in <strong>New York City</strong>. It is the largest U.S. newspaper publisher as measured by total daily circulation. Gannett owns the national newspaper USA Today, as well ...",
    "published": "1 week ago"
  },
  {
    "title": "Gannett | GCI Stock Price, Company Overview & News",
    "url": "https://www.forbes.com/companies/gannett/",
    "snippet": "Gannett&#x27;s portfolio also includes digital marketing solutions brand, LocaliQ, and the events division, USA Today Network Ventures. Gannett was founded by Frank E. Gannett in 1906 and is headquartered in <strong>New York, NY</strong>.",
    "published": null
  },
  {
    "title": "USA Today Owner Gannett Moves HQ from VA to the Theater District",
    "url": "https://www.westsidespirit.com/news/usa-today-owner-gannett-moves-hq-from-va-to-the-theater-district-GA3211899",
    "snippet": "Gannett, the nation’s largest newspaper publisher which owns USA Today and more than 250 local newspapers from Phoenix to Rochester, is packing up its corporate headquarters in Tysons, Virginia and moving it to <strong>New York City</strong>.",
    "published": null
  },
  {
    "title": "Gannett Co., Inc. | American Media Conglomerate | Britannica Money",
    "url": "https://www.britannica.com/money/Gannett-Co-Inc",
    "snippet": "Gannett Co., Inc., one of the largest ... of newspapers and periodicals in the United Kingdom and Europe. It is headquartered in <strong>McLean, Va</strong>....",
    "published": null
  },
  {
    "title": "List of assets owned by USA Today Co. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_assets_owned_by_Gannett",
    "snippet": "USA Today Co. owns over 100 daily newspapers, and nearly 1,000 weekly newspapers. These operations are in 44 U.S. states, one U.S. territory, and six countries. ... The St. Augustine Record ... The St. Lucie News-Tribune, Fort Pierce ... The Herald-Mail, Hagerstown, Maryland.",
    "published": "1 week ago"
  }
]