[
  {
    "title": "Samy Bengio on LinkedIn: AI/ML - Machine Learning Researcher, MLR - Careers at Apple",
    "url": "https://www.linkedin.com/posts/bengio_aiml-machine-learning-researcher-mlr-activity-6921941917932945408-CZVQ?trk=public_profile_share_view",
    "snippet": "The MLR team at Apple, recently started by Samy Bengio, is hiring <strong>world-class Research Scientists and Software Engineers</strong>.",
    "published": "April 18, 2022"
  },
  {
    "title": "Samy Bengio - Apple | LinkedIn",
    "url": "https://www.linkedin.com/in/bengio",
    "snippet": "AFM Team and myself are excited to be heading to hashtag #NeurIPS2025! Be sure to stop by the Apple booth at the San Diego iteration (booth #1103)… · I have officially graduated with a Ph.D. from EPFL! It was an honor to defend my thesis before an exceptional jury: Francis Bach, Samy Bengio, Gautam…",
    "published": null
  },
  {
    "title": "Apple hires ex-Google AI expert Samy Bengio | AppleInsider",
    "url": "https://appleinsider.com/articles/21/05/03/apple-hires-ex-google-ai-expert-samy-bengio",
    "snippet": "<strong>Apple has hired Samy Bengio, a former AI scientist who resigned in protest of Google&#x27;s firing of two employees, to lead a new AI team under John Giannandrea</strong>.",
    "published": "May 3, 2021"
  },
  {
    "title": "Samy Bengio",
    "url": "https://bengio.abracadoudou.com/",
    "snippet": "More recently I have been sponsoring ... on Apple silicon. Understanding training and generalization of deep architectures · See for instance this or this . ... See for instance this or this. Image Captioning. ... Keynote talk on &quot;Recent results towards reasoning with LLMs&quot;, Ithaca, NY, USA, September 2025...",
    "published": null
  },
  {
    "title": "r/apple on Reddit: Apple has hired Samy Bengio, a former AI scientist who resigned in protest of Google's firing of two employees, to lead a new AI team under John Giannandrea.",
    "url": "https://www.reddit.com/r/apple/comments/n4iyzu/apple_has_hired_samy_bengio_a_former_ai_scientist/",
    "snippet": "Samy Bengio himself is also part of that wave of deep learning pioneers and definitely a big figure in the field. Him leaving Google and joining Apple is relatively big news on its own.",
    "published": "May 4, 2021"
  }
]