[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "In August 2005, Navalny was admitted to the Social Council of the Central Administrative Okrug of Moscow, created before the Moscow City Duma election held later that year, in which he took part as a candidate. In November, he was one of the initiators of the Youth Public Chamber, intended to help younger politicians take part in legislative initiatives.",
    "published": "1 week ago"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "(Template courtesy of Olivia Wilson) (Photo Credit Top Left: Mitya Aleshkovskiy, CC BY-SA 4.0 ... His career in politics <strong>began in 2000</strong>, after a new law had been announced, raising the electoral threshold for political parties, essentially making ...",
    "published": null
  },
  {
    "title": "Timeline of Alexei Navalny’s life and activism - Good Morning America",
    "url": "https://www.goodmorningamerica.com/news/story/timeline-alexei-navalnys-life-activism-107380308",
    "snippet": "Surviving numerous arrests and a poisoning, Navalny has been the highest-profile critic of Russian President Vladimir Putin and his 24-year rule. Born in 1976, Navalny <strong>started his career in politics and activism at the same time Putin came to power</strong>.",
    "published": "February 20, 2024"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice ... of the Russian Federation. <strong>In 2000, while he was still a student, Navalny joined Yabloko, a political party that promoted liberal democracy and a market economy</strong>....",
    "published": "March 7, 2023"
  },
  {
    "title": "Who Was Navalny? A Timeline of the Putin Critic’s Career - The New York Times",
    "url": "https://www.nytimes.com/2024/02/16/world/europe/aleksei-navalny-career-russia.html",
    "snippet": "Navalny, who had studied law and finance and worked as a real estate lawyer, <strong>joined the liberal Yabloko party the same year that Vladimir V.</strong> Putin was first elected president of Russia.",
    "published": "February 17, 2024"
  }
]