[
  {
    "title": "Samy Bengio - Apple | LinkedIn",
    "url": "https://www.linkedin.com/in/bengio",
    "snippet": "Experience: Apple · Location: Mountain View · 500+ connections on LinkedIn. View Samy Bengio’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": null
  },
  {
    "title": "Samy Bengio - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Samy_Bengio",
    "snippet": "Samy Bengio (born 1965) is a Canadian computer scientist working as <strong>senior director of Artificial Intelligence and Machine Learning Research at Apple</strong>. Bengio obtained his Ph.D. in Computer Science in 1993 with a thesis titled Optimization of a Parametric Learning Rule for Neural Networks from ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Samy Bengio on LinkedIn: AI/ML - Machine Learning Researcher, MLR - Careers at Apple",
    "url": "https://www.linkedin.com/posts/bengio_aiml-machine-learning-researcher-mlr-activity-6921941917932945408-CZVQ?trk=public_profile_share_view",
    "snippet": "AI/ML - Machine Learning Researcher, MLR - Careers at Apple",
    "published": "April 18, 2022"
  },
  {
    "title": "Samy Bengio - Research at Google",
    "url": "https://research.google.com/pubs/bengio.html?viewType=Print&viewClass=Print",
    "snippet": "Samy Bengio (PhD in computer science, University of Montreal, 1993) is a <strong>research scientist at Google since 2007.</strong> Before that, he was senior researcher in statistical machine learning at IDIAP Research Institute since 1999, where he supervised PhD students and postdoctoral fellows.",
    "published": null
  },
  {
    "title": "Apple hires ex-Google AI expert Samy Bengio | AppleInsider",
    "url": "https://appleinsider.com/articles/21/05/03/apple-hires-ex-google-ai-expert-samy-bengio",
    "snippet": "On April 6, Bengio announced his resignation from Google after nearly 14 years at the company, saying he was pursuing &quot;other exciting opportunities.&quot; His last day at the search giant was April 28. In December, the Mountain View firm fired Timnit Gebru, co-founder of the company&#x27;s ethical AI team. In February, Google fired Margaret Mitchell, the co-lead and co-founder of the same team.",
    "published": "May 3, 2021"
  }
]