[
  {
    "title": "Morena (political party) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Morena_(political_party)",
    "snippet": "The National Regeneration Movement (Spanish: Movimiento de Regeneración Nacional), commonly referred to by its syllabic abbreviation Morena ([moˈɾena]), is a left-wing political party in Mexico. Founded in 2011 by <strong>Andrés Manuel López Obrador</strong> as a civil association and registered as a political ...",
    "published": "5 days ago"
  },
  {
    "title": "Morena | Political Party, Mexico, Andrés Manuel López Obrador, & Claudia Sheinbaum | Britannica",
    "url": "https://www.britannica.com/topic/Morena-political-party",
    "snippet": "Morena, major political party in Mexico. It was founded in 2014 when populist Mexican political leader <strong>Andrés Manuel López Obrador</strong> mobilized politicians from across the political spectrum in Mexico to form a new political party.",
    "published": "February 25, 2025"
  },
  {
    "title": "How Morena Broke Mexico’s Glass Ceiling — International Relations Review",
    "url": "https://www.irreview.org/articles/2025/3/7/how-morena-broke-mexicos-glass-ceilingnbsp",
    "snippet": "Claudia Sheinbaum of the far-left Morena party has made history as the first woman to be elected president of Mexico. Her predecessor, <strong>Andres Manuel Lopez Obrador</strong>, widely known by his initials AMLO, founded the Morena party as a personal campaign ...",
    "published": "March 8, 2025"
  },
  {
    "title": "MORENA (party) - (AP Comparative Government) - Vocab, Definition, Explanations | Fiveable | Fiveable",
    "url": "https://library.fiveable.me/key-terms/ap-comp-gov/morena-party",
    "snippet": "MORENA is a political party in Mexico founded by <strong>Andrés Manuel López Obrador</strong> (AMLO) that promotes left-wing policies such as social welfare programs, anti-corruption measures, and economic nationalism.",
    "published": null
  },
  {
    "title": "Movimiento de Regeneración Nacional (Morena) - Explainer | Wilson Center",
    "url": "https://www.wilsoncenter.org/article/movimiento-de-regeneracion-nacional-morena-explainer",
    "snippet": "Morena, Movimiento de Regeneración Nacional (National Regeneration Movement), was created in 2014 as <strong>Andrés Manuel López Obrador</strong> (AMLO) led an exodus of politicians from across the entire political spectrum into a new political party.",
    "published": null
  }
]