[
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "Programmer, designer, author, and manager in high tech R&amp;D. Specialties: internet… · Experience: Stanford Institute for Human-Centered Artificial Intelligence (HAI) · Location: Palo Alto · 500+ connections on LinkedIn. View Peter Norvig’s profile on LinkedIn, a professional community ...",
    "published": "1 week ago"
  },
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Norvig is one of the creators of JScheme. Norvig is listed under &quot;Academic Faculty &amp; Advisors&quot; for the Singularity University. <strong>In 2011, Norvig worked with Sebastian Thrun to develop a popular online course in Artificial Intelligence that had more than 160,000 students enrolled</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Norvig Bio",
    "url": "https://norvig.com/bio.html",
    "snippet": "Peter Norvig is a <strong>Distinguished Education Fellow at Stanford&#x27;s Human-Centered Artificial Intelligence Institute and a researcher at Google Inc</strong>; previously he directed Google&#x27;s core search algorithms group and Google&#x27;s Research group. He was head of NASA Ames&#x27;s Computational Sciences Division, ...",
    "published": null
  },
  {
    "title": "Peter Norvig - Stanford HAI",
    "url": "https://hai.stanford.edu/people/peter-norvig",
    "snippet": "Get the latest news, advances in research, policy work, and education program updates from HAI in your inbox weekly. ... Peter Norvig is a <strong>Distinguished Education Fellow at Stanford&#x27;s Human-Centered Artificial Intelligence Institute and a researcher at Google Inc</strong>; previously he directed Google&#x27;s ...",
    "published": null
  },
  {
    "title": "Q&A: Peter Norvig ’78 P’16 P’18 reflects on experience in tech world",
    "url": "https://www.browndailyherald.com/2015/10/15/qa-peter-norvig-78-p16-p18-reflects-on-experience-in-tech-world/",
    "snippet": "When Peter Norvig ’78 P’16 P’18, director of research at Google, enrolled at Brown, he knew almost nothing about computer science — a nascent field in which classes had just begun to be offered and for which there was no concentration. “I thought it was an obscure and strange branch of mathematics that not many people understood,” Norvig said.",
    "published": "October 16, 2015"
  }
]