[
  {
    "title": "EBRD holds its 2025 Annual Meeting and Business Forum in London",
    "url": "https://www.ebrd.com/home/news-and-events/news/2025/ebrd-holds-its-2025-annual-meeting-and-business-forum-in-london.html",
    "snippet": "The Board of Governors’ opening session for the event will take place at Westminster Central Hall on Wednesday 14 May. The Chair of the Board of Governors, Slovenia’s Klemen Boštjančič, and EBRD President Odile Renaud-Basso will deliver speeches at the session.",
    "published": null
  },
  {
    "title": "EBRD Board of Directors visits Slovenia",
    "url": "https://www.ebrd.com/home/news-and-events/news/2023/ebrd-board-of-directors-visits-slovenia.html",
    "snippet": "The EBRD Board Directors is meeting with government representatives, including Minister of Finance Klemen Boštjančič, private-sector companies and members of the diplomatic community.",
    "published": null
  },
  {
    "title": "Slovenia's Finance Minister Klemen Boštjančič Assumes Chairmanship of EBRD Board - The Region",
    "url": "https://connectingregion.com/news/slovenias-finance-minister-klemen-bostjancic-assumes-chairmanship-of-ebrd-board/",
    "snippet": "<strong>Slovenia&#x27;s Finance Minister Klemen Boštjančič assumes the chairmanship of the European Bank for Reconstruction and Development (EBRD) Board</strong>, marking a significant milestone for the country",
    "published": "May 20, 2024"
  },
  {
    "title": "PUBLIC EUROPEAN BANK FOR RECONSTRUCTION AND DEVELOPMENT",
    "url": "https://www.ebrd.com/content/dam/ebrd_dxp/assets/pdfs/office-of-the-general-counsel/annual-meetings/annual-meeting-2025/am2025-proceedings-english.pdf",
    "snippet": "Şimşek, were the Vice Chairs. ... Procedures Committee that had been circulated to all Governors. The Board was then addressed by The Rt Hon Rachel Reeves MP (Chancellor of the Exchequer of · the United Kingdom), Mr Klemen Boštjančič (Chair of the Board of Governors), and Ms Odile",
    "published": null
  },
  {
    "title": "STA: Boštjančič elected chair of EBRD Board of Governors",
    "url": "https://english.sta.si/3301029/bostjancic-elected-chair-of-ebrd-board-of-governors",
    "snippet": "Yerevan, 16 May - <strong>Finance Minister Klemen Boštjančič was elected chair of the Board of Governors of the European Bank for Reconstruction and Development (EBRD) at its annual meeting on Thursday</strong>.",
    "published": null
  }
]