[
  {
    "title": "Full article: A ‘Second Transition’ in Spain? Policy, Institutions and Interparty Politics under Zapatero (2004–8)",
    "url": "https://www.tandfonline.com/doi/full/10.1080/13608740903503803",
    "snippet": "It concludes that while there were significant changes during the Zapatero government, they do not amount to a second transition. ... In 2004, the Spanish parliamentary election came just a few days after the devastating Islamist terrorist attacks on Madrid commuter trains. The Partido Socialista Obrero Español (PSOE, Spanish Socialist Party), with first-time candidate for prime minister José Luis Rodríguez Zapatero, won an unexpected victory over the conservative Partido Popular (PP, Popular Party), newly led by Mariano Rajoy.",
    "published": null
  },
  {
    "title": "Introduction: Political Change in Spain, from Zapatero to Rajoy | SpringerLink",
    "url": "https://link.springer.com/chapter/10.1057/9781137306623_1",
    "snippet": "—, ed. 2011. Spain’s “Second Transition”? The Socialist Government of José Luis Rodríguez Zapatero.",
    "published": null
  },
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "He was appointed a few hours later as prime minister by Juan Carlos I and sworn in the next day at the Zarzuela Palace, before the King and Queen, Zapatero, the outgoing prime minister, and the Presidents of the Cortes Generales, and others. <strong>Rajoy&#x27;s government was formed on 21 December 2011</strong> with ...",
    "published": "March 8, 2004"
  },
  {
    "title": "José Luis Rodríguez Zapatero - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/José_Luis_Rodríguez_Zapatero",
    "snippet": "Rajoy accepted on the condition that Zapatero could not be alone but accompanied at least by two of his potential allies after the election: Gaspar Llamazares (the leader of United Left) and Josep-Lluís Carod-Rovira (leader of Republican Left of Catalonia). Rajoy justified his decision on the grounds that, in his opinion, he was not running against the Socialist Party but against a &quot;coalition&quot; of forces opposed to the People&#x27;s Party&#x27;s policies.",
    "published": "November 12, 2025"
  },
  {
    "title": "Spanish prime-ministerial transition - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Spanish_prime-ministerial_transition",
    "snippet": "In this way, many decisions are reserved for an full-capacity prime minister. An example of this was the <strong>2011 general election</strong>, when outgoing prime minister José Luis Rodríguez Zapatero did not run for re-election and he took care of the office until the newly appointed prime minister, Mariano ...",
    "published": "June 7, 2025"
  }
]