[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "This company originally had no distribution deal of producing films with various studios such as The Ladd Company, Columbia Pictures, TriStar Pictures, Warner Bros., Touchstone Pictures, Vestron Pictures, Universal Pictures and 20th Century Fox (now known as 20th Century Studios), with the latter ending up being the distributor of the majority of Regency&#x27;s library. It produced films such as Once Upon a Time in America and Q&amp;A, but was shut down in 1991.",
    "published": "2 days ago"
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between <strong>Arnon Milchan, Scriba &amp; Deyle and Canal+</strong> to finance 20 films in five years, with New Regency Productions acting as its production and sales arm.",
    "published": "2 weeks ago"
  },
  {
    "title": "Regency Enterprises | Corus Entertainment Fandom | Fandom",
    "url": "https://corusentertainment.fandom.com/wiki/Regency_Enterprises",
    "snippet": "<strong>Arnon Milchan founded his company as Embassy International Pictures N.V.</strong> which held the name for 7 years until the named changed to Regency International Pictures. This company originally had no distribution deal producing films with various ...",
    "published": "October 29, 2024"
  },
  {
    "title": "Regency Enterprises (Creator) - TV Tropes",
    "url": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/RegencyEnterprises",
    "snippet": "Regency Enterprises (commonly referred to as Regency onscreen) is an American entertainment company formed by Arnon Milchan. It was founded in 1991 as the successor to Regency International Pictures formerly known as <strong>Embassy International</strong> …",
    "published": "October 2, 2025"
  },
  {
    "title": "Regency Enterprises | JH Wiki Collection Wiki | Fandom",
    "url": "https://jhmovie.fandom.com/wiki/Regency_Enterprises",
    "snippet": "Arnon Milchan founded his company as <strong>Embassy International Pictures N.V.</strong>, which held the name for 7 years until it was changed to Regency International Pictures. This company originally had no distribution deal of producing films with various ...",
    "published": "October 29, 2024"
  }
]