[
  {
    "title": "Old Trafford - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Old_Trafford",
    "snippet": "<strong>Old Trafford</strong> (/ˈtræfərd/) is a football stadium in <strong>Old Trafford</strong>, Greater Manchester, England, and is the home of Manchester United. With a capacity of 74,197, it is the largest club football stadium (and second-largest football stadium overall after Wembley Stadium) in the United Kingdom, ...",
    "published": "1 day ago"
  },
  {
    "title": "New Trafford Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_Trafford_Stadium",
    "snippet": "<strong>New Trafford Stadium</strong> is the name given by the architects Foster + Partners to a potential new stadium for Manchester United that would replace Old Trafford, their home stadium since 1910.",
    "published": "6 days ago"
  },
  {
    "title": "Visit Old Trafford | Man Utd Museum, Stadium Tour, Red Cafe, Conferences, Business and Corporate Events | Manchester United",
    "url": "https://www.manutd.com/en/visit-old-trafford",
    "snippet": "<strong>Old Trafford Stadium</strong> is the world-famous home of Manchester United, and there&#x27;s plenty to do when you visit.",
    "published": null
  },
  {
    "title": "United Events Conference, Exhibition and Event Facilities at Manchester United | Manchester United",
    "url": "https://www.manutd.com/en/united-events",
    "snippet": "The world-renowned <strong>Old Trafford stadium</strong>, home of Manchester United, is a totally unique venue.",
    "published": null
  },
  {
    "title": "Old Trafford - Manchester United - Manchester - The Stadium Guide",
    "url": "https://www.stadiumguide.com/oldtrafford/",
    "snippet": "Due to its proximity to Trafford Park industrial estate, <strong>Old Trafford</strong> got heavily damaged by German air raids during World War 2. It took eight years to rebuilt the stadium, the delays being caused by limited post-war resources, and during that ...",
    "published": "June 9, 2020"
  }
]