[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "Jean-Luc Antoine Pierre Mélenchon (French: [ʒɑ̃lyk melɑ̃ʃɔ̃] ⓘ; born 19 August 1951) is a French politician who has been the de facto leader of the movement La France Insoumise (LFI) since it was established in 2016. He was the deputy in the National Assembly for the 4th constituency of Bouches-du-Rhône from 2017 to 2022 and led the La France Insoumise group in the National Assembly from 2017 to 2021.",
    "published": "1 week ago"
  },
  {
    "title": "Jean-Luc Mélenchon - Actualités, vidéos et infos en direct",
    "url": "https://www.lemonde.fr/jean-luc-melenchon/",
    "snippet": "Le député des Bouches-du-Rhône, <strong>reconduit dans son rôle de coordinateur du mouvement en juin</strong>, a réussi à percer le mur médiatique et trace discrètement sa route à l’heure où la succession de Jean-Luc Mélenchon, sans être ouverte, ...",
    "published": null
  },
  {
    "title": "French elections: Who is Mélenchon and what does his Nupes alliance want?",
    "url": "https://www.bbc.com/news/world-europe-61737537",
    "snippet": "A veteran firebrand of France&#x27;s far left, Jean-Luc Mélenchon has a strong chance of depriving President Emmanuel Macron of controlling the next government.",
    "published": "June 15, 2022"
  },
  {
    "title": "Jean-Luc Mélenchon – POLITICO",
    "url": "https://www.politico.eu/person/jean-luc-melenchon/",
    "snippet": "January 7, 2025 5:03 pm CET · Advertisement · The Socialists have taken timid steps toward emancipation from far-left firebrand Jean-Luc Mélenchon. January 3, 2025 4:00 am CET · France’s far-right leader must decide whether to wreck things or play nice — while keeping the 2027 presidential election firmly in her sights.",
    "published": null
  },
  {
    "title": "Jean-Luc Mélenchon Casts a Long Shadow Over the Stagnant French Left",
    "url": "https://foreignpolicy.com/2025/04/25/melenchon-french-left-politics-progressive-coalition-2027-election/",
    "snippet": "If Sanders’ strength flows from his status as the consummate outsider—a man preaching the same basic message for decades—Mélenchon’s comes from his capacity for reinvention: for understanding his country’s shifting political sands and seizing the opportunities before him. The first major turning point came in 2005. Breaking with Socialist Party leadership, Mélenchon campaigned for a “no” vote in France’s referendum on a new EU constitution, deriding the failed proposal as a neoliberal Trojan horse.",
    "published": "May 13, 2025"
  }
]