[
  {
    "title": "University of Paris-Sud - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q1480643",
    "snippet": "M. <strong>JEAN-PIERRE KAHANE</strong> EST ÉLU PRÉSIDENT DE L&#x27;UNIVERSITÉ PARIS-SUD (French)",
    "published": null
  },
  {
    "title": "Paris-Sud University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris-Sud_University",
    "snippet": "<strong>Pierre-Gilles de Gennes and Albert Fert</strong>, two Nobel Prize winners of physics, were affiliated to the University of Paris-Sud. A number of the most renowned French mathematicians were affiliated with the University of Paris-Sud as well.",
    "published": "October 7, 2025"
  },
  {
    "title": "University of Paris-Sud (Fees & Reviews): France, Paris",
    "url": "https://www.edarabia.com/23354/university-of-paris-sud-paris-france/",
    "snippet": "Paris-Sud University (Paris XI) ... Services · Legal · Program and Project Management · Sales · Leadership: <strong>Sylvie Retailleau</strong> (President) Gender: Mixed (Co-education) Number of Staff: 1800 ·...",
    "published": "November 1, 2025"
  },
  {
    "title": "Paris-Saclay University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris-Saclay_University",
    "snippet": "Confronted with disagreements between its members (between the schools and universities, or between their supervisory ministries), the project stagnated, as the Cour des Comptes noted in its report of 8 February 2017, pointing in particular to a lack of housing and transport facilities, as well as a lack of strategic vision, despite the five billion euros planned (committed or envisaged). In 2017, the University of Paris-Sud proposed merging with the university system (ComUE) to create the Paris-Saclay University as a collegiate university, and integrating the schools into the future institution as component institutions.",
    "published": "3 weeks ago"
  },
  {
    "title": "Paris-Sud University (Paris XI) Employees, Location, Alumni",
    "url": "https://www.linkedin.com/school/universit-paris-sud/",
    "snippet": "1 billion members | Manage your professional identity. Build and engage with your professional network. Access knowledge, insights and opportunities.",
    "published": null
  }
]