[
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed bin Salman was born on 31 August 1985 to Prince Salman bin Abdulaziz (later King of Saudi Arabia) and his third wife, <strong>Fahda bint Falah Al Hithlain</strong>. He is the eldest of his mother&#x27;s six children and the eighth child and seventh son of his father. His full siblings include Prince Turki ...",
    "published": "11 hours ago"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman is the third oldest living head of state, the oldest living monarch, and Saudi Arabia&#x27;s first head of state born after the unification of Saudi Arabia. He has a reported personal wealth of at least US$18 billion, which makes him the third wealthiest royal in the world. Salman is a son of King Abdulaziz and Hassa bint Ahmed Al Sudairi, making him one of the Sudairi Seven.",
    "published": "November 3, 2025"
  },
  {
    "title": "Sara bint Mashour Al Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sara_bint_Mashour_Al_Saud",
    "snippet": "<strong>Sara bint Mashour Al Saud</strong> (Arabic: سارة بنت مشهور آل سعود) is a member of the Saudi royal family and wife of Saudi Crown Prince Mohammed bin Salman, who is her first cousin. She is a granddaughter of King Abdulaziz.",
    "published": "1 week ago"
  },
  {
    "title": "Salman of Saudi Arabia | King, Father, Siblings, & Son | Britannica",
    "url": "https://www.britannica.com/biography/Salman-of-Saudi-Arabia",
    "snippet": "Salman is king of Saudi Arabia (2015– ) and the last of the sons of Abdulaziz ibn Saud to rule the country. His son Mohammed bin Salman has assumed many of his father’s duties as head of state and government.",
    "published": "December 14, 2023"
  },
  {
    "title": "Princess Fahda, Wife of Saudi King Salman, Arrives in Tangier for Vacation",
    "url": "https://www.moroccoworldnews.com/2023/08/30853/princess-fahda-wife-of-saudi-king-salman-arrives-in-tangier-for-vacation/",
    "snippet": "<strong>Princess Fahda bint Falah Al Hithlain</strong>, wife of Saudi Arabia’s King Salman bin Abdulaziz and mother of Crown Prince Mohammed bin Salman, has chosen Morocco to spend her personal vacation.",
    "published": "August 4, 2023"
  }
]