[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "The site&#x27;s new owner, <strong>Disney</strong>, hired G. Elliott Morris to develop a new model. On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to ABC News pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight.",
    "published": "1 month ago"
  },
  {
    "title": "About Us | FiveThirtyEight",
    "url": "https://fivethirtyeight.com/about-us/",
    "snippet": "We aren’t afraid to say, “we don’t know,” or that our old analysis is now outdated, and with new evidence our argument has changed. When we’re wrong, we say we were wrong. Personality — Our journalists can bring their whole selves to their work. We share who we are and let the personalities of our journalists shine through. ... FiveThirtyEight 47 W.",
    "published": "June 30, 2023"
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "On July 22, 2013, <strong>ESPN (a subsidiary of the Walt Disney Company)</strong> announced that it had acquired ownership of the FiveThirtyEight website and brand, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming ...",
    "published": "1 day ago"
  },
  {
    "title": "FiveThirtyEight joins ABC News - ABC News",
    "url": "https://abcnews.go.com/US/fivethirtyeight-joins-abc-news/story?id=54531745",
    "snippet": "<strong>ABC News</strong> announced today it has reached an agreement in principle to acquire the renowned data journalism organization FiveThirtyEight from ESPN.",
    "published": "April 17, 2018"
  },
  {
    "title": "Why did ABC News acquire FiveThirtyEight? - Quora",
    "url": "https://www.quora.com/Why-did-ABC-News-acquire-FiveThirtyEight",
    "snippet": "Answer (1 of 2): Short answer: Because ESPN needed to sell FiveThirtyEight, and no one outside the Disney umbrella was willing to pay a high enough price. ESPN had been looking at divesting itself of Nate Silver’s brand for at least a few months now. TheBigLead (a sister publication to USA Toda...",
    "published": null
  }
]