[
  {
    "title": "Viktor Yanukovych - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Viktor_Yanukovych",
    "snippet": "Viktor Fedorovych Yanukovych (born 9 July 1950) is a Ukrainian former politician who served as the fourth president of Ukraine from 2010 to 2014. He also served as the prime minister of Ukraine several times between 2002 and 2007 and was a member of the Verkhovna Rada (parliament) from 2006 to 2010.",
    "published": "1 week ago"
  },
  {
    "title": "Ukraine After Yanukovych | YaleGlobal Online",
    "url": "https://archive-yaleglobal.yale.edu/content/ukraine-after-yanukovych",
    "snippet": "In late January, after passage of laws that criminalized many peaceful activities of the protesters, clashes with the police that resulted in the death of six protesters, and the occupation of regional administrative offices throughout western Ukraine, Yanukovych had agreed, after several meetings with the leaders of the opposition parties – Vitali Klitschko of UDAR (Ukrainian Democratic Alliance for Reform), Oleh Tyahnibok of Svoboda (Freedom) and Arseniy Yatsenyuk of Batkivschchyna (Fatherland) – to form a new government that included members of the opposition, repeal most of the new laws, and grant the protesters amnesty provided they ended their occupation of government buildings and blockades of streets and squares.",
    "published": null
  },
  {
    "title": "Viktor Yanukovych | Facts, Biography, Maidan Protests, & Flight to Russia | Britannica",
    "url": "https://www.britannica.com/biography/Viktor-Yanukovych",
    "snippet": "As the 2004 presidential election approached, Yanukovych was presented as Kuchma’s clear successor, and Russian Pres. Vladimir Putin offered support for his candidacy. During the campaign Yanukovych’s chief opponent, the pro-Western Viktor Yushchenko, became ill after an apparent assassination attempt, and the race drew international attention.",
    "published": "February 9, 2010"
  },
  {
    "title": "Yanukovych Wins Ukraine’s Presidential Election",
    "url": "https://www.oscepa.org/en/news-a-media/press-releases/press-2010/yanukovych-wins-ukraines-presidential-election",
    "snippet": "Yanukovych promised to cut taxes to lift the nation out of recession, unfreeze a $16.4 billion bailout loan and improve relations with Russia and the European Union. He replaces Viktor Yushchenko, whose fortunes plunged over political gridlock. Uncertainty may be prolonged after Timoshenko accused Yanukovych of fraud and promised to challenge the result.",
    "published": null
  },
  {
    "title": "Ukraine’s Presidents, Power Elites, and the Country’s Evolution | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/ukraines-presidents-power-elites-and-countrys-evolution",
    "snippet": "The Orange Revolution (2004) prevented Kuchma from enthroning Viktor Yanukovych as his chosen successor. After three rounds of elections and two months of protests in Kyiv’s Maidan Nezalezhnosti (Independence Square), <strong>Viktor Yushchenko</strong> became ...",
    "published": null
  }
]