[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "The Andean pact stood in opposition to Merkel, especially in the five years before she became chancellor in 2005, after she had become chairperson of the CDU. Years before his admission, Merz had already a &quot;fundamental loyalty&quot; to his peers in the Andean Pact.",
    "published": "1 week ago"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "Ten people (nine men and one woman) have served as chancellor of the Federal Republic of Germany, the first being <strong>Konrad Adenauer</strong> from 1949 to 1963. (Another 26 men had served as &quot;Reich chancellors&quot; of the previous German Empire from 1871 to 1945.) The current officeholder is Friedrich Merz ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Who was the previous chancellor of Germany before Friedrich Merz? - Quora",
    "url": "https://www.quora.com/Who-was-the-previous-chancellor-of-Germany-before-Friedrich-Merz",
    "snippet": "Answer: <strong>Olaf Scholz</strong> (SPD). SPD now still in governement but vize-chancellor not Scholz anymore. <strong>Olaf Scholz</strong> was doing continuing Politics of Merkel (CDU) he was previously finance minister there.",
    "published": null
  },
  {
    "title": "Friedrich Merz | Politics, Germany, & Christian Democrats | Britannica",
    "url": "https://www.britannica.com/biography/Friedrich-Merz",
    "snippet": "Friedrich Merz (born November 11, 1955, Brilon, Germany) is a German lawyer, lobbyist, and politician who has served as leader of Germany’s Christian Democratic Union (CDU) party since 2022. Following the CDU’s win in Germany’s February 2025 election, Merz became the country’s chancellor in May 2025. Merz worked as a lawyer before entering politics.",
    "published": "March 19, 2025"
  },
  {
    "title": "The Federal Chancellors of the Federal Republic of Germany since 1949 | Federal Government",
    "url": "https://www.bundeskanzler.de/bk-en/federal-chancellery/federal-chancellors-since-1949",
    "snippet": "From <strong>Konrad Adenauer</strong> to Friedrich Merz – an overview of the Federal Chancellors of the Federal Republic of Germany.",
    "published": null
  }
]