[
  {
    "title": "Leadership - IAU",
    "url": "https://www.iau-aiu.net/Leadership",
    "snippet": "The first session will be held at the IAU 2025 International Conference. Format: The ELP will meet in person and online over the course of one year. <strong>Each module is complimented by Action Leadership Groups, separated into current and emerging leaders for true peer-to-peer exchange</strong>.",
    "published": null
  },
  {
    "title": "Apply Now: Executive Leadership Programme (ELP) — International Association of Universities",
    "url": "https://iau.global/news/executive-leadership-programme-elp24-25",
    "snippet": "The 2024-2025 cohort will begin at the IAU 2024 International Conference in Tokyo, Japan and will continue through the IAU 2025 International Conference to be held in Autumn 2025. The ELP will meet in person and online over the course of one year. Each module is complimented by Action Leadership Groups, separated into current and emerging leaders for true peer-to-peer exchange.",
    "published": "August 8, 2025"
  },
  {
    "title": "International Association of Universities",
    "url": "https://www.iau-aiu.net/",
    "snippet": "The IAU has four priority which inform the Association’s work, namely: <strong>Value-based Leadership, Internationalization for the Common Good, Sustainable Development, and Digital Transformation</strong>.",
    "published": null
  },
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "The IAU is composed of individual members, who include both professional astronomers and junior scientists, and national members, such as professional associations, national societies, or academic institutions. Individual members are organised into divisions, committees, and working groups centered on particular subdisciplines, subjects, or initiatives.",
    "published": "3 weeks ago"
  },
  {
    "title": "Executive Leadership Programme — International Association of Universities",
    "url": "https://iau.global/elp",
    "snippet": "The 2025-2026 cohort will begin on 24 October 2025 at the IAU 2025 International Conference in Kigali, Rwanda and will continue through the IAU 17th General Conference to be held in Autumn 2026. The ELP will meet in person and online over the course of one year. Each module is complimented by Action Leadership Groups, separated into current and emerging leaders for true peer-to-peer exchange.",
    "published": null
  }
]