[
  {
    "title": "Lord Sebastian Coe | Alumni | Loughborough University",
    "url": "https://www.lboro.ac.uk/alumni/our-alumni/lord-seb-coe/",
    "snippet": "He was coached by his father who designed workouts specifically for his son. He <strong>studied Economics and Social History</strong> at Loughborough University and won his first major race in 1977 – an 800-metre event at the European indoor championships in San Sebastián, Spain.",
    "published": null
  },
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "<strong>In 2012, Coe was appointed Pro-Chancellor of Loughborough University</strong> where he had been an undergraduate. Subsequently, in 2017, he was appointed as Chancellor. He is also a member of Loughborough University&#x27;s governing body. He was one of 24 athletes inducted as inaugural members of the IAAF ...",
    "published": "November 18, 2025"
  },
  {
    "title": "World Athletics | IAAF President Sebastian Coe to become Loughborough University Chancellor| News",
    "url": "https://worldathletics.org/news/iaaf-news/sebastian-coe-loughborough-university-chancel",
    "snippet": "Loughborough University’s Chair of Council and Senior Pro-Chancellor Sir Peter Bonfield today announced the nomination of IAAF President Sebastian Coe as the university’s new Chancellor.",
    "published": null
  },
  {
    "title": "Sebastian Coe - World Athletics | LinkedIn",
    "url": "https://www.linkedin.com/in/seb-coe/",
    "snippet": "Sebastian Coe (often referred to as Seb Coe) is a distinguished global sports… · Experience: World Athletics · Education: Loughborough University · Location: Monaco · 500+ connections on LinkedIn. View Sebastian Coe’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": "July 6, 2025"
  },
  {
    "title": "Chancellor Lord Sebastian Coe awarded with honorary doctorate title in Hungary | Alumni | Loughborough University",
    "url": "https://www.lboro.ac.uk/alumni/news/2023/november/lord-coe-awarded-honorary-doctorate-hungary/",
    "snippet": "<strong>Alumnus and Chancellor of the University</strong>, Lord Sebastian Coe was awarded an honorary doctorate title at the Hungarian University of Sports Science based in Budapest, Hungary, earlier this month.",
    "published": null
  }
]