[
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Jennifer Westacott AC is an Australian business executive. She served as the chief executive of the Business Council of Australia (BCA) from 2011 to 2023. She is the current chancellor of <strong>Western Sydney University</strong>.",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "She is Chair of <strong>Bradfield Development Authority (formerly the Western Parkland City Authority), Studio Schools of Australia and Future Generation Global. Jennifer is a director of Atco Australia</strong> and Patron of The Pinnacle Foundation. She is Chancellor of Western Sydney University and a member ...",
    "published": null
  },
  {
    "title": "The boss of the Business Council defies the stereotype of the blue-blooded big shot",
    "url": "https://www.smh.com.au/politics/federal/the-boss-of-the-business-council-defies-the-stereotype-of-the-blue-blooded-big-shot-20180322-p4z5l6.html",
    "snippet": "She served as second-in-charge of the NSW Department of Housing, director of Housing Victoria, secretary of the state&#x27;s Department of Education and Training and is the current chair of <strong>Mental Health Australia</strong>.",
    "published": "March 24, 2018"
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "Jennifer is a National Fellow of the Institute of Public Administration Australia and a Fellow of the Australian Institute of Company Directors, and since 2013 has been a Non-Executive Director of <strong>Wesfarmers Limited</strong> and Chair of the Mental Health Council of Australia.",
    "published": null
  },
  {
    "title": "Jennifer Westacott AC - KPMG Australia | LinkedIn",
    "url": "https://www.linkedin.com/in/jennifer-westacott-ac-9aa853146/",
    "snippet": "We had a full house of industry leaders who heard from Secretary Department of Planning and Environment Kiersten Fishburn, WPCA Chair Jennifer Westacott AO, Acting CEO Anne Skewes and our expert panellists on key directions for the Aerotropolis to inform the future of the Western Parkland City.",
    "published": "November 17, 2021"
  }
]