[
  {
    "title": "Hawker Siddeley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Siddeley",
    "snippet": "Hawker Siddeley Aircraft was <strong>formed in 1935</strong> as a result of the purchase by Hawker Aircraft of the companies of J. D. Siddeley, the automotive and engine builder Armstrong Siddeley and the aircraft manufacturer Armstrong Whitworth Aircraft. At this time, Hawker Siddeley also acquired A.V.",
    "published": "August 29, 2025"
  },
  {
    "title": "Hawker Siddeley Group PLC | Science Museum Group Collection",
    "url": "https://collection.sciencemuseumgroup.org.uk/people/ap17246/hawker-siddeley-group-plc",
    "snippet": "Hawker Siddeley Group PLC was <strong>initially formed as the Hawker Siddeley Aircraft Company on 11th July 1935</strong>. The new company was established to acquire all of the shares of the Armstrong Siddeley Development Company and 50% of the shares of the ...",
    "published": null
  },
  {
    "title": "Hawker Siddeley - Graces Guide",
    "url": "https://www.gracesguide.co.uk/Hawker_Siddeley",
    "snippet": "WW2 Hawker Siddeley was <strong>one of the United Kingdom&#x27;s most important aviation concerns</strong>, producing numerous designs including the famous Hawker Hurricane fighter plane that, along with the Supermarine Spitfire, was Britain&#x27;s front-line defence in the Battle of Britain.",
    "published": null
  },
  {
    "title": "History of HAWKER SIDDELEY GROUP PUBLIC LIMITED COMPANY – FundingUniverse",
    "url": "https://www.fundinguniverse.com/company-histories/hawker-siddeley-group-public-limited-company-history/",
    "snippet": "<strong>Its founder, Tommy Sopwith, produced the famous Sopwith Camel that shot down Germany&#x27;s World War I flying ace, the Red Baron</strong>. In World War II the company produced the Hawker Hurricane, which played a crucial role in the Battle of Britain in 1940.",
    "published": null
  },
  {
    "title": "Hawker Siddeley",
    "url": "https://heritage.baesystems.com/page/hawker-siddeley",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  }
]