[
  {
    "title": "John Heitinga - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Heitinga",
    "snippet": "John Gijsbert Alan Heitinga (born 15 November 1983) is a Dutch football coach and former player who was <strong>most recently the head coach of Eredivisie club Ajax</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "After years in the youth academy, hundreds of matches for Ajax’s first team, various coaching roles at the De Toekomst training complex, and a stint as assistant coach with Jong Ajax, he now embarks on his second spell as the club’s head coach. ... Technical Director Alex Kroes is pleased with the appointment of John Heitinga as Ajax’s new head coach.",
    "published": null
  },
  {
    "title": "Ajax suspends John Heitinga with immediate effect",
    "url": "https://english.ajax.nl/articles/ajax-suspends-john-heitinga-with-immediate-effect",
    "snippet": "<strong>Ajax has suspended John Heitinga with immediate effect</strong>. The head coach’s contract was due to run until June 30, 2027, but will now be terminated. The same applies to assistant coach Marcel Keizer.",
    "published": null
  },
  {
    "title": "Ex-Liverpool assistant John Heitinga sacked as Ajax boss - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/46870935/ex-liverpool-assistant-john-heitinga-sacked-ajax-boss",
    "snippet": "&quot;<strong>Ajax has suspended John Heitinga with immediate effect</strong>. The head coach&#x27;s contract was due to run until June 30, 2027, but will now be terminated,&quot; the club said in a statement.",
    "published": "November 6, 2025"
  },
  {
    "title": "Heitinga is back: 'Really excited to get started'",
    "url": "https://english.ajax.nl/articles/heitinga-is-back-really-excited-to-get-started",
    "snippet": "Ajax has reached an agreement with John Heitinga regarding the coach’s move to Amsterdam. Heitinga is signing a contract with Ajax as head coach <strong>until June 30, 2027</strong>.",
    "published": null
  }
]