[
  {
    "title": "Jean-Luc Mélenchon Casts a Long Shadow Over the Stagnant French Left",
    "url": "https://foreignpolicy.com/2025/04/25/melenchon-french-left-politics-progressive-coalition-2027-election/",
    "snippet": "Jean-Luc Mélenchon, one of France’s most hated politicians, casts a shadow over the left at a critical juncture.",
    "published": "May 13, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "Mélenchon has been labelled a populist by numerous diverse people, with the Socialist Party senator Luc Carvounas saying he goes to &quot;the summits of demagoguery and populism&quot;, and the magazine Slate stating that Mélenchon&#x27;s rhetoric is &quot;shocking&quot; and implying his entire political life is based around pleasing the people.",
    "published": "2 days ago"
  },
  {
    "title": "Jean-Luc Mélenchon – POLITICO",
    "url": "https://www.politico.eu/person/jean-luc-melenchon/",
    "snippet": "January 7, 2025 5:03 pm CET · Advertisement · <strong>The Socialists have taken timid steps toward emancipation from far-left firebrand Jean-Luc Mélenchon</strong>. January 3, 2025 4:00 am CET ·",
    "published": null
  },
  {
    "title": "France in Crisis: an Interview with Jean Luc Melenchon and La France Insoumise - CounterPunch.org",
    "url": "https://www.counterpunch.org/2025/10/29/france-in-crisis-an-interview-with-jean-luc-melenchon-and-la-france-insoumise/",
    "snippet": "Jean Luc Melenchon : <strong>The capitalists are getting behind the far right</strong>. Do you know why? Because there is intense social mobilization against the decisions stemming from the neoliberal program.",
    "published": "October 29, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon - World news, culture and opinion",
    "url": "https://www.lemonde.fr/en/jean-luc-melenchon/",
    "snippet": "<strong>The Parti Socialiste, which has broken free of radical-left leader Jean-Luc Mélenchon, is not done with its battles</strong>. It will, by 2027, need to win back moderate voters who have shunned it for the past seven years, at a time when PM François ...",
    "published": null
  }
]