[
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "Real Protection Is Needed Against This Russian Case History of Madness, and We Will Continue Now Working With All Partners to Ensure That Protection Is in Place – Address by the President ... In Warsaw, President of Ukraine <strong>Volodymyr Zelenskyy</strong> met ...",
    "published": "4 days ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "Zelenskyy announced his candidacy in the 2019 presidential election on the evening of 31 December 2018, alongside the New Year&#x27;s Eve address of then-president Petro Poroshenko on the TV channel 1+1. A political outsider, Zelenskyy positioned himself as an anti-establishment and anti-corruption figure, and had already become one of the frontrunners in opinion polls for the election months before he formally declared his candidacy. He won the election with 73.23 percent of the vote in the second round, defeating Poroshenko in the biggest landslide in the history of Ukrainian presidential elections.",
    "published": "4 days ago"
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "19, 2025, 3:33 PM ET (AP) Show less ... <strong>Volodymyr Zelensky</strong> (born January 25, 1978, Kryvyy Rih, Ukraine, U.S.S.R. [now in Ukraine]) is a Ukrainian actor and comedian who was elected president of Ukraine in 2019.",
    "published": "September 27, 2019"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "On 18 June 2015, Yanukovych was officially deprived of the title of president of Ukraine. The Government of Ukraine utilizes a semi-presidential system in which the roles of the head of state and head of government are separate, thus the president of Ukraine is not the nation&#x27;s head of government.",
    "published": "November 10, 2025"
  },
  {
    "title": "Ukraine-Russia war latest: Zelensky says draft documents prepared after US talks but Moscow insists no breakthrough | The Independent",
    "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-war-live-putin-nato-eu-trump-peace-b2889322.html",
    "snippet": "Initial drafts of US proposals for a peace deal between Ukraine and Russia meet many of Kyiv&#x27;s demands, Ukrainian President <strong>Volodymyr Zelensky</strong> has said. But he suggested that neither side in the almost four-year war is likely to get everything ...",
    "published": "1 hour ago"
  }
]