[
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "Mark Joseph Carney (born March 16, 1965) is a Canadian politician and economist who has been serving as the 24th prime minister of Canada since 2025. He has also been leader of the Liberal Party and the member of Parliament (MP) for Nepean since 2025.",
    "published": "6 hours ago"
  },
  {
    "title": "Premiership of Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Premiership_of_Mark_Carney",
    "snippet": "The premiership of Mark Carney began on March 14, 2025, when the first Cabinet headed by Mark Carney was sworn in by Governor General Mary Simon. Carney was invited to form the 30th Canadian Ministry and become the 24th Prime Minister of Canada after he succeeded Prime Minister <strong>Justin Trudeau</strong> ...",
    "published": "6 hours ago"
  },
  {
    "title": "Who is Liberal leader Mark Carney, Canada's new prime minister?",
    "url": "https://www.bbc.com/news/articles/c3911lv1pzko",
    "snippet": "Unlike most PM-hopefuls, Carney had never held political office. Still, he handily won the Liberal Party contest to replace outgoing Prime Minister <strong>Justin Trudeau</strong> in early March, and has now been elected by the people.",
    "published": "April 29, 2025"
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "The Right Honourable Mark Carney, Prime Minister of CanadaMark Carney is Canada’s 24th Prime Minister. He was elected Leader of the Liberal Party of Canada and sworn in as Prime Minister in March 2025. He leads a government that will take action to unite Canadians, defend Canada’s sovereignty, and build the strongest economy in the G7.",
    "published": null
  },
  {
    "title": "Mark Carney | Liberal Party, Prime Minister, Biography, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Mark-Carney",
    "snippet": "Mark Carney (b. 1965) is the prime minister of Canada. An economist, he previously served as governor of the Bank of Canada (2008–13) and as head of the Bank of England (2013–20). He was the first non-Briton to hold the latter position. In March 2025 he was elected leader of the Liberal Party of Canada and became prime minister.",
    "published": "January 22, 2016"
  }
]