[
  {
    "title": "Kim Pegula net worth 2025: How the Buffalo Bills owner built her NFL fortune | NFL News - The Times of India",
    "url": "https://timesofindia.indiatimes.com/sports/nfl/news/kim-pegula-net-worth-2025-how-the-buffalo-bills-owner-built-her-nfl-fortune/articleshow/124347716.cms",
    "snippet": "... <strong>Kim Pegula</strong> has had a wonderful transforming journey. Once an abandoned child in South Korea, she is successfully becoming one of the most powerful figures in American sports. As of 2025, Pegula and her husband, Terry Pegula, own a combined ...",
    "published": "October 8, 2025"
  },
  {
    "title": "Terry Pegula - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Terry_Pegula",
    "snippet": "On June 23, 2025, it was announced that Pegula would divest ownership of the Knighthawks franchise. It was later announced on August 5, 2025 that the <strong>Seneca Nation of New York</strong> had purchased the team. In 2012, he won a bid for the development rights to the Webster Block on Buffalo&#x27;s waterfront.",
    "published": "1 week ago"
  },
  {
    "title": "Who is the Owner of the Buffalo Bills? Terry Pegula",
    "url": "https://whoistheownerof.com/who-is-the-owner-of-the-buffalo-bills/",
    "snippet": "Who owns the Buffalo Bills in 2025. Learn about <strong>Terry Pegula</strong>, sole owner of the team since 2014, and how his leadership brought the franchise to new heights",
    "published": "September 5, 2025"
  },
  {
    "title": "2025 Buffalo Bills season - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Buffalo_Bills_season",
    "snippet": "The 2025 season is the Buffalo Bills&#x27; 56th in the National Football League (NFL), their 66th overall, their eleventh full season under the ownership of <strong>Terry and Kim Pegula</strong>, and their ninth under the head coach/general manager tandem of Sean ...",
    "published": "1 day ago"
  },
  {
    "title": "'Small-market' Bills rewarding owner Terry Pegula with hefty return on investment",
    "url": "https://www.si.com/nfl/bills/news/business-small-market-bills-rewarding-owner-terry-pegula-with-hefty-return-on-investment",
    "snippet": "Roger Goodell, the NFL commissioner, talks with majority owner of the Buffalo Bills, <strong>Terry Pegula</strong>, during the Bills warm up before the Buffalo Bills divisional game against the Baltimore Ravens at Highmark Stadium in Orchard Park on Jan. 19, 2025.",
    "published": "August 15, 2025"
  }
]