[
  {
    "title": "Liberal–National Coalition - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Liberal–National_Coalition",
    "snippet": "The revived SA Nationals have never been successful in South Australia, due to the state&#x27;s highly centralised population (some three-quarters of the population lives in Adelaide) and the Liberals&#x27; strong support in rural areas that would tilt National in most of the rest of Australia. The party&#x27;s current incarnation has only elected two representatives: Peter Blacker from 1973 to 1993, and Karlene Maywald from 1997 to 2010. From 2004 to 2010, Maywald was a Minister in the Rann Labor government, before losing her seat at the 2010 South Australian state election, thereby informally creating a Labor–National coalition in South Australia.",
    "published": "7 hours ago"
  },
  {
    "title": "Albanese government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Albanese_government",
    "snippet": "Albanese succeeded the <strong>Morrison government</strong> after the Liberal–National Coalition was defeated at the 2022 election, and saw the first Labor government to be elected at the federal level since the Rudd government was defeated at the 2013 election.",
    "published": "1 day ago"
  },
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "Albanese led his government to a landslide victory at the election, defying a global anti-incumbency surge and becoming the first prime minister since <strong>John Howard</strong> at the 2004 election to lead his government to re-election. Several media outlets attributed Albanese&#x27;s victory to anti-Donald Trump ...",
    "published": "9 hours ago"
  },
  {
    "title": "Australia: Liberal-National coalition reunite a week after split",
    "url": "https://www.bbc.com/news/articles/cx2748d37k4o",
    "snippet": "The Coalition split last Tuesday after Littleproud said both parties were not able to agree on key policy matters but it appears those issues have now been resolved. &quot;The focus now is on [Australia&#x27;s Prime Minister] Anthony Albanese and the Labor government and holding them to account &#x27;cause that&#x27;s important for our democracy,&quot; he told media on Wednesday afternoon.",
    "published": "May 28, 2025"
  },
  {
    "title": "Liberal Party of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Liberal_Party_of_Australia",
    "snippet": "Ray Groom won again for the Liberals in 1992 and 1996, before Labor enjoyed 16 years in power from 1998 until Will Hodgman won office for the Liberals in 2014, ushering in an extended period of Liberal government. Hodgman won the 2018 election, and his successors Peter Gutwein won in 2021, and Jeremy Rockliff in 2024. ... The Liberals were for decades the junior Coalition partner in Queensland, where the Nationals were dominant in a state with a decentralised population.",
    "published": "2 days ago"
  }
]