[
  {
    "title": "Pier Luigi Bersani - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pier_Luigi_Bersani",
    "snippet": "Bersani joined the Italian Communist Party and subsequently the Democratic Party of the Left. As member of the <strong>National Secretariat of the Democrats of the Left</strong>, he was responsible for the economic sector.",
    "published": "August 25, 2025"
  },
  {
    "title": "Italian Communist Party - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Italian_Communist_Party",
    "snippet": "The party adopted a slim structure headed by a Central Committee of 15 members, five of whom were also in the Executive Committee (EC), namely Ambrogio Belloni, Nicola Bombacci, Amadeo Bordiga (EC), Bruno Fortichiari (EC), Egidio Gennari, Antonio Gramsci, Ruggero Grieco (EC), Anselmo Marabini, Francesco Misiano, Giovanni Parodi, Luigi Polano, Luigi Repossi (EC), Cesare Sessa, Ludovico Tarsia, and Umberto Terracini (EC).",
    "published": "1 week ago"
  },
  {
    "title": "Pier Luigi Bersani",
    "url": "https://grokipedia.com/page/Pier_Luigi_Bersani",
    "snippet": "Pier Luigi Bersani (born 29 September 1951) is an Italian politician known for his long career in centre-left politics, including roles as Secretary of the Democratic Party from 7 November 2009 to 20 April 2013 and Minister of Economic Development from 17 May 2006 to 8 May 2008 in the second Prodi government.[1][2][3] Born in Bettola near Piacenza to a family of artisans—his father a mechanic and gas station operator—Bersani graduated in philosophy from the University of Bologna and began his political ascent in the Communist Party, later transitioning through Democratic Left to the Democr",
    "published": null
  },
  {
    "title": "Italian Communist Party politicians - FamousFix.com list",
    "url": "https://m.famousfix.com/list/italian-communist-party-politicians",
    "snippet": "Overview: <strong>Leonilde Iotti</strong>, commonly known as Nilde Iotti (10 April 1920 – 4 December 1999) was an Italian politician, member of the Italian Communist Party (PCI). She was the first woman ever to become President ...",
    "published": null
  },
  {
    "title": "Pier Luigi Bersani | Italian politician | Britannica",
    "url": "https://www.britannica.com/biography/Pier-Luigi-Bersani",
    "snippet": "Ask the Chatbot Games &amp; Quizzes History &amp; Society Science &amp; Tech Biographies Animals &amp; Nature Geography &amp; Travel Arts &amp; Culture ProCon Money Videos ... Pier Luigi Bersani, the leader of the <strong>center-left Democratic Party</strong> (Partito Democratico; ...",
    "published": null
  }
]