[
  {
    "title": "List of prime ministers of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Canada",
    "snippet": "The prime minister of Canada is the official who serves as the primary minister of the Crown, chair of the Cabinet, and thus head of government of Canada. Twenty-four people (twenty-three men and one woman) have served as prime minister. Officially, the prime minister is appointed by the governor general of Canada, but by constitutional convention, the prime minister must have the confidence of the elected House of Commons.",
    "published": "2 days ago"
  },
  {
    "title": "Prime Ministers of Canada",
    "url": "https://lop.parl.ca/sites/ParlInfo/default/en_CA/People/primeMinisters",
    "snippet": "This page provides general details on Canada&#x27;s prime ministers since 1867. For more information on an individual prime minister, including their electoral history and parliamentary roles, click on their name to view their complete profile",
    "published": null
  },
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Trudeau was baptized with his father&#x27;s niece Anne Rouleau-Danis as godmother and his mother&#x27;s brother-in-law Thomas Walker as godfather, at Ottawa&#x27;s Notre Dame Basilica on the afternoon of January 16, 1972, which marked his first public appearance. and given the names &quot;Justin Pierre James&quot;. On April 14, 1972, Trudeau&#x27;s father and mother hosted a gala at the National Arts Centre, at which visiting U.S. president Richard Nixon said, &quot;I&#x27;d like to toast the future prime minister of Canada, to Justin Pierre Trudeau&quot; to which Pierre Trudeau responded that should his son ever assume the role, he hoped he would have &quot;the grace and skill of the president&quot;.",
    "published": "4 days ago"
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "<strong>Prime Minister Carney</strong> started his career in finance before joining Canada’s public service to help ensure our economy supports the things that Canadians value – like health care, security, and a life you can afford.",
    "published": null
  },
  {
    "title": "List of prime ministers of Canada | Britannica",
    "url": "https://www.britannica.com/place/list-of-prime-ministers-of-Canada-1800352",
    "snippet": "This is a chronologically ordered list of the prime ministers, from the earliest to the most recent.",
    "published": "November 4, 2011"
  }
]