[
  {
    "title": "2025 Australian federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Australian_federal_election",
    "snippet": "All 150 seats in the House of Representatives were up for election, along with 40 of the 76 seats in the Senate. The Labor government of <strong>Anthony Albanese</strong> was elected for a second term in a landslide victory over the opposition Liberal–National Coalition, led by Peter Dutton.",
    "published": "1 day ago"
  },
  {
    "title": "Next Australian federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Australian_federal_election",
    "snippet": "It is expected that the incumbent Prime Minister <strong>Anthony Albanese</strong> will lead his Labor majority government to seek a third three-year term in government. They are expected to be challenged by the Liberal–National Coalition, led by opposition leader Sussan Ley.",
    "published": "1 day ago"
  },
  {
    "title": "Prime Minister of Australia | Prime Minister of Australia",
    "url": "https://www.pm.gov.au/",
    "snippet": "Building Australia’s future · View all media items · Tuesday 16 December 2025 · Transcript · Tuesday 16 December 2025 · Transcript · Tuesday 16 December 2025 · Transcript · Tuesday 16 December 2025 · Transcript · Tuesday 16 December 2025 · Transcript ·",
    "published": null
  },
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "He also administered the official commencement of the AUKUS security pact between Australia, the United States, and the United Kingdom, and navigated Australia&#x27;s response to the Gaza war. Despite often scoring low approval ratings, his government was re-elected in a landslide victory in the 2025 election, resulting in one of the largest Labor governments in Australian history.",
    "published": "9 hours ago"
  },
  {
    "title": "Australian Government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Australian_Government",
    "snippet": "The governor-general usually presides at council meetings, but in their absence another minister nominated as the vice-president of the Executive Council presides at the meeting of the council. Since 1 June 2022, the vice-president has been senator Katy Gallagher. As of 13 May 2025, there are 16 departments of the Australian Government.",
    "published": "2 days ago"
  }
]