[
  {
    "title": "Nate Silver – FiveThirtyEight",
    "url": "https://fivethirtyeight.com/contributors/nate-silver/",
    "snippet": "Nate Silver founded and was the <strong>editor in chief</strong> of FiveThirtyEight.",
    "published": null
  },
  {
    "title": "A few words about FiveThirtyEight - by Nate Silver",
    "url": "https://www.natesilver.net/p/a-few-words-about-fivethirtyeight",
    "snippet": "For more extended thoughts on the environment at Disney — plus plenty of self-reflection/self-criticism — you can see the item at the bottom of SBSQ #12.4 But the basic issue is that Disney was never particularly interested in running FiveThirtyEight as a business, even though I think it could have been a good business.",
    "published": "March 5, 2025"
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "Nathaniel Read Silver (born January 13, 1978) is an American statistician, political analyst, author, sports gambler, and poker player who analyzes baseball, basketball, football, and elections. He is the <strong>founder of FiveThirtyEight</strong> and held the position of editor-in-chief there, along with ...",
    "published": "1 week ago"
  },
  {
    "title": "Trump Approval Rating: Latest Polls | Silver Bulletin",
    "url": "https://www.natesilver.net/p/trump-approval-ratings-nate-silver-bulletin",
    "snippet": "This is the landing page for Silver Bulletin presidential approval ratings. It will always contain the latest data from our average of presidential approval polls and we’ll regularly update these approval ratings as new polls come in.1 · Our polling average is the direct descendant of the presidential approval average that Nate designed for FiveThirtyEight...",
    "published": "5 hours ago"
  },
  {
    "title": "Nate Silver (@NateSilver538) / X",
    "url": "https://x.com/NateSilver538",
    "snippet": "New Book, <strong>On The Edge</strong>, #5 NYT Bestseller! https://penguinrandomhouse.com/books/529280/on-the-edge-by-nate-silver/…",
    "published": "August 27, 2008"
  }
]