[
  {
    "title": "Austria | Reuters Institute for the Study of Journalism",
    "url": "https://reutersinstitute.politics.ox.ac.uk/digital-news-report/2025/austria",
    "snippet": "It took more than five months for the ÖVP to put together a workable coalition that excluded the far right, but throughout this process press freedom and the relationship between politicians and the news media have been in the spotlight. Throughout the year, tensions grew between the right-wing Freedom Party (FPÖ) and the public service broadcaster ORF. In February 2025, ORF’s editorial leadership publicly rejected accusations from FPÖ politician Peter Westenthaler, a member of the ORF&#x27;s governing board, who claimed that ORF journalists were acting as political propagandists.",
    "published": null
  },
  {
    "title": "New Austrian Government Sworn In — Austria in USA",
    "url": "https://www.austria.org/news/new-austrian-government-sworn-in",
    "snippet": "On March 3, 2025, Federal President <strong>Alexander Van der Bellen</strong> swore in a new Austrian Federal Government formed by the Austrian People’s Party (ÖVP), the Social Democratic Party (SPÖ) and the NEOS.",
    "published": "March 20, 2025"
  },
  {
    "title": "Austria's three-party government takes office, shutting out far right | Reuters",
    "url": "https://www.reuters.com/world/europe/austrian-conservative-stocker-sworn-head-coalition-government-2025-03-03/",
    "snippet": "The new government headed by <strong>Chancellor Christian Stocker</strong> of the OVP takes office after two years of recession, and plans spending cuts and tax hikes on big business to bring Austria&#x27;s budget deficit back within European Union limits and avoid ...",
    "published": "March 3, 2025"
  },
  {
    "title": "Austrian centrist parties reach deal to form government without far right | Austria | The Guardian",
    "url": "https://www.theguardian.com/world/2025/feb/27/austria-centrist-parties-deal-form-government-without-far-right",
    "snippet": "Stocker said the negotiations since September had been “perhaps the most difficult in the history of our country”. Austria’s challenges were “historic and far-reaching”, he said, including war in Ukraine, a flagging economy and pressure from migration. Stocker took over the ÖVP leadership earlier this year after the former chancellor Karl Nehammer resigned when the first round of three-way coalition talks failed. Stocker is a 64-year-old lawyer who spent three decades in local politics and became an MP in 2019.",
    "published": "February 27, 2025"
  },
  {
    "title": "Austria swears in new government, ending five-month political crisis – POLITICO",
    "url": "https://www.politico.eu/article/austria-swears-new-government-ending-five-month-political-crisis-christian-stocker-alexander-van-der-bellen/",
    "snippet": "March 3, 2025 11:43 am CET · By Csongor Körömi · Austria’s President <strong>Alexander van der Bellen</strong> swore in the country’s new three-party government Monday, ending five months of political deadlock that followed the far right’s election ...",
    "published": "March 3, 2025"
  }
]