[
  {
    "title": "Chase Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chase_Center",
    "snippet": "The arena also includes the Warriors’ practice facility known as the Oracle Performance Center. <strong>The Chase Center</strong> is the second youngest arena in the NBA, after the Intuit Dome in Inglewood, California. The arena, which is home to the Golden State Warriors of the NBA and Golden State Valkyries ...",
    "published": "1 day ago"
  },
  {
    "title": "Chase Center’s Golden Gate to Success | Mortenson",
    "url": "https://www.mortenson.com/news-insights/chase-center-golden-gate-success",
    "snippet": "The forward-thinking vision of the <strong>Chase Center</strong> project team is evident in the exciting lineup of events planned for 2025. Highlights include hosting the NBA All-Star Game, the prestigious Laver Cup, and the inaugural season of the Golden State ...",
    "published": null
  },
  {
    "title": "Home | Chase Center",
    "url": "https://www.chasecenter.com/",
    "snippet": "<strong>Chase Center</strong>, a state-of-the-art sports and entertainment arena in San Francisco, is home to the Golden State Warriors and nearly 200 events per year.",
    "published": null
  },
  {
    "title": "Chase Center is the Golden State Warriors’ Dramatic Home | Visit California",
    "url": "https://www.visitcalifornia.com/experience/chase-center/",
    "snippet": "While the Warriors are the stars of the <strong>Chase Center</strong>, the arena also hosts occasional University of San Francisco Dons basketball games and the road to the Final Four has ran through here when the 2022 West Regionalswere played here; looking ...",
    "published": "October 1, 2024"
  },
  {
    "title": "Chase Center (2025) - All You Need to Know BEFORE You Go (with Reviews)",
    "url": "https://www.tripadvisor.com/Attraction_Review-g60713-d18928609-Reviews-Chase_Center-San_Francisco_California.html",
    "snippet": "Prices of drinks were high compared to the NHL and NFL games we attended on subsequent days. ... ✨ <strong>The Chase Center</strong> isn’t just an arena — it’s San Francisco’s future built on its past.",
    "published": null
  }
]