[
  {
    "title": "Renée Slegers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ren%C3%A9e_Slegers",
    "snippet": "Renée Josiena Anna Slegers (Dutch: [rəˈneː joːˈsinaː ˈʔɑnaː ˈsleːɣərs]; born 5 February 1989) is a <strong>Dutch football coach and former player</strong>, who is the head coach of Women&#x27;s Super League club Arsenal.",
    "published": "15 hours ago"
  },
  {
    "title": "Arsenal Women Long-Read: The making of Renee Slegers Arsenal Manager - Arseblog News - the Arsenal news site",
    "url": "https://arseblog.news/2025/02/arsenal-women-long-read-renee-slegers-in-profile/",
    "snippet": "In January, Arsenal appointed <strong>35-year-old Dutch coach</strong> Renee Slegers as the Head Coach of their women’s team after a spell as Interim Manager that saw the Gunners win 10 and draw one of her 11 games in temporary charge.",
    "published": "February 5, 2025"
  },
  {
    "title": "Renee Slegers: The player, the coach and the person behind the Arsenal boss - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/c77n75ld1l6o",
    "snippet": "Just like at Rosengard, Slegers has worked her way up the ladder at Arsenal - first becoming Eidevall&#x27;s assistant, and then taking interim charge when he resigned in October after a disappointing start to the season. Her impact was instant. She went unbeaten in her first 11 games in charge - a run of fixtures that proved to be an almost-perfect audition for the permanent position. &quot;Renee came in she steadied the ship,&quot; Arsenal left-back Katie McCabe said.",
    "published": "May 24, 2025"
  },
  {
    "title": "Renée Slegers on her journey from Arsenal academy player to Women's Champions League finalist coach | UEFA Women's Champions League 2024/25 | UEFA.com",
    "url": "https://www.uefa.com/womenschampionsleague/news/0299-1dc2c4191321-6569b12998ac-1000--renee-slegers-on-her-journey-from-arsenal-academy-player-to/",
    "snippet": "... The last time Arsenal featured ... Women&#x27;s Cup), Renée Slegers was <strong>a fresh-faced 18-year-old midfielder who was just coming to the end of a valuable year spent at the club&#x27;s academy</strong>....",
    "published": "May 23, 2025"
  },
  {
    "title": "Renée Sleger's Net Worth, Ethnicity, Partner and Personal Life",
    "url": "https://www.bbntimes.com/society/renee-sleger-s-net-worth-ethnicity-partner-and-personal-life",
    "snippet": "Renée Slegers was born on February 5, 1989, in Someren-Eind, a small town in the Netherlands’ Noord-Brabant province. Her ethnicity is Dutch, rooted in the cultural and historical context of the Netherlands. The Dutch are a Germanic ethnic group native to the region, with a heritage shaped by centuries of maritime trade, cultural exchange, and a strong national identity.",
    "published": null
  }
]