[
  {
    "title": "Yabloko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yabloko",
    "snippet": "In March 2002, the party became a full member of the Liberal International, and since November 1998, it has been in observer status. The founder of the party <strong>Grigory Yavlinsky</strong> is an honorary vice-president of the Liberal International and winner of its Prize for Freedom.",
    "published": "3 weeks ago"
  },
  {
    "title": "Russian Democratic Party YABLOKO » The Russian United Democratic Party YABLOKO",
    "url": "https://eng.yabloko.ru/the-russian-united-democratic-party-yabloko/",
    "snippet": "YABLOKO founder <strong>Grigory Yavlinsky</strong> came fourth and third in presidential elections of 1996 and 2000, respectively, was not allowed to run in the presidential elections of 2012, and came fifth in 2018, when Vladimir Putin became President for ...",
    "published": null
  },
  {
    "title": "Russian Democratic Party YABLOKO",
    "url": "https://eng.yabloko.ru/",
    "snippet": "Lies and legitimacy The founder of the Yabloko Party analyses the political situation. Article by Grigory Yavlinsky on radio Svoboda.",
    "published": null
  },
  {
    "title": "Yabloko | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/yabloko",
    "snippet": "YABLOKO Yabloko was one of the leading liberal opposition parties in the newly democratic Russia of the 1990s. Yabloko&#x27;s founder and leader was <strong>Grigory Yavlinsky</strong>, a liberal economist who had stayed aloof from the new democratic political movements being formed between 1989 and 1991.",
    "published": null
  },
  {
    "title": "Russian opposition party that wants Ukraine ceasefire vows to keep campaigning despite crackdown | Reuters",
    "url": "https://www.reuters.com/business/media-telecom/russian-opposition-party-that-wants-ukraine-ceasefire-vows-keep-campaigning-2025-12-15/",
    "snippet": "<strong>Grigory Yavlinsky</strong>, founder of the political party Yabloko, attends the party&#x27;s congress in Moscow, Russia, April 3, 2021. A sign on the rostrum reads: &quot;Freedom to all political prisoners.",
    "published": "1 week ago"
  }
]