[
  {
    "title": "Oskar Lafontaine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Oskar_Lafontaine",
    "snippet": "On 24 May 2005 Lafontaine left the SPD. After two weeks of speculation it was announced on 10 June that he would run as the lead candidate for The Left party (Die Linke), a coalition of the Labor and Social Justice Party (WASG), which was based in western Germany, and the Left Party.PDS, which was the successor to the ruling East German Socialist Unity Party (SED).",
    "published": "November 12, 2025"
  },
  {
    "title": "Die Linke: Gregor Gysi und Oskar Lafontaine streiten über Flüchtlinge - DER SPIEGEL",
    "url": "https://www.spiegel.de/politik/deutschland/die-linke-gregor-gysi-und-oskar-lafontaine-streiten-ueber-fluechtlinge-a-1170416.html",
    "snippet": "... Der vorläufige Höhepunkt: Die Antwort des großen alten Rivalen des Ex-Parteichefs. <strong>Gregor Gysi, mittlerweile Chef der Europäischen Linken</strong>, veröffentlichte einen Gastbeitrag im linken Blatt &quot;Neues Deutschland&quot; .",
    "published": "September 28, 2017"
  },
  {
    "title": "A Better Europe is Possible",
    "url": "https://jacobin.com/2015/03/oskar-lafontaine-interview-die-linke",
    "snippet": "In his long career, Lafontaine ... finance; chairman of the Social Democratic Party (SDP); and later <strong>cochair of the new left-wing party Die Linke (The Left).</strong>...",
    "published": null
  },
  {
    "title": "Die Linke: Oskar Lafontaine tritt aus der Linkspartei aus | DIE ZEIT",
    "url": "https://www.zeit.de/politik/deutschland/2022-03/oskar-lafontaine-tritt-aus-der-linkspartei-aus",
    "snippet": "Führende Linkenpolitiker bedauerten den Parteiaustritt Lafontaines, wiesen seine Kritik aber zugleich zurück. Der einstige Bundestagsfraktionschef Gregor Gysi sagte der Neuen Osnabrücker Zeitung: &quot;Ich bedaure den Schritt von Oskar Lafontaine, den ich für falsch halte.",
    "published": "March 17, 2022"
  },
  {
    "title": "DIE LINKE hätte es ohne Oskar Lafontaine so nicht gegeben: Die Linke",
    "url": "https://www.die-linke.de/start/nachrichten/detail/die-linke-haette-es-ohne-oskar-lafontaine-so-nicht-gegeben",
    "snippet": "Erklärung von Gregor Gysi, Vorsitzender der Bundestagsfraktion DIE LINKE, auf der Pressekonferenz am 23. Januar 2010 im Berliner Karl-Liebknecht-Haus · Der Vorstand muss die Entscheidung von Oskar Lafontaine respektieren, aber es tut ausgesprochen weh. Oskar Lafontaine war, ist und bleibt ...",
    "published": null
  }
]