[
  {
    "title": "Jodie Haydon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jodie_Haydon",
    "snippet": "<strong>Jodie Haydon</strong> (born 1978 or 1979) is an Australian financial services professional and women&#x27;s advocate. She is the wife of the 31st (and current) prime minister of Australia, Anthony Albanese. <strong>Jodie Haydon</strong> was born in 1978 or 1979 in Bankstown, Sydney, and grew up on the Central Coast of New ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "His parents met in March 1962 on ... but did not continue their relationship afterwards, going their separate ways. Albanese&#x27;s mother adopted Carlo&#x27;s surname for herself and named Anthony after his cousin Anthony Howett, who had died in a car accident in Northern New South ...",
    "published": "20 hours ago"
  },
  {
    "title": "Spouse or partner of the prime minister of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Spouse_or_partner_of_the_prime_minister_of_Australia",
    "snippet": "The spouse of prime minister Anthony Albanese is <strong>Jodie Haydon</strong>.",
    "published": "5 days ago"
  },
  {
    "title": "Australian prime minister Albanese becomes first to wed in office",
    "url": "https://www.bbc.com/news/articles/ce865kpdzz8o",
    "snippet": "Australian Prime Minister Anthony Albanese has married his partner <strong>Jodie Haydon</strong>, becoming the country&#x27;s first leader to tie the knot while in office.",
    "published": "3 weeks ago"
  },
  {
    "title": "Australian PM Albanese marries partner in private ceremony | Reuters",
    "url": "https://www.reuters.com/world/asia-pacific/australian-pm-albanese-marries-partner-private-ceremony-2025-11-29/",
    "snippet": "Anthony Albanese became the first Australian prime minister to tie the knot while in office when he married his partner <strong>Jodie Haydon</strong> in a private ceremony on Saturday.",
    "published": "3 weeks ago"
  }
]