[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist ... spectroscopy (NMR) and mass spectrometry. She was previously a <strong>professor of chemistry and provost and executive vice chancellor at the University of California, Riverside</strong>....",
    "published": "July 15, 2025"
  },
  {
    "title": "University of California, Santa Cruz (UCSC) Highest Paid Employees",
    "url": "https://openpayrolls.com/rank/highest-paid-employees/university-of-california-santa-cruz",
    "snippet": "In 2022 the University of California, Santa Cruz (UCSC) reported 1,250 employees making more than $100,000 per year; the average salary was $69,217. The highest reported pay was $526,900 for Cynthia Larive, Chan. The University of California, Santa Cruz (UCSC) in 2022 ranked 246th in the nation among highest paying universities and colleges and 2,353rd in the nation for overall highest paying employers.",
    "published": null
  },
  {
    "title": "r/UCSC on Reddit: the chancellor is receiving a 28.5% pay increase.",
    "url": "https://www.reddit.com/r/UCSC/comments/1fw5ojy/the_chancellor_is_receiving_a_285_pay_increase/",
    "snippet": "Article states &quot;UC Santa Cruz Chancellor Cynthia Larive will voluntarily forgo her base salary increase for 2024-25.&quot; You should know that this is in reference to the 4% across-the-board increase that all staff got, not the upcoming 28.5% increase.",
    "published": "October 4, 2024"
  },
  {
    "title": "Meet the New Chancellor - City on a Hill Press",
    "url": "https://cityonahillpress.com/2019/05/23/meet-the-new-chancellor/",
    "snippet": "Cynthia Larive got her doctorate from UC Riverside in 1992. This year she will replace George Blumenthal as UCSC chancellor. Photo by Yvonne Gonzalez.When she was 9 years old, Cynthia, or Cindy,",
    "published": "May 23, 2019"
  },
  {
    "title": "Cynthia Larive - Chancellor - Univerisity of California Santa Cruz | LinkedIn",
    "url": "https://www.linkedin.com/in/cynthia-larive-83218a8",
    "snippet": "2 others named Cynthia Larive are on LinkedIn See others named Cynthia Larive 路 See all courses 路 Include this LinkedIn profile on other websites 路 <strong>Chancellor at Univerisity of California Santa Cruz</strong> 路 Chancellor at Univerisity of California ...",
    "published": null
  }
]