[
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "<strong>Founded in 1983 as Televerket Kabel-TV as part of the former state-owned Televerket</strong>, the company was successively named Svenska Kabel-TV AB and Telia InfoMedia TeleVision AB, before becoming &#x27;Com Hem&#x27; (a play on the Swedish phrase Kom hem, &quot;come home&quot;) in 1999.",
    "published": "June 6, 2025"
  },
  {
    "title": "Com Hem",
    "url": "https://eqtgroup.com/about/current-portfolio/com-hem",
    "snippet": "<strong>EQT III acquired Com Hem AB, a Swedish cable TV operator, in 2003.</strong>",
    "published": null
  },
  {
    "title": "BC Partners to acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/bc-partners-acquire-com-hem",
    "snippet": "<strong>Carlyle and Providence acquired Com Hem from EQT in 2006</strong> and, in the same year, they acquired UPC, which was integrated with Com Hem. Under the ownership of Carlyle and Providence, the company has invested nearly SEK 4 billion on developing the company, upgrading the network to the highest ...",
    "published": null
  },
  {
    "title": "Com Hem 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10876-33",
    "snippet": "Com Hem Holding AB is a broadcast television company with services that include cable television, broadcast Internet, and telephone. The company is based in Sweden and has two primary business segments: Com Hem and Boxer. The Com Hem business offers broadband, telephone, and fixed telephone services to both consumers and businesses, as does Boxer, which was an acquisition.",
    "published": null
  },
  {
    "title": "BC Partners to acquire Com Hem — BC Partners",
    "url": "https://www.bcpartners.com/news/bc-partners-to-acquire-com-hem/",
    "snippet": "<strong>Carlyle and Providence acquired Com Hem from EQT in 2006</strong> and, in the same year, they acquired UPC, which was integrated with Com Hem. Under the ownership of Carlyle and Providence, the company has invested nearly SEK 4 billion on developing ...",
    "published": "April 28, 2025"
  }
]