[
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "Use of the term &quot;president&quot; dates back to 1834 and the regency of Maria Christina when, styled after the head of government of the French July Monarchy (1830), the official title was the &quot;President of the Council of Ministers&quot; (Presidente del Consejo de Ministros). This remained until 1939, when the Second Spanish Republic ended. Before 1834 the figure was known as &quot;Secretary of State&quot; (Secretario de Estado), a denomination used today for junior ministers. Spain was not unique in this regard: it was one of several European parliamentary systems, including France, Italy and the Irish Free State, that styled the head of government as &#x27;presidents&#x27; of the government rather than the Westminster term of &#x27;prime minister&#x27; (see President of the Council for the full list of corresponding terms).",
    "published": "3 weeks ago"
  },
  {
    "title": "Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pedro_S%C3%A1nchez",
    "snippet": "Under Sánchez&#x27;s premiership, the Congress approved a total central government budget of 196 billion euros – the biggest budget in the country&#x27;s history – in 2021, after he had won the support of the Catalan pro-independence Republican Left of Catalonia. Following the fall of Kabul and the subsequent de facto creation of the Islamic Emirate of Afghanistan, the Prime Minister offered Spain as a hub for Afghans who collaborated with the European Union, who would later be settled in various countries.",
    "published": "3 days ago"
  },
  {
    "title": "Spain - Autonomous Regions, Constitution, Monarchy | Britannica",
    "url": "https://www.britannica.com/place/Spain/Government-and-society",
    "snippet": "The principles on which his regime was based were embodied in a series of Fundamental Laws (passed between 1942 and 1967) that declared Spain a monarchy and established a legislature known as the Cortes. Yet Franco’s system of government differed radically from Spain’s modern constitutional traditions.",
    "published": "October 1, 1998"
  },
  {
    "title": "Spain: Government",
    "url": "https://globaledge.msu.edu/countries/spain/government",
    "snippet": "History · Government · Economy · Statistics · Trade Statistics · Culture · Risk · Corporations · Indices · Resources · U.S. Trade Resources · Memo · Search for Another Country · Tips When Visiting… · In Spain, only bullfights, football matches, and theatrical performances occur on time.",
    "published": null
  },
  {
    "title": "Government of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_Spain",
    "snippet": "The Government is responsible before the Parliament (Cortes Generales), and more precisely before the Congress of the Deputies, a body which elects the Prime Minister or dismisses them through a motion of censure. This is because Spain is a parliamentary system established by the Constitution of 1978.",
    "published": "October 22, 2025"
  }
]