[
  {
    "title": "Luis Enrique, a la gijonesa: historia de un \"niño flaco\" a la conquista de Asturias (y del Mundial)",
    "url": "https://www.elconfidencial.com/deportes/futbol/mundial/2022-12-06/luis-enrique-seleccion-espanola-mundial-qatar_3534247/",
    "snippet": "Triunfó en Barcelona, pero nunca se olvida de Gijón. Ni de la ciudad, ni del barrio. &quot;Los equipos con los que más se identifica son La Braña y el Sporting&quot;, explica Martínez. Los años en Asturias curtieron el carácter de Luis Enrique, cuya personalidad no ha cambiado.",
    "published": "December 6, 2022"
  },
  {
    "title": "De Gijón al trono del fútbol mundial: el año en que Luis Enrique convirtió al PSG en un equipo irrepetible. Asturias Mundial.",
    "url": "https://www.asturiasmundial.com/noticia/142537/gijon-trono-futbol-mundial-ano-luis-enrique-convirtio-psg-equipo-irrepetible",
    "snippet": "Desde Gijón hasta Doha, pasando por París, Luis Enrique ha firmado el año más rotundo de su carrera. Y lo ha hecho sin fuegos artificiales innecesarios, con trabajo, convicción y una idea clara: el fútbol se gana en equipo. En Asturias, esa idea se entiende muy bien.",
    "published": null
  },
  {
    "title": "Luis Enrique: «Me siento muy orgulloso de donde soy, gijonudo hasta la muerte» | El Comercio: Diario de Asturias",
    "url": "https://www.elcomercio.es/deportes/futbol/luis-enrique-psg-champions-gijon-sporting-20250521204526-nt.html",
    "snippet": "–Mucha gente en Asturias está pendiente del PSG. ¿Siente un orgullo especial? –¡Claro que sí! Siempre que vas a cualquier sitio y más, nosotros dos, que somos de Gijón (Luis Enrique) y de Oviedo (Joaquín Valdés), tener el cariño de nuestra gente es lo mejor.",
    "published": "May 23, 2025"
  },
  {
    "title": "Luis Enrique - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Luis_Enrique",
    "snippet": "Luis Enrique was <strong>born in Gijón, Asturias</strong>, and began his career with local Sporting de Gijón, where he gained the nickname Lucho after Luis Flores, a Mexican forward in the team.",
    "published": "15 hours ago"
  },
  {
    "title": "Gijón, orgulloso de un entrenador como Luis Enrique: «Ya era el mejor sin necesidad de ningún premio» | El Comercio: Diario de Asturias",
    "url": "https://www.elcomercio.es/deportes/futbol/gijon-orgulloso-entrenador-luis-enrique-mejor-premio-20250923223514-nt.html",
    "snippet": "Luis Enrique debutaría esa misma temporada con el primer equipo a las órdenes de Chuchi Aranguren. Real Madrid, Barcelona y Selección Española como jugador; Barça &#x27;B&#x27;, Roma, Celta, Barça, la Selección Española y el PSG, como técnico, adornan la trayectoria de uno de los deportistas más ilustres de este siglo. «Es una persona que trabaja desde la humildad. Sin duda es merecidísimo». El Ayuntamiento de Gijón se sumaba al carro de elogios a Luis Enrique.",
    "published": "September 24, 2025"
  }
]