[
  {
    "title": "Vincent Kompany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Vincent_Kompany",
    "snippet": "Vincent Jean Mpoy Kompany (born 10 April 1986) is a Belgian professional football manager and former player who played as a centre-back. He is the <strong>head coach of Bundesliga club Bayern Munich</strong>. As a player, he is best known for his eleven seasons at Manchester City, eight of which he served as ...",
    "published": "2 days ago"
  },
  {
    "title": "Vincent Kompany Spotlight: News, Personal & more",
    "url": "https://fcbayern.com/en/teams/first-team/coaches-and-staff/vincent-kompany",
    "snippet": "Vincent Kompany has been <strong>head coach of FC Bayern since July 2024</strong>. The former defender was born in Ukkel, Belgium and played for Anderlecht, Hamburger SV and Manchester City. He returned to Belgium in 2019 and became player-coach at Anderlecht.",
    "published": null
  },
  {
    "title": "How Vincent Kompany led Bayern Munich back to Bundesliga glory | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/how-vincent-kompany-led-bayern-munich-back-to-league-title-31766",
    "snippet": "When Bayern Munich opted to make Vincent Kompany their new coach, there were some who questioned whether a young tactician who was previously demoted with English side Burnley FC would be ready to step up to one of the giants of the world game. A little under a year later, Vincent Kompany has answered his doubters with the Bundesliga title.",
    "published": "May 5, 2025"
  },
  {
    "title": "Vincent Kompany (Bayern Munich) Stats - Flashscore.com",
    "url": "https://www.flashscore.com/player/kompany-vincent/K6A2elS9/",
    "snippet": "View the player profile of Vincent Kompany (Bayern Munich) on Flashscore.com. Career stats (appearances, goals, cards) and transfer history.",
    "published": null
  },
  {
    "title": "Vincent Kompany - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/vincent-kompany/profil/trainer/69681",
    "snippet": "Current club Bayern Munich · Current ... manager. Compact · Detailed · 69681696816968169681 · Vincent Kompany is the <strong>brother of François Kompany</strong> (Retired)....",
    "published": null
  }
]