[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Electoral blocs are not present within the current law system of Russia, so it would be realised via means of a single party, RPR-PARNAS, which is not only eligible for participation in statewide elections, but is also currently not required to collect citizens&#x27; signatures for the right to participate in the State Duma elections scheduled for September 2016, due to the regional parliament mandate previously taken by Nemtsov. The candidates RPR-PARNAS would appoint were to be chosen via primary elections. On 5 July 2015, Kasyanov was elected as the only leader of RPR-PARNAS, and the party was renamed to just PARNAS. He added he would like to eventually re-establish the institution of co-chairmanship, adding, &quot;Neither Alexei Navalny nor Mikhail Khodorkovsky will enter our party today and be elected as co-chairmen.",
    "published": "2 days ago"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "<strong>Russia of the Future</strong> (Russian: Россия Будущего, romanized: Rossiya Budushchego, IPA: [rɐˈsʲijə ˈbudʊɕːɪvə]), originally known as the People&#x27;s Alliance (Народный Альянс, Narodnyy Al&#x27;yans) and formerly called the Progress Party (Партия Прогресса, ...",
    "published": "September 30, 2025"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "In 2000, while he was still a student, Navalny joined Yabloko, a political party that promoted liberal democracy and a market economy. In the early days of Putin’s reign, it seemed that opposition groups might hold some sway in the State Duma, but the unification of pro-Putin parties under the banner of United Russia in 2001 would stifle much dissent.",
    "published": "March 7, 2023"
  },
  {
    "title": "5 things to know about Russian opposition leader Alexei Navalny – POLITICO",
    "url": "https://www.politico.eu/article/5-things-you-need-to-know-about-alexei-navalny/",
    "snippet": "Although Navalny is widely viewed as a leading Russian opposition figure, he has — unlike Nemtsov — never held public office. He got his start in politics as a member of the liberal <strong>Yabloko opposition party</strong> in 2000, but was expelled from ...",
    "published": "August 21, 2020"
  },
  {
    "title": "The Man Who Stood Up to Vladimir Putin | Journal of Democracy",
    "url": "https://www.journalofdemocracy.org/online-exclusive/the-man-who-stood-up-to-vladimir-putin/",
    "snippet": "As a young man, Navalny had been drawn to Yabloko, one of post-Communist Russia’s oldest political parties with a liberal, pro-Western orientation. In Putin’s first two terms, Yabloko lost its representation in the Duma and gradually drifted into irrelevance.",
    "published": "January 23, 2025"
  }
]