[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "The original de Havilland Aircraft of Canada, Limited was created in 1928 by <strong>the British de Havilland Aircraft Company</strong> to build Moth aircraft for the training of Canadian airmen, and subsequently after the Second World War, designed and produced indigenous designs.",
    "published": "3 days ago"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "De Havilland Aircraft of Canada was founded as a subsidiary of England’s de Havilland Aircraft Company in 1928. During the Second World War, de Havilland produced the multi-purpose Mosquito and training airplane Tiger Moth at its Downsview facility in Toronto.",
    "published": null
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "Later, <strong>Hawker Siddeley</strong> merged into what is eventually known today as BAE Systems, the British aerospace and defence business. The de Havilland name lives on in De Havilland Canada, which owns the rights to the name and the aircraft produced by de Havilland&#x27;s former Canadian subsidiary, including ...",
    "published": "November 1, 2025"
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "De Havilland Canada was founded nearly 96 years ago, in August 1928, as a subsidiary of the <strong>United Kingdom aircraft manufacturer De Havilland Aircraft</strong>. In the last century, the Canadian company has changed many hands.",
    "published": "February 21, 2024"
  },
  {
    "title": "About - De Havilland Canada",
    "url": "https://dehavilland.com/about/",
    "snippet": "In this role, he oversees the strategy and operations of all divisions of De Havilland Canada. Brian was born and raised in Newfoundland and received a commerce degree from Memorial University before earning an MBA at the Ivey School of Business at Western. Brian has a long history in the Canadian aerospace industry, spending 22 years at PAL Aerospace, with his last role as President and CEO. At PAL, Brian and his team took a small, regional company, found market segments in which they could not only participate but win, and transformed PAL into a global aerospace participant with staff and operations on three continents.",
    "published": "March 15, 2023"
  }
]