[
  {
    "title": "Bart De Wever - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bart_De_Wever",
    "snippet": "<strong>Bart Albert Liliane De Wever</strong> (Dutch: [ˈbɑrt də ˈʋeːvər]; born 21 December 1970) is a Belgian politician who has served as the Prime Minister of Belgium since February 2025. From 2004 to 2025, De Wever had been the leader of the New Flemish Alliance (N-VA), a political party advocating ...",
    "published": "1 day ago"
  },
  {
    "title": "Prime Minister of Belgium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Belgium",
    "snippet": "<strong>Bart De Wever</strong>, the (former) leader of New-Flemish Alliance, was appointed as new prime minister on 3 February 2025. He is the first Flemish Nationalist to ever become Premier of Belgium.",
    "published": "September 11, 2025"
  },
  {
    "title": "Prime Minister | Belgium.be",
    "url": "https://www.belgium.be/en/about_belgium/government/federal_authorities/federal_government/prime_minister",
    "snippet": "An electronic Council of Ministers took place under the presidency of Prime Minister <strong>Bart De Wever</strong>. You can consult the Council’s decisions at news.belgium.be (fr). Read more about Decisions of the Council of Ministers of 28 February 2025",
    "published": null
  },
  {
    "title": "Biography | Bart De Wever",
    "url": "https://premier.be/en/biography",
    "snippet": "<strong>Bart De Wever</strong> (b. 1970) has been Prime Minister of Belgium since 3 February 2025. He is the first Flemish nationalist to hold this position. He previously served as Mayor of Antwerp from January 2013 to February 2025, and is still titular mayor of the city.",
    "published": "July 7, 2025"
  },
  {
    "title": "Flemish nationalist Bart De Wever sworn in as Belgium's new prime minister",
    "url": "https://www.lemonde.fr/en/international/article/2025/02/03/flemish-nationalist-bart-de-wever-sworn-in-as-belgium-s-new-prime-minister_6737718_4.html",
    "snippet": "<strong>Bart De Wever</strong> was sworn in by King Philippe after a coalition agreement was found Friday, following seven months of negotiations. He is the first Flemish nationalist to lead Belgium&#x27;s government.",
    "published": "February 3, 2025"
  }
]