[
  {
    "title": "Sanctioning a Transnational Network Fueling the Conflict in Sudan - United States Department of State",
    "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/12/sanctioning-a-transnational-network-fueling-the-conflict-in-sudan",
    "snippet": "HomeOffice of the SpokespersonPress Releases…Sanctioning a Transnational Network Fueling the Conflict in Sudan · hide · Press Statement · <strong>Thomas &quot;Tommy&quot; Pigott</strong>, Principal Deputy Spokesperson · December 9, 2025 · On November 19, President ...",
    "published": "1 week ago"
  },
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Since independence was proclaimed on 1 January 1956, six individuals (and three multi-member sovereignty councils) have served as head of state of Sudan, currently under the title President of the Republic of Sudan. Prior to independence, Sudan was governed as a condominium by Egypt and the United Kingdom, under the name Anglo-Egyptian Sudan.",
    "published": "November 14, 2025"
  },
  {
    "title": "World Report 2025: South Sudan | Human Rights Watch",
    "url": "https://www.hrw.org/world-report/2025/country-chapters/south-sudan",
    "snippet": "On May 25, <strong>Salva Kiir</strong> was endorsed as his party’s presidential candidate. He warned that an extension of the election timetable would cause a return to conflict. The Tumaini talks were launched in May, with the goal of rebooting the 2018 peace ...",
    "published": "January 16, 2025"
  },
  {
    "title": "Kamil Idris government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kamil_Idris_government",
    "snippet": "Sudan&#x27;s foreign ministry published a roadmap including the formation of a transitional government and a national dialogue with civil society groups, leading to free and fair elections at the end of the transition period. The foreign ministry requested support from the African Union, the United Nations, and the Arab League to support the roadmap. On 18 February 2025, the Rapid Support Forces announced plans to form their own rival government, the Government of Peace and Unity, to administer the parts of Sudan under RSF control.",
    "published": "1 month ago"
  },
  {
    "title": "Tipping points: South Sudan on the brink of collapse?",
    "url": "https://www.iiss.org/online-analysis/online-analysis/2025/05/tipping-points-south-sudan-on-the-brink-of-collapse/",
    "snippet": "<strong>President Kiir</strong> faces a growing number of crises in South Sudan, including rising tensions within the regime and regional instability, putting the country at risk of further fragmentation and conflict.",
    "published": null
  }
]