[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The Executive Board has responsibility for all decisions related to the business of World Athletics including developing and reviewing the World Athletics Strategic Plan; adopting and monitoring the annual plan and budget; appointing and monitoring the Chief Executive; financial planning and controlling income and expenditure; identifying and managing risks; and developing internal controls, organisational policies, procedures and systems (e.g., human resources, IT).",
    "published": null
  },
  {
    "title": "World Athletics President Coe discusses sport’s path with Future Leaders in Apeldoorn | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/sebastian-coe-sport-path-future-leaders-apeldoorn",
    "snippet": "World Athletics President <strong>Sebastian Coe</strong> held a wide-ranging discussion with members of the European Athletics Future Leaders Forum in Apeldoorn, the Netherlands, on Friday (7).",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "Included in its charge is the standardization of rules and regulations for the sports, certification of athletic facilities, recognition and management of world records, and the organisation and sanctioning of athletics competitions, including the World Athletics Championships.",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "The Athletes’ Commission members on the Council are exempted from the one Member Federation rule. There is a minimum gender requirement in the composition of Council. Of the total 26 members, there must be a minimum of: ... 13 of each gender for the elections in 2027 and thereafter (ie 50%). This target has been met four years earlier than the Constitution prescribed. Council has the powers and responsibilities to develop the World Plan for athletics and approve and review the World Athletics Strategic Plan; adopt, amend and repeal rules and regulations; decide all matters relating to the co",
    "published": null
  },
  {
    "title": "World Athletics sets ambitious targets with three-year gender leadership strategy | World Athletics",
    "url": "https://worldathletics.org/women-in-athletics/news/world-athletics-targets-gender-leadership-strategy",
    "snippet": "World Athletics President <strong>Sebastian Coe</strong> said: “I am incredibly proud of the progress we’ve made to date to increase female representation in athletics – highlighted by our 50/50 gender balanced Council.",
    "published": null
  }
]