[
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "Aníbal Domingo Fernández, born on January 9, 1957, is an Argentine politician. He is a Justicialist Party member, a lawyer, and a certified public accountant. He has been a close supporter of former Presidents Néstor Kirchner and Cristina Fernández de Kirchner.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "Aníbal Domingo Fernández (born January 9, 1957) is an Argentine Justicialist Party politician, lawyer, and certified public accountant. Throughout his career, he has remained a close ally to the former Presidents Néstor Kirchner and Cristina Fernández de Kirchner.",
    "published": "November 15, 2025"
  },
  {
    "title": "\"El daño es superlativo\": Aníbal Fernández llamó a \"levantar la voz\" contra el Gobierno POLÍTICA El Intransigente",
    "url": "https://elintransigente.com/2025/12/el-dano-es-superlativo-anibal-fernandez-llamo-a-levantar-la-voz-contra-el-gobierno/",
    "snippet": "El exjefe de Gabinete, Aníbal Fernández, analizó la situación actual de Argentina en una entrevista con Radio 10 y se mostró duramente crítico con el Gobierno.",
    "published": "1 week ago"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Aníbal Fernández is a candidate for <strong>governor of the Province of Buenos Aires</strong> and currently chief of staff of the Minister’s Cabinet for the presidency. Previously, he served in the National Senate as representative for the province of Buenos ...",
    "published": null
  },
  {
    "title": "Buenos Aires Times | Aníbal Fernández: ‘I understand and share the president’s view on re-election’",
    "url": "https://www.batimes.com.ar/news/argentina/anibal-fernandez-there-will-be-a-guarantee-of-everybody-being-able-to-compete-so-that-there-are-no-complications.phtml",
    "snippet": "<strong>Security Minister</strong> Aníbal Fernández, who has won the confidence of both Alberto Fernández and Cristina Fernández de Krichner in his lengthy political career occupying posts of key importance in different Peronist governments, gave an interview ...",
    "published": "April 28, 2023"
  }
]