[
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "Although Axel Weber was tipped as one of the possible successors, he resigned from the ECB in protest at the bail out policies. <strong>Mario Draghi</strong> was chosen to become the next President of the ECB on 24 June 2011. Draghi was president from 1 November 2011 until 31 October 2019 (succeeded by Christine ...",
    "published": "September 25, 2025"
  },
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "On 2 July 2019, Christine Lagarde was nominated by the European Council to succeed <strong>Mario Draghi</strong> as President of the European Central Bank (ECB) on 1 November 2019.",
    "published": "6 days ago"
  },
  {
    "title": "Christine Lagarde - President of the European Central Bank | LinkedIn",
    "url": "https://de.linkedin.com/in/christinelagarde",
    "snippet": "President of the European Central Bank · Born in Paris in 1956, Christine Lagarde completed high school in Le Havre and attended Holton Arms School in Bethesda (Maryland, United States). She then graduated from law school at University Paris X, and obtained a Master’s degree from the Political ...",
    "published": "October 1, 2025"
  },
  {
    "title": "Christine Lagarde - European Central Bank",
    "url": "https://www.ecb.europa.eu/ecb/decisions/html/cvlagarde.en.html",
    "snippet": "Christine Lagarde, President of the European Central Bank",
    "published": "November 22, 2023"
  },
  {
    "title": "Christine Lagarde appointed President of the European Central Bank - Consilium",
    "url": "https://www.consilium.europa.eu/en/press/press-releases/2019/10/18/christine-lagarde-appointed-president-of-the-european-central-bank/",
    "snippet": "Christine Lagarde will replace the outgoing President, <strong>Mario Draghi</strong>, as of 1 November 2019.",
    "published": null
  }
]