[
  {
    "title": "Elected Officials | Georgia.gov",
    "url": "https://georgia.gov/elected-officials",
    "snippet": "The .gov means it’s official. Local, state, and federal government websites often end in .gov. State of Georgia government websites and email systems use “georgia.gov” or “ga.gov” at the end of the address.",
    "published": "August 15, 2023"
  },
  {
    "title": "Elected Officials In The State Of Georgia | Georgia Secretary of State",
    "url": "https://sos.ga.gov/page/elected-officials-state-georgia",
    "snippet": "Please click on the links below to find out more about Georgia&#x27;s elected officials. To find your specific representatives, please visit My Voter Page. ... <strong>Governor Brian P.</strong>",
    "published": null
  },
  {
    "title": "Georgia Elected Officials: Congress, Governor, Legislators - 270toWin",
    "url": "https://www.270towin.com/elected-officials/georgia",
    "snippet": "Georgia members of Congress; map of district borders; race rating for 2026 elections. Locate elected federal and state officials for any address.",
    "published": null
  },
  {
    "title": "Your Government | Georgia.gov",
    "url": "https://georgia.gov/your-government",
    "snippet": "Call 1-800-GEORGIA to verify that a website is an official website of the State of Georgia. ... Learn more about Georgia&#x27;s state government, how it works, and ways to get involved. See who currently holds office in our state’s government.",
    "published": null
  },
  {
    "title": "Georgia state executive offices - Ballotpedia",
    "url": "https://ballotpedia.org/Georgia_state_executive_offices",
    "snippet": "Executive officials in Georgia are part of a three-pronged government structure that includes state legislators and state judges. The following chart details the relationship among different branches of Georgia&#x27;s state government: Click here to view a large scale image of the Georgia state government organizational chart. There are no regularly scheduled state executive elections in Georgia in 2025...",
    "published": null
  }
]