[
  {
    "title": "Taoiseach - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taoiseach",
    "snippet": "In contrast, the office of Taoiseach as <strong>created in 1937</strong> possesses a much more powerful role. The holder of the position can both advise the President to dismiss ministers and dissolve Parliament on his own authority—advice that the President is almost always required to follow by convention.",
    "published": "4 days ago"
  },
  {
    "title": "Records of Irish heads of government since 1922 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Records_of_Irish_heads_of_government_since_1922",
    "snippet": "The Taoiseach (plural: Taoisigh) ... to as the President of the Executive Council. This office was first held by <strong>W. T. Cosgrave from 1922 to 1932, and then by Éamon de Valera from 1932 to 1937</strong>....",
    "published": "November 19, 2025"
  },
  {
    "title": "Taoiseach | Meaning, Pronunciation, & List of Heads of Government of Ireland | Britannica",
    "url": "https://www.britannica.com/topic/taoiseach",
    "snippet": "Taoiseach calls for Herzog Park renaming plan to be withdrawn • Nov. 30, 2025, 2:52 AM ET (BBC) ... taoiseach, head of government of Ireland. The office of taoiseach (prime minister) was <strong>created by the Irish constitution of December 29, 1937</strong>.",
    "published": "April 5, 2024"
  },
  {
    "title": "Department of the Taoiseach - gov.ie",
    "url": "https://www.gov.ie/en/organisation/department-of-the-taoiseach/",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "Department of the Taoiseach - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Department_of_the_Taoiseach",
    "snippet": "Under the Constitution (Consequential Provisions) Act 1937, the Department of the President of the Executive Council was renamed as the Department of the Taoiseach from and after the coming into operation of the Constitution of Ireland, which occurred on 29 December 1937.",
    "published": "October 21, 2025"
  }
]