[
  {
    "title": "New America (organization) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_America_(organization)",
    "snippet": "New America, formerly the New America Foundation, is an American liberal think tank <strong>founded in 1999</strong>. It focuses on a range of public policy issues, including national security, technology, health, gender, energy, education, and the economy. The organization is based in Washington, D.C., and ...",
    "published": "2 weeks ago"
  },
  {
    "title": "New America (New America Foundation) - InfluenceWatch - InfluenceWatch",
    "url": "https://www.influencewatch.org/non-profit/new-america-foundation/",
    "snippet": "<strong>Ted Halstead founded New America and was president and CEO from 1999-2007</strong>. Halstead convinced liberal commentator Bill Moyers, the former press secretary for President Lyndon Johnson, to back the project.",
    "published": "May 2, 2023"
  },
  {
    "title": "New America | Learn & Work Ecosystem Library",
    "url": "https://learnworkecosystemlibrary.com/organizations/new-america/",
    "snippet": "<strong>Founded in 1999</strong>, New America is a liberal think tank and 501(c)(3) nonprofit organization focused on research and policy recommendations aimed at &quot;realizing the promise of America in an era of rapid technological and social change.&quot;",
    "published": "May 14, 2025"
  },
  {
    "title": "New America Foundation - SourceWatch",
    "url": "https://www.sourcewatch.org/index.php/New_America_Foundation",
    "snippet": "With an emphasis on big ideas, ... in critical areas, bringing promising new ideas and debates to the fore.&quot;[1] The foundation, which was <strong>launched in 1999</strong>, has as its CEO Steve Coll, a staff writer with The New Yorker magazine while the chairman of the Board of Directors ...",
    "published": null
  },
  {
    "title": "Our Story",
    "url": "https://www.newamerica.org/our-story/",
    "snippet": "We are dedicated to realizing the promise of America in an era of rapid technological and social change. At New America, our research and policy recommendations focus on five key thematic areas: education and work; family economic security and wellbeing; global politics for people and planet; political reform and civic engagement; and technology and democracy.",
    "published": null
  }
]