[
  {
    "title": "Marcelo Ebrard se queda en Morena: “Siempre voy a estar buscando la presidencia de la República” | Elecciones mexicanas 2024 | EL PAÍS México",
    "url": "https://elpais.com/mexico/2023-11-13/marcelo-ebrard-se-queda-en-morena-siempre-voy-a-estar-buscando-la-presidencia-de-la-republica.html",
    "snippet": "<strong>Marcelo Ebrard permanecerá en Morena</strong>.",
    "published": "November 13, 2023"
  },
  {
    "title": "Marcelo Ebrard - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Ebrard",
    "snippet": "On 20 June 2024, president-elect Sheinbaum announced Ebrard&#x27;s appointment to serve as Secretary of the Economy in her cabinet as of 1 October 2024. Considered a <strong>moderate member of MORENA</strong>, his appointment as Secretary of the Economy led the peso to rise as high as 0.9% against the United States ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Las reacciones a la permanencia de Marcelo Ebrard en Morena: “Esta es su casa y su causa” | Elecciones mexicanas 2024 | EL PAÍS México",
    "url": "https://elpais.com/mexico/elecciones-mexicanas/2023-11-13/las-reacciones-a-la-permanencia-de-marcelo-ebrard-en-morena-esta-es-su-casa-y-su-causa.html",
    "snippet": "El titular del Ejecutivo ya había dicho la semana pasada que el excanciller, su aliado político desde hace 24 años, era “libre” de tomar una decisión sobre su permanencia o salida del partido, aunque también lanzó un duro mensaje sobre el costo político que entrañaba distanciarse de Morena. “Quien no tiene ideales, quien no piensa en el pueblo es un politiquero, un arribista, un grillo, no puede llamarse político”, declaró el mandatario. “Se lucha por ideales, se lucha por principios, no se lucha por cargos”, afirmó López Obrador. “Buena noticia que Ebrard continúe siendo parte de nuestro movimiento y se reconozca el liderazgo de la Doctora Sheinbaum”, declaró Citlalli Hernández, secretaria general de Morena.",
    "published": "November 13, 2023"
  },
  {
    "title": "APEC summit, internet coverage, 2024 presidential candidates for MC and Morena | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/apec-summit-internet-coverage-2024-presidential-candidates-mc-and-morena",
    "snippet": "<strong>Marcelo Ebrard has declared his continued affiliation with Morena</strong> and has reached a political understanding with presumed presidential candidate Claudia Sheinbaum. The former Foreign Minister welcomed Morena&#x27;s acknowledgment of irregularities ...",
    "published": null
  },
  {
    "title": "Conoce a Marcelo Ebrard Casaubón, senador electo por Morena - El Heraldo de México",
    "url": "https://heraldodemexico.com.mx/edicion-impresa/2024/7/19/conoce-marcelo-ebrard-casaubon-senador-electo-por-morena-622379.html",
    "snippet": "Marcelo Ebrard Casaubón nació ... la LXVI Legislatura en el Senado de la República representando al partido <strong>Movimiento de Regeneración Nacional</strong> (Morena......",
    "published": null
  }
]