[
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "La France Insoumise was founded on <strong>10 February 2016</strong>, based on the belief that traditional parties and political organisations no longer serve democracy.",
    "published": "5 days ago"
  },
  {
    "title": "La France Insoumise group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise_group",
    "snippet": "The La France Insoumise – New Popular Front group (French: Groupe parlementaire La France Insoumise – Nouveau Front Populaire) is a parliamentary group in the National Assembly <strong>founded following the 2017 legislative election</strong>.",
    "published": "October 26, 2025"
  },
  {
    "title": "La France Insoumise | Encyclopedia MDPI",
    "url": "https://encyclopedia.pub/entry/34009",
    "snippet": "La France Insoumise was founded on <strong>10 February 2016</strong>,[1] based on the belief that traditional parties and political organisations no longer serve democracy and instead transverse movements are needed.[2] The movement is particularly inspired ...",
    "published": "November 15, 2022"
  },
  {
    "title": "La France insoumise - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/La_France_insoumise",
    "snippet": "La France Insoumise (pronounced ... democratic socialist, left-wing populist political party in France , <strong>launched on 10 February 2016 by Jean-Luc Mélenchon</strong>, then a Member of the European Parliament (MEP) and former co-president ...",
    "published": "October 5, 2025"
  },
  {
    "title": "La France Insoumise: tradition and change on the French Left | Counterfire",
    "url": "https://www.counterfire.org/article/la-france-insoumise-tradition-and-change-on-the-french-left/",
    "snippet": "As tensions rise in Paris, John Mullen gives a cool-headed tour of the French Left The France Insoumise,[1] a radical Left movement (deliberately not a party), <strong>founded in 2016</strong> and led by Jean-Luc Mélenchon, who was previously (from 1976 to ...",
    "published": null
  }
]