[
  {
    "title": "Banijay Entertainment - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banijay_Entertainment",
    "snippet": "Banijay Entertainment was formed in January 2008 through the successive acquisition of production companies, first in France then internationally under the leadership of <strong>Stéphane Courbit</strong> (who was previously the CEO of Endemol France) alongside Groupe Arnault, the Agnelli and De Agostini families ...",
    "published": "1 day ago"
  },
  {
    "title": "Banijay Group is a leader in the entertainment business",
    "url": "https://group.banijay.com/who-we-are/",
    "snippet": "As an engineer passionate with sports and tech, <strong>Nicolas Béraud</strong> is the CEO of Banijay Gaming and founder of Betclic. He created Sport4fun.com with Eric Moncada in 2000 before founding Betclic in London in 2005. He left the company in 2011 to create TripleFun, which develops games for mobile.",
    "published": "May 24, 2024"
  },
  {
    "title": "Stéphane Courbit - Banijay",
    "url": "https://www.banijay.com/people/stephane-courbit/",
    "snippet": "In January 2008, Courbit created Banijay Group, and in 2016, he triggered the merger between Banijay Group and Zodiak Media, making him the leader of the world’s largest independent production and distribution company (over 3 billion Euro business), responsible for global hit brands including Temptation Island, Survivor, Wife Swap and Versailles.",
    "published": "April 3, 2024"
  },
  {
    "title": "Our People - Banijay",
    "url": "https://www.banijay.com/our-people/",
    "snippet": "<strong>Stéphane Courbit</strong> is a French entrepreneur and Chairman of Banijay Group.",
    "published": "February 26, 2024"
  },
  {
    "title": "Our Story - Banijay",
    "url": "https://www.banijay.com/our-story/",
    "snippet": "Banijay is the world&#x27;s largest independent content creation Group for television and multimedia platforms. Banijay is present in 16 territories. ... We are a collective of multi-talented on and off-screen creatives from 25 territories, united in ambition and diverse in thinking.",
    "published": "November 24, 2016"
  }
]