[
  {
    "title": "List of all Prime Ministers of India (1947-2025) | India PM List",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1",
    "snippet": "List of all Prime Ministers of India till 2025: <strong>Narendra Modi</strong> is the current and 14th Prime Minister of India who assumed office on 10 June 2024. Jawaharlal Nehru is the first and the longest-serving Prime Minister of India while Indira Gandhi ...",
    "published": "August 22, 2025"
  },
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "The prime minister unilaterally controls the selection and dismissal of members of the council; and allocation of posts to members within the government. This council, which is collectively responsible to the Lok Sabha as per Article 75(3), assists the president regarding the operations under the latter&#x27;s powers; however, by the virtue of Article 74 of the Constitution, such &#x27;aid and advice&#x27; tendered by the council is binding. Since 1947, India has had 14 prime ministers.",
    "published": "1 week ago"
  },
  {
    "title": "Prime Ministers of India List From 1947 to 2025 PDF",
    "url": "https://guidely.in/blog/list-of-prime-ministers-of-india",
    "snippet": "This page provides a comprehensive list of Indian Prime Ministers, along with their tenures, constituencies, and political party affiliations, making it a valuable resource for students, exam aspirants, and political enthusiasts. Candidates can also download the Prime Ministers of India 2025 PDF in both English and Hindi using the link provided below.",
    "published": "1 week ago"
  },
  {
    "title": "Prime Ministers of India - Complete List from 1947 to 2025",
    "url": "https://www.bankbazaar.com/voter-id/list-of-prime-ministers-in-india.html",
    "snippet": "Prime Ministers of India - Know the complete list of prime ministers of India from independence. Find out their duration, political parties, and constituencies.",
    "published": null
  },
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "This was followed by the full terms of <strong>P. V. Narasimha Rao, Atal Bihari Vajpayee, Manmohan Singh, and Narendra Modi</strong>, who is the current prime minister of India, serving since 26 May 2014.",
    "published": "3 days ago"
  }
]