[
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "Various foreign officials attended ... Šefčovič (EU), and Rick Perry (United States). Zelenskyy is the first Jewish president of Ukraine; with <strong>Volodymyr Groysman</strong> as prime minister, Ukraine became the first country other than Israel to simultaneously have a Jewish head of state ...",
    "published": "1 day ago"
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "Zelenskyy offers to drop NATO bid for security guarantees but rejects US push to cede territory • Dec. 14, 2025, 4:25 PM ET (AP) Russia and Ukraine trade attacks as US and European officials prepare for peace talks • Dec. 13, 2025, 4:51 PM ET (AP) Show less ... Volodymyr Zelensky (born January 25, 1978, Kryvyy Rih, Ukraine, U.S.S.R. [now in Ukraine]) is a Ukrainian actor and comedian who was elected president of Ukraine in 2019.",
    "published": "September 27, 2019"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "On 18 June 2015 Yanukovych was officially deprived of the title of President of Ukraine. The 2019 election took place on 31 March, with a run-off on 21 April. As a result of this election, Volodymyr Zelenskyy, a former actor and comedian with no prior political experience, became the sixth President of Ukraine, scoring a record 73.22% of the popular vote in the run-off against incumbent Poroshenko.",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "Every president of Ukraine except for Volodymyr Zelenskyy has been a People&#x27;s Deputy of the Verkhovna Rada prior to their election, with <strong>Kuchma, Yushchenko, and Yanukovych</strong> all previously serving as Prime Minister and Kravchuk as well as acting ...",
    "published": "October 25, 2025"
  },
  {
    "title": "Volodymyr Zelensky | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/volodymyr-zelensky",
    "snippet": "Volodymyr Zelensky, born on January 25, 1978, in Kryvyi Rih, Ukraine, is a significant political figure who transitioned from a successful career in entertainment to become the sixth president of Ukraine in 2019. Prior to his presidency, Zelensky gained fame as a comedian and actor, especially noted for his role in the sitcom &quot;Servant of the People,&quot; where he portrayed a teacher who unexpectedly becomes president.",
    "published": null
  }
]