[
  {
    "title": "Progressive Party (Russia) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Progressive_Party_(Russia)",
    "snippet": "The Progressive Party (Russian: Прогрессивная партия), also known as the Progressists (Russian: прогрессисты), was a group of moderate Russian liberals <strong>organized in 1912</strong>. It had 25 deputies in the Third Duma and 48 in the Fourth.",
    "published": "May 1, 2025"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: ... Partiya Progressa), is a banned opposition political party in Russia <strong>founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018 by Alexei Navalny</strong>, who was also the founder of the non-profit organisation Anti-Corruption ...",
    "published": "1 month ago"
  },
  {
    "title": "Progressive Bloc | Liberal, Centrist & Reformist | Britannica",
    "url": "https://www.britannica.com/topic/Progressive-Bloc",
    "snippet": "Progressive Bloc, coalition of moderate conservatives and liberals in the fourth Russian Duma (elected legislative body) that tried to pressure the imperial government into adopting a series of reforms aimed at inspiring public confidence in the government and at improving the management of Russia’s effort in World War I.",
    "published": "July 20, 1998"
  },
  {
    "title": "Progressive Party of Russia (21st Century Crisis) | Alternative History | Fandom",
    "url": "https://althistory.fandom.com/wiki/Progressive_Party_of_Russia_(21st_Century_Crisis)",
    "snippet": "It forms one of the major political parties of The Opposition, and The Other Russia, two opposition blocs meant to oppose the current regime of Vladimir Putin. Despite being left-wing, the Russian Progressives stated that they are not aligned with, and actually also oppose the Communist Party. Throughout its history, it has received heavy funding from the United States, United Kingdom, Germany and France, though the Russian Progressives deny this.",
    "published": null
  },
  {
    "title": "Progressive Bloc (Russia) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Progressive_Bloc_(Russia)",
    "snippet": "<strong>The Progressive Bloc was an alliance of political forces in the Russian Empire in the early twentieth century</strong>. It held 236 of the 442 seats in the Imperial Duma. The Bloc was formed when the Duma was recalled to session during World War I, one ...",
    "published": "November 10, 2025"
  }
]