[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "It largely replaced the original ... hours before Eurosport&#x27;s startup, under the brand <strong>Sky Europe</strong>. Eurosport was closed down in May 1991 after rival Screensport channel filed a complaint to the European Commission over the corporate structure. The channel was saved later that month when the ...",
    "published": "2 days ago"
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "Eurosport 1 is a television sports network channel which is a division of Eurosport and a subsidiary of EMEA version of <strong>Warner Bros. Discovery</strong>. Discovery took a 20% minority interest share in December 2012, and became majority shareholder in the Eurosport venture with TF1 in January 2014, taking ...",
    "published": "1 week ago"
  },
  {
    "title": "Eurosport and BT Sport will disappear after TNT Sports rebrand | TNT Sports | The Guardian",
    "url": "https://www.theguardian.com/media/2023/feb/21/eurosport-bt-sport-disappear-tnt-rebrand-tv",
    "snippet": "<strong>WBD</strong>, which has a call option to take full control of the joint venture until September 2026, took a 20% stake in Eurosport in 2012 before taking full ownership from French media group TF1 in 2015.",
    "published": "September 25, 2024"
  },
  {
    "title": "Eurosport",
    "url": "https://wikideck.com/Eurosport",
    "snippet": "Five days later, that channel&#x27;s transponder space was taken over by RTL II. Eurosport eventually came under a French consortium comprising the <strong>TF1 Group, Canal+ Group and Havas Images</strong>. In January 2001, TF1 took full ownership of Eurosport.",
    "published": null
  },
  {
    "title": "Eurosport - Wikipedia",
    "url": "http://easo.starbirdmusic.com/try-https-en.wikipedia.org/wiki/Eurosport",
    "snippet": "For a period of time, some of Sky Channel&#x27;s former pan-European programming was broadcast in the hours before Eurosport&#x27;s startup, under the brand Sky Europe.[4] Eurosport was closed down in May 1991 after the competing Screensport channel filed a complaint to the European Commission over the corporate structure.[5] The channel was saved when the TF1 Group (formed after the French government privatized the post ORTF-split TF1 5 years prior to the acquisition) stepped in to replace BSkyB as joint-owners.",
    "published": "July 22, 2022"
  }
]