[
  {
    "title": "2024–2025 Georgian political crisis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–2025_Georgian_political_crisis",
    "snippet": "Two hundred members of the National Bank of Georgia stated that the suspension of preparations for EU accession negotiations was unconstitutional because it opposed Article 78 of the constitution. On 3 December 2024, political scientist Stephen F. Jones stated that Ivanishvili had become &quot;the unaccountable and unchecked ruler&quot; of Georgia, and that Ivanishvili&#x27;s government was &quot;on the brink of collapse&quot;.",
    "published": "November 12, 2025"
  },
  {
    "title": "The People vs Georgian Dream: Who Will Win in 2025? | Davis Center",
    "url": "https://daviscenter.fas.harvard.edu/insights/people-vs-georgian-dream-who-will-win-2025",
    "snippet": "Will Georgia in 2025 resume its three-decade-long foreign policy of moving toward Europe after the breakdown of EU membership negotiations, the result of Georgian Dream’s antidemocratic legislation and hostility to the West since 2021–2022? ... On December 28, the popularly elected Georgian President Salome Zurabishvili left the Orbeliani presidential palace in downtown Tbilisi, her six-year term having expired.",
    "published": null
  },
  {
    "title": "Georgia: Repressive Laws Effectively Criminalize Peaceful Protests | Human Rights Watch",
    "url": "https://www.hrw.org/news/2025/12/04/georgia-repressive-laws-effectively-criminalize-peaceful-protests",
    "snippet": "(Berlin, December 4, 2025) – <strong>Georgian authorities have adopted a series of laws that unjustifiably interfere with the right to peaceful assembly and are being used to suppress dissent</strong>, Human Rights Watch said today.",
    "published": "2 weeks ago"
  },
  {
    "title": "LIVE December 9, 2025 Election (updated) | 11alive.com",
    "url": "https://www.11alive.com/elections",
    "snippet": "<strong>Georgia is holding two special elections for House District 121 and House District 23.</strong>",
    "published": null
  },
  {
    "title": "Election results from Dec. 2, 2025 - Ballotpedia News",
    "url": "https://news.ballotpedia.org/2025/12/09/election-results-from-dec-2-2025/",
    "snippet": "In the special general election runoff for Georgia House of Representatives District 106, <strong>Muhammad Akbar Ali (D) won with 947 votes, defeating Marqus Cole (D).</strong> The special general election was held on Nov. 4, and the filing deadline passed on Sept. 16. The election was called after Shelly ...",
    "published": null
  }
]