[
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Entre 1985 y 1987 fue <strong>secretario administrativo del Movimiento Peronista</strong> de dicha Cámara y luego accedió a la secretaría administrativa de esta institución. Durante el gobierno del Presidente Duhalde, Fernández fue designado secretario ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "He has held several cabinet positions ... He served as <strong>Minister of Production under Eduardo Duhalde, as Interior Minister under Néstor Kirchner, as Minister of Justice under Cristina Fernández de Kirchner, and as the President&#x27;s Cabinet Chief from 2009 to 2011.</strong>...",
    "published": "November 15, 2025"
  },
  {
    "title": "Aníbal Fernández | Actor",
    "url": "https://www.imdb.com/name/nm4686433/",
    "snippet": "Aníbal Fernández. Self: Milagros en campaña. Aníbal Fernández is known for <strong>Milagros en campaña (2015), El ángel de la medianoche (1999) and Vértigo (2010)</strong>.",
    "published": null
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "However, he resigned from this role when President Néstor Kirchner appointed him <strong>Interior Minister</strong> later that year. After the 2009 mid-term elections, Aníbal Fernández was chosen to become the President&#x27;s Cabinet Chief.",
    "published": null
  },
  {
    "title": "The disgraceful Aníbal Fernández was reelected as president of the CAH",
    "url": "https://derechadiario.com.ar/us/argentina/unpresentable-anibal-fernandez-was-reelected-as-president-cah",
    "snippet": "Previously, Fernández had been in charge of the confederation in a first stage between 2013 and 2016, when he was still <strong>president of Quilmes, National Senator, and General Secretary of the convicted Cristina Fernández de Kirchner</strong>.",
    "published": "April 27, 2025"
  }
]