[
  {
    "title": "Alexander De Croo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_De_Croo",
    "snippet": "Alexander De Croo was born on 3 ... Minister of State Herman De Croo and his wife Françoise Desguin. <strong>In 1993, he attended the Vrije Universiteit Brussel where he graduated in 1998 in Business Engineering</strong>. He attended Northwestern University in Evanston, Illinois, in 2002, ...",
    "published": "1 week ago"
  },
  {
    "title": "Alexander De Croo wiki | TheReaderWiki",
    "url": "https://thereaderwiki.com/en/Alexander_De_Croo",
    "snippet": "Alexander De Croo was born on 3 ... of State Herman De Croo and his wife Françoise Desguin.[5] <strong>In 1993, he attended the Vrije Universiteit Brussel where he graduated in 1998 in Business Engineering</strong>....",
    "published": null
  },
  {
    "title": "Family tree of Alexander De Croo - Geneastar",
    "url": "https://en.geneastar.org/genealogy/dealexander/alexander-de-croo",
    "snippet": "<strong>In 1993, he attended the Vrije Universiteit Brussel where he graduated in 1998 in Business Engineering</strong>. He attended Northwestern University in Evanston, Illinois, in 2002, and completed an MBA at the Kellogg School of Management in 2004.",
    "published": null
  },
  {
    "title": "VUB alumnus Alexander De Croo becomes Prime Minister of Belg | Vrije Universiteit Brussel",
    "url": "https://www.vub.be/en/news/vub-alumnus-alexander-de-croo-becomes-prime-minister-belg",
    "snippet": "493 days after the last federal elections, the political parties PS, sp.a, Groen, Ecolo, CD&amp;V, MR and Open VLD form a Belgian government. The government will be headed by Alexander De Croo, <strong>45 years old and alumnus of VUB, where he graduated with great distinction as a commercial engineer</strong>.",
    "published": "April 3, 2024"
  },
  {
    "title": "Alexander De Croo - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q476596",
    "snippet": "Waarnemend burgemeester van Brakel geeft sjerp door aan <strong>Alexander De Croo</strong>: &quot;Blijven luisteren naar de mensen&quot; (Dutch) publication date · 2 February 2025 · retrieved · 4 February 2025 · author name string · VRT NWS · educated at · Vrije ...",
    "published": null
  }
]