[
  {
    "title": "Svenja Huth stats and ratings | Sofascore",
    "url": "https://www.sofascore.com/football/player/svenja-huth/68254",
    "snippet": "Transfer history · Svenja Huth is 34 years old (Jan 25, 1991), 163 cm tall and plays for VfL Wolfsburg. Svenja Huth prefers to play with right foot. His jersey number is 10. Svenja Huth career statistics, match ratings, heatmap and goals are available on Sofascore for current and previous seasons.",
    "published": null
  },
  {
    "title": "Svenja Huth stats and transfer history - AiScore",
    "url": "https://www.aiscore.com/player-svenja-huth/vrqwniopo3hoqn2",
    "snippet": "Svenja Huth Info AiScore player value for Svenja Huth is 0.17M. He has a contract with VfL Wolfsburg Women until -. Svenja Huth&#x27;s jersey number is 10. Svenja Huth is 34 years old，birthday is 1991/01/25 UTC, and he is 163 cm tall and 54 kg.",
    "published": null
  },
  {
    "title": "Svenja Huth Stats | Soccerway",
    "url": "https://www.soccerway.com/player/huth-svenja/4Yq5cXl3/",
    "snippet": "View the player profile of Svenja Huth (Wolfsburg) on Soccerway. Career stats, injuries and transfer history.",
    "published": null
  },
  {
    "title": "Svenja Huth (Wolfsburg) Stats - Flashscore.com",
    "url": "https://www.flashscore.com/player/huth-svenja/4Yq5cXl3/",
    "snippet": "Help: You are on the player profile of Svenja Huth, Wolfsburg. View Svenja Huth stats in detail (appearances, goals, cards / leagues, cups, national team), transfer value, contract length, transfer history including transfer fees, injury updates or unique player ratings from previous matches.",
    "published": null
  },
  {
    "title": "Svenja Huth",
    "url": "https://grokipedia.com/page/Svenja_Huth",
    "snippet": "FFC Frankfurt, where she developed ... League triumph over Paris Saint-Germain.[5] She later <strong>moved to Turbine Potsdam in 2015 before transferring to VfL Wolfsburg in 2019,</strong> where she has since become club captain and helped secure ...",
    "published": null
  }
]