[
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "Much of Dawkins’s work has generated debate for asserting the supremacy of science over religion in explaining the world. He also asserts that laws of probability preclude the existence of an omnipotent creator. After earning his master’s and doctorate degrees in zoology in 1966 at the University of Oxford under famed ethologist Nikolaas Tinbergen (who was best known for his work with both instinctive and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "In his own work, Maeterlinck tried to explain memory in termites and ants by stating that neural memory traces were added &quot;upon the individual mneme&quot;. Nonetheless, the author James Gleick describes Dawkins&#x27;s concept of the meme as &quot;his most famous memorable invention, far more influential than his selfish genes or his later proselytising against religiosity&quot;. In 2006 Dawkins founded the Richard Dawkins Foundation for Reason and Science (RDFRS), a non-profit organisation.",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins Biography - Facts, Childhood, Family Life & Achievements",
    "url": "https://www.thefamouspeople.com/profiles/clinton-richard-dawkins-2646.php",
    "snippet": "A behind-the-scene look at the life of Richard Dawkins.",
    "published": null
  },
  {
    "title": "Richard Dawkins - Students | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/students/article/Richard-Dawkins/603802",
    "snippet": "More books followed, including ... and Climbing Mount Improbable (1996). <strong>In 1995 Dawkins was made the Charles Simonyi professor of public understanding of science at Oxford University</strong>....",
    "published": null
  },
  {
    "title": "Richard Dawkins - Oxford Reference",
    "url": "https://www.oxfordreference.com/display/10.1093/oi/authority.20110803095703340",
    "snippet": "(1941– )British scientist whose ... Nairobi, Kenya, Dawkins <strong>studied at Oxford, then taught at the University of California, Berkeley (1967–69), before returning to Oxford as a fellow of New College</strong>....",
    "published": null
  }
]