[
  {
    "title": "Mark A. Aguiar - Princeton University",
    "url": "https://collaborate.princeton.edu/en/persons/mark-a-aguiar/",
    "snippet": "Dive into the research topics where Mark A. Aguiar is active. These topic labels come from the works of this person. Together they form a unique fingerprint. ... Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory ...",
    "published": null
  },
  {
    "title": "Mark Aguiar | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/people/mark-aguiar",
    "snippet": "He <strong>specializes in macroeconomics and international economics, and his research focuses on models of consumption and savings</strong>. Mark&#x27;s interests include life cycle consumption and savings, sovereign debt, and current account dynamics.",
    "published": null
  },
  {
    "title": "Mark A. Aguiar",
    "url": "https://gceps.princeton.edu/mark-a-aguiar/",
    "snippet": "<strong>From 1989-1995, as a US Department of State foreign service officer, he served in embassies in Seoul and Beijing, and also in the Office of Japanese Affairs in Washington, DC</strong>. Aguiar received his BA in history and Chinese from Brown University, ...",
    "published": null
  },
  {
    "title": "Mark Aguiar - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Aguiar",
    "snippet": "He then went on to graduate study at the Massachusetts Institute of Technology, where he received a PhD in economics in 1999, writing a thesis titled The Information Content of Asset Prices and Emerging Market Crises under the direction of Ricardo J. Caballero and Daron Acemoglu. Aguiar was an assistant professor of economics at the University of Chicago Booth School of Business between 1999 and 2004, a senior economist at the Federal Reserve Bank of Boston from 2004 to 2006, and a tenured associate professor of economics at the University of Rochester from 2006 to 2011.",
    "published": "October 23, 2025"
  },
  {
    "title": "Mark Aguiar | IDEAS/RePEc",
    "url": "https://ideas.repec.org/e/pag57.html",
    "snippet": "Mark Aguiar &amp; Satyajit Chatterjee &amp; Harold L. Cole &amp; Zachary Stangebye, 2020. &quot;Self-Ful?lling Debt Crises, Revisited,&quot; PIER Working Paper Archive 20-003, Penn Institute for Economic Research, Department of Economics, University of Pennsylvania.",
    "published": null
  }
]