[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Navalny said the concept of political parties was &quot;outdated&quot;, and added his participation would make maintaining the party more difficult. However, he &quot;blessed&quot; the party and discussed its maintenance with its leaders. They, in turn, stated they wanted to eventually see Navalny as a member of the party. On 15 December 2012 Navalny expressed his support of the party, saying, &quot;The People&#x27;s Alliance is my party&quot;, but again refused to join it, citing the criminal cases against him.",
    "published": "2 days ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. In 2000, while he was still a student, Navalny joined <strong>Yabloko</strong>, ...",
    "published": "March 7, 2023"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "According to Navalny&#x27;s ally Lyubov Sobol, the goals of the party include &quot;real changes, real reforms&quot;, including increased property protections, a fair criminal-justice system and battling corruption, &quot;so that money from the budget does not flow into offshores and is not spent on yachts and palaces&quot;.",
    "published": "September 30, 2025"
  },
  {
    "title": "True Beliefs and Opportunism: Navalny’s Tangled Political Development - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/02/01/true-beliefs-and-opportunism-navalnys-tangled-political-development-a72797",
    "snippet": "In 1999, Navalny made his first foray into formal politics, joining the <strong>center-left pro-European liberal party, Yabloko</strong>.",
    "published": "September 1, 2025"
  },
  {
    "title": "2024 Russian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024_Russian_presidential_election",
    "snippet": "Other candidates also declared their candidacy but were barred for various reasons by the Central Election Commission (CEC). As was the case in the 2018 presidential election, the most prominent opposition leader, Alexei Navalny, was barred from running due to a prior criminal conviction seen ...",
    "published": "1 month ago"
  }
]