[
  {
    "title": "1. FFC Frankfurt - Stadion",
    "url": "https://ffc-frankfurt.de/fans/stadion.html",
    "snippet": "Am 28. Februar 2016, vor dem FFC-Heimspiel gegen den 1. FC Köln in der Allianz Frauen-Bundesliga, wurde das drittgrößte Fußballstadion der Stadt offiziell von Frankfurts Oberbürgermeister Peter Feldmann und dem hessischen Innenminister Peter Beuth an den 1.",
    "published": null
  },
  {
    "title": "Waldstadion (Frankfurt) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Waldstadion_(Frankfurt)",
    "snippet": "Waldstadion (German pronunciation: [ˈvalt.ʃtaːdi̯ɔn] ⓘ, Forest Stadium), currently known as <strong>Deutsche Bank Park for sponsorship purposes, is a retractable roof sports stadium in Frankfurt, Germany. The home stadium of the football club Eintracht Frankfurt, it was opened in 1925</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Stadium - Eintracht Frankfurt Pros",
    "url": "https://en.eintracht.de/stadium/",
    "snippet": "Since 1 July 2020, the Frankfurt arena has been known as <strong>Deutsche Bank Park</strong> – a name which harks back to its origins. The idea of turning what used to be a military shooting range by the Oberforsthaus into a sports park first came about around ...",
    "published": null
  },
  {
    "title": "PSD Bank Arena - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/PSD_Bank_Arena",
    "snippet": "The <strong>PSD Bank Arena</strong> (formerly known as Stadion am Bornheimer Hang) is a multi-use stadium in Bornheim, a district of Frankfurt am Main, Germany, and is best accessed by the Johanna-Tesch-Platz U-Bahn station (which is located on territory of ...",
    "published": "July 19, 2025"
  },
  {
    "title": "Where to Watch Frankfurt Football Teams: These Top Stadiums",
    "url": "https://www.travelingforsports.com/blog/frankfurt-football-stadiums/",
    "snippet": "Currently the home of Eintracht Frankfurt, <strong>Deutsche Bank Park</strong> was first opened in 1925. It now has a retractable roof, and a capacity of 58,000 for league matches, making it the seventh-largest stadium in Germany.",
    "published": "February 6, 2025"
  }
]