[
  {
    "title": "EQT Corporation | Affordable, Reliable, Clean Energy",
    "url": "https://www.eqt.com/",
    "snippet": "If EQT were a country, it would be the 12th largest natural gas producer in the world",
    "published": null
  },
  {
    "title": "EQT Corporation Profile",
    "url": "https://www.eqt.com/about/corporate-profile",
    "snippet": "EQT Corporation is a premier, vertically integrated <strong>American</strong> natural gas company with production and midstream operations focused in the Appalachian Basin. With operations in Pennsylvania, West Virginia and Ohio, we are dedicated to the development of our world-class asset base.",
    "published": null
  },
  {
    "title": "EQT AB - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_AB",
    "snippet": "EQT AB is a <strong>Swedish</strong> global investment organization founded in 1994. Its funds invest in private equity (EQT Private Capital Europe &amp; North America), infrastructure (EQT Infrastructure), real estate (EQT Real Estate), growth equity, and venture capital in Europe, North America, and Asia Pacific.",
    "published": "3 weeks ago"
  },
  {
    "title": "Eqtgroup",
    "url": "https://eqtgroup.com/about/history",
    "snippet": "Over the course of Sweden’s modern history, the Wallenberg family has been a main influencer of the country’s industrial, entrepreneurial and banking sphere, partly through its industrial holding company Investor AB, founded in 1916. Inspired by the Wallenberg family’s philosophy of responsible ownership, Conni Jonsson received a mandate from the board of Investor AB to establish EQT in 1994 with the backing from Investor AB, AEA Investors and SEB.",
    "published": null
  },
  {
    "title": "EQT Corporation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_Corporation",
    "snippet": "EQT is the largest natural gas producer in the Appalachian Basin with 19.802 trillion cubic feet equivalent of proved reserves across approximately 1.8 million gross acres, including approximately 1.5 million gross acres in the Marcellus Formation, as of December 31, 2019.",
    "published": "July 14, 2025"
  }
]