[
  {
    "title": "Sooronbay Jeenbekov - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/Sooronbay_Jeenbekov",
    "snippet": "Sooronbay Sharipovich Jeenbekov (Kyrgyz: Сооронбай Шарипович (Шарип уулу) Жээнбеков, Sooronbay Şaripoviç (Şarip uulu) Jéénbekov; ky or Sooronbay Zheenbekov; born 16 November 1958) is a Kyrgyz politician. He was the President of Kyrgyzstan. He officially took office on 24 November 2017. He was also the Prime Minister of Kyrgyzstan from April 2016 to August 2017. He resigned on 15 October 2020 due to the 2020 Kyrgyzstan protests.",
    "published": "August 14, 2025"
  },
  {
    "title": "Kyrgyzstan’s President Sooronbay Jeenbekov resigns",
    "url": "https://soyuz.by/en/geopolitics/kyrgyzstan-s-president-sooronbay-jeenbekov-resigns",
    "snippet": "<strong>The situation in Kyrgyzstan is close to a conflict between law enforcers and demonstrators</strong>, the outgoing leader said. &quot;Regrettably, the aggression continues unabated and demands for my resignation are still there.",
    "published": null
  },
  {
    "title": "Kyrgyz President Jeenbekov Offers Resignation – The Diplomat",
    "url": "https://thediplomat.com/2020/10/kyrgyz-president-jeenbekov-offers-resignation/",
    "snippet": "Jeenbekov urged Japarov and other politicians to withdraw their supporters from Bishkek. “No power is worth the integrity of our country and harmony in society.” · Constitutionally, the president’s powers will next transfer to the speaker of parliament, the newly appointed Kanat Isayev. But Isayev, the leader of the Kyrgyzstan party, is now the new target of cries for resignation.",
    "published": "October 15, 2020"
  },
  {
    "title": "President of Kyrgyzstan Sooronbay Jeenbekov resigns",
    "url": "http://kun.uz/en/51221676",
    "snippet": "Protests had erupted after the election on October 4 was won by parties loyal to Jeenbekov but opponents disagreed with the results and they were later annulled but this did not quell the tensions. “Peace in Kyrgyzstan, the integrity of the country, unity of our people and peace in the society are above all for me. I do not cling to power. I do not want to remain in the history of Kyrgyzstan as the President who shed blood and shot his citizens. For this reason, I have made the decision to resign,” Jeenbekov said in a statement released by his office.",
    "published": null
  },
  {
    "title": "Kyrgyzstan election: President Jeenbekov resigns after protests",
    "url": "https://www.bbc.com/news/world-asia-54553173",
    "snippet": "Sooronbay Jeenbekov warned the country was close to conflict after a disputed election.",
    "published": "October 15, 2020"
  }
]