[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "During his political career, Mélenchon crossed various tendencies of the French left, from Trotskyism in his youth to more moderate socialism, as he was in the <strong>Socialist Party for almost thirty years</strong>, occupying a place on the left wing of the party, before he began a companionship with the ...",
    "published": "2 days ago"
  },
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "La France Insoumise (LFI or FI; [la fʁɑ̃s ɛ̃sumiz], lit. &#x27;France Unbowed&#x27; or &#x27;France in Revolt&#x27;) is a left-wing political party in France. It was <strong>launched in 2016</strong> by Jean-Luc Mélenchon, then a Member of the European Parliament (MEP) and former co-president of the Left Party (PG).",
    "published": "2 days ago"
  },
  {
    "title": "Jean-Luc Mélenchon facts for kids",
    "url": "https://kids.kiddle.co/Jean-Luc_M%C3%A9lenchon",
    "snippet": "<strong>In 1976, Mélenchon joined the Socialist Party</strong>. He quickly became involved in local politics. He was elected as a town councillor in Massy in 1983. In 1986, he was elected to the Senate, the upper house of the French parliament.",
    "published": null
  },
  {
    "title": "Who Is Jean-Luc Melenchon? All About The New Popular Front Leader | Europe - Times Now",
    "url": "https://www.timesnownews.com/world/europe/who-is-jean-luc-melenchon-age-family-daughter-net-worth-controversies-new-popular-union-article-111560066",
    "snippet": "Jean-Luc Melenchon, born on August 19, 1951, in Tangier, Morocco, is the son of a postmaster and a primary school teacher.After working as a teacher for a while, Melenchon <strong>entered politics in September 1976 and joined the Socialist Party (PS).</strong>",
    "published": "July 7, 2024"
  },
  {
    "title": "Jean-Luc Mélenchon, the rabble-rouser leading the new French left – POLITICO",
    "url": "https://www.politico.eu/article/jean-luc-melenchon-rabble-rouser-leader-new-france-left/",
    "snippet": "The former Trotskyist has emerged as a commanding figure in France’s post-Socialist left after forging an unlikely left-wing alliance ahead of the legislative elections",
    "published": "May 22, 2022"
  }
]