[
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "Dr. Hilligje van’t Land serves the global higher education community as Secretary General of the International Association of Universities (IAU) - a global NGO with UNESCO Associate Status. The IAU will celebrate its 75th Anniversary in 2025.",
    "published": null
  },
  {
    "title": "Presidency — International Association of Universities",
    "url": "https://iau.global/presidency",
    "snippet": "She or he chairs the Administrative Board and the Executive Committee. The current IAU President, <strong>Professor Andrew Deeks</strong>, was elected during the IAU’s 16th General Conference in Dublin, Ireland in October 2022.",
    "published": null
  },
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "The IAU is composed of individual members, who include both professional astronomers and junior scientists, and national members, such as professional associations, national societies, or academic institutions. Individual members are organised into divisions, committees, and working groups centered on particular subdisciplines, subjects, or initiatives.",
    "published": "3 weeks ago"
  },
  {
    "title": "Governance Structure - IAU",
    "url": "https://www.iau-aiu.net/Governance-Structure",
    "snippet": "Elected for a 4-year non-renewable term, the IAU President is elected from among members of the Administrative Board by the General Conference. He/She chairs the Administrative Board and the Executive Committee.",
    "published": null
  },
  {
    "title": "2025 IAU Election Results and New Council Announcement - IAU - International Association of Ultrarunners",
    "url": "https://iau-ultramarathon.org/2025-iau-election-results-and-new-council-announcement.html",
    "snippet": "As the IAU embarks on this new term, President <strong>Nadeem Khan</strong> congratulates all council members on their new positions and expresses optimism for the future of the organization.",
    "published": "October 17, 2025"
  }
]