[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "On December 13, 2021, New Regency renewed their global distribution deal with Disney. This includes Disney&#x27;s handling of global theatrical distribution, home entertainment, and first pay rights for New Regency. New Regency&#x27;s sales team, led by Charlotte Thorp and primarily based out of London, United Kingdom will handle all other television and SVOD rights after the first pay window as well as other business development. In June 2025...",
    "published": "2 days ago"
  },
  {
    "title": "News | Regency Enterprises",
    "url": "https://newregency.com/news",
    "snippet": "EXCLUSIVE: New Regency has secured the film and television rights to Meg Mason’s novel Sorrow and Bliss in what was said to be a competitive situation.",
    "published": null
  },
  {
    "title": "Regency Centers Reports Fourth Quarter and Full Year 2024 Results | Regency Centers Corporation",
    "url": "https://investors.regencycenters.com/news-releases/news-release-details/regency-centers-reports-fourth-quarter-and-full-year-2024",
    "snippet": "... During the fourth quarter, ... an average price of $74.66 per share. Under the terms of its forward sale agreements, <strong>the Company has until December of 2025 to settle the transactions</strong>....",
    "published": null
  },
  {
    "title": "Investor Relations | Regency Centers Corporation",
    "url": "https://investors.regencycenters.com/",
    "snippet": "The Investor Relations website contains information about Regency Centers Corporation&#x27;s business for stockholders, potential investors, and financial analysts.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between Arnon Milchan, Scriba &amp; Deyle and Canal+ to finance 20 films in five years, with New Regency Productions acting as its production and sales arm. The company was originally known as Embassy International Pictures from 1982 until 1991.",
    "published": "2 weeks ago"
  }
]