[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. <strong>In 1995 he was named the first Simonyi Professor for the Public Understanding of Science</strong>, a position he held until 2008, and ...",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "Dawkins was named the first Charles Simonyi Professor for the Public Understanding of Science at Oxford (1995–2008). In that capacity he continued to publish prolifically and produced an array of television programs. His 1996 documentary Break the Science Barrier featured Dawkins conversing with an array of prominent scientists about their discoveries.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins: A Biography | Discovery Institute",
    "url": "https://www.discovery.org/a/10291/",
    "snippet": "The most readily recognizable figure in the Darwin debate, Dawkins <strong>retired in 2008 as Professor for Public Understanding of Science at Oxford University</strong>, a position he held from 1995, by which time he had effectively discontinued his career ...",
    "published": "October 15, 2024"
  },
  {
    "title": "OPEN DISCUSSION MARCH 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/2025/03/open-discussion-march-2025/",
    "snippet": "I happen to think that government service is an honorable profession, based partially on a 30 year career and even longer dealing with government workers while I was at a private law firm. Government employees work very hard every day to provide the services their agencies were designed for.",
    "published": "April 1, 2025"
  },
  {
    "title": "Richard Dawkins Net Worth 2025: Salary, Wealth, and Financial Overview",
    "url": "https://aupeo.com/richard-dawkins-net-worth/",
    "snippet": "During his tenure as <strong>Professor for Public Understanding of Science</strong> (1995–2008), Dawkins not only shaped the next generation of scientists but also contributed substantially to public science education.",
    "published": "February 19, 2025"
  }
]