[
  {
    "title": "DFG, German Research Foundation - News",
    "url": "https://www.dfg.de/en/about-us/international-cooperation/news",
    "snippet": "The DFG and the NRF are providing a co-funding opportunity for Korean-German joint workshops and research visits. <strong>Proposals must be submitted by 16 April 2025</strong>. Professor Dr. Katja Becker and H.E.",
    "published": null
  },
  {
    "title": "Katja Becker - Deutsche Forschungsgemeinschaft (DFG) - German Research Foundation | LinkedIn",
    "url": "https://www.linkedin.com/in/katja-becker-6b78ab76/",
    "snippet": "Katja Becker, President of the German Research Foundation (DFG) since 2020, studied… · Experience: Deutsche Forschungsgemeinschaft (DFG) - German Research Foundation · Education: Ruprecht-Karls-Universität Heidelberg · Location: Frankfurt Rhine-Main Metropolitan Area · 500+ connections on LinkedIn.",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - Professor Dr. Katja Becker - President of the DFG",
    "url": "https://www.dfg.de/en/about-us/statutory-bodies/executive-committee/members/becker",
    "snippet": "President of the DFG, Professor Dr. Katja Becker · © DFG / David Ausserhofer",
    "published": null
  },
  {
    "title": "DFG - German Research Foundation",
    "url": "https://www.dfg.de/en",
    "snippet": "<strong>The political breakthrough achieved in the negotiations strengthens Europe as a research hub and opens up new pathways towards climate-resilient and resource-efficient agriculture</strong>, says DFG President Katja Becker.",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - DFG to Leave the Platform X",
    "url": "https://www.dfg.de/en/service/press/press-releases/2025/press-release-no-01",
    "snippet": "Becker went on: “<strong>By leaving the platform, we are sending a clear message against the spread of fake news and the political instrumentalisation of social media</strong> – as are an increasing number of individuals and institutions within the research ...",
    "published": null
  }
]