[
  {
    "title": "Sundar Pichai - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sundar_Pichai",
    "snippet": "In April 2024, after 28 Google employees were fired for protesting against Project Nimbus, Pichai stated that the office is not a place &quot;to fight over disruptive issues or debate politics&quot;, and warned against using the company &quot;as a personal platform&quot;. Pichai was included in Time&#x27;s annual list of the 100 most influential people in 2016 and 2020. He was also included in the Time 100 AI list in 2024. He was awarded the 2021 ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Eric Schmidt - Former CEO and Chairman, Google; Chair and CEO of Relativity Space | LinkedIn",
    "url": "https://www.linkedin.com/in/eric-e-schmidt/",
    "snippet": "As Chairman and CEO of Google, He oversaw the company&#x27;s transformation from a small startup to one of the world’s most influential companies from 2001 to 2011. Under his leadership, alongside Sergey Brin and Larry Page, the company dramatically scaled its infrastructure and diversified its products, while maintaining a strong culture of innovation. Eric founded the Special Competitive Studies Project in 2021, a non-profit initiative focused on strengthening America’s long-term AI and technological competitiveness in national security, the economy, and society.",
    "published": "August 5, 2024"
  },
  {
    "title": "Who Is Sundar Pichai? What Is Artificial Intelligence?",
    "url": "https://www.investopedia.com/articles/investing/090815/look-sundar-pichai-googles-new-ceo.asp",
    "snippet": "When Google reorganized into Alphabet in August 2015, <strong>Sundar Pichai</strong> was selected as Google’s CEO. He joined the board of directors of Alphabet in July 2017. Under Pichai&#x27;s leadership, Google invested in new opportunities such as Google Cloud ...",
    "published": "December 27, 2022"
  },
  {
    "title": "About Eric - Eric Schmidt",
    "url": "https://ericschmidt.com/bio/",
    "snippet": "As Chairman and CEO of Google, he oversaw the company’s transformation from a small startup to one of the world’s most influential companies from 2001 to 2011. Prior to joining Google, Eric was Chairman and CEO of Novell, a software as a service company. He previously spent 14 years at Sun Microsystems, Inc., starting his career as a manager and rising to become their Chief Technology Officer.",
    "published": "August 13, 2025"
  },
  {
    "title": "Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Google",
    "snippet": "The lawsuit became known in March 2021 when a federal judge denied Google&#x27;s request to dismiss the case, ruling that they must face the group&#x27;s charges. Reuters reported that the lawsuit alleged that Google&#x27;s CEO <strong>Sundar Pichai</strong> ...",
    "published": "3 days ago"
  }
]