[
  {
    "title": "Government of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_India",
    "snippet": "The government is led by the president of India (currently <strong>Droupadi Murmu</strong> since 25 July 2022) who as head of state holds formal executive power, and thus (following parliamentary elections) appoints, as head of government, the prime minister, as well as other ministers.",
    "published": "1 month ago"
  },
  {
    "title": "About Us | Welcome to RASHTRAPATI BHAVAN - The Office and Residence of the President of India",
    "url": "https://www.rashtrapatibhavan.gov.in/about-us",
    "snippet": "About Us - The President of India is the head of state of the Republic of India. The President is the nominal head of the executive, the first citizen of the country, as well as the commander-in-chief of the Indian Armed Forces. Smt. <strong>Droupadi Murmu</strong> is the 15th and current President, having ...",
    "published": null
  },
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "This was followed by the full terms of P. V. Narasimha Rao, Atal Bihari Vajpayee, Manmohan Singh, and <strong>Narendra Modi</strong>, who is the current prime minister of India, serving since 26 May 2014. He is the first non-Congress leader to win three consecutive general elections and secure a third successive ...",
    "published": "3 days ago"
  },
  {
    "title": "Who's Who| National Portal of India",
    "url": "https://www.india.gov.in/my-government/whos-who",
    "snippet": "Lt. Governors &amp; Administrators ... This section gives you information about the persons holding the highest offices as well as respectable positions at the Executive, Judiciary, and Legislature levels in the country.",
    "published": null
  },
  {
    "title": "Home | President of India",
    "url": "https://www.presidentofindia.gov.in/",
    "snippet": "Smt. <strong>Droupadi Murmu</strong> was sworn in as the 15th President of India on 25 July, 2022. Previously, she was the Governor of Jharkhand from 2015 to 2021.",
    "published": null
  }
]