[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The McClatchy Company bought Knight Ridder in June 2006 with intentions of selling 12 Knight Ridder newspapers. On August 2, 2006, McClatchy sold the Beacon Journal to Black Press. In 2018, <strong>GateHouse Media</strong> bought the newspaper. On November 11, 2013, the Akron Beacon Journal printed its last ...",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal Sold to GateHouse Media, Owner of Columbus Dispatch, Canton Repository",
    "url": "https://www.clevescene.com/news/akron-beacon-journal-sold-to-gatehouse-media-owner-of-columbus-dispatch-canton-repository-17221068/",
    "snippet": "The Akron Beacon Journal has been ... Repository and a preponderance of smaller-town dailies. The ABJ’s current owner, <strong>Black Press Ltd.</strong>, is a Canadian company with papers in Alberta, British Columbia, California, Hawaii and ...",
    "published": "June 2, 2025"
  },
  {
    "title": "Gatehouse Media purchases Akron Beacon Journal - cleveland.com",
    "url": "https://www.cleveland.com/akron/2018/04/gatehouse_media_purchases_akro.html",
    "snippet": "The Akron Beacon Journal has been purchased by <strong>Gatehouse Media</strong> for an undisclosed sum. The sale was announced on Wednesday to the newspaper staff. Gatehouse, a subsidiary of New York-based New Media Investment Group Inc., has more than 140 daily ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/153167-50",
    "snippet": "Explore institutional-grade private ... our team of analysts. ... This information is available in the PitchBook Platform. To explore Akron Beacon Journal‘s full profile, request access. Request a free trial · Akron Beacon Journal was founded in 1838. Akron Beacon Journal is headquartered in Akron, OH. Akron Beacon Journal’s primary industry is Buildings and Property. Akron Beacon Journal is a Private company. The current valuation ...",
    "published": null
  },
  {
    "title": "Those were the days in Rubber City … but they had to end – Plain Dealing: Cleveland Journalists Tell Their Stories",
    "url": "https://pressbooks.ulib.csuohio.edu/plain-dealing/chapter/stuart-warner-on-the-glory-days-of-the-akron-beacon-journal/",
    "snippet": "I felt like crying when I first sat down to write this, only three days after it was announced that the Akron Beacon Journal had been sold to <strong>Gatehouse Media</strong>, another vulture capitalist group picking over the remains of the industry I love.",
    "published": "July 31, 2018"
  }
]