[
  {
    "title": "Arnon Milchan",
    "url": "https://www.forbes.com/profile/arnon-milchan/",
    "snippet": "<strong>Arnon Milchan owns film and TV production company New Regency Enterprises</strong>.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "In May 2016, New Regency announced that Brad Weston had stepped of the company as CEO and president after five years as <strong>Yariv Milchan the son of New Regency&#x27;s founder Arnon Milchan had joined the company and became their new chairman and CEO</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Regency Enterprises",
    "url": "https://grokipedia.com/page/Regency_Enterprises",
    "snippet": "Regency Enterprises, Inc., commonly ... 2025, <strong>Regency formed a long-term partnership with Shamrock Capital, providing library investment and production credit facilities to support future content creation without equity dilution</strong>.[7] Arnon ...",
    "published": null
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "Milchan has also successfully diversified his company’s activities within the sphere of entertainment, most specifically in the realm of television through Regency Television (“Malcom in the Middle” and “The Bernie Mac Show”), and sports where the company was once the largest shareholder of PUMA, the worldwide athletic apparel and show conglomerate based in Germany, which was later sold after a successful re-branding in 2003.",
    "published": null
  },
  {
    "title": "Arnon Milchan | Producer, Additional Crew, Actor",
    "url": "https://www.imdb.com/name/nm0586969/",
    "snippet": "After the incredible successes of his films &quot;Pretty Woman&quot; and &quot;The War of the Roses,&quot; Milchan founded New Regency Productions and went on to produce countless critical and box office successes including &quot;J.F.K,&quot; &quot;A Time to Kill,&quot; &quot;Free Willy,&quot; &quot;The Client,&quot; &quot;Tin Cup,&quot; &quot;Under Siege,&quot; &quot;The Devil&#x27;s Advocate,&quot; &quot;The Negotiator,&quot; &quot;City of Angels,&quot; &quot;Entrapment,&quot; &quot;Fight Club,&quot; &quot;Big Momma&#x27;s House,&quot; &quot;Don&#x27;t Say a Word,&quot; &quot;Daredevil,&quot; &quot;Man on Fire,&quot; &quot;Mr.",
    "published": null
  }
]