[
  {
    "title": "John Garamendi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Garamendi",
    "snippet": "<strong>In 1990, Garamendi became the first elected California insurance commissioner, serving from 1991 to 1995</strong>. He ran for governor in the 1994 election, losing in the Democratic primary. He left elective office and served as President Bill Clinton&#x27;s deputy secretary of the interior from 1995 to ...",
    "published": "3 weeks ago"
  },
  {
    "title": "John Garamendi - Ballotpedia",
    "url": "https://ballotpedia.org/John_Garamendi",
    "snippet": "Garamendi earned a B.A. from the University of California at Berkeley in 1966 and an M.B.A. from Harvard University in 1970. His career experience includes working as the <strong>deputy secretary of the United States Department of the Interior, a businessman, and a rancher</strong>.",
    "published": null
  },
  {
    "title": "John Garamendi | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/john-garamendi/G000559",
    "snippet": "John Garamendi, the Representative from California - in Congress from <strong>2009 through Present</strong>",
    "published": null
  },
  {
    "title": "Congressman John Garamendi |Representing the 8th District of California",
    "url": "https://garamendi.house.gov/",
    "snippet": "Garamendi &amp; California Dems Condemn Trump’s Plan to Pump Water Out of the Delta ... WASHINGTON, DC — Today, Representative John Garamendi (CA-08) led Representatives Ami Bera (CA-06), Mark DeSaulnier (CA-10), Josh Harder (CA-09), Jared Huffman (CA-02), Doris Matsui (CA-07), and Mike Thompson (CA-04) in condemning Acting Commissioner of the U.S.",
    "published": null
  },
  {
    "title": "About John Garamendi | Congressman John Garamendi",
    "url": "https://garamendi.house.gov/about",
    "snippet": "From <strong>1991 to 1995, and again from 2003 to 2006</strong>, Garamendi served as the California Insurance Commissioner, earning a reputation as the most effective protector of consumer interests in the nation. He successfully forced insurance companies to pay claims to policyholders and significantly curtailed ...",
    "published": "August 22, 2023"
  }
]