[
  {
    "title": "Business Council of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Business_Council_of_Australia",
    "snippet": "The Business Council of Australia was formed in 1983 from a merger of AIDA and the Business Roundtable. The board oversees the council&#x27;s secretariat, committees and task forces, makes recommendations about membership and appointments, and proposes policies. ... President: <strong>Geoff Culbert</strong> - Chair ...",
    "published": "April 1, 2025"
  },
  {
    "title": "Board - Business Council of Australia - V1",
    "url": "https://www.bca.com.au/board",
    "snippet": "President, Business Council of Australia · Read bio · Matt Comyn · Chief Executive Officer, Commonwealth Bank of Australia (CBA) Read bio · Karen Dobson · Former Managing Director, Dow Australia &amp; New Zealand · Read bio · <strong>Danny Gilbert</strong> AM · ...",
    "published": null
  },
  {
    "title": "Geoff Culbert - Business Council of Australia",
    "url": "https://www.bca.com.au/geoff_culbert",
    "snippet": "Geoff assumed the role of President of the Business Council of Australia in February 2024. Geoff is Chair of the NSW Fundraising Committee for the Australian Olympic Committee.",
    "published": null
  },
  {
    "title": "Business Council of Australia proposes five critical questions for the next Australian government - AICD",
    "url": "https://www.aicd.com.au/leadership/types/management/business-council-of-australia-proposes-five-critical-questions-for-the-next-australian-government.html",
    "snippet": "Former Sydney Airport CEO Geoff Culbert became president of the Business Council of Australia (BCA) in February 2024, when CEO <strong>Bran Black</strong>, a lawyer and former government adviser, was just six months into his new role at the powerful advocacy group.",
    "published": null
  },
  {
    "title": "Business Council of Australia | LinkedIn",
    "url": "https://au.linkedin.com/company/business-council-of-australia",
    "snippet": "I also canvassed the need for more stability around Australia’s climate policy, with a depoliticised process that everyone can sign up to. Business needs certainty to invest for the transition. Thanks to my co-panellists, Danielle Wood, Peter Burns and Sarah Hunter—and to John Kehoe, our host from the AFR. ... In his first speech as Business Council President Geoff Culbert warned The Australian Financial Review Business Summit that if we do not break from this short-term thinking cycle, which has taken hold in Australian society , we risk losing our competitive edge.",
    "published": null
  }
]