[
  {
    "title": "Maurice Steijn - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Maurice_Steijn",
    "snippet": "On 23 October 2023, a day after a 4–3 loss to Utrecht placed it second-from-last on the Eredivisie table, Ajax announced that it was parting ways with Steijn after just <strong>two wins through eleven matches in charge</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "Maurice Steijn nieuwe hoofdtrainer Ajax",
    "url": "https://www.ajax.nl/artikelen/maurice-steijn-nieuwe-hoofdtrainer-ajax",
    "snippet": "Het afgelopen seizoen eindigde Steijn met Sparta zeer verrassend op de zesde plaats in de Eredivisie om vervolgens nog de finale van de play-offs voor Europees voetbal te bereiken. Directeur Voetbalzaken Sven Mislintat: &quot;Maurice is inmiddels grofweg twintig jaar als trainer actief in het betaalde voetbal, waarvan ruim twaalf jaar als hoofdtrainer. Hij heeft bij alle clubs waar hij werkzaam was veel betere resultaten behaald dan vooraf werd verwacht.",
    "published": null
  },
  {
    "title": "Maurice Steijn - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/steijn-maurice/profil/trainer/13405",
    "snippet": "This is the profile site of the manager Maurice Steijn. The site lists all clubs he coached and all clubs he played for.",
    "published": null
  },
  {
    "title": "Maurice Steijn new head coach Ajax",
    "url": "https://english.ajax.nl/articles/maurice-steijn-new-head-coach-ajax",
    "snippet": "<strong>Last season Steijn finished on a surprising sixth place with Sparta in the Eredivisie and even reached the play-off final for European football</strong>. Director of Football Sven Mislintat: &quot;Maurice is now roughly 20 years active as a trainer in ...",
    "published": null
  },
  {
    "title": "Ajax sack manager Maurice Steijn after disastrous start to the season leaves Dutch giants in relegation zone amid worst run of results since 1954 | Goal.com",
    "url": "https://www.goal.com/en/news/ajax-sack-manager-maurice-steijn-dutch-giants-relegation-zone-worst-run-1954/blt4dd0f21aca8747d1",
    "snippet": "Maurice Steijn has left Ajax by mutual consent after a dismal run of results that has seen the team pick up just <strong>five points</strong>.",
    "published": "October 23, 2023"
  }
]