[
  {
    "title": "Office of the Director | NIST",
    "url": "https://www.nist.gov/director",
    "snippet": "This leads to improved quality of life and better and more jobs. NIST works with the private sector, other government agencies, and universities to develop and apply the technology, measurements and standards needed for new and improved products and services.",
    "published": "March 16, 2009"
  },
  {
    "title": "NIST Senior Leadership | NIST",
    "url": "https://www.nist.gov/director/leadership",
    "snippet": "<strong>Dr. Boehm</strong> is NIST&#x27;s Chief of Staff where he provides strategic guidance and advice to the NIST Director and senior leadership to help the Institute accomplish its mission by maximizing budgetary resources, expanding partnerships and improving ...",
    "published": "June 2, 2025"
  },
  {
    "title": "NIST Director Laurie Locascio to depart in January | FedScoop",
    "url": "https://fedscoop.com/nist-director-laurie-locascio-to-depart-in-january/",
    "snippet": "“<strong>Laurie Locascio</strong> embodies the right mix of visionary leadership, knowledge, and skills that will build on ANSI’s incredible successes and lead the Institute into the future,” Christian Dubay, chair of ANSI’s Board Search Committee, said ...",
    "published": "October 18, 2024"
  },
  {
    "title": "List of directors of the National Institute of Standards and Technology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_directors_of_the_National_Institute_of_Standards_and_Technology",
    "snippet": "The National Institute of Standards and Technology succeeded the National Bureau of Standards in 1988. Following is a list of the directors of both agencies. The number of NIST directors is a continuation of the number of NBS directors since Locascio is considered the 17th NIST director ...",
    "published": "3 weeks ago"
  },
  {
    "title": "NIST Director Laurie Locascio Stepping Down in January – MeriTalk",
    "url": "https://www.meritalk.com/articles/nist-director-laurie-locascio-stepping-down-in-january/",
    "snippet": "<strong>Laurie Locascio</strong> will be joining the American National Standards Institute (ANSI) as its CEO in January. She will continue to serve as Under Secretary of Commerce for Standards and Technology and NIST Director until then, providing leadership ...",
    "published": null
  }
]