[
  {
    "title": "Erik ten Hag - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Erik_ten_Hag",
    "snippet": "On 28 December 2017, <strong>Ten Hag</strong> was appointed as the head coach of Ajax after the club dismissed Marcel Keizer, and commenced in the role on 1 January 2018 on a two-and-a-half year contract. He signed a deal until June 2020. He arrived at a team that had already been eliminated from the domestic ...",
    "published": "3 weeks ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "<strong>John Heitinga</strong> is the new head coach of Ajax. After years in the youth academy, hundreds of matches for Ajax’s first team, various coaching roles at the De Toekomst training complex, and a stint as assistant coach with Jong Ajax, he now embarks ...",
    "published": null
  },
  {
    "title": "Alfred Schreuder new head coach Ajax",
    "url": "https://english.ajax.nl/articles/alfred-schreuder-new-head-coach-ajax/",
    "snippet": "Ajax and Manchester United have reached an agreement for the transfer of <strong>Erik ten Hag</strong> to the English club. Ten Hag has been the head coach at Ajax since January 2018 and will leave after this season.",
    "published": null
  },
  {
    "title": "Francesco Farioli new Ajax head coach",
    "url": "https://english.ajax.nl/articles/francesco-farioli-new-ajax-head-coach/",
    "snippet": "We don&#x27;t want to waste any time getting ready for the new season and bringing Ajax back to where it belongs.&quot; On Thursday, <strong>Francesco Farioli</strong> was presented as Ajax&#x27;s new head coach in the Johan Cruijff ArenA.",
    "published": null
  },
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "He succeeded Marc Overmars, who left in early 2022. Mislintat appointed <strong>Maurice Steijn</strong> as head coach. Mislintat spent approximately 111 million euros on transfers. Ajax had its worst start to the season in fifty-nine years.",
    "published": "1 week ago"
  }
]