[
  {
    "title": "Hem - 2025 Company Profile, Team, Funding & Competitors - Tracxn",
    "url": "https://tracxn.com/d/companies/hem/__RzsXUsLjn8V1NcFoMplSP3vCaJDKDiei-bGvoH9Lw_c",
    "snippet": "Hem - Internet-first brand of multi-category home improvement products. Acquired by <strong>Vitra</strong>. Raised a total funding of $5M over 1 round from 12 investors.",
    "published": "September 15, 2025"
  },
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "Com Hem was a Swedish brand owned by <strong>Tele2 AB</strong> which supplied Triple Play services that included cable television, broadband internet and fixed-line telephone. Founded in 1983 as Televerket Kabel-TV as part of the former state-owned Televerket, the company was successively named Svenska Kabel-TV ...",
    "published": "June 6, 2025"
  },
  {
    "title": "Com Hem 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10876-33",
    "snippet": "Information on acquisition, funding, investors, and executives for Com Hem. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Com Hem - Products, Competitors, Financials, Employees, Headquarters Locations",
    "url": "https://www.cbinsights.com/company/com-hem",
    "snippet": "The focus of FttP is aimed at fulfilling <strong>the government</strong>&#x27;s target of providing a 1Gb/s service to 98% of the population by 2025. The methodology to achieve this has rested on regulatory measures supported by public funds, as well as on the auction of spectrum in different bands.",
    "published": null
  },
  {
    "title": "Com Hem AB - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn",
    "url": "https://tracxn.com/d/companies/com-hem-ab/__C72ILG9J1X0WjTdDonjKDs7MlEgXfBRoW-3D_-KNVmk",
    "snippet": "Com Hem AB - Media group providing broadband, TV and telephony services. Acquired by <strong>Tele2.</strong> Raised funding over 3 rounds from 1 investor.",
    "published": "November 11, 2025"
  }
]