[
  {
    "title": "The President and Vice-Presidents at Université Paris-Saclay | Université Paris-Saclay",
    "url": "https://www.universite-paris-saclay.fr/en/president-and-vice-presidents-universite-paris-saclay",
    "snippet": "<strong>Camille Galap</strong>, president of Université Paris-Saclay, holds a PhD in biology from the Université du Havre and is a professor.",
    "published": "October 1, 2025"
  },
  {
    "title": "Camille Galap, élu président de l’Université Paris-Saclay | ENS-PARIS-SACLAY",
    "url": "https://ens-paris-saclay.fr/actualite/camille-galap-elu-president-de-luniversite-paris-saclay",
    "snippet": "L&#x27;ENS Paris-Saclay est l&#x27;un des membres fondateurs de l&#x27;Université Paris-Saclay. <strong>Camille Galap</strong> a été élu président de l’Université Paris-Saclay par les membres du Conseil d’administration réunis le mardi 11 juin 2024.",
    "published": "October 5, 2024"
  },
  {
    "title": "Camille Galap new president Paris-Saclay University | LERU",
    "url": "https://www.leru.org/news/camille-galap-new-president-paris-saclay-university",
    "snippet": "On Tuesday 11 June 2024, the Governing Board of Paris-Saclay University convened to elect the university’s new president. Prof. <strong>Camille Galap</strong> was elected by the members of the Governing Board. His term of office is four years, effective immediately. Prof. Galap succeeds Prof.",
    "published": null
  },
  {
    "title": "Présentation de l’équipe présidentielle de l’Université Paris-Saclay - UVSQ",
    "url": "https://www.uvsq.fr/presentation-de-lequipe-presidentielle-de-luniversite-paris-saclay",
    "snippet": "Professeur de physique à la Faculté des sciences de l’Université Paris-Saclay, <strong>Patrick Puzo</strong>, responsable du magistère de physique de l’université depuis 2010, et plus largement de plus de 200 nouveaux étudiants et étudiantes en 3e ...",
    "published": null
  },
  {
    "title": "Election of the president of Université Paris-Saclay | Université Paris-Saclay",
    "url": "https://www.universite-paris-saclay.fr/en/news/election-president-universite-paris-saclay",
    "snippet": "On Tuesday 11 June 2024, the Governing board of Université Paris-Saclay convened to elect the university’s new president. <strong>Camille Galap</strong> was elected by the members of the Governing board (36 voting members) president of Université Paris-Saclay ...",
    "published": "June 11, 2024"
  }
]