[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "However, <strong>by the end of the 2015–16 ... to head coach of Bordeaux, with Régis Sonnes stepping down as the lead coach</strong>. Brunel&#x27;s first match in charge was a 15–9 victory over reigning champions Racing 92. Despite the good start to the season, Bordeaux only went on to win 10 games in 25 matches ...",
    "published": "January 1, 2025"
  },
  {
    "title": "Jacques Brunel | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/12984",
    "snippet": "During the 2013 Six Nations ... in the Championship. <strong>Brunel joined the Bordeaux coaching staff in 2016 where he worked as an assistant coach before taking over as the head coach the next season</strong>....",
    "published": null
  },
  {
    "title": "Rugby Database Coach: Jacques Brunelcoached France games",
    "url": "https://www.rugbydatabase.co.nz/team/coach.php?teamId=45&coachId=179",
    "snippet": "Rugby Database coaching statistics for Jacques Brunel while coaching France including a full list of games",
    "published": null
  },
  {
    "title": "Jacques Brunel named as the new head coach of France – The Irish Times",
    "url": "https://www.irishtimes.com/sport/rugby/jacques-brunel-named-as-the-new-head-coach-of-france-1.3338874",
    "snippet": "That club success coupled with his international experience persuaded Italy to appoint him as head coach a position he held until <strong>stepping down in 2016</strong> to be replaced by Conor O’Shea.",
    "published": "December 27, 2017"
  },
  {
    "title": "Jacques Brunel (rugby player) - Alchetron, the free social encyclopedia",
    "url": "https://alchetron.com/Jacques-Brunel-(rugby-player)",
    "snippet": "However, on this occasion, Clermont won 19–6. <strong>In 2011 he left his post with Perpignan to join the Italian national team as head coach</strong>. Jacques Brunel&#x27;s first match in charge of Italy came during the 2012 Six Nations Championship, which saw ...",
    "published": "October 12, 2024"
  }
]