[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "After the 2004 general elections, ... (NDA) tenure by <strong>becoming the political party with the single largest number of seats in the Lok Sabha</strong>. It formed United Progressive Alliance (UPA) with allies and staked claim to form government. In a surprise move, Chairperson Sonia Gandhi declared Manmohan ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "Over his career, Dr. Singh held several significant positions, including <strong>Secretary in the Ministry of Finance, Deputy Chairman of the Planning Commission, Governor of the Reserve Bank of India, Advisor to the Prime Minister, and Chairman of the University Grants Commission</strong>.",
    "published": null
  },
  {
    "title": "Manmohan Singh | Biography, Reforms, Political Career, & Death | Britannica",
    "url": "https://www.britannica.com/biography/Manmohan-Singh",
    "snippet": "Manmohan Singh (1932–2024) was an Indian economist and politician who was <strong>the first person from a minority community to serve as prime minister of India</strong> (2004–14).",
    "published": "February 24, 2005"
  },
  {
    "title": "DR. MANMOHAN SINGH",
    "url": "https://inc.in/our-inspiration/dr-manmohan-singh",
    "snippet": "This story of unprecedented growth and prosperity is the story of Dr Singh’s premiership from 2004-2014. But it began during his tenure as Finance Minister from 1991-1996 when the script first began to take shape. In July 1991, Dr Manmohan Singh ended his budget speech with the words “No power on earth can stop an idea whose time has come.",
    "published": null
  },
  {
    "title": "Dr. Manmohan Singh: India’s son, the Pride of the World",
    "url": "https://inc.in/congress-sandesh/tribute/dr-manmohan-singh-india-s-son-the-pride-of-the-world",
    "snippet": "Thereafter, during the tenure of Dr. Manmohan Singh as Prime Minister of India, <strong>India witnessed all-round development and India stood in the forefront of the group of nations of the world</strong>.",
    "published": null
  }
]