[
  {
    "title": "Odion Ighalo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Odion_Ighalo",
    "snippet": "Odion Jude Ighalo (born 16 June 1989) is a Nigerian professional footballer who plays as a forward. After starting his career at Nigerian clubs <strong>Prime and Julius Berger</strong>, Ighalo moved to Norwegian club Lyn in 2007. A year later, he was signed by Italian club Udinese, spending most of his tenure ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Odion Ighalo - Nigeria | Player Profile | Sky Sports Football",
    "url": "https://www.skysports.com/odion-ighalo",
    "snippet": "Odion Ighalo, who was on loan at Manchester United for a year, has completed a permanent transfer to Saudi Arabian club <strong>Al-Shabab</strong>.",
    "published": null
  },
  {
    "title": "Odion Ighalo Honoured by Former Club, Granada",
    "url": "https://newscentral.africa/odion-ighalo-honoured-by-former-club-granada/",
    "snippet": "Odion Ighalo was recognised by his previous team, Granada, during their pre-season match against Saudi team, Al-Wehda. The match concluded with a 1-1 draw in regular time, with Granada emerging victorious in a penalty shootout with a score of 5-4. Ighalo, who is currently affiliated with Al-Wehda, had a loan spell at Granada from Serie A club, Udinese, during the 2009/10 season.",
    "published": "August 10, 2024"
  },
  {
    "title": "Odion Ighalo facts for kids",
    "url": "https://kids.kiddle.co/Odion_Ighalo",
    "snippet": "After that, he moved to Saudi Arabia, playing for Al Shabab and Al-Hilal before joining Al-Wehda. He also played for the Nigerian national team. He represented Nigeria at the 2018 World Cup. He was the top goal scorer in the qualifiers for the 2019 Africa Cup of Nations. Nigeria finished third in that tournament, and Ighalo was the top scorer there too. ... Odion Ighalo was born in Edo and grew up in Lagos, Nigeria.",
    "published": null
  },
  {
    "title": "Odion Ighalo - Player profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/odion-ighalo/profil/spieler/62121",
    "snippet": "Odion Ighalo is a 36-year old football player aus Nigeria, (* Jun 16, 1989 in Lagos, Nigeria). Ighalo is Jul 1, 2025 without a club since. He plays in the position Centre-Forward. His market value is €600k.",
    "published": null
  }
]