[
  {
    "title": "President of Chile - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Chile",
    "snippet": "The shorter term (previously it was six years) allows for synchronized parliamentary and presidential elections. The president&#x27;s official seat is the La Moneda Palace in the capital Santiago. <strong>Michelle Bachelet</strong> was the first female president of Chile and served twice, from 2006 to 2010 and again ...",
    "published": "12 hours ago"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "Kast beat the governing left-wing coalition candidate Jeanette Jara decisively with more than 58% of the vote in his third attempt at running for president. It marks the biggest shift to the right since the end of Chile&#x27;s military dictatorship in 1990.",
    "published": "2 days ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "The son of a Nazi party member and an admirer of Pinochet, Kast built his campaign on a promise to expel tens of thousands of undocumented migrants ... The ultra-conservative former congressman <strong>José Antonio Kast</strong> has been elected as Chile’s ...",
    "published": "13 hours ago"
  },
  {
    "title": "Gabriel Boric - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gabriel_Boric",
    "snippet": "Boric, however, refrained from issuing a personal apology, stating that no individual in Chile would face persecution or intimidation for their beliefs unless they contravened the law. In January 2025, President <strong>Gabriel Boric</strong> became the first ...",
    "published": "2 days ago"
  },
  {
    "title": "Kast’s Victory in Chile Is Another Win for Global Right-Wing Movement - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/americas/chile-kast-right-wing-movement.html",
    "snippet": "<strong>José Antonio Kast</strong>, who was elected president on Sunday, is the latest conservative to rise to power promising strict law and order measures.",
    "published": "19 hours ago"
  }
]