[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_Regency_Pictures",
    "snippet": "Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: one to do business in the United States and legally named Regency Entertainment (USA), Inc., one to do business overseas and legally named Monarchy Enterprises S.á.r.l.",
    "published": "May 5, 2025"
  },
  {
    "title": "Arnon Milchan",
    "url": "https://www.forbes.com/profile/arnon-milchan/",
    "snippet": "Arnon Milchan owns film and TV production company New Regency Enterprises.",
    "published": null
  },
  {
    "title": "Regency Enterprises | Paramount Animation Fan Wiki",
    "url": "https://paramountanimation.fandom.com/wiki/Regency_Enterprises",
    "snippet": "JavaScript is disabled in your browser · Please enable JavaScript to proceed · A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser",
    "published": null
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "Milchan has also successfully diversified his company’s activities within the sphere of entertainment, most specifically in the realm of television through Regency Television (“Malcom in the Middle” and “The Bernie Mac Show”), and sports where the company was once the largest shareholder of PUMA, the worldwide athletic apparel and show conglomerate based in Germany, which was later sold after a successful re-branding in 2003.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between Arnon Milchan, Scriba &amp; Deyle and Canal+ to finance 20 films in five years, with New Regency Productions acting as its production and sales arm. The company was originally known as Embassy International Pictures from 1982 until 1991.",
    "published": "2 weeks ago"
  }
]