[
  {
    "title": "Carlo Ancelotti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Carlo_Ancelotti",
    "snippet": "With his team&#x27;s 2–1 victory over Real Sociedad on 17 September 2023, Ancelotti got his 173rd Madrid win, overtaking Zinedine Zidane to become the coach with the second most wins in the club&#x27;s history. On 29 December, although he had previously been linked with the position of head coach for the Brazil national football team, Real Madrid announced that Ancelotti had agreed to a contract extension until 30 June 2026.",
    "published": "2 weeks ago"
  },
  {
    "title": "Carlo Ancelotti: All clubs, titles and records of the Italian star coach - full list",
    "url": "https://www.olympics.com/en/news/carlo-ancelotti-all-clubs-titles-records-full-list-brazil",
    "snippet": "After eight at the helm, Ancelotti coached <strong>Chelsea, Paris Saint-Germain, Bayern Munich, Napoli, Everton and Real Madrid</strong>. ... Carlo Ancelotti has enjoyed great success in the UEFA Champions League.",
    "published": "May 12, 2025"
  },
  {
    "title": "Carlo Ancelotti - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/carlo-ancelotti/profil/trainer/523",
    "snippet": "This is the profile site of the manager Carlo Ancelotti. The site lists all clubs he coached and all clubs he played for.",
    "published": null
  },
  {
    "title": "Bio - Carlo Ancelotti",
    "url": "https://carloancelotti.it/en/bio/",
    "snippet": "During this time he has won two Champions, two Intercontinental Cup, two European Supercups, three Serie A championship, four Italian Cups and one Italian Supercup. He participated in two World Cups too. Carlo starts his managerial career as <strong>Arrigo Sacchi</strong>’s assitant coach with itakian National ...",
    "published": "August 19, 2025"
  },
  {
    "title": "Carlo Ancelotti Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/3864/Carlo-Ancelotti/overview",
    "snippet": "Ancelotti’s coaching career began as assistant to <strong>Arrigo Sacchi</strong> with Italy’s 1994 FIFA World Cup finalists, before he moved into club management with Reggiana and Parma, later taking over at Juventus and then Milan.",
    "published": null
  }
]