[
  {
    "title": "Revolution of Dignity - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Revolution_of_Dignity",
    "snippet": "The Revolution of Dignity (Ukrainian: ... place in Ukraine in February 2014 at the end of the Euromaidan protests. <strong>Scores of protesters were killed by government forces during clashes in the capital Kyiv</strong>....",
    "published": "3 weeks ago"
  },
  {
    "title": "Euromaidan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Euromaidan",
    "snippet": "Some Russian citizens sympathetic ... becoming Ukrainian citizens. Altogether, <strong>more than 100 people were killed and 2,500 injured</strong>. The death toll included 108 protesters and 13 police officers. Most of the deaths and injuries were during the Revolution of Dignity in February 2014...",
    "published": "2 weeks ago"
  },
  {
    "title": "Understanding Ukraine’s Euromaidan Protests - Open Society Foundations",
    "url": "https://www.opensocietyfoundations.org/explainers/understanding-ukraines-euromaidan-protests",
    "snippet": "In late November 2013, Ukrainians took to the streets in peaceful protest after then-president Viktor Yanukovych chose not to sign an agreement that would have integrated the country more closely with the European Union. As the protests in Kyiv’s Independence Square, or Maidan, continued into 2014, the government began cracking down on the demonstrators. The size of the protests only grew in reaction and turned into what was termed “the revolution ...",
    "published": null
  },
  {
    "title": "Ukrainian Revolution of Dignity 2013–2014: Origins, Progress, and Impact on Society | Journal of Information Systems Engineering and Management",
    "url": "https://www.jisem-journal.com/index.php/journal/article/view/1868",
    "snippet": "<strong>The storming of Euromaidan by the security forces and the shooting of people on 18-22 February 2014 (the Heavenly Hundred) turned Euromaidan into a Revolution of Dignity</strong>. The Euromaidan events unfolded across Ukraine, involving around 10 million people directly or indirectly participating in ...",
    "published": "February 19, 2025"
  },
  {
    "title": "Ukraine - Maidan, Protest, Revolution | Britannica",
    "url": "https://www.britannica.com/place/Ukraine/The-Maidan-protest-movement",
    "snippet": "Street protests erupted in Kyiv, and Lutsenko and Klitschko emerged as the leaders of the largest demonstrations since the Orange Revolution. Police violently dispersed crowds in Kyiv’s Maidan Nezalezhnosti (“Independence Square”), and, as the protests continued into December, demonstrators occupied Kyiv’s city hall and called on Yanukovych to resign. Russia, in turn, offered to cut the price of natural gas and purchase $15 billion in Ukrainian bonds to prop up the country’s faltering economy.",
    "published": "July 26, 1999"
  }
]