[
  {
    "title": "Bombardier Aviation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bombardier_Aviation",
    "snippet": "On 24 March 2011, Shanghai-based Commercial Aircraft Corporation of China (COMAC) and Bombardier Inc. signed a framework agreement for a long-term strategic cooperation on commercial aircraft. The intention was to break the near-duopoly of Airbus and Boeing. Aircraft covered by the programme included the Bombardier CRJ-series, CSeries and Q-series; and the Comac ARJ21 and Comac C919.",
    "published": "October 31, 2025"
  },
  {
    "title": "Airbus takes control of Bombardier jet program Boeing tried to kill",
    "url": "https://money.cnn.com/2017/10/16/news/companies/airbus-buys-majority-stake-bombardier-cseries/index.html",
    "snippet": "<strong>The deal allows Bombardier and Quebec to exit the program in 2023</strong>, selling their stakes to Airbus in the years to come. &quot;At the end of the day, this is going to be an Airbus program,&quot; Rainer Ohler, vice president of communications for Airbus ...",
    "published": null
  },
  {
    "title": "CSeries dumping petition by Boeing - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/CSeries_dumping_petition_by_Boeing",
    "snippet": "On 26 September, after lobbying by Boeing, the US Department of Commerce (DoC) alleged subsidies of 220% and intended to collect deposits accordingly, plus a preliminary 80% anti-dumping duty, resulting in a duty of 300%. The DoC announced its final ruling, a total duty of 292%, on 20 December, hailing it as an affirmation of the &quot;America First&quot; policy. In October, with financial issues already mounting, Bombardier was indirectly forced by the US government tariffs to relinquish 50.01% of its stake in the CSeries program to Airbus for a symbolic CAD$1, and would produce CSeries aircraft in the United States.",
    "published": "September 8, 2025"
  },
  {
    "title": "Airbus and the Government of Québec become sole owners of the A220 Programme as Bombardier completes its strategic exit from Commercial Aviation | Bombardier",
    "url": "https://bombardier.com/en/media/news/airbus-and-government-quebec-become-sole-owners-a220-programme-bombardier-completes-its",
    "snippet": "As part of the agreement, <strong>Airbus has acquired the Airbus A220 and A330 work package production capability from Bombardier in Saint-Laurent, Québec</strong>. These production activities will be operated in the Saint Laurent site by Stelia Aéronautique ...",
    "published": null
  },
  {
    "title": "Boeing Takes On Bombardier and Airbus With Embraer Deal - The New York Times",
    "url": "https://www.nytimes.com/2018/07/05/business/boeing-embraer-airbus-bombardier.html",
    "snippet": "Boeing will take over 80 percent of the Brazilian company’s commercial aircraft and services arm, which the companies said was worth $4.75 billion.",
    "published": "July 6, 2018"
  }
]