[
  {
    "title": "List of Juventus FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Juventus_FC_managers",
    "snippet": "Juventus Football Club is an Italian professional association football club based in Turin, Piedmont, who currently play in the Serie A. They have played at their current home ground, Juventus Stadium, since 2011. This chronological list comprises all those who have held the position of manager ...",
    "published": "November 2, 2025"
  },
  {
    "title": "Juventus Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=1408&teamTabs=managers",
    "snippet": "Juventus Football Club Managers, full history, past and present. Provided courtesy of Soccerbase.com, the Football Betting Site.",
    "published": null
  },
  {
    "title": "Juventus » Manager history",
    "url": "https://www.worldfootball.net/teams/juventus/9/",
    "snippet": "Juventus on Monday sacked coach <strong>Igor Tudor</strong> after the Serie A club&#x27;s 1-0 defeat by Lazio meant they had accumulated just five points in their last five matches....",
    "published": null
  },
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "Juventus Football Club announces that it has today relieved <strong>Igor Tudor</strong> of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": null
  },
  {
    "title": "Juventus FC - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/juventus-fc/mitarbeiterhistorie/verein/506",
    "snippet": "Juventus FC UEFA U19 · Juventus Youth · The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along. Under &quot;Position&quot;, you can select a specific role from the drop-down menu.",
    "published": null
  }
]