[
  {
    "title": "List of political parties in Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_political_parties_in_Italy",
    "snippet": "Both parties achieved electoral ... formed in 1922, came too late. The beginning of 1921 saw the foundation of the <strong>Communist Party of Italy</strong>, born from a split of the Italian Socialist Party....",
    "published": "October 18, 2025"
  },
  {
    "title": "Italy: Political parties at a glance",
    "url": "https://politpro.eu/en/italy/parties",
    "snippet": "<strong>Forza Italia</strong> is a center-right party in Italy, founded in 1994 by Silvio Berlusconi. It represents conservative and economically liberal positions and has been involved in several government coalitions.",
    "published": "September 13, 2019"
  },
  {
    "title": "Italian Popular Party | History & Politics | Britannica",
    "url": "https://www.britannica.com/topic/Italian-Popular-Party",
    "snippet": "They advocated programs ranging from social reform to the defense of free enterprise. The DC usually dominated Italian politics from World War II until the mid-1990s. In <strong>January 1919</strong> a Sicilian priest, Luigi Sturzo, founded the original Italian ...",
    "published": "July 20, 1998"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "<strong>The Democratic Party</strong> may have only a short history, but it has already passed through several sometimes strikingly contradictory phases. The party was founded in 2007 as a result of the convergence of the Democrats of the Left (direct heirs ...",
    "published": null
  },
  {
    "title": "Italian Parties and Party System(s) | Political Parties and the Crisis of Democracy: Organization, Resilience, and Reform | Oxford Academic",
    "url": "https://academic.oup.com/book/58013/chapter/479031843",
    "snippet": "If we focus on party organizations, some kinds of special representation exist, especially for younger members. In the PDS-DS, young people were given a special status through the ‘Sinistra Giovanile’; the same happened when the PD was founded in 2008 (‘Giovani Democratici’). In Forza Italia, from 1994 to 2008, we find ‘Forza Italia—Giovani per la Libertà’; and ‘Studenti per le libertà’ as a specific organization for students.",
    "published": "July 4, 2024"
  }
]