[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "In the 2022 Italian general election, the PD-led coalition achieved similar results to 2018 and returned to the opposition. However, the PD consolidated as one of the two major political parties in Italy during the 2020s along with the Brothers of Italy. Prominent Democrats include former leaders Walter Veltroni, Dario Franceschini, Nicola Zingaretti and Enrico Letta.",
    "published": "1 day ago"
  },
  {
    "title": "Revista Española de Ciencia Política. Núm. 44. Julio 2017, pp. 275-299",
    "url": "https://dialnet.unirioja.es/descarga/articulo/6089213.pdf",
    "snippet": "Sources: Own elaboration. Democratic Party (www.partitodemocratico.it) and Pasquino (2013). Legend: * = the · direct election of the Pd leadership was held on 30 April 2017. Even though the PD’s Statute/Charter is crystal-clear, that is, the party secretary is",
    "published": null
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "Italy’s Democrats have often posed as a guarantor of institutional stability and Rome’s Atlanticist line. Current leader <strong>Elly Schlein</strong> has tacked left, but it’s done little to change the party’s identity as a force for steadying Italian ...",
    "published": null
  },
  {
    "title": "Democratic Party - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q47729",
    "snippet": "2020 Italian regional elections · 0 references · founded by · Walter Veltroni · 0 references · position held by head of the organization · Secretary of the Democratic Party · 0 references · chairperson · <strong>Matteo Orfini</strong> · start time ...",
    "published": null
  },
  {
    "title": "Democratic Party – Democratic and Progressive Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_–_Democratic_and_Progressive_Italy",
    "snippet": "Prior to the formation of the group, its name was that of the lead electoral list of the centre-left coalition in the 2022 Italian general election. In July 2022, the centre-right coalition was forecast to win a parliamentary absolute majority under the Rosatellum electoral law of 2017, which was pushed by the Democratic Party (PD) under Matteo Renzi&#x27;s leadership and was now rejected by the party under the leadership of Enrico Letta.",
    "published": "August 9, 2025"
  }
]