[
  {
    "title": "Luca Cordero di Montezemolo",
    "url": "https://en.wikipedia.org/wiki/Luca_Cordero_di_Montezemolo",
    "snippet": "Luca Cordero di Montezemolo (Italian pronunciation: [ˈluːka korˈdɛːro di ˌmontedˈdzɛːmolo, -dˈdzeːm-]; born 31 August 1947) is an Italian businessman and motorsport executive who is best known as the <strong>former chairman of Ferrari, Fiat S.p.A., Confindustria and Alitalia</strong>.",
    "published": "October 22, 2025"
  },
  {
    "title": "Luca Cordero di Montezemolo odchodzi z Ferrari. Dyrektor Generalny Fiata, Sergio Marchionne nowym Prezesem. | FCA archives | Stellantis Media",
    "url": "https://www.media.stellantis.com/pl-pl/fca-archive/press/luca-cordero-di-montezemolo-odchodzi-z-ferrari-dyrektor-generalny-fiata-sergio-marchionne-nowym-prezesem",
    "snippet": "&quot;W 2003 roku - powiedział Dyrektor Generalny Fiata, Sergio Marchionne - <strong>Luca</strong> i ja w tym samym dniu otrzymaliśmy nominację na stanowisko Członków Zarządu Fiata. Rok później ja zostałem Dyrektorem Generalnym, a on Prezesem.",
    "published": "September 9, 2014"
  },
  {
    "title": "Fiat S.p.A. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_S.p.A.",
    "snippet": "<strong>After Umberto Agnelli&#x27;s death on 28 May 2004, Luca Cordero di Montezemolo was named chairman</strong>, with Agnelli heir John Elkann becoming vice chairman (at the age of 28), and other family members also serving on the board.",
    "published": "3 weeks ago"
  },
  {
    "title": "Luca Cordero di Montezemolo - Unionpedia, the concept map",
    "url": "https://en.unionpedia.org/Luca_Cordero_di_Montezemolo",
    "snippet": "Luca Cordero di Montezemolo (born 31 August 1947) is an Italian businessman who is best known as former Chairman of Ferrari, and <strong>formerly Chairman of Fiat S.p.A.</strong> and President of Confindustria and FIEG. 69 relations.",
    "published": null
  },
  {
    "title": "Fremantle Secures Global Rights to Documentary ‘Luca: Seeing Red’ About Ferrari’s Luca di Montezemolo: ‘I’ve Lived My Life at Full Speed’ (EXCLUSIVE)",
    "url": "https://www.yahoo.com/entertainment/movies/articles/fremantle-secures-global-rights-documentary-170938509.html",
    "snippet": "Fremantle has acquired worldwide distribution rights to feature documentary “Luca: Seeing Red” about the life of businessman and former chairperson of Ferrari Luca Cordero di Montezemolo. The doc – about to be launched at Mipcom in Cannes – sees Chris Harris (“Top Gear”) traveling to Italy to “meet his hero” while “blending rare archive and …",
    "published": "October 9, 2025"
  }
]