[
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "<strong>Heitinga is signing a contract with Ajax as head coach until June 30, 2027</strong>. Marcel Keizer will be his assistant and is signing a contract of the same duration. Date: 31.05.2025 · Photographer: AFC Ajax ·",
    "published": null
  },
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "On 19 May 2023, Sven Mislintat took over as Ajax&#x27;s sports director. He succeeded Marc Overmars, who left in early 2022. Mislintat appointed <strong>Maurice Steijn</strong> as head coach. Mislintat spent approximately 111 million euros on transfers. Ajax had its worst start to the season in fifty-nine years.",
    "published": "2 weeks ago"
  },
  {
    "title": "r/soccer on Reddit: [VI] Fred Grim will be Ajax first team head coach until at least the winter break",
    "url": "https://www.reddit.com/r/soccer/comments/1p2uetc/vi_fred_grim_will_be_ajax_first_team_head_coach/",
    "snippet": "[Romano] Ajax have agreed deal to appoint <strong>John Heitinga</strong> as new head coach on two year contract.",
    "published": "4 weeks ago"
  },
  {
    "title": "Ajax hires Liverpool assistant John Heitinga as new head coach | AP News",
    "url": "https://apnews.com/article/ajax-coach-heitinga-liverpool-c894f54c8f6ecf0949d3962a5d3e353e",
    "snippet": "AMSTERDAM (AP) — Ajax hired <strong>John Heitinga</strong> as head coach on Saturday to replace Francesco Farioli nearly two weeks after the Italian resigned following the team’s late-season collapse.",
    "published": "May 31, 2025"
  },
  {
    "title": "Official website AFC Ajax Amsterdam - Ajax.nl",
    "url": "https://english.ajax.nl/",
    "snippet": "Ajax are fully focused on Sunday&#x27;s Klassieker against Feyenoord. Head coach <strong>Fred Grim</strong> looked ahead to the clash with the Rotterdam side on Friday at the Johan Cruijff Arena, addressing the fitness of his squad and the team’s preparations for the match.",
    "published": null
  }
]