[
  {
    "title": "TSV 1860 Munich - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TSV_1860_Munich",
    "snippet": "On 28 April 2006, 1860 sold its 50% share to Bayern Munich to help resolve a serious financial crisis that saw 1860 facing bankruptcy. On 12 July 2017, Bayern Munich terminated 1860 Munich&#x27;s rental agreement for <strong>Allianz Arena</strong>. The club returned to their old stadium, the Grünwalder Stadion.",
    "published": "2 weeks ago"
  },
  {
    "title": "Grünwalder Stadion - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gr%C3%BCnwalder_Stadion",
    "snippet": "<strong>Städtisches Stadion an der Grünwalder Straße</strong> (also known as Grünwalder Stadion and Sechzger Stadion) is a football stadium in Munich, Germany. It was built in 1911 and was the home ground for 1860 Munich until 1995. Local rival Bayern Munich also played in the stadium from 1926 until 1972, ...",
    "published": "June 5, 2025"
  },
  {
    "title": "TSV 1860 Munich - Stadium - Städtisches Stadion an der Grünwalder Straße | Transfermarkt",
    "url": "https://www.transfermarkt.com/tsv-1860-munich/stadion/verein/72",
    "snippet": "TSV 1860 Munich · TSV 1860 München II · TSV 1860 München U19 · TSV 1860 München U17 · TSV 1860 München Youth · ©IMAGO · ©IMAGO · ©IMAGO · This page provides you with information about the stadium of the selected club. In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights.",
    "published": null
  },
  {
    "title": "Kick it in Giesing! | simply Munich",
    "url": "https://www.munich.travel/en/topics/sports-leisure/kick-it-in-giesing",
    "snippet": "That evening, thousands donned ... the TSV 1860 Munich players would be back where they belong, and no longer in the <strong>Allianz Arena</strong> football stadium which they had shared with city rival FC Bayern....",
    "published": null
  },
  {
    "title": "Gruenwalder Stadion (2025) - All You Need to Know BEFORE You Go (with Reviews)",
    "url": "https://www.tripadvisor.com/Attraction_Review-g187309-d12240172-Reviews-Gruenwalder_Stadion-Munich_Upper_Bavaria_Bavaria.html",
    "snippet": "And the stadium itself: Unique. A magnificent view of the surrounding houses from which you can watch the game, an old and authentic football atmosphere and the most beautiful scoreboard in the world: manually operated by the Taferlmann/-Frau. Hopefully, the city of Munich, TSV 1860 München ...",
    "published": null
  }
]