[
  {
    "title": "Newsroom - Senator Alex Padilla",
    "url": "https://www.padilla.senate.gov/newsroom/",
    "snippet": "WASHINGTON, D.C. — Today, U.S. Senator Alex Padilla (D-Calif.), Ranking Member of the Senate Judiciary Immigration Subcommittee, joined a bicameral spotlight forum to denounce the Department of Homeland Security’s (DHS) unlawful arrests of U.S. citizens. U.S.",
    "published": "October 11, 2021"
  },
  {
    "title": "alex padilla - Latest News, Updates and Analysis",
    "url": "https://calmatters.org/tag/alex-padilla/",
    "snippet": "Justice Sen. Alex Padilla <strong>visits San Diego immigration court</strong>: ‘This should not be a trap’ · Sen. Alex Padilla observed immigration court in San Diego this week in order to get a better understand of the issues that people face in proceedings.",
    "published": null
  },
  {
    "title": "Press Releases - Senator Alex Padilla",
    "url": "https://www.padilla.senate.gov/newsroom/press-releases/",
    "snippet": "WASHINGTON, D.C. — Today, U.S. Senators Alex Padilla and Adam Schiff (both D-Calif.) announced that <strong>the Department of Transportation (DOT) awarded over $297 million to 24 California projects to help transition to low-emission bus models across the state</strong>.",
    "published": "October 7, 2021"
  },
  {
    "title": "WATCH: Padilla Calls on Republicans to Pass Democratic Proposal to Keep Health Care Costs From Skyrocketing for Millions of Americans - Senator Alex Padilla",
    "url": "https://www.padilla.senate.gov/newsroom/press-releases/watch-padilla-calls-on-republicans-to-pass-democratic-proposal-to-keep-health-care-costs-from-skyrocketing-for-millions-of-americans/",
    "snippet": "WASHINGTON, D.C. — Today, U.S. Senator Alex Padilla (D-Calif.) delivered remarks on the Senate floor, <strong>blasting Congressional Republicans for creating a health care crisis in California and across the nation</strong>.",
    "published": "5 days ago"
  },
  {
    "title": "Alex Padilla | AP News",
    "url": "https://apnews.com/hub/alex-padilla",
    "snippet": "Los Angeles Mayor Karen Bass defended U.S. Senator Alex Padilla after Vice President Vance called him ‘Jose’ during his visit on Friday.",
    "published": null
  }
]