[
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "After years in the youth academy, hundreds of matches for Ajax’s first team, various coaching roles at the De Toekomst training complex, and a stint as assistant coach with Jong Ajax, he now embarks on his second spell as the club’s head coach. ... Technical Director Alex Kroes is pleased with the appointment of John Heitinga as Ajax’s new head coach.",
    "published": null
  },
  {
    "title": "John Heitinga - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Heitinga",
    "snippet": "John Gijsbert Alan Heitinga (born 15 November 1983) is a Dutch football coach and former player who was most recently the head coach of Eredivisie club Ajax.",
    "published": "2 weeks ago"
  },
  {
    "title": "Ajax suspends John Heitinga with immediate effect",
    "url": "https://english.ajax.nl/articles/ajax-suspends-john-heitinga-with-immediate-effect",
    "snippet": "Ajax has suspended John Heitinga with immediate effect. The head coach’s contract was due to run <strong>until June 30, 2027</strong>, but will now be terminated. The same applies to assistant coach Marcel Keizer.",
    "published": null
  },
  {
    "title": "Heitinga is back: 'Really excited to get started'",
    "url": "https://english.ajax.nl/articles/heitinga-is-back-really-excited-to-get-started",
    "snippet": "John Heitinga has returned to Ajax. He signed a <strong>two-year</strong> contract as head coach after spending two years in England with West Ham United and Liverpool.",
    "published": null
  },
  {
    "title": "Ajax to sack manager John Heitinga less than six months after Liverpool exit - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cn7e1k2pp31o",
    "snippet": "Heitinga, 41, <strong>won just five of his 11 Eredivisie matches in charge of the Amsterdam club who sit eight points adrift of league leaders Feyenoord. Ajax have lost all four of their Champions League matches this season, including a 3-0 home defeat to Galatasaray on Wednesday. Former Everton player Heitinga acted as Arne Slot&#x27;s assistant coach last season</strong> ...",
    "published": "November 6, 2025"
  }
]