[
  {
    "title": "Next Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Ukrainian_presidential_election",
    "snippet": "On 26 February 2025, after a previous ... law, and also pledged to hold a presidential election upon the conclusion of the Russo-Ukrainian War. On 6 March 2025 opposition politicians Petro Poroshenko and Yulia Tymoshenko, after having confirmed that they had held discussions ...",
    "published": "1 week ago"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "19 December 2025 - 15:57 · In Warsaw, President of Ukraine <strong>Volodymyr Zelenskyy</strong> held a meeting with President of Poland Karol Nawrocki. This was the first official visit by a foreign leader to the incumbent Polish President since his inauguration ...",
    "published": "3 days ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "On 17 October, Donald Trump indicated interest in meeting Zelenskyy at the 2025 Budapest Summit in Hungary, but that their meeting would be separate from Trump&#x27;s meeting with Putin as Trump noted, &quot;These two leaders do not like each other, and we want to make it comfortable for everybody.&quot; On Meet the Press, Zelenskyy confirmed that he was interested in joining the summit meeting, emphasizing the importance of Ukraine as being part the dialogue in order &quot;to have just and lasting peace.&quot;",
    "published": "4 days ago"
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "<strong>Volodymyr Zelensky</strong> Ukrainian president <strong>Volodymyr Zelensky</strong> speaking during a press conference, March 15, 2025.",
    "published": "September 27, 2019"
  },
  {
    "title": "Yulia Svyrydenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yulia_Svyrydenko",
    "snippet": "<strong>Yulia Anatoliivna Svyrydenko</strong> (Ukrainian: Юлія Анатоліївна Свириденко, IPA: [ˈjul⁽ʲ⁾ijɐ ɐnɐˈtɔl⁽ʲ⁾ijiu̯nɐ swɪrɪˈdɛnko]; born 25 December 1985) is a Ukrainian politician who has served as the 19th ...",
    "published": "1 month ago"
  }
]