[
  {
    "title": "Business Council of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Business_Council_of_Australia",
    "snippet": "In June 1951, the AIPL was renamed as the Australian Industries Development Association (AIDA). Hosiery manufacturer George Foletta served as the organisation&#x27;s president from 1951 to 1956. The Business Council of Australia was formed in 1983 from a merger of AIDA and the Business Roundtable.",
    "published": "April 1, 2025"
  },
  {
    "title": "Business Council of Australia | LinkedIn",
    "url": "https://au.linkedin.com/company/business-council-of-australia",
    "snippet": "Our India Co-chair, Dr Anish Shah, was recently elected as President of FICCI and we thank him for his leadership of the CEO Forum. And we spent time with ASSOCHAM (The Associated Chambers of Commerce and Industry of India), meeting with members of their education council to discuss opportunities across education and its intersection with industry: Thank you Neeraj Joshi Catherine Gallagher and Ravneet Pawha. ... The Business Council of Australia is calling on the Federal Government to use the May Budget to urgently address Australia’s global competitiveness warning signs with practical actions.",
    "published": null
  },
  {
    "title": "Business Council of Australia",
    "url": "https://www.bca.com.au/",
    "snippet": "The Business Council of Australia brings together the experience and capability of chief executives and their teams from across a diverse range of industries to develop common-sense, trusted and evidence-based policies.",
    "published": "August 26, 2024"
  },
  {
    "title": "Board - Business Council of Australia - V1",
    "url": "https://www.bca.com.au/board",
    "snippet": "Open letter to Parliament: A strong economy through successful businesses The Big Five Questions: Australia’s priorities Workplace Relations Seize the Moment Disability Inclusion Frontier Economy Advancing Women Australian supplier payment code Strong Australia Network BizRebuild Indigenous Engagement Past Campaigns",
    "published": null
  },
  {
    "title": "New BCA President starts today - Business Council of Australia",
    "url": "https://www.bca.com.au/new_bca_president_starts_today",
    "snippet": "The Business Council of Australia welcomes incoming BCA President <strong>Geoff Culbert</strong>, who today takes over leadership of the BCA Board from outgoing President Tim Reed.",
    "published": null
  }
]