[
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Producer <strong>Ada Solomon</strong> has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian film industry has achieved within the institution.",
    "published": "2 weeks ago"
  },
  {
    "title": "Home - European Film Academy",
    "url": "https://www.europeanfilmawards.eu/",
    "snippet": "The trio of producers Maren Ade, Jonas Dornbach and Janine Jackowski from the German company Komplizen Film will be honoured at the 38th European Film Awards with the EURIMAGES INTERNATIONAL CO-PRODUCTION AWARD 2026 presented by Eurimages and the European Film Academy.",
    "published": "September 23, 2024"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/european-film-academy-announces-new-board-appointments/",
    "snippet": "It is a time of change, and I am ... the European Film Academy, and especially the newly elected deputy chairs: <strong>Leontine Petit and Matthieu Darras</strong>.”...",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "Other renowned films include SORELLA DI CLAUSURA (Ivana Mladenovic, 2025), THE NEW YEAR THAT NEVER CAME (Bogdan Mureșanu, Best Film at the Venice Orizzonti section &amp; European Film Academy Discovery nominee, 2024), DO NOT EXPECT TOO MUCH OF THE END OF THE WORLD (Radu Jude, Special Jury Prize Locarno, 2023). In 2013, Solomon received the European Co-Production Award – Prix Eurimages. Outgoing chair Mike Downey commented: “To quote Shakespeare, &#x27;Parting is such sweet sorrow.&#x27;",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "The European Film Academy has announced three new board appointments, with <strong>Ada Solomon</strong> to become chair and Leontine Petit and Matthieu Darras to be deputy chairs.",
    "published": "2 weeks ago"
  }
]