[
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.m.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Jennifer Westacott AO is an Australian business executive. She served as the chief executive of the Business Council of Australia (BCA) from <strong>2011 to 2023</strong>.",
    "published": "October 6, 2024"
  },
  {
    "title": "BCA CEO Jennifer Westacott to call timethe",
    "url": "https://www.afr.com/politics/federal/westacott-calls-time-at-the-bca-20230209-p5cj4d",
    "snippet": "Corporate crusader Jennifer Westacott has called time on her tenure as chief executive of the Business Council of Australia, and will step down in the next 12 to 18 months. After agreeing late last year to implement a succession strategy, the BCA has enlisted a recruitment agency to find a replacement for Ms Westacott who has been at the helm of the organisation since 2011.",
    "published": "February 9, 2023"
  },
  {
    "title": "Statement by Business Council chief executive Jennifer Westacott - Business Council of Australia",
    "url": "https://www.bca.com.au/statement_by_business_council_chief_executive_jennifer_westacott",
    "snippet": "Mr Gailey was greatly respected for his deep and thoughtful contribution to public policy development in Australia, working closely with former Business Council CEO <strong>Katie Lahey</strong> during his time as President.",
    "published": null
  },
  {
    "title": "Staff - Business Council of Australia - V1",
    "url": "https://www.bca.com.au/staff",
    "snippet": "Jennifer Westacott interview with Kim Landers on AM, ABC Radio 27 July 2021 Read more",
    "published": null
  },
  {
    "title": "Former BCA chief Jennifer Westacott to chair Future Generation Global, a philanthropic investment vehicle established by fund manager Geoff Wilson",
    "url": "https://www.afr.com/companies/financial-services/former-bca-chief-lands-gig-at-geoff-wilson-s-future-generation-20231126-p5emv8",
    "snippet": "Former Business Council chief executive Jennifer Westacott has been <strong>appointed chairwoman of the $460 million ASX-listed philanthropic vehicle Future Generation Global</strong>, and says she plans to use the role to push for more government incentives ...",
    "published": "November 26, 2023"
  }
]