[
  {
    "title": "Mergers: Commission approves acquisition of Com Hem by Tele2",
    "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_18_6065",
    "snippet": "<strong>The European Commission has approved unconditionally, under the EU Merger Regulation, the proposed acquisition of Com Hem by Tele2.</strong> The Commission concluded that the transaction would raise no competition concerns as the companies\\&#x27; activities ...",
    "published": null
  },
  {
    "title": "Tele2 2025 Company Profile: Stock Performance & Earnings | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10373-41",
    "snippet": "<strong>Tele2 was a pure mobile operator until 2018 when it acquired Com Hem</strong>, Sweden&#x27;s largest cable company. Tele2 is also present in the Baltic markets, where it runs a pure mobile business.",
    "published": null
  },
  {
    "title": "Tele2 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tele2",
    "snippet": "<strong>On 1 December 2025, Tele2 and Telenor, through Net4Mobility, will begin shutting down the 2G network</strong>. The phase-out coincides with the ongoing decommissioning of the 3G network, freeing up spectrum for newer mobile technologies.",
    "published": "November 2, 2025"
  },
  {
    "title": "The European Commission has approved the merger of Tele2 and Com Hem - Inderes",
    "url": "https://www.inderes.fi/en/releases/the-european-commission-has-approved-the-merger-of-tele2-and-com-hem",
    "snippet": "Today <strong>the European Commission approved the merger of Tele2 and Com Hem unconditionally</strong>. The merger will combine two highly cash generative businesses with clear synergies to create a leading...",
    "published": null
  },
  {
    "title": "Tele2 closes Com Hem acquisition - Mobile World Live",
    "url": "https://www.mobileworldlive.com/featured-content/top-three/tele2-closes-com-hem-acquisition/",
    "snippet": "At the time, Kirkby said the final quarter before closing the acquisition was again one “of solid business trends”, adding the Com Hem deal will take Tele2’s “customer-focussed strategy” to a higher level. Comments · Tags · Europe Operators · Share · Saleha Riaz · Network Tech September 15, 2025 ·",
    "published": "November 6, 2018"
  }
]