[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "<strong>In 2001, Jacques Brunel joined the technical staff of the French national team under the guidance of Bernard Laporte</strong>, training the forwards. Under his guidance, France became known for their strong forwards work, which was a key element in their Six Nations Championship grand slam winning campaigns ...",
    "published": "January 1, 2025"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "<strong>Appointed in December 2017 after a year with Bordeaux Begles</strong>, Jacques Brunel’s first game as France rugby coach saw his side lose 15-13 to Ireland following a last-minute Johnny Sexton drop goal.",
    "published": "May 30, 2025"
  },
  {
    "title": "Rugby Database Coach: Jacques Brunelcoached France games",
    "url": "https://www.rugbydatabase.co.nz/team/coach.php?teamId=45&coachId=179",
    "snippet": "Rugby Database coaching statistics for Jacques Brunel while coaching France including a full list of games",
    "published": null
  },
  {
    "title": "Jacques Brunel | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/12984",
    "snippet": "<strong>After Guy Noves sacking December 2017 Brunel was named as the France national coach</strong>. In round 4 of the 2018 Six Nations under Brunel, France defeated England for the first time since 2015, running out 22–16 victors, and had it not been because ...",
    "published": null
  },
  {
    "title": "Jacques Brunel named new coach of France's national rugby team",
    "url": "https://www.france24.com/en/20171227-rugby-jacques-brunel-named-new-coach-france-national-team",
    "snippet": "His assistants, Yannick Bru (forwards coach) and Jean-Frederic Dubois (backs), were also relieved of their duties. <strong>Brunel was once ex France boss Laporte&#x27;s right-hand man as forwards coach from 2000-2007</strong>.",
    "published": "December 27, 2017"
  }
]