[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "Jean-Luc Antoine Pierre Mélenchon (French: [ʒɑ̃lyk melɑ̃ʃɔ̃] ⓘ; born 19 August 1951) is a French politician who has been the de facto leader of the movement <strong>La France Insoumise (LFI)</strong> since it was established in 2016. He was the deputy in the National Assembly for the 4th constituency ...",
    "published": "1 week ago"
  },
  {
    "title": "Who is Jean-Luc Melenchon, the hard left-leader dubbed 'France's Jeremy Corbyn'? | World News | Sky News",
    "url": "https://news.sky.com/story/who-is-jean-luc-melenchon-the-hard-left-leader-dubbed-frances-jeremy-corbyn-13174952",
    "snippet": "Mr Melenchon has been a fixture in French left-wing politics for decades. He spent 30 years in the <strong>Socialist Party</strong> and held ministerial posts before breaking with the party in 2008.",
    "published": "July 8, 2024"
  },
  {
    "title": "Who Is Jean-Luc Melenchon? All About The New Popular Front Leader | Europe - Times Now",
    "url": "https://www.timesnownews.com/world/europe/who-is-jean-luc-melenchon-age-family-daughter-net-worth-controversies-new-popular-union-article-111560066",
    "snippet": "Jean-Luc Melenchon, born on August 19, 1951, in Tangier, Morocco, is the son of a postmaster and a primary school teacher.After working as a teacher for a while, Melenchon entered politics in September 1976 and joined the <strong>Socialist Party (PS).</strong>",
    "published": "July 7, 2024"
  },
  {
    "title": "Jean-Luc Mélenchon Casts a Long Shadow Over the Stagnant French Left",
    "url": "https://foreignpolicy.com/2025/04/25/melenchon-french-left-politics-progressive-coalition-2027-election/",
    "snippet": "Breaking with <strong>Socialist Party</strong> leadership, Mélenchon campaigned for a “no” vote in France’s referendum on a new EU constitution, deriding the failed proposal as a neoliberal Trojan horse.",
    "published": "May 13, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon, the rabble-rouser leading the new French left – POLITICO",
    "url": "https://www.politico.eu/article/jean-luc-melenchon-rabble-rouser-leader-new-france-left/",
    "snippet": "The former leader of the party, <strong>Jean-Christophe Cambadélis</strong>, said a France led by Mélenchon would look like “North Korea,” while former PM Bernard Cazeneuve accused his party of condoning “the hatred of the state” and of “tolerating ...",
    "published": "May 22, 2022"
  }
]