[
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "^ Although Leonid Kravchuk&#x27;s official inauguration ceremony was conducted on 5 December 1991, he carried out most of the presidential responsibilities temporarily ceded to him as Chairman of the Verkhovna Rada from 24 August 1991 until 5 December 1991, when he became President of Ukraine in his own right. He had previously served as Chairman of the Supreme Soviet of the Ukrainian SSR since 23 July 1990.",
    "published": "October 25, 2025"
  },
  {
    "title": "List of Presidents of Ukraine (1991 - 2022)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-presidents-of-ukraine-1646021751-1",
    "snippet": "Presidents of Ukraine: The current President of Ukraine is Volodymyr Zelensky. He was elected President of Ukraine in 2019. Take a look at the list of Presidents of Ukraine since 1991.",
    "published": "February 28, 2022"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "<strong>Leonid Kuchma was the only president to have served two consecutive terms in office</strong>. Viktor Yushchenko, Petro Poroshenko, and Viktor Yanukovych served one term, with the latter being replaced by acting president Oleksandr Turchynov, who then also served as Chairman of the Ukrainian Parliament, ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Ukraine’s Presidents, Power Elites, and the Country’s Evolution | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/ukraines-presidents-power-elites-and-countrys-evolution",
    "snippet": "As president, <strong>Leonid Kravchuk (1991–94)</strong> is remembered as the founder of independent Ukraine, and signer of the 1994 Budapest Memorandum on Security Assurances that renounced Ukraine’s nuclear status.",
    "published": null
  },
  {
    "title": "Presidents Of Ukraine Since 1991",
    "url": "https://www.worldatlas.com/articles/presidents-of-ukraine-since-1991.html",
    "snippet": "The first president of independent Ukraine was Leonid Kravchuk. He took the position <strong>December of 1991</strong> after having served as the Chairman of the Supreme Soviet of the Ukrainian Soviet Socialist Republic (SSR) while a member of the Communist Party.",
    "published": "April 1, 2019"
  }
]