[
  {
    "title": "Prime Minister of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Saudi_Arabia",
    "snippet": "An ongoing power struggle between ... remaining prime minister. From that point until the appointment of Mohammed bin Salman as prime minister by <strong>King Salman</strong>, the two offices were merged....",
    "published": "November 10, 2025"
  },
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "Mohammed bin Salman (born August 31, 1985) is the de facto ruler of Saudi Arabia, known for his aggressive foreign policy, ambitious economic vision, and controversial social reforms. He formally serves as crown prince (2017– ) and prime minister (2022– ) and has previously served as minister of defense (2015–22).",
    "published": "July 17, 2019"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "His seventh son, Crown Prince Mohammed bin Salman, is considered the de facto ruler of Saudi Arabia due to the King&#x27;s poor health and Mohammed&#x27;s own political maneuvering. <strong>Mohammed replaced his father</strong> as prime minister in 2022, making Salman the first king since Saud in 1964 not to serve as ...",
    "published": "November 3, 2025"
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed bin Salman <strong>Al Saud</strong> (born 31 August 1985), also known as MbS, is the de facto ruler of the Kingdom of Saudi Arabia, formally serving as Crown Prince and Prime Minister. He is the heir apparent to the Saudi throne, the seventh son of ...",
    "published": "11 hours ago"
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing - HOG",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?OpenForm=&ExpandView=&RestrictToCategory=Saudi+Arabia",
    "snippet": "The Heads of Government listing is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers and in some cases, ministers responsible for development assistance.",
    "published": null
  }
]