[
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "Greta Conway Van Susteren (born ... Fox News, and MSNBC. She <strong>hosted Fox News&#x27;s On the Record w/ Greta Van Susteren for 14 years (2002–2016) before departing for MSNBC, where she hosted For the Record with Greta for roughly six months in 2017.</strong>...",
    "published": "August 20, 2025"
  },
  {
    "title": "Greta Van Susteren | C-SPAN.org",
    "url": "https://www.c-span.org/person/greta-van-susteren/48096/",
    "snippet": "Greta Conway Van Susteren is an <strong>American commentator, lawyer, and former television news anchor for CNN, Fox News, and NBC News</strong>. She hosted Fox News&#x27;s On the Record w/ Greta Van Susteren for 14 years before departing for MSNBC, where she hosted For the Record with Greta for roughly six months ...",
    "published": null
  },
  {
    "title": "Greta Van Susteren",
    "url": "https://www.forbes.com/profile/greta-van-susteren/",
    "snippet": "Former Fox News Star Greta Van Susteren Moves To MSNBC <strong>Former Fox News star Greta Van Susteren will debut on MSNBC next week with For the Record with Greta</strong>.",
    "published": null
  },
  {
    "title": "MSNBC fires Greta Van Susteren, replaces her with liberal host | Fox News",
    "url": "https://www.foxnews.com/entertainment/msnbc-fires-greta-van-susteren-replaces-her-with-liberal-host",
    "snippet": "<strong>Greta Van Susteren is out at MSNBC less than six months after she started at the cable channel</strong>. Van Susteren broke the news of her own ouster Thursday, tweeting &quot;I&#x27;m out at MSNBC&quot; shortly before the network issued its own announcement.",
    "published": "June 30, 2017"
  },
  {
    "title": "Greta Van Susteren",
    "url": "https://www.kltv.com/authors/greta-van-susteren/",
    "snippet": "Greta Van Susteren is <strong>Chief National Political Analyst for Gray Media and host of Full Court Press</strong>. She is an award-winning journalist and worked as a news anchor at CNN, Fox News Channel and MSNBC.",
    "published": null
  }
]