[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "During his political career, Mélenchon crossed various tendencies of the French left, from Trotskyism in his youth to more moderate socialism, as <strong>he was in the Socialist Party for almost thirty years</strong>, occupying a place on the left wing of the party, before he began a companionship with the ...",
    "published": "2 days ago"
  },
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "&#x27;France Unbowed&#x27; or &#x27;France in Revolt&#x27;) is a left-wing political party in France. It was <strong>launched in 2016</strong> by Jean-Luc Mélenchon, then a Member of the European Parliament (MEP) and former co-president of the Left Party (PG). It aims to implement the eco-socialist and democratic socialist programme ...",
    "published": "3 days ago"
  },
  {
    "title": "The transformation of Jean-Luc Mélenchon: From radical outsider to populist leader | EUROPP",
    "url": "https://blogs.lse.ac.uk/europpblog/2017/04/22/the-transformation-of-jean-luc-melenchon/",
    "snippet": "He graduated in philosophy in 1972, but politically he was a “Lambertist”, a member of the French Trotskyist movement, and <strong>after 1971 he joined the Socialist Party of François Mitterrand</strong>.",
    "published": "March 17, 2021"
  },
  {
    "title": "Jean-Luc Mélenchon, the veteran leftist standing in the way of a Macron-Le Pen rematch",
    "url": "https://www.france24.com/en/europe/20220407-jean-luc-m%C3%A9lenchon-the-veteran-leftist-standing-in-way-of-macron-le-pen-rematch",
    "snippet": "Like many young leftwingers of ... He got a first job in the press four years later, before <strong>starting a 32-year-long association with the Socialist Party in 1976</strong>....",
    "published": "April 7, 2022"
  },
  {
    "title": "Jean-Luc Mélenchon‘s ‘Now the people – revolution in the 21st century’ - character, programme and methods of the new radical left | Socialist World Media",
    "url": "https://www.socialistworld.net/2025/10/23/jean-luc-melenchons-now-the-people-revolution-in-the-21st-century-character-programme-and-methods-of-the-new-radical-left/",
    "snippet": "He moved to France in 1962. There <strong>Mélenchon joined a Trotskyist group, Organisational Communiste Internationaliste, led by Pierre Lambert</strong>. This group conducted “deep entryism” within the PS, generally hiding Marxist politics.",
    "published": "October 23, 2025"
  }
]