[
  {
    "title": "2024–2025 French political crisis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–2025_French_political_crisis",
    "snippet": "The vote, held on 8 September, resulted in a heavy defeat for Bayrou, with 194 votes in favor of the government and 364 against. The National Rally and the New Popular Front voted against alongside other minor parties. Macron appointed Sébastien Lecornu as prime minister on 9 September 2025. Lecornu presented his cabinet on 5 October, but resigned the next day, making him the shortest-serving prime minister in the history of the French Fifth Republic.",
    "published": "3 weeks ago"
  },
  {
    "title": "French PM names new government, hoping to avoid another no-confidence vote | France | The Guardian",
    "url": "https://www.theguardian.com/world/2024/dec/23/french-pm-names-new-government-hoping-to-avoid-another-no-confidence-vote",
    "snippet": "One of the government’s first tasks will be to draw up a 2025 budget bill and reduce France’s budget deficit, which is expected to reach 6% of gross domestic product by the end of the year, well above the 3% of GDP the European Union requires of member states. Barnier pushed through a budget bill at the beginning of December using the controversial constitutional clause called the 49.3, but the legislation was dropped after his government lost the no confidence vote.",
    "published": "December 26, 2024"
  },
  {
    "title": "France has a new government. Here’s what it needs to do now | PBS News",
    "url": "https://www.pbs.org/newshour/world/france-has-a-new-government-heres-what-it-needs-to-do-now",
    "snippet": "The government, put together by newly named Prime Minister <strong>Francois Bayrou</strong>, includes members of the outgoing conservative-dominated team and new figures from centrist or left-leaning backgrounds.",
    "published": "December 23, 2024"
  },
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "If so, the president may serve ... between the legislature and the executive. The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 and resigned on 6 October 2025, but was re-appointed ...",
    "published": "18 hours ago"
  },
  {
    "title": "France’s Endless Nightmare: A Nation Incapable of Reform - American Thinker",
    "url": "https://www.americanthinker.com/articles/2025/12/france_s_endless_nightmare_a_nation_incapable_of_reform.html",
    "snippet": "The bill now moves to the Senate, where the governing coalition holds a majority. It will likely pass without major obstruction. On December 23rd, the Senate begins negotiations for the 2026 budget.",
    "published": "4 days ago"
  }
]