[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "Pochettino was born in Murphy, Santa Fe to Amalia and Héctor Pochettino, a farm labourer. His family is of Italian descent from Piedmont. Between the age of eight and ten, he played both football and volleyball, and also <strong>learned judo</strong>. He supported Racing Club de Avellaneda as a child.",
    "published": "2 weeks ago"
  },
  {
    "title": "Mauricio Pochettino - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1167021/bio/",
    "snippet": "He began to study for his coaching qualifications and, after a short stint helping to coach Espanyol&#x27;s successful women&#x27;s team, took over as coach of the men&#x27;s first team in January 2009 where he pulled them out of the relegation zone and finished tenth overall. After almost four years in charge of Espanyol, Pochettino became manager of Premier League side Southampton in January, 2013.",
    "published": null
  },
  {
    "title": "Young Mauricio Pochettino's soccer upbringing - Soccer America",
    "url": "https://www.socceramerica.com/young-mauricio-pochettinos-soccer-upbringing/",
    "snippet": "Mauricio&#x27;s young life and soccer education could not have been more different than what the USMNT players he will coach experienced.",
    "published": "September 3, 2024"
  },
  {
    "title": "Five Things to Know: Mauricio Pochettino | U.S. Soccer Official Website",
    "url": "https://www.ussoccer.com/stories/2024/09/five-things-to-know-about-us-mens-national-team-head-coach-mauricio-pochettino",
    "snippet": "Mauricio Pochettino was formally announced as the next head coach of the United States Men’s National Team on Tuesday, becoming the 40th manager in the program’s history. Get familiar with Pochettino’s style and background with the five things to know.",
    "published": "September 11, 2024"
  },
  {
    "title": "Maurizio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Maurizio_Pochettino",
    "snippet": "Maurizio Pochettino Grippaldi (born 30 March 2001) is an Argentine-Spanish professional footballer who plays as a winger for Andorran club Inter Club d&#x27;Escaldes. Pochettino is the son of the Argentine football manager and former footballer, Mauricio Pochettino.",
    "published": "October 1, 2025"
  }
]