[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Left_(Germany)",
    "snippet": "&#x27;The Left&#x27;), also known as the ... political party in Germany. The party was <strong>founded in 2007 as the result of the merger of the Party of Democratic Socialism (PDS) and Labour and Social Justice – The Electoral Alternative</strong>....",
    "published": "January 7, 2007"
  },
  {
    "title": "Left Party | Germany, Politics, Origin, & Election Results | Britannica",
    "url": "https://www.britannica.com/topic/Left-Party-political-party-Germany",
    "snippet": "The Left (Die Linke) is a German political party that ruled East Germany as the Socialist Unity Party of Germany (SED) and now contests elections in united Germany.",
    "published": "November 10, 2006"
  },
  {
    "title": "Welcome: Die Linke English pages",
    "url": "https://en.die-linke.de/welcome/",
    "snippet": "As a socialist party, DIE LINKE stands for alternatives, for a better future. We are a new left party, a democratic socialist left, comprised of those of different political, ideological and religious backgrounds, of women and men, old and young, immigrants, those with disabilities.",
    "published": null
  },
  {
    "title": "German elections: The Left party advocates for 'fair immigration society', right to asylum - InfoMigrants",
    "url": "https://www.infomigrants.net/en/post/62864/german-elections-the-left-party-advocates-for-fair-immigration-society-right-to-asylum",
    "snippet": "The Left party (Die Linke) was <strong>founded in 2007.</strong> It emerged from the merger of the Party of Democratic Socialism (PDS) -- the successor party to the SED in East Germany -- and the Electoral Alternative for Labor and Social Justice (WASG) in West ...",
    "published": null
  },
  {
    "title": "Die Linke: the legacy of the GDR",
    "url": "https://www.deutschland.de/en/topic/politics/die-linke-parties-in-the-german-bundestag",
    "snippet": "Profile: Die Linke (i.e. the Left) was <strong>formed in 2007 from the merger of the PDS – the democratic successor to the East German party SED – and the left-wing SPD breakaway group WASG</strong>.",
    "published": "May 8, 2025"
  }
]