[
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "He worked in these roles for more than nine years in total. He was the <strong>Minister of Production, Interior Minister, and Minister of Justice</strong>. He also served as the President&#x27;s Cabinet Chief.",
    "published": null
  },
  {
    "title": "Aníbal Fernández cuestionó al Gobierno y calificó de “vergüenza” la oferta salarial del sector empresario",
    "url": "https://www.opinandosannicolas.ar/2025/11/anibal-fernandez-cuestiono-al-gobierno-y-califico-de-verguenza-la-oferta-salarial-del-sector-empresario/",
    "snippet": "El <strong>ex jefe de Gabinete</strong> Aníbal Fernández sostuvo que las políticas oficiales “no tienen nada novedoso” y remiten a “las mismas de los ’70 y los ’90”, al considerar que favorecen a “un puñadito de empresas” mientras los ...",
    "published": "3 weeks ago"
  },
  {
    "title": "\"El daño es superlativo\": Aníbal Fernández llamó a \"levantar la voz\" contra el Gobierno POLÍTICA El Intransigente",
    "url": "https://elintransigente.com/2025/12/el-dano-es-superlativo-anibal-fernandez-llamo-a-levantar-la-voz-contra-el-gobierno/",
    "snippet": "El exjefe de Gabinete criticó la &quot;visión miope&quot; de la gestión actual y su &quot;falta de respeto&quot; por los vulnerables, urgiendo a la dirigencia a reaccionar. Aníbal Fernández, Gobierno",
    "published": "1 week ago"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "<strong>Chief of the Cabinet of Ministers and Candidate for Governor of the Province of Buenos Aires</strong> (Frente para la Victoria) Aníbal Fernández is a candidate for governor of the Province of Buenos Aires and currently chief of staff of the Minister’s ...",
    "published": null
  },
  {
    "title": "Presidency of Alberto Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Presidency_of_Alberto_Fern%C3%A1ndez",
    "snippet": "About a month later, seeking to broaden his appeal to moderates, Fernández struck a deal with Sergio Massa to form an alliance called Frente de Todos, wherein Massa would be offered a role within a potential Fernández administration, or be given a key role within the Chamber of Deputies in exchange for dropping out of the presidential race and offering his support. Fernández also earned the endorsement of the General Confederation of Labour, receiving their support in exchange for promising that he will boost the economy and that there would be no labor reforms. Fernández took office on 10 December 2019.",
    "published": "November 7, 2025"
  }
]