[
  {
    "title": "Konstantinos Tasoulas - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Konstantinos_Tasoulas",
    "snippet": "He previously served as President of the Hellenic Parliament from 2019 to 2025. A member of the New Democracy party, he was previously an MP for Ioannina from 2000 to 2025. He also briefly served as the Minister of Culture and Sports from 2014 to 2015 during the Antonis Samaras government. Tasoulas was born in Ioannina, Greece on 17 July 1959.",
    "published": "1 month ago"
  },
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "The current Third Hellenic Republic ... 1967. On 1 June 1973 the then leader of the military junta and regent for the exiled King Constantine II, <strong>Georgios Papadopoulos</strong>, abolished the Greek monarchy and proclaimed himself President of the Republic....",
    "published": "3 weeks ago"
  },
  {
    "title": "Katerina Sakellaropoulou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Katerina_Sakellaropoulou",
    "snippet": "Katerina N. Sakellaropoulou (Greek: Κατερίνα Ν. Σακελλαροπούλου [kateˈrina sacelaroˈpulu]; born 30 May 1956) is a Greek retired judge who served as the president of Greece from 2020 to 2025. She was elected by the Hellenic Parliament to succeed <strong>Prokopis Pavlopoulos</strong> on 22 ...",
    "published": "October 2, 2025"
  },
  {
    "title": "Greek premier nominates Parliament Speaker Konstantinos Tasoulas for president",
    "url": "https://www.aa.com.tr/en/europe/greek-premier-nominates-parliament-speaker-konstantinos-tasoulas-for-president/3451184",
    "snippet": "“His broad acceptance arises from the fact that he was elected president of the Hellenic Parliament three times with the greatest majority in the post-dictatorship era, with 283, 270 and 249 votes,” said Kyriakos Mitsotakis. He called on all parliamentary parties to evaluate Tassoulas&#x27; candidacy through a single prism, that of prestige and experience, of knowledge and character. A jurist and senior lawmaker, Tasoulas, 66, previously served as culture minister and deputy defense minister under conservative New Democracy (ND) governments before being elected parliament speaker.",
    "published": null
  },
  {
    "title": "Mitsotakis Nominates Tasoulas as Next President of Greece - GreekReporter.com",
    "url": "https://greekreporter.com/2025/01/15/mitsotakis-nominates-tasoulas-next-president-greece/",
    "snippet": "Mitsotakis also expressed gratitude to outgoing President <strong>Katerina Sakellaropoulou</strong> for her term, praising her for humanizing the presidency. However, he added that the country now requires a president with “a long-standing public service record ...",
    "published": "January 15, 2025"
  }
]