[
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "Included in its charge is the ... of athletics competitions, including the World Athletics Championships. The organisation&#x27;s current president is <strong>Sebastian Coe</strong> of the United Kingdom, who was elected to the four-year position in 2015, and re-elected twice in 2019 and 2023 for ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "Lifetime Achievement Award (BBC Sports Personality of the Year) Lifetime Achievement Award (Laureus World Sport Awards) ... Masters in managing Olympic sport organisations (2017) Universidad San Sebastian-Chilean Olympic Committee ... Progressed through the military ranks and held different appointments in operations, training and logistics · World Athletics Council Vice-President (2023-present)",
    "published": null
  },
  {
    "title": "Coe re-elected and will preside over historic gender equal Council | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/sebastian-coe-president-congress-2023-gender-equal-council",
    "snippet": "World Athletics President <strong>Sebastian Coe</strong> was elected for a third term at the 54th World Athletics Congress in Budapest on Thursday (17).",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "He was the director of the Dutch Olympic Committee between 1965 and 1970 but retained an extensive involvement with athletics, becoming the European Athletics Association president upon its formation in 1970 until 1976, when he was elected as the third IAAF president. Curiously, at the age of 73, he was two years older than the man he was succeeding but Paulen was active in addressing many of the relevant issues of the changing times. The first IAAF World Cup in 1977 was contested during his brief presidency and he set in motion events that lead to the first IAAF World Championships in 1983.",
    "published": null
  },
  {
    "title": "New Athletes' Commission members announced | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/athletes-commission-members-2025-2029",
    "snippet": "The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December 2016. Since 2019, the Chairperson and one other member of the Athletes’ Commission – one man and one woman – have been full voting members of the World Athletics Council.",
    "published": null
  }
]