[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "It was subsequently acquired by ... TF1 Group later bought out the other owners&#x27; shares. In 2012, <strong>Discovery Communications began to take an ownership in Eurosport, eventually leading to a full buyout in 2015.</strong>...",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport International 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/63601-30",
    "snippet": "Information on acquisition, funding, investors, and executives for Eurosport International. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Acquisition of the Eurosport group by Discovery Communications ...",
    "url": "https://groupe-tf1.fr/en/press-release/group-activity-development-acquisitions-sales-diversification/acquisition-eurosport-group-discovery-communications",
    "snippet": "Acquisition of the Eurosport group by Discovery Communications The TF1 group and Discovery Communications today confirm completion of: <strong>the acquisition by Discovery Communications of a 49% equity interest in the Eurosport group, which is now 100% owned by Discovery Communications</strong>; the buyout ...",
    "published": null
  },
  {
    "title": "Discovery to Acquire Full Control of Eurosport for $534 Million",
    "url": "https://www.hollywoodreporter.com/news/general-news/discovery-communications-fully-acquire-eurosport-810414/",
    "snippet": "<strong>Discovery Communications on Wednesday unveiled an agreement to acquire full ownership of pan-European sports network Eurosport for $534 million (€491 million)</strong> from France’s TF1 Group, which has announced it will exercise a put option on ...",
    "published": "July 22, 2015"
  },
  {
    "title": "Eurosport - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/eurosport",
    "snippet": "Eurosport is a pan-European television sports network, owned and operated by Discovery Communications. ... Get predictions on funding, acquisitions, IPOs and more.",
    "published": null
  }
]