[
  {
    "title": "FC Versailles 78 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FC_Versailles_78",
    "snippet": "The club is an official academy of the French Football Federation. Since 2024, the club has been <strong>partially owned by French Formula One driver Pierre Gasly</strong>. FC Versailles was formed in 1989 as the result of a merger between Racing Club Versailles and Companion Sports Versailles.",
    "published": "3 weeks ago"
  },
  {
    "title": "r/formula1 on Reddit: Pierre Gasly becomes the 3rd partner owner of FC Versailles",
    "url": "https://www.reddit.com/r/formula1/comments/1bhvt10/pierre_gasly_becomes_the_3rd_partner_owner_of_fc/",
    "snippet": "The board will promise you a 100m budget and a new stadium, but what they really mean is 100 euros and 45 new seats ... FC Versailles is proud to welcome <strong>Pierre Gasly</strong>, French Formula 1 driver, as its third owner partner.",
    "published": "March 18, 2024"
  },
  {
    "title": "Pierre Gasly steps into football ownership with FC Versailles",
    "url": "https://www.pitinsider.com/pierre-gasly-steps-into-football-ownership-with-fc-versailles/",
    "snippet": "<strong>Pierre Gasly</strong> has acquired a stake in FC Versailles, a French football club competing in the third tier of the country&#x27;s football pyramid, the National.",
    "published": "March 19, 2024"
  },
  {
    "title": "Formula 1 driver Pierre Gasly becomes French football club's co-owner",
    "url": "https://www.aa.com.tr/en/sports/formula-1-driver-pierre-gasly-becomes-french-football-clubs-co-owner/3168580",
    "snippet": "Formula 1 driver <strong>Pierre Gasly</strong> has become co-owner of FC Versailles, a semi-professional French football club based near Paris.",
    "published": null
  },
  {
    "title": "Pierre Gasly buys stake in semi-pro French football club FC Versailles | The Independent",
    "url": "https://www.independent.co.uk/f1/f1-pierre-gasly-versailles-alpine-b2514440.html",
    "snippet": "He will bring us his very high level knowledge and his humility… I am certain that our collaboration will be fruitful. <strong>Pierre Gasly</strong> has bought a stake in French third division club FC Versailles (Getty Images)",
    "published": "March 18, 2024"
  }
]