[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Die_Linke",
    "snippet": "The party was founded in 2007 as ... the Socialist Unity Party of Germany (SED). Since October 2024, Die Linke&#x27;s co-chairpersons have been <strong>Ines Schwerdtner and Jan van Aken</strong>....",
    "published": "January 7, 2007"
  },
  {
    "title": "The Improbable Resurgence of Die Linke",
    "url": "https://jacobin.com/2025/02/die-linke-germany-renewal-strategy/",
    "snippet": "But becoming a party of the working class will take a lot more than a last-minute turnaround at the polls. <strong>Jan van Aken</strong> (L), federal chairman of Die Linke, and member of the Bundestag Gregor Gysi speak at a press conference in Berlin on February ...",
    "published": null
  },
  {
    "title": "Sahra Wagenknecht - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sahra_Wagenknecht",
    "snippet": "In mid-October, over 50 members of Die Linke submitted an application for Wagenknecht&#x27;s exclusion from the party. The initiators said they wanted to prevent <strong>Sahra Wagenknecht</strong> from building a new party with the resources of Die Linke. &quot;This is no longer acceptable,&quot; said Sofia Leonidakis, leader ...",
    "published": "1 month ago"
  },
  {
    "title": "Left Party | Germany, Politics, Origin, & Election Results | Britannica",
    "url": "https://www.britannica.com/topic/Left-Party-political-party-Germany",
    "snippet": "Left Party, German political party that ruled East Germany as the Socialist Unity Party of Germany (SED) and now contests elections in united Germany as the Left (Die Linke).",
    "published": "November 10, 2006"
  },
  {
    "title": "How Die Linke Turned the Tide - Rosa-Luxemburg-Stiftung",
    "url": "https://www.rosalux.de/en/news/id/53139/how-die-linke-turned-the-tide",
    "snippet": "<strong>Ines Schwerdtner and Jan van Aken</strong> have served as co-chairs of Die Linke since October 2024 and were both elected to parliament in the 2025 federal election.",
    "published": "February 25, 2025"
  }
]