[
  {
    "title": "Arteta's update on Rice, Timber, Trossard & Saliba | Press conference | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/artetas-update-rice-timber-trossard-saliba",
    "snippet": "Share Connor Booth 12 Dec 2025 · <strong>Mikel Arteta</strong> has delivered the latest news on the fitness of several first team players as we prepare to host Wolves in the Premier League on Saturday, December 13.",
    "published": null
  },
  {
    "title": "2025–26 Arsenal F.C. season - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025%E2%80%9326_Arsenal_F.C._season",
    "snippet": "The away side&#x27;s jubilation would be short lived, however, as Saka forced in an own goal once again, this time his delivery striking opposing defender Yerson Mosquera and finding the target. The 2–1 victory meant that Arsenal retained their 2-point gap at the top of the league summit. Note: Age as of 16 December 2025.",
    "published": "19 hours ago"
  },
  {
    "title": "Arsenal Transfer DealSheet: What to expect in 2026 - The Athletic",
    "url": "https://www.nytimes.com/athletic/6852386/2025/12/02/arsenal-transfer-latest-january-summer-2026/",
    "snippet": "Mikel Arteta and Arsenal have already lined up the arrival of <strong>Victor Ozhianvuna</strong> (right) Getty Images ... Dec. 2, 2025Updated Dec.",
    "published": "2 weeks ago"
  },
  {
    "title": "Six players miss return to Arsenal training as Mikel Arteta given fresh headache | Football London",
    "url": "https://www.football.london/arsenal-fc/news/five-players-miss-return-arsenal-33064897",
    "snippet": "Kai Havertz is not ready to join the main group, however, the Arsenal manager confirmed, is back outside on the pitch, which comes as a real positive. The German forward has been missing since he injured his knee on the opening day at Manchester United. “He is doing really well, he is doing stuff on the pitch, Arteta admitted in early December.",
    "published": "7 hours ago"
  },
  {
    "title": "How Arsenal reintegrate players returning from injury: Bespoke programmes – and patience - The Athletic",
    "url": "https://www.nytimes.com/athletic/6881440/2025/12/12/arsenal-reintegrating-players-from-injury/",
    "snippet": "Gabriel Jesus prays at full time after making his comeback from 11 months out injured in Arsenal&#x27;s Champions League win against Club Brugge on Wednesday Dean Mouhtaropoulos/Getty Images ... Dec. 12, 2025Updated Dec. 13, 2025 ... At the start of December, Mikel Arteta said injuries had been “a theme of this season” for his Arsenal side.",
    "published": "3 days ago"
  }
]