[
  {
    "title": "List of presidents of Indonesia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Indonesia",
    "snippet": "During this time, the Emergency Government of the Republic of Indonesia, led by Sjafruddin Prawiranegara, acted as the country&#x27;s government-in-exile until 13 July 1949. As a result, Sukarno&#x27;s term in office actually had 206 days less. This figure includes his term as the president of the United States of Indonesia (27 December 1949 – 15 August 1950; 231 days), which was coterminous with Assaat being president of the constituent Republic of Indonesia.",
    "published": "November 7, 2025"
  },
  {
    "title": "President of Indonesia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Indonesia",
    "snippet": "This was a clear sign that while the presidency is the key institution, the MPR was now a check on the president&#x27;s power. Wahid was replaced by his vice-president, <strong>Megawati Sukarnoputri</strong>, daughter of Sukarno and former opposition leader during Suharto&#x27;s presidency.",
    "published": "4 weeks ago"
  },
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "Later that evening, <strong>Joko Widodo</strong> was officially announced as president and began to receive congratulations from world leaders. Following the announcement, the value of the Indonesian rupiah dropped by 0.3%, and the JSX Composite fell by 0.9%. Observers denied Prabowo&#x27;s allegations of cheating, ...",
    "published": "3 days ago"
  },
  {
    "title": "Prabowo is finally president in Indonesia – now what? | Lowy Institute",
    "url": "https://www.lowyinstitute.org/the-interpreter/prabowo-finally-president-indonesia-now-what",
    "snippet": "“Third time’s the charm,” screamed Indonesian and foreign media after <strong>Prabowo Subianto</strong> finally clinched victory. Twice Prabowo had lost to Joko “Jokowi” Widodo, yet Prabowo was welcomed into the fold by Jokowi following the 2019 trouncing.",
    "published": null
  },
  {
    "title": "Joko Widodo - BBC News",
    "url": "https://www.bbc.com/news/topics/cw1qqzx6129t",
    "snippet": "So what happens now? ... <strong>Prabowo Subianto</strong>, who is dogged by allegations of rights abuses, appears on course to win the presidency. ... Indonesia&#x27;s early election results show <strong>Prabowo Subianto</strong> has over 50% of the vote. ... The world&#x27;s third-largest democracy is facing a crucial test of its ...",
    "published": null
  }
]