[
  {
    "title": "Spouse or partner of the prime minister of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Spouse_or_partner_of_the_prime_minister_of_Australia",
    "snippet": "Until the 1960s, it was uncommon for the spouse of a prime minister to have their own career. <strong>Zara Holt</strong>, a fashion designer, was the first to continue her career during her husband&#x27;s term in office, and reputedly earned more money than him.",
    "published": "5 days ago"
  },
  {
    "title": "Jodie Haydon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jodie_Haydon",
    "snippet": "<strong>Jodie Haydon</strong> (born 1978 or 1979) is an Australian financial services professional and women&#x27;s advocate. She is the wife of the 31st (and current) prime minister of Australia, Anthony Albanese.",
    "published": "2 weeks ago"
  },
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "<strong>Albanese</strong> is the first prime minister of Australia to be engaged or wed while in office. <strong>Albanese</strong> describes himself as &quot;half-Italian and half-Irish&quot; and a &quot;non-practising Catholic&quot;. He is also a music fan who, not long after becoming prime minister, attended a Gang of Youths concert at the Enmore ...",
    "published": "20 hours ago"
  },
  {
    "title": "Gough Whitlam's partner: Margaret Whitlam | naa.gov.au",
    "url": "https://www.naa.gov.au/explore-collection/australias-prime-ministers/gough-whitlam/partner",
    "snippet": "Gough Whitlam was the Prime Minister of Australia from 1972 to 1975. ... From 1972 to 1975, <strong>Margaret Whitlam</strong> was an outspoken prime ministerial spouse, a frequent guest speaker, broadcaster and columnist.",
    "published": null
  },
  {
    "title": "Australian prime minister Albanese becomes first to wed in office",
    "url": "https://www.bbc.com/news/articles/ce865kpdzz8o",
    "snippet": "Anthony Albanese weds <strong>Jodie Haydon</strong>, after the couple became engaged on Valentine&#x27;s Day last year.",
    "published": "3 weeks ago"
  }
]