[
  {
    "title": "Taye Atske Selassie - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taye_Atske_Selassie",
    "snippet": "Taye Atske Selassie Amde (Amharic: ታዬ አጽቀሥላሴ, born 13 January 1956) is an Ethiopian diplomat and politician who is the <strong>President of Ethiopia since 2024</strong>.",
    "published": "November 6, 2025"
  },
  {
    "title": "Taye Atske Selassie becomes Ethiopia's new president | TV BRICS, 08.10.24",
    "url": "https://tvbrics.com/en/news/taye-atske-selassie-becomes-ethiopia-s-new-president/",
    "snippet": "Taye Atske Selassie was sworn in as <strong>President of the Federal Democratic Republic of Ethiopia</strong> at a joint parliamentary session of the country on 7 October 2024.",
    "published": null
  },
  {
    "title": "Taye Atske Selassie - X",
    "url": "https://x.com/TayeAtske/status/1755598004021842391",
    "snippet": "Taye Atske Selassie · @TayeAtske · <strong>President of The Federal Democratic Republic of Ethiopia</strong> ; Former Foreign Minister, Ambassador and Permanent Representative of Ethiopia to the UN. Ethiopia Joined August 2014 · 543 Following · 287.3K Followers · Pinned · Taye Atske Selassie ·",
    "published": null
  },
  {
    "title": "Ambassador Taye Atske Selassie Appointed President of Ethiopia - ENA English - ENA",
    "url": "https://www.ena.et/web/eng/w/eng_5251030",
    "snippet": "Addis Ababa October 7/2024 (ENA) - Ambassador Taye Atske Selassie, serving as Minister of Foreign Affairs has been appointed as <strong>president of Federal Democratic Republic of Ethiopia</strong>.",
    "published": null
  },
  {
    "title": "Eritrean Press on X: \"Taye Atske Selassie has been appointed as Ethiopia’s new president, succeeding the country’s first female president, Sahle-Work Zewde. He has served as the Minister of Foreign Affairs since February 8, 2024. Born in Debarek, Gondar, Taye, who stands 5 ft. 4 in. tall, https://t.co/rlf4OigIUy\" / X",
    "url": "https://x.com/EritreanPress/status/1843269110211170493",
    "snippet": "Taye Atske Selassie has been appointed as Ethiopia’s new president, succeeding the country’s first female president, Sahle-Work Zewde. He has served as the <strong>Minister of Foreign Affairs since February 8, 2024</strong>. Born in Debarek, Gondar, Taye, ...",
    "published": null
  }
]