[
  {
    "title": "Fiat - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat",
    "snippet": "Fiat Automobiles S.p.A., commonly known as Fiat (UK: /ˈfiːət, -æt/ FEE-ət, -⁠at, ... Italian: [ˈfiːat]), is an Italian automobile manufacturer. Fiat Automobiles was formed in January 2007 when Fiat Group reorganized its automobile business, and traces its history back to 1899, when ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Fiat S.p.A. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_S.p.A.",
    "snippet": "Following the Egyptian Revolution of 1952, President Gamal Abdel Nasser ordered the EGID (General Intelligence Agent) to establish a state owned automobile company. El Nasr Automotive Manufacturing Company was founded in 1960 in Helwan, Egypt. It began producing some Fiat based models, but later produced the TOFAŞ Şahin under license by Tofaş. The last Fiat 128 model was built in 2008, while the Şahin is still in production in Egypt. Currently the El-Mashreq Company, a part of the Seoudi Group is the main manufacturer of Alfa Romeo and Fiat vehicles for the Egyptian market.",
    "published": "3 weeks ago"
  },
  {
    "title": "Fiat Chrysler Automobiles - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_Chrysler_Automobiles",
    "snippet": "The corporation was established by January 2012, when Fiat Group acquired a 58.5% stake of the Chrysler Group (which from 1998 to 2007 was part of DaimlerChrysler) and thus became, at that time, the 7th largest automaker (behind Toyota, General Motors, Volkswagen, Hyundai, Ford and Nissan). Its corporate headquarters were domiciled in Amsterdam and its financial headquarters were in London.",
    "published": "2 weeks ago"
  },
  {
    "title": "Fiat SpA | Definition, History, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Fiat-SpA",
    "snippet": "Fiat, major Italian manufacturer of automobiles that is a subsidiary of the multinational automobile manufacturer Stellantis. Among its automotive names were Chrysler, Ferrari, Maserati, and Lancia. The company also had interests in retailing, chemicals, and civil engineering in addition to manufacturing farm equipment and earth-moving machinery. Headquarters are in Turin.",
    "published": null
  },
  {
    "title": "The headquarters of Fiat are in... | Trivia Answers | QuizzClub",
    "url": "https://quizzclub.com/trivia/the-headquarters-of-fiat-are-in-which-italian-city/answer/1087387/",
    "snippet": "Fiat Automobiles is an Italian automobile manufacturer headquartered in <strong>Turin</strong>. It&#x27;s a subsidiary of FCA Italy S.p.A., which is part of Fiat Chrysler Automobiles. It was founded in 1899 by Giovanni Agnelli.",
    "published": "March 7, 2020"
  }
]