[
  {
    "title": "Sushila Karki - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sushila_Karki",
    "snippet": "Sushila Karki (born 7 June 1952) is a Nepalese politician and former jurist who became the <strong>interim prime minister of Nepal</strong> following the Gen Z-led protests of September 2025 that led to her predecessor’s resignation. She is the first woman in Nepal’s history to serve both as prime minister ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Nepal's interim government: Two new ministers take oath as PM Sushila Karki expands Cabinet - The Hindu",
    "url": "https://www.thehindu.com/news/international/nepals-interim-government-two-new-ministers-take-oath-as-pm-sushila-karki-expands-cabinet/article70204924.ece",
    "snippet": "Gupta has been given the portfolio of Youth and Sports, while <strong>Gautam will receive the portfolio of Health and Population</strong>. The Cabinet now consists of 10 ministers. Following two days of Gen Z protests in Nepal on September 8 and 9 that led to ...",
    "published": "October 26, 2025"
  },
  {
    "title": "Karki interim cabinet - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Karki_interim_cabinet",
    "snippet": "An interim government was formed in Nepal on 12 September 2025 after the Generation Z-led mass anti-corruption protests that overthrew the government of the prime minister, K. P. Sharma Oli. With the dissolution of the second federal parliament on 12 September 2025, the new cabinet led by interim Prime Minister Sushila Karki will remain in office until a successor government is appointed upon a general election.",
    "published": "4 days ago"
  },
  {
    "title": "Nepal PM Sushila Karki Cabinet Expansion Adds New Ministers",
    "url": "https://www.newkerala.com/news/o/nepal-pm-sushila-karki-expands-cabinet-inducts-new-faces-856",
    "snippet": "&quot;The duo took the oath of office before President Ram Chandra Poudel during a ceremony at the President&#x27;s Office.&quot; She inducted <strong>Sudha Gautam</strong>, a former Health Secretary, as Minister for Health and Population, and Bablu Gupta, a social activist, ...",
    "published": "October 26, 2025"
  },
  {
    "title": "Nepal PM Karki expands cabinet, inducts new facesThe Shillong Times",
    "url": "https://theshillongtimes.com/2025/10/27/nepal-pm-karki-expands-cabinet-inducts-new-faces/",
    "snippet": "Kathmandu, Oct 26: Nepal’s interim government, led by Prime Minister Sushila Karki, added new faces to her Cabinet on Sunday. The Prime Minister continues to hold several ministerial portfolios. She inducted <strong>Sudha Gautam</strong>, a former Health Secretary, as Minister for Health and Population, and ...",
    "published": null
  }
]