[
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Charged with leading France’s golden generation of players, <strong>Fabien Galthie</strong> has overseen one of rugby’s great revolutions. With the otherworldly talents of Antoine Dupont, Damien Penaud, Romain Ntamack and Gregory Alldritt at his fingertips, ...",
    "published": "May 30, 2025"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "Although coached by <strong>Jean Desclaux between 1973 and 1980</strong>, the French team&#x27;s main influence during the late 1970 was captain Jacques Fouroux. Fouroux played scrum-half and captained France to their 1977 Five Nations Grand Slam, during which France played a very forward-oriented style of rugby.",
    "published": "1 week ago"
  },
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "In 2001 Galthié was appointed captain of France. A successful year in 2002, including a Six Nations Grand Slam, saw France dominate the 2002 IRB Awards, with Galthié named Player of the Year, as well as French coach <strong>Bernard Laporte</strong> being named Coach of the Year.",
    "published": "3 weeks ago"
  },
  {
    "title": "Fabien Galthie: Ten things you should know about the France head coach",
    "url": "https://www.rugbyworld.com/countries/france-countries/fabien-galthie-ten-things-you-should-know-about-the-france-head-coach-134810",
    "snippet": "3. Overall Galthie played in 64 Tests for France between 1991 and 2003, scoring ten tries during his international career. 4. <strong>Galthie started coaching in 2004 with his first post at his former team Stade Francais</strong>.",
    "published": "January 12, 2024"
  },
  {
    "title": "France national rugby union team coaches - FamousFix.com list",
    "url": "https://m.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "... Overview: Bernard Laporte (born 1 July 1964) is a rugby player, coach and former French Secretary of State for Sport. <strong>From 1999 to 2007, Laporte was the head coach of the France national team</strong>.",
    "published": null
  }
]