[
  {
    "title": "Eqtgroup",
    "url": "https://eqtgroup.com/about/history",
    "snippet": "Over the course of Sweden’s modern ... Investor AB, founded in 1916. Inspired by the Wallenberg family’s philosophy of responsible ownership, <strong>Conni Jonsson</strong> received a mandate from the board of Investor AB to establish EQT in 1994 with the backing from Investor AB, AEA ...",
    "published": null
  },
  {
    "title": "EQT AB - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_AB",
    "snippet": "It is ranked the third largest private equity firm worldwide based on funds raised according to the 2024 edition of Private Equity International&#x27;s PEI 300 ranking. The company was founded in 1994 by <strong>SEB, AEA Investors, and Investor AB</strong>. Conni Jonsson was founding chairman.",
    "published": "3 weeks ago"
  },
  {
    "title": "EQT Corporation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_Corporation",
    "snippet": "EQT opened one of the first compressed natural gas (CNG) fueling stations in the Strip District of Pittsburgh in 2011. That same year, David L.",
    "published": "July 14, 2025"
  },
  {
    "title": "EQT: From Nordic Roots to Global Dominance",
    "url": "https://quartr.com/insights/company-research/eqt-from-nordic-roots-to-global-dominance",
    "snippet": "The idea to establish EQT emerged during a dinner in Stockholm’s Gamla Stan (Old Town) in 1993, where <strong>Conni Jonsson</strong>, then an employee at the Wallenberg family’s investment company Investor, and Claes Dahlbäck, the CEO of Investor, discussed ...",
    "published": "September 11, 2025"
  },
  {
    "title": "30 Years of Being More Than Capital",
    "url": "https://eqtgroup.com/thinq/Education/30-years-of-being-more-than-capital",
    "snippet": "EQT started life in 1994 as a small Stockholm-based startup: an idea that was first dreamt up a year earlier between <strong>Conni Jonsson</strong>, at the time working at Investor AB, the industrial holding company founded by the Wallenbergs in 1916, and his CEO, Claes Dahlbäck, over dinner in Stockholm’s ...",
    "published": null
  }
]