[
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Previously, he served in the National Senate as representative for the province of Buenos Aires. Fernández <strong>initiated his career as consultant to the Budget Committee for the Senators Chambers of the province of Buenos Aires in 1983</strong>.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anibal_Fernandez",
    "snippet": "<strong>He has held several cabinet positions under three presidents, serving in these offices for a total of over nine years</strong>. He served as Minister of Production under Eduardo Duhalde, as Interior Minister under Néstor Kirchner, as Minister of Justice under Cristina Fernández de Kirchner, and as ...",
    "published": "March 27, 2025"
  },
  {
    "title": "Aníbal Fernández (Politician) - Age, Birthday, Bio, Facts, Family, Net Worth, Height & More | AllFamous.org",
    "url": "https://allfamous.org/people/anibal-fernandez-19570126.html",
    "snippet": "He served as Minister of Production under Eduardo Duhalde, Interior Minister under Néstor Kirchner, Justice Minister under Cristina Fernández de Kirchner and Chief of Staff for the President from <strong>2009 to 2011</strong> ..",
    "published": "March 20, 2023"
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "<strong>After the 2009 mid-term elections, Aníbal Fernández was chosen to become the President&#x27;s Cabinet Chief</strong>.",
    "published": null
  },
  {
    "title": "Argentina - Politics",
    "url": "https://www.globalsecurity.org/military/world/argentina/president-fernandez-a.htm",
    "snippet": "<strong>After serving as campaign manager of Nestor Kirchner&#x27;s successful 2003 bid for the presidency, AF became Cabinet Chief on May 25, 2003.</strong> Cabinet Chief Alberto Fernandez was President Nestor Kirchner&#x27;s [2003-2007] main advisor on Buenos Aires politics and on the workings of the national PJ party ...",
    "published": null
  }
]