[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "<strong>In the 1980s, the government of Canada under Prime Minister Brian Mulroney privatized DHC and in 1986 sold the aircraft company to then Seattle-based Boeing. DHC was eventually acquired by Montreal-based Bombardier Aerospace in 1992</strong> after cumulative losses of US$636 million over five years ...",
    "published": "1 month ago"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "Commuter airlines did not create ... the Canadian government purchased de Havilland Canada from its British owners, <strong>Hawker Siddeley Aviation</strong>....",
    "published": null
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "In November 2018, <strong>Longview Aviation Capital Corp.</strong> acquired the Dash 8 programme and the de Havilland Canada brand from Bombardier, adding them to the rights and type certificates for all of the out-of-production aircraft (DHC-1 through DHC-7) already sold to its subsidiary Viking Air in 2005.",
    "published": "November 1, 2025"
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "Then, in 1974, the Canadian government purchased De Havilland Canada from its British owner, <strong>Hawker Siddeley Aviation</strong>. However, DHC&#x27;s status as a &quot;Crown Corporation&quot; will not last long.",
    "published": "February 21, 2024"
  },
  {
    "title": "de Havilland Canada (1928–1986) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada_(1928–1986)",
    "snippet": "The aircraft company was established ... World War, designed and produced indigenous designs. <strong>In the 1980s, the Government of Canada privatized DHC and in 1986 sold the aircraft company to then Seattle-based Boeing</strong>, which renamed the company to Boeing of Canada Ltd., marking ...",
    "published": "November 1, 2025"
  }
]