[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "He is an <strong>emeritus fellow of New College, Oxford</strong>. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and is on the advisory board of the University of Austin. Dawkins has won several academic and writing awards, among them ...",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins | Vrije Universiteit Brussel",
    "url": "https://www.vub.be/en/person/richard-dawkins",
    "snippet": "From 1995 to 2008, Dawkins was a <strong>professor at the University of Oxford</strong>, holding the Charles Simonyi Chair for the Public Understanding of Science. He used this position to promote science and rational thinking, becoming known for his sharp criticism ...",
    "published": "December 2, 2024"
  },
  {
    "title": "Richard Dawkins: Social Sciences and Humanities H-index & Awards - Academic Profile | Research.com",
    "url": "https://research.com/u/richard-dawkins",
    "snippet": "<strong>Literature, Genetics, Gene-centered view of evolution, Evolutionary biology and Art history</strong> are his primary areas of study. Richard Dawkins has included themes like Aesthetics, Darwinism and Wonder in his Literature study.",
    "published": null
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and ... Dawkins assisted Tinbergen before becoming an <strong>assistant professor of zoology (1967–69) at the University of California, Berkeley</strong>....",
    "published": "July 15, 2009"
  },
  {
    "title": "Professor Richard Dawkins FRS",
    "url": "https://royalsociety.org/people/richard-dawkins-11316/",
    "snippet": "Richard is a <strong>prominent scientist</strong>, having published bestselling books on genetics and evolution, including The Selfish Gene (1976), The Blind Watchmaker (1986) — with the latter winning a number of awards.",
    "published": null
  }
]