[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "The Union is <strong>best known for being the leading authority in assigning official names and designations to astronomical objects, and for setting uniform definitions for astronomical principles</strong>. It also coordinates with national and international partners, such as UNESCO, to fulfill its mission.",
    "published": "3 weeks ago"
  },
  {
    "title": "International Astronomical Union (IAU) | Britannica",
    "url": "https://www.britannica.com/topic/International-Astronomical-Union",
    "snippet": "International Astronomical Union (IAU), senior body governing international professional astronomical activities worldwide, with headquarters in Paris. It was established in 1919 as the first of a series of international unions for the advancement of specific branches of science. Its professed",
    "published": "March 29, 2007"
  },
  {
    "title": "The History of the International Astronomical Union",
    "url": "https://adsabs.harvard.edu/full/1949PASP...61....5A",
    "snippet": "A powerful, streamlined new Astrophysics Data System",
    "published": null
  },
  {
    "title": "IAU HISTORY | IAU100:Under One Sky",
    "url": "https://www.iau-100.org/iau-history",
    "snippet": "In the late nineteenth century, several large-scale international surveys had been organised, most notably the great Carte du Ciel and the related Astrographical Catalogue. <strong>George Ellery Hale</strong>, one of the founders of modern astrophysics, had founded the International Union for Cooperation in ...",
    "published": null
  },
  {
    "title": "Astronomy and World Politics: History of the IAU. The Birth and First Half- Century of the International Astronomical Union. Adriaan Blaauw. Published for the International Astronomical Union by Kluwer, Norwell, MA, 1994. xx, 296 pp., illus. $90 or £60 or Dfl. 150; paper, $49 or £36 or Dfl. 90. | Science",
    "url": "https://www.science.org/doi/10.1126/science.266.5193.2027",
    "snippet": "Owen Gingerich ,Astronomy and World Politics: History of the IAU. The Birth and First Half- Century of the International Astronomical Union. Adriaan Blaauw. Published for the International Astronomical Union by Kluwer, Norwell, MA, 1994. xx, 296 pp., illus. $90 or £60 or Dfl.",
    "published": null
  }
]