[
  {
    "title": "NBA Head Coaches | The Official Website of The NBA Coaches Association",
    "url": "https://nbacoaches.com/nba-head-coaches/",
    "snippet": "NBA Head CoachesNBA Coaches Association2025-12-02T19:22:52+00:00 · EASTERN CONFERENCE · Boston Celtics · BIO · Brooklyn Nets · BIO · New York Knicks · BIO · Philadelphia 76ers · BIO · Toronto Raptors · BIO · Chicago Bulls · BIO · Cleveland Cavaliers ·",
    "published": "May 27, 2019"
  },
  {
    "title": "Ranking All 30 NBA Head Coaches for 2025 – The Big Lead",
    "url": "https://lists.thebiglead.com/sports/ranking-all-30-nba-head-coaches-for-2025/",
    "snippet": "Atkinson finally got his chance to be back as a head coach this year. He had been a highly-touted assistant for years once getting the Brooklyn Nets job. He ultimately resigned midway through his fourth year. After two coaching ‘rehab stints’ under Ty Lue and Steve Kerr, Atkinson found himself a plush job with the Cavs. He led Cleveland to the No. 1 overall seed in the Eastern Conference after a fantastic 64-18 mark in the regular season. Named as the 2025 NBA Coach of the Year, the next step will involve the Cavs staying healthy and pushing for a run to the NBA Finals.",
    "published": null
  },
  {
    "title": "2024-25 NBA Coaches | Basketball-Reference.com",
    "url": "https://www.basketball-reference.com/leagues/NBA_2025_coaches.html",
    "snippet": "Get the list of all the 2024-25 NBA Coaches including their teams and more on Basketball-Reference.com",
    "published": null
  },
  {
    "title": "List of current NBA head coaches - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_current_NBA_head_coaches",
    "snippet": "Amongst the active NBA head coaches, Doc Rivers has coached and won the most games, while Rick Carlisle has lost the most games. Mark Daigneault, Steve Kerr, Joe Mazzulla, and Spoelstra have won NBA championships with their current teams, while Carlisle, Tyronn Lue, Nick Nurse, and Rivers have won with their former teams. As of November 15, 2025, 18 coaches have spent their entire NBA head coaching career with their current team.",
    "published": "2 weeks ago"
  },
  {
    "title": "NBA Coaches - National Basketball Association - ESPN",
    "url": "https://www.espn.com/nba/coaches",
    "snippet": "National Basketball Association (NBA) Coaches on ESPN.com.",
    "published": null
  }
]