[
  {
    "title": "The Walt Disney Company - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Walt_Disney_Company",
    "snippet": "The Walt Disney Company, commonly referred to as simply Disney, is an American multinational mass media and entertainment conglomerate headquartered at the <strong>Walt Disney Studios complex in Burbank, California</strong>, while Disney’s New York operations, including ABC, are headquartered at 7 Hudson Square.",
    "published": "12 hours ago"
  },
  {
    "title": "The Walt Disney Company Offices: Locations & Headquarters | Built In",
    "url": "https://builtin.com/company/walt-disney-company/offices",
    "snippet": "The Walt Disney Company is headquartered in <strong>Burbank, California, USA</strong> and has 15 office locations.",
    "published": null
  },
  {
    "title": "Walt Disney Studios (Burbank) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Walt_Disney_Studios_(Burbank)",
    "snippet": "The Walt Disney Studios, located in <strong>Burbank, California, United States</strong>, serves as the corporate headquarters for the Walt Disney Company. The 51-acre (20.6 ha) studio lot also contains several sound stages, a backlot, and other filmmaking production facilities for Walt Disney Studios&#x27;s motion ...",
    "published": "3 days ago"
  },
  {
    "title": "The Walt Disney Co Locations - Headquarters & Offices - GlobalData",
    "url": "https://www.globaldata.com/company-profile/the-walt-disney-company/locations/",
    "snippet": "View The Walt Disney Co company headquarters address along with its other key offices and locations.",
    "published": null
  },
  {
    "title": "The Walt Disney Company Company Profile - The Walt Disney Company Overview - GlobalData",
    "url": "https://www.globaldata.com/company-profile/the-walt-disney-company/",
    "snippet": "Disney operates globally, with significant markets in North America, Europe, and Asia. Disney is headquartered in <strong>Burbank, California</strong>, the US. Gain a 360-degree view of The Walt Disney Co and make more informed decisions for your business Gain a 360-degree view of The Walt Disney Co and make ...",
    "published": null
  }
]