[
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "As of 1 July 2022, <strong>Alfred Schreuder</strong> succeeded Erik ten Hag, who left for Manchester United, as Ajax&#x27;s coach. Most of the key players from previous seasons left during the summer transfer period, but there was also a lot of reinvestment. Ajax started the 2022/23 season relatively well with six ...",
    "published": "2 weeks ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "Since 2016, the former international, who played not only for Ajax but also for Atlético Madrid, Everton, Fulham, and Hertha BSC, has held various coaching roles at Ajax. Keizer (Badhoevedorp, January 15, 1969) progressed through the Ajax academy as a youth player, just like Heitinga.",
    "published": null
  },
  {
    "title": "AFC Ajax » Coaching Staff List",
    "url": "https://www.worldfootball.net/teams/afc-ajax/9/",
    "snippet": "Football - results, news, statistics and much more...",
    "published": null
  },
  {
    "title": "Francesco Farioli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Francesco_Farioli",
    "snippet": "Farioli, visibly emotional after the final match, stated he had &quot;no regrets&quot; despite the outcome. Reports of internal disagreements over tactics, transfer policy, and budget constraints followed, culminating in Farioli&#x27;s departure by mutual consent on 19 May 2025. On 6 July 2025, <strong>Francesco Farioli</strong> ...",
    "published": "20 hours ago"
  },
  {
    "title": "Ajax Amsterdam - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/ajax-amsterdam/mitarbeiterhistorie/verein/610",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  }
]