[
  {
    "title": "IAU Past President Catherine Cesarsky Wins European Astronomical Society Prize | IAU",
    "url": "https://www.iau.org/news/announcements/detail/ann24009/",
    "snippet": "Cesarsky has long been an active member of the IAU, having <strong>previously chaired the IAU Commission 48 on High-Energy Astrophysics</strong>. In 2006, she was elected President of the IAU at the XXVI IAU General Assembly in Prague, becoming the first woman ...",
    "published": null
  },
  {
    "title": "Catherine Cesarsky - President Elect of the International Astronomical Union (IAU)",
    "url": "https://www.eso.org/public/france/news/eso0323/",
    "snippet": "The General Assembly of the International Astronomical Union (IAU), meeting in Sydney (Australia), has appointed the ESO Director General, Dr. Catherine Cesarsky, as <strong>President Elect for a three-year period (2003-2006).</strong> The IAU is the world&#x27;s ...",
    "published": null
  },
  {
    "title": "Catherine Cesarsky",
    "url": "https://www.sheisanastronomer.org/profiles/europe/catherine-cesarsky",
    "snippet": "In the first year IAU affairs took up about 5 per cent of my time, in the second year they took up much more because the preparations for the International Year of Astronomy were so time consuming. Now, in the past 3 months, a very high percentage of my time has been devoted to my duties as President of the IAU and as chair of the Working Group coordinating IYA2009 at international level.",
    "published": null
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "Catherine Cesarsky, as <strong>President for a three-year period (2006-2009).</strong> The IAU is a body of distinguished professional astronomers, founded in 1919 to promote and safeguard the science of astronomy in all its aspects through international cooperation.",
    "published": null
  },
  {
    "title": "Catherine Cesarsky elected president of the International Astronomical Union",
    "url": "https://www.eurekalert.org/news-releases/750070",
    "snippet": "The General Assembly of the International Astronomical Union, meeting in Prague (Czech Republic), has elected the ESO director general, Dr. Catherine Cesarsky, as <strong>president for a three-year period (2006-2009).</strong> Dr.",
    "published": null
  }
]