[
  {
    "title": "Where is Disney's Headquarters? Main Office Location and Global Offices | Clay",
    "url": "https://www.clay.com/dossier/disney-headquarters-office-locations",
    "snippet": "The Walt Disney Company&#x27;s main headquarters is located at <strong>500 South Buena Vista Street in Burbank, California</strong>. This facility serves as the primary corporate office for the global entertainment conglomerate.",
    "published": null
  },
  {
    "title": "Contact Us - The Walt Disney Privacy Center",
    "url": "https://privacy.thewaltdisneycompany.com/en/support/",
    "snippet": "The Walt Disney Company For questions regarding The Walt Disney Company’s Privacy Policy or privacy practices, please contact: Email: privacycontact@TWDC.com Phone: (877) 466-6669 Address: The Walt Disney Company <strong>500 South Buena Vista Street</strong> Mail Code 7830 Burbank, CA 91521-7667",
    "published": "January 5, 2024"
  },
  {
    "title": "The Walt Disney Company Corporate Headquarters, Office Locations and Addresses | Craft.co",
    "url": "https://craft.co/the-walt-disney/locations",
    "snippet": "The Walt Disney Company is headquartered in <strong>Burbank, 500 S Buena Vista St, United States</strong>, and has 15 office locations.",
    "published": null
  },
  {
    "title": "The Walt Disney Co Locations - Headquarters & Offices - GlobalData",
    "url": "https://www.globaldata.com/company-profile/the-walt-disney-company/locations/",
    "snippet": "View The Walt Disney Co company headquarters address along with its other key offices and locations.",
    "published": null
  },
  {
    "title": "Walt Disney Studios (Burbank) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Walt_Disney_Studios_(Burbank)",
    "snippet": "The Walt Disney Studios, located in <strong>Burbank, California, United States</strong>, serves as the corporate headquarters for the Walt Disney Company. The 51-acre (20.6 ha) studio lot also contains several sound stages, a backlot, and other filmmaking production ...",
    "published": "3 days ago"
  }
]