[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "He began his senior career at <strong>Bayern Munich</strong>, playing mostly in the club&#x27;s reserve side before his 2013 transfer to Bayer Leverkusen. A season later, he was signed by Premier League club Liverpool for £9.75 million where he made over 150 appearances across all tiers of competition and would ...",
    "published": "2 days ago"
  },
  {
    "title": "Emre Can",
    "url": "https://www.bvb.de/de/en/teams/football/player/emre-can.html",
    "snippet": "Can played for Eintracht’s youth team for three years (2006 to 2009) before moving to Bayern Munich’s U17 team. In Munich, he made his first appearance for the senior team on 12 August 2012 in a 2-1 Super Cup win against Borussia Dortmund. In 2013/14, he joined Bayer 04 Leverkusen and was signed by Liverpool just one year later, where he played a total of 167 games between 2014 and 2018.",
    "published": null
  },
  {
    "title": "Emre Can - Most Played Positions",
    "url": "https://www.footballcritic.com/emre-can/player-positions/5439",
    "snippet": "Previous teams: <strong>Juventus, Liverpool, Bayer 04, Bayern</strong> · Emre Can transfer news and current transfer value are available on FootballTransfers.com · Champions League · 4 years · All Related News about Can · A team-mates shortlist of Emre ...",
    "published": null
  },
  {
    "title": "Emre Can - Liverpool FC",
    "url": "https://members.liverpoolfc.com/team/first-team/player/emre-can",
    "snippet": "In 2009, <strong>Bayern Munich</strong> recognised his talents and secured his signature. In a bid to aid his acceleration into first-team football, the German giants sold him to Leverkusen in August 2013.",
    "published": null
  },
  {
    "title": "Liverpool career stats for Emre Can - LFChistory - Stats galore for Liverpool FC!",
    "url": "https://www.lfchistory.net/players/player/profile/1272",
    "snippet": "At the same time as he was moving through different age groups with his club, Can represented the country of his birth at different levels even though parentage meant that he was also eligible to play for Turkey. He had to serve an apprenticeship with Bayern’s Regional League South team before being named in a senior matchday squad for the first time for the home march against Schalke at the end of February 2012.",
    "published": null
  }
]