[
  {
    "title": "Union Berlin home ground expansion hiccups - Coliseum",
    "url": "https://www.coliseum-online.com/union-berlin-home-ground-expansion-hiccups/",
    "snippet": "With around 18,800 standing places ... fixtures following the expansion “which is the need of the hour”. The new <strong>Alte Försterei</strong> will rank among the Top 20 stadium capacities in Germany with this size while putting less ...",
    "published": "October 20, 2025"
  },
  {
    "title": "Union Berlin’s new stadium plans evolve - Coliseum",
    "url": "https://www.coliseum-online.com/union-berlins-new-stadium-plans-evolve/",
    "snippet": "After the already completed renovation of the Forsthaus and the opening of the new professional training ground in the summer, construction of a car park and the second professional training ground on top of it is scheduled to begin in May 2025, immediately at the end of the season. At the same time, the joint headquarters for the men’s and women’s professional teams will be built, forming the heart of the new professional training centre. Work on the stadium is slated to begin once the training ground is complete, which is expected to be in the summer of 2026. Image: 1. FC Union Berlin",
    "published": "October 10, 2024"
  },
  {
    "title": "Stadion An der Alten Försterei - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stadion_An_der_Alten_F%C3%B6rsterei",
    "snippet": "<strong>Stadion An der Alten Försterei</strong> ... is a football stadium in Köpenick and the largest single-purpose football stadium in the German capital of Berlin. It has been home to football club 1. FC Union Berlin since its predecessor SC Union Oberschöneweide started playing in the ...",
    "published": "June 14, 2025"
  },
  {
    "title": "Union Berlin offers fans shares in An der Alten Försterei stadium facelift | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/union-berlin-offers-fans-stadium-shares-renovation-svensson-29411",
    "snippet": "Union Berlin fans are being given another opportunity to help shape the future of the club they love as the Bundesliga side prepares to revamp its iconic <strong>An der Alten Försterei stadium</strong> in the German capital.",
    "published": "October 25, 2024"
  },
  {
    "title": "Homepage | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en",
    "snippet": "Official website of 1.FC Union Berlin - Here you can find all news about the soccer club from Berlin Köpenick, the Union-Zeughaus and the stadium <strong>An der Alten Försterei</strong>.",
    "published": null
  }
]