[
  {
    "title": "Mark Aguiar | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is a consultant at the <strong>Federal Reserve Bank of Minneapolis and the Walker Professor of Economics and International Finance at Princeton University. Previously, he was a professor of economics at the University of Rochester and a senior economist at the Federal Reserve Bank of Boston</strong>...",
    "published": null
  },
  {
    "title": "Mark Aguiar - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Aguiar",
    "snippet": "Mark Armando Aguiar (born 1966) is an American economist who has served as the Walker Professor of Economics and International Finance at Princeton University since 2015. Born in 1966, Aguiar graduated magna cum laude from Brown University with a BA in history and Chinese in 1988.",
    "published": "October 23, 2025"
  },
  {
    "title": "Mark A. Aguiar | The Julis-Rabinowitz Center for Public Policy ...",
    "url": "https://jrc.princeton.edu/people/mark-aguiar",
    "snippet": "Mark A. Aguiar is the Walker Professor of Economics and International Finance at Princeton University. His research focuses on models of consumption and savings with applications in both open- and closed-economy macroeconomics. Specific interests include life cycle consumption and savings, current account dynamics, sovereign debt, and the interplay of time allocation and consumption.",
    "published": null
  },
  {
    "title": "Mark Aguiar | International Growth Centre",
    "url": "https://www.theigc.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is currently Professor of Economics at Princeton University. His research focuses on models of consumption and savings with applications in both open- and closed-economy macroeconomics. Specific interests include life cycle consumption and savings, current account dynamics, sovereign ...",
    "published": null
  },
  {
    "title": "Mark A. Aguiar",
    "url": "https://gceps.princeton.edu/mark-a-aguiar/",
    "snippet": "From 1989-1995, as a <strong>US Department of State foreign service officer</strong>, he served in embassies in Seoul and Beijing, and also in the Office of Japanese Affairs in Washington, DC. Aguiar received his BA in history and Chinese from Brown University, ...",
    "published": null
  }
]