[
  {
    "title": "Jonathan Kodjia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jonathan_Kodjia",
    "snippet": "On 19 January 2020, Kodjia was presented to the media by Al-Gharafa in the Qatar Stars League, coached by former Premier League manager <strong>Slaviša Jokanović</strong>.",
    "published": "October 3, 2025"
  },
  {
    "title": "Jonathan Kodjia and Related Topics",
    "url": "https://hyperleap.com/topic/Jonathan_Kodjia",
    "snippet": "Argentine professional football manager who was most recently the head coach of Premier League club <strong>Leeds United</strong>. In the 72nd minute of a tight game between two teams who were essentially jostling for position in the playoffs, albeit Leeds ...",
    "published": null
  },
  {
    "title": "Jonathan Kodjia à Versailles -",
    "url": "https://www.unfp.org/2024/08/jonathan-kodjia-a-versailles/",
    "snippet": "L’expérimenté buteur, passé par Reims, Cherbourg, Amiens, Caen, Angers, Bristol, Aston Villa, Al-Gharafa et Annecy, s’est engagé ce jeudi avec le FC Versailles, après avoir passé six semaines avec l’UNFP Football Club. Il retrouvera le coach <strong>Jean-Luc Vasseur</strong>, qui s’est occupé ...",
    "published": null
  },
  {
    "title": "Jonathan Kodjia: Profile, news and stats | Kings League France",
    "url": "https://kingsleague.pro/en/players/80107-jonathan-kodjia",
    "snippet": "Access to the official Jonathan Kodjia website: News, statistics, results, goals and more information about the Kings League player",
    "published": null
  },
  {
    "title": "Jonathan Kodjia (Player) | National Football Teams",
    "url": "https://www.national-football-teams.com/player/64320/Jonathan_Kodjia.html",
    "snippet": "Jonathan Kodjia · You are using an old browser which is not compatible with our new design. Please update your browser or use our old website. Kindly provided by Jorge Mendoza · Kindly provided by SiebenW Add Picture · Position · Centre Forward (CF) Other positions: Secondary striker (SS) Age ·",
    "published": null
  }
]