[
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Jennifer Westacott AC is an Australian business executive. She served as the chief executive of the Business Council of Australia (BCA) from 2011 to 2023. She is the current chancellor of <strong>Western Sydney University</strong>. She grew up in Springfield in New South Wales, Australia and completed her secondary ...",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott: Positions, Relations and Network - MarketScreener",
    "url": "https://www.marketscreener.com/insider/JENNIFER-WESTACOTT-A18HDI/",
    "snippet": "Jennifer Anne Westacott currently ... Pty Ltd., as Director from 2024, ATCO Australia Pty Ltd., as Director from 2024, <strong>Canadian Utilities Ltd</strong>., as Independent Director from 2025, The University of New South Wales, as Member from ...",
    "published": null
  },
  {
    "title": "31 October 2024 Director changes",
    "url": "https://www.wesfarmers.com.au/docs/default-source/asx-announcements/director-changes.pdf?sfvrsn=55a6e4bb_0",
    "snippet": "Ms Westacott will retire as a non-executive director by rotation at the conclusion of the 2025 Annual · General Meeting, expected to be held in October 2025, and will not seek re-election. After commencing as a director on 1 May 2025 Ms Coates will stand for election at the 2025 Annual · General Meeting. ... “Jennifer ...",
    "published": null
  },
  {
    "title": "Jennifer Westacott AC rejoins KPMG to champion inclusion and innovation",
    "url": "https://kpmg.com/au/en/about/impact-plan/jennifer-westacott-ac-rejoins-kpmg-inclusion-innovation.html",
    "snippet": "Jennifer wrapped up her eight-year tenure as Co-Patron of Pride in Diversity as <strong>KPMG Australia</strong> was awarded Platinum Status at the prestigious LGBTQ+ Inclusion Awards in June 2025 – an accolade that sets the gold standard for workplace inclusivity.",
    "published": "August 9, 2025"
  },
  {
    "title": "Chancellor | Western Sydney University",
    "url": "https://www.westernsydney.edu.au/about_uws/leadership/chancellor",
    "snippet": "As Australia’s Business Champion ... also serves NSW as a global ambassador for business events. From 1 March 2025, Jennifer has served on the <strong>Reserve Bank of Australia</strong>’s new Governance Board....",
    "published": null
  }
]