[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "He studied agriculture in a school 20 miles from home. When he was 13, Pochettino was scouted by Jorge Griffa, director of football at Newell&#x27;s Old Boys, and his future manager Marcelo Bielsa, then the reserve team coach at Newell&#x27;s. Although he was happy at Rosario Central who were interested in signing him, he was persuaded to try out for their rivals Newell&#x27;s Old Boys in Rosario, Santa Fe. He was quickly placed in a team attending ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Everything About Mauricio Pochettino’s Family Background & Personal Life- Parents, Siblings, Nationalities, & More - EssentiallySports",
    "url": "https://www.essentiallysports.com/soccer-football-news-everything-about-mauricio-pochettino-family-background-personal-life-parents-siblings-nationalities-more/",
    "snippet": "Idolizing Germany icon Franz Beckenbauer, he played as a defender. He struggled a lot in his earlier days. After attending <strong>agricultural school</strong>, he would take a three-hour bus ride to Rosario once a week.",
    "published": "September 9, 2025"
  },
  {
    "title": "Sebastiano Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastiano_Pochettino",
    "snippet": "Pochettino attended <strong>St. Paul&#x27;s School in Barcelona, Spain</strong>. He is the son of the Argentine football manager Mauricio Pochettino, and the brother of the footballer Maurizio Pochettino.",
    "published": "August 15, 2025"
  },
  {
    "title": "Mauricio Pochettino - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1167021/bio/",
    "snippet": "Mauricio Pochettino. Self: LaLiga. &quot;Mauricio Pochettino is a professional football manager and former defender. He was the manager of Tottenham Hotspur Football Club from May 2014 to November 2019. Born in Murphy, Argentina, Pochettino began his footballing career in 1987 at the age of 14 after ...",
    "published": null
  },
  {
    "title": "Mauricio Pochettino - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/mauricio-pochettino/profil/trainer/9044",
    "snippet": "This is the profile site of the manager Mauricio Pochettino. The site lists all clubs he coached and all clubs he played for.",
    "published": null
  }
]