[
  {
    "title": "List of chancellors of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_chancellors_of_Germany",
    "snippet": "The office was created in the North German Confederation in 1867, when <strong>Otto von Bismarck</strong> became the first chancellor. With the unification of Germany and establishment of the German Empire in 1871, the Confederation evolved into a German ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "In Nazi Germany the office of Reichskanzler was never formally abolished, but instead combined with the office of Reichspräsident. On August 1, the day before Reichspräsident <strong>Paul von Hindenburg</strong>&#x27;s death, the Hitler cabinet passed a law merging the offices of Reich Chancellor and Reich President ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "In 2005 he was described by German media as a new member of the Andean Pact, an originally secret network of influential CDU men formed in 1979 by then members of the Young Union during a trip to the South American Andes region. The Andean pact stood in opposition to Merkel, especially in the five years before she became chancellor in 2005, after she had become chairperson of the CDU.",
    "published": "1 week ago"
  },
  {
    "title": "Germany's chancellors",
    "url": "https://www.dw.com/en/germanys-chancellors/g-17105436",
    "snippet": "He had to step down as a result of a no-confidence vote in parliament when his coalition partner, the FDP switched allegiances.Image: picture-alliance/dpa · Social upheaval in Germany led to a change in politics, with <strong>Willy Brandt</strong> becoming ...",
    "published": null
  },
  {
    "title": "List of chancellors of Germany | Names & Years | Britannica",
    "url": "https://www.britannica.com/place/list-of-chancellors-of-Germany-2066807",
    "snippet": "This is a chronologically ordered list of chancellors of",
    "published": "May 31, 2016"
  }
]