[
  {
    "title": "Jonathan Kodjia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jonathan_Kodjia",
    "snippet": "He scored his first competitive goal for Bristol City on 15 August 2015 in a 4–2 defeat to Brentford, converting a pass from Luke Ayling to give City a 1–0 lead. He scored 20 goals in 48 appearances in his debut season at Bristol City. On <strong>30 August 2016</strong>, Kodjia signed with Aston Villa on ...",
    "published": "October 3, 2025"
  },
  {
    "title": "Jonathan Kodjia: Aston Villa sign Bristol City striker for initial £11m fee - BBC Sport",
    "url": "https://www.bbc.co.uk/sport/football/37220214",
    "snippet": "Aston Villa have signed Bristol City striker Jonathan Kodjia on a four-year deal, for an initial £11m that may rise to a Championship record fee of £15m.",
    "published": null
  },
  {
    "title": "Aston Villa sign Jonathan Kodjia from Bristol City for £15m | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11677/10558164/aston-villa-bid-15m-for-bristol-city-striker-jonathan-kodjia",
    "snippet": "The signing of Kodjia is more than the previous Championship record, Villa&#x27;s signing of Ross McCormack for £12m, potentially rising to £14m. Villa manager Roberto Di Matteo told Aston Villa&#x27;s official website: &quot;We are really pleased to have secured the services of Jonathan. &quot;He is a proven goalscorer and hopefully he&#x27;ll play an important part in what we hope will be a successful season for the club.&quot; Bristol City chief operating officer Mark Ashton said: &quot;We want to build the club in the right way and we&#x27;ve had a very active and positive summer in the transfer market.",
    "published": "August 31, 2016"
  },
  {
    "title": "How is ex-Bristol City and Aston Villa star Jonathan Kodjia getting on?",
    "url": "https://footballleagueworld.co.uk/how-is-ex-bristol-city-and-aston-villa-star-jonathan-kodjia-getting-on/",
    "snippet": "As time went on, Kodjia’s role in the side became less prominent, with just 22 starts in his final season for the club proving the writing was on the wall, and while Villa were celebrating promotion to the Premier League, the forward was soon to be on the move.",
    "published": "September 6, 2024"
  },
  {
    "title": "Bristol City’s Jonathan Kodjia joins Aston Villa for potential £15m fee | Aston Villa | The Guardian",
    "url": "https://www.theguardian.com/football/2016/aug/30/bristol-city-jonathan-kodjia-aston-villa-championship-record-fee",
    "snippet": "Jonathan Kodjia has joined Aston Villa from Bristol City in an £11m deal which could rise to £15m. The striker has signed a four-year contract at Villa, who were relegated from the Premier League last season. Transfer news live: Arsenal sign Lucas Pérez, Hart to Torino, Barcelona seal Alcácer and more!",
    "published": "February 21, 2018"
  }
]