[
  {
    "title": "Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pedro_S%C3%A1nchez",
    "snippet": "After the resignation of PSOE leader Alfredo Pérez Rubalcaba, following poor results at the 2014 European Parliament election, Sánchez launched his campaign to succeed him on 12 June 2014. He was elected as PSOE Secretary-General on 13 July, winning 49% of votes against his opponents Eduardo Madina and José Antonio Pérez Tapias.",
    "published": "1 day ago"
  },
  {
    "title": "Pedro Sánchez | prime minister of Spain | Britannica",
    "url": "https://www.britannica.com/biography/Pedro-Sanchez-politician",
    "snippet": "Other articles where Pedro Sánchez is discussed: Spain: Economic recovery and Catalonian independence: …the corruption charges, PSOE leader Pedro Sánchez, with the support of Catalan and Basque nationalist parties, challenged his government. On June 1, 2018, Sánchez ousted Rajoy after a motion of no confidence was narrowly approved by the Spanish parliament.",
    "published": null
  },
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "Although there is no legal requirement for this, it is seen as a royal endorsement of the democratic process—a fundamental concept enshrined in the 1978 Constitution. The largest party can end up not ruling if rival parties form a coalition—as happened in 2018 with the election of PSOE leader Pedro Sánchez.",
    "published": "1 month ago"
  },
  {
    "title": "Third government of Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Third_government_of_Pedro_S%C3%A1nchez",
    "snippet": "The third government of Pedro Sánchez was formed on 21 November 2023, following the latter&#x27;s election as prime minister of Spain by the Congress of Deputies on 16 November and his swearing-in on 17 November, as a result of the Spanish Socialist Workers&#x27; Party (PSOE) and Sumar being able to muster a majority of seats in the Parliament with external support from Republican Left of Catalonia (ERC), Together for Catalonia (Junts), EH Bildu, the Basque Nationalist Party (PNV), the Galician Nationalist Bloc (BNG) and Canarian Coalition (CCa) following the 2023 general election. It succeeded the second Sánchez government and has been the incumbent government of Spain since 21 November 2023, a total of 761 days, or 2 years and 1 month.",
    "published": "3 weeks ago"
  },
  {
    "title": "Pedro Sánchez - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q6070218",
    "snippet": "<strong>María Begoña Gómez Fernández</strong>, bilbaína de 43 años, experta en la captación de fondos para organizaciones no gubernamentales y fundaciones, es la mujer del nuevo presidente del Gobierno, Pedro Sánchez (Spanish)",
    "published": null
  }
]