[
  {
    "title": "French Prime Minister Sébastien Lecornu resigns after less than a month",
    "url": "https://www.bbc.com/news/articles/cewn9k0w9rxo",
    "snippet": "<strong>Lecornu&#x27;s shock resignation on Monday morning came the day after he unveiled his cabinet, and made him the third French PM to leave office since last December</strong>. His ministerial line-up had been fiercely criticised across the board by parties ...",
    "published": "October 6, 2025"
  },
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "<strong>He was in office as a caretaker prime minister until he was reappointed by President Macron on 10 October 2025</strong>. Lecornu was born on 11 June 1986 in Eaubonne, Val-d&#x27;Oise Department, to Jean-Pierre Lecornu, an aeronautical technician at the Safran Aircraft Engines factory in Vernon, and Martine ...",
    "published": "18 hours ago"
  },
  {
    "title": "Lecornu lives to fight another day, but the outlook for France remains bleak – POLITICO",
    "url": "https://www.politico.eu/article/sebastien-lecornu-france-budget/",
    "snippet": "To that end, Lecornu and his government are now preparing emergency legislation to roll over this year’s budget to keep the French state operational, and lawmakers have been warned they may be called in for a special session to pass such a stopgap budget in late December. According to the ministry of finance, though, if a rolled-over 2025 budget were to last throughout next year, it would push France’s deficit beyond 6 percent of GDP.",
    "published": "6 days ago"
  },
  {
    "title": "French Prime Minister Sébastien Lecornu Resigns - The New York Times",
    "url": "https://www.nytimes.com/2025/10/06/world/europe/france-lecornu-resigns-macron.html",
    "snippet": "Sébastien Lecornu resigned as France’s prime minister after serving for less than a month, the shortest tenure in the history of the Fifth Republic. The resignation also came amid growing concern that he would not be able to get a budget passed.CreditCredit...Pool photo by Alain Jocard ... Oct. 6, 2025",
    "published": "October 6, 2025"
  },
  {
    "title": "Macron asks for fresh talks after new Prime Minister Sebastien Lecornu resigns - as it happened | Reuters",
    "url": "https://www.reuters.com/world/europe/live-frances-new-prime-minister-sebastien-lecornu-has-resigned-2025-10-06/",
    "snippet": "<strong>France&#x27;s new Prime Minister Sebastien Lecornu and his government resigned</strong>, just hours after appointing his new cabinet.",
    "published": "October 6, 2025"
  }
]