[
  {
    "title": "DFG - German Research Foundation",
    "url": "https://www.dfg.de/en",
    "snippet": "DFG Welcomes EU Agreement on New Breeding Techniques · Call for swift implementation of the new legal framework",
    "published": null
  },
  {
    "title": "German Research Foundation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/German_Research_Foundation",
    "snippet": "The German Research Foundation (German: Deutsche Forschungsgemeinschaft [ˈdɔʏtʃə ˈfɔʁʃʊŋsɡəˌmaɪnʃaft]; abbr. DFG [ˌdeːʔɛfˈɡeː]) is a German research funding organization, which functions as a self-governing institution for the promotion of science and research in the ...",
    "published": "October 2, 2025"
  },
  {
    "title": "Germany, German Research Foundation (DFG) - International Science Council",
    "url": "https://council.science/member/germany-deutsche-forschungsgemeinschaft-dfg/",
    "snippet": "The Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) is the central self-governing research funding organisation in Germany. The DFG serves the sciences and humanities and promotes research of the highest quality in all its forms and disciplines at universities and non-university research institutions.",
    "published": "August 13, 2024"
  },
  {
    "title": "AHRC and German Research Foundation renew research partnership – UKRI",
    "url": "https://www.ukri.org/news/ahrc-and-german-research-foundation-renew-research-partnership/",
    "snippet": "Subsequent annual rounds will follow the same monthly pattern. Top image: From left to right: AHRC Executive Chair Professor <strong>Christopher Smith</strong> and Dr Claudia Althaus, Deputy Head of the Humanities Department at the DFG.",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - A New Vice President for the DFG",
    "url": "https://www.dfg.de/en/service/press/press-releases/2025/press-release-no-17",
    "snippet": "The re-elected Vice President <strong>Karin Jacobs</strong> heads the Chair of Experimental Physics at Saarland University.",
    "published": null
  }
]