[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the chancellor of <strong>University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "r/UCSC on Reddit: the chancellor is receiving a 28.5% pay increase.",
    "url": "https://www.reddit.com/r/UCSC/comments/1fw5ojy/the_chancellor_is_receiving_a_285_pay_increase/",
    "snippet": "Article states &quot;<strong>UC Santa Cruz</strong> Chancellor Cynthia Larive will voluntarily forgo her base salary increase for 2024-25.&quot; You should know that this is in reference to the 4% across-the-board increase that all staff got, not the upcoming 28.5% increase.",
    "published": "October 4, 2024"
  },
  {
    "title": "University of California, Santa Cruz (UCSC) Highest Paid Employees",
    "url": "https://openpayrolls.com/rank/highest-paid-employees/university-of-california-santa-cruz",
    "snippet": "In 2022 the <strong>University of California, Santa Cruz (UCSC)</strong> reported 1,250 employees making more than $100,000 per year; the average salary was $69,217. The highest reported pay was $526,900 for Cynthia Larive, Chan. The <strong>University of California, Santa Cruz (UCSC)</strong> in 2022 ranked 246th in the nation ...",
    "published": null
  },
  {
    "title": "Contact Administrators and Public Officials – pay us more ucsc",
    "url": "https://payusmoreucsc.com/contact-admins-and-public-officials/",
    "snippet": "Cynthia Larive <strong>UCSC Chancellor</strong> Contact: 831-459-4291 | clarive@ucsc.edu | Contact Form • Total pay and benefits (2021): $473,082 • Has said she is fine with receiving nearly half a million dollars a year in salary while graduate students and workers at the university lack food and housing ...",
    "published": null
  },
  {
    "title": "Cynthia Larive | Transparent California",
    "url": "https://transparentcalifornia.com/salaries/2018/university-of-california/cynthia-larive/",
    "snippet": "Cynthia Larive · We&#x27;re starting to collect 2024 data. If you&#x27;d like to help us, you can donate or sponsor your favorite agency. Sponsor an agency ·",
    "published": null
  }
]