[
  {
    "title": "Federal Reserve Bank of Minneapolis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Federal_Reserve_Bank_of_Minneapolis",
    "snippet": "The first building for the Minneapolis Federal Reserve bank is located at <strong>510 Marquette Avenue, at the corner of Marquette Avenue and 5th Street South in Minneapolis</strong>, right next to the Nicollet Mall station of the METRO Blue and Green light rail lines, and across from the Soo Line Building.",
    "published": "November 21, 2025"
  },
  {
    "title": "Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/",
    "snippet": "The Federal Reserve Bank of Minneapolis is pursuing an economy that works for all of us. Serving Montana, North and South Dakota, Minnesota, Wisconsin and the Upper Peninsula of Michigan.",
    "published": null
  },
  {
    "title": "Federal Reserve Board - Federal Reserve Bank of Minneapolis Contacts",
    "url": "https://www.federalreserve.gov/supervisionreg/afi/res_cont_minn.htm",
    "snippet": "FedEZFile and FedEZFile FluentFedEZFile ContactsReserve Bank Applications ContactsTypes of FilingsFiling ResourcesProcessing StagesBanking Market InformationCRA and the Applications Process · <strong>90 Hennepin Avenue</strong> P.O. Box 291 Minneapolis, MN ...",
    "published": null
  },
  {
    "title": "Visiting the Bank: Policies, Directions, and Parking | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/connect/directions-and-parking",
    "snippet": "The Fed is accessible via several Metro Transit bus routes, and is located approximately five blocks north of the Warehouse District light rail station. The Federal Reserve Bank is located at <strong>90 Hennepin, on the corner of Hennepin Ave and N 1st St</strong>.",
    "published": null
  },
  {
    "title": "About Us | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/about-us",
    "snippet": "With <strong>headquarters in Minneapolis</strong> and a Branch in Helena, Mont., we examine banks to make them safe and sound. We conduct world-class research to inform policymakers. Our 1,000 employees in Minneapolis and 60 in Helena monitor the regional economy ...",
    "published": null
  }
]