[
  {
    "title": "Juventus Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_Stadium",
    "snippet": "Juventus Stadium (Italian ... simply known in Italy as the Stadium (Italian: Lo Stadium), is <strong>an all-seater football stadium in the Vallette borough of Turin, Italy, and the home of Juventus</strong>....",
    "published": "October 14, 2025"
  },
  {
    "title": "Allianz Stadium Juventus",
    "url": "https://www.juventus.com/en/allianz-stadium/",
    "snippet": "<strong>Allianz Stadium</strong>, the home of Juventus FC and Bianconeri. Directions and access, accreditation and welcoming activities.",
    "published": null
  },
  {
    "title": "Juventus Stadium (2025) - All You Need to Know BEFORE You Go (with Reviews)",
    "url": "https://www.tripadvisor.com/Attraction_Review-g187855-d2540083-Reviews-Juventus_Stadium-Turin_Province_of_Turin_Piedmont.html",
    "snippet": "Modern, functional and designed for fans, it is <strong>one of the most advanced stadiums in Europe</strong>. Every detail, from the perfect visibility from every sector to the deafening sound of the curve, contributes to creating a unique atmosphere.",
    "published": null
  },
  {
    "title": "Allianz Stadium (Juventus Stadium) - Turin - The Stadium Guide",
    "url": "https://www.stadiumguide.com/juventusstadium/",
    "snippet": "Club: Juventus FC | Opening: 2011 | Capacity: 41,000 seats | Description: <strong>Allianz Stadium</strong>, previously called Juventus Stadium, replaced Juventus&#x27; old Stadio Delle Alpi, which had been the home of the club since 1990.",
    "published": "June 9, 2020"
  },
  {
    "title": "Juventus Stadium - Stadiums | Paris Saint-Germain",
    "url": "https://billetterie.psg.fr/en/stadiums/juventus-stadium",
    "snippet": "Located in Turin, Italy, this legendary <strong>41,000-capacity stadium, with stands just 7.5 metres from the pitch</strong>, is where the Juventus team has forged its reputation for excellence. From Serie A victories to decisive Champions League matches, every corner of the stadium bears the echoes of success.",
    "published": null
  }
]