[
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "On 1 June 2018, Rajoy and his ... of the People&#x27;s Party and retired from politics shortly after and he was succeeded as his party&#x27;s president by <strong>Pablo Casado</strong> a month later....",
    "published": "March 8, 2004"
  },
  {
    "title": "Mariano Rajoy former President of Spain (2011 to 2018).",
    "url": "https://clubmadrid.org/who/members/rajoy-mariano/",
    "snippet": "Afterwards, in 1993, he was reelected to Congress, and from 1996, he served in the PP government of the new Spanish President, José María Aznar (1996-2004), heading the Ministries of Education, Culture, Interior; and as a Vice President between 2001 and 2003. In that year, Rajoy succeeded Aznar as party leader, thus becoming its candidate for the Presidency of the Government in the 2004 and 2008 general elections.",
    "published": "November 21, 2019"
  },
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "On June 1, 2018, the Spanish Socialist Workers’ Party leader, Pedro Sánchez, with the support of Catalan and Basque nationalist parties, ousted Mariano Rajoy after filing a motion of no confidence against his prime ministership.",
    "published": "December 6, 2011"
  },
  {
    "title": "Mariano Rajoy | Historica Wiki | Fandom",
    "url": "https://historica.fandom.com/wiki/Mariano_Rajoy",
    "snippet": "Mariano Rajoy (born 27 March 1955) was Prime Minister of Spain from 20 December 2011 to 1 June 2018, succeeding <strong>Jose Luis Rodriguez Zapatero</strong> and preceding Pedro Sanchez. Leader of the People&#x27;s Party of Spain from 2004, he was forced to resign ...",
    "published": "October 29, 2024"
  },
  {
    "title": "Mariano Rajoy - the patient man of Spanish politics - BBC News",
    "url": "https://www.bbc.com/news/world-europe-15781440",
    "snippet": "As Mr Rajoy departed, he told Spanish MPs that it was &quot;an honour to leave a better Spain than I found&quot;. He will be succeeded by <strong>Pedro Sánchez</strong> from the Spanish Socialist Party, the party that triggered the no-confidence vote.",
    "published": "June 1, 2018"
  }
]