[
  {
    "title": "Anke Domscheit-Berg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anke_Domscheit-Berg",
    "snippet": "<strong>Her mandate ended in 2025 because she did not run for re-election</strong>. Previously, she was a member of the Pirate Party Germany and the Greens. She is married to Daniel Domscheit-Berg. Anke Domscheit-Berg grew up as daughter of an art historian and a doctor in Müncheberg, East Germany.",
    "published": "August 13, 2025"
  },
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://grokipedia.com/page/Anke_Domscheit-Berg",
    "snippet": "Anke Domscheit-Berg joined the ... for advocating internet policy reforms and political openness.[95] She <strong>departed the Pirate Party in 2014</strong>, citing frustrations with internal dysfunction, including personal attacks on ...",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg | The Guardian",
    "url": "https://www.theguardian.com/profile/anke-domscheit-berg",
    "snippet": "Anke Domscheit-Berg is chairwoman of the State of Brandenburg Pirate Party and a candidate for the Bundestag at the upcoming elections. She is an open government activist, consultant and writer",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://sawadee.wiki/wiki/Anke_Domscheit-Berg",
    "snippet": "She has been a member of the Bundestag since 2017, when she was elected on the party list of The Left, <strong>without being a party member. She joined the party in 2021</strong> following her nomination to the top female position on the party election list ...",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg | NEXT Conference",
    "url": "https://nextconf.eu/person/anke-domscheit-berg/",
    "snippet": "Anke Domscheit-Berg is <strong>member of the Pirate Party</strong> and regional party leader of the PIRATEN Brandenburg. As longtime activist and journalist, she is specializing in upheavals due to the digital…",
    "published": "May 3, 2014"
  }
]