[
  {
    "title": "Christine Lagarde",
    "url": "https://www.theceo.in/women/christine-lagarde",
    "snippet": "Since 2006, Lagarde has been <strong>romantically involved with French entrepreneur Xavier Giocanti</strong>, with whom she was a fellow student at Université Paris X.",
    "published": "October 31, 2023"
  },
  {
    "title": "Biografía de Christine Lagarde (Su vida, historia, bio resumida)",
    "url": "https://www.buscabiografias.com/biografia/verDetalle/11107/Christine%20Lagarde",
    "snippet": "Divorciada de Wilfried Lagarde, es madre de Pierre-Henri Lagarde, nacido en 1986, y de Thomas Lagarde, nacido en 1988. Desde 2006, <strong>su pareja es el empresario inmobiliario Xavier Giocanti</strong>. Es vegetariana y no bebe alcohol.",
    "published": null
  },
  {
    "title": "PHOTOS. Christine Lagarde : retour sur ses 13 ans d'amour avec Xavier Giocanti - Closer",
    "url": "https://www.closermag.fr/politique/photos-christine-lagarde-retour-sur-ses-13-ans-d-amour-avec-xavier-giocanti-992139",
    "snippet": "Nouvelle présidente de la Banque centrale européenne, <strong>Christine Lagarde peut compter sur son compagnon, Xavier Giocanti</strong>.",
    "published": "January 25, 2025"
  },
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "The second is the British businessman Eachran Gilmour; sources differ on whether they were ever married. Since 2006, <strong>her partner</strong> has been the entrepreneur Xavier Giocanti from Marseille, a fellow-student at Université Paris X.",
    "published": "2 weeks ago"
  },
  {
    "title": "Newsmaker: Christine Lagarde | The National",
    "url": "https://www.thenationalnews.com/arts/newsmaker-christine-lagarde-1.192032",
    "snippet": "Lagarde has been married twice – in 1982 to the financial analyst Wilfred Lagarde, with whom she had two sons; and after their divorce in 1982, to Eachran ­Gilmour. <strong>Divorced for a second time</strong>, her partner since 2006 has been the French ...",
    "published": "June 16, 2021"
  }
]