[
  {
    "title": "Europe ready to lead ‘multinational force’ in Ukraine as part of US peace plan | Ukraine | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/ukraine-talks-european-leaders-meet-berlin-starmer-macron-zelenskyy-merz-us-witkoff",
    "snippet": "Trump told reporters in the Oval Office on Monday he had “very long and very good” talks with Ukrainian counterpart Volodymyr Zelenskyy and European and Nato leaders, adding: “We had numerous conversations with President Putin of Russia, and I think we’re closer now than we have been ever, and we’ll see what we can do.”",
    "published": "6 hours ago"
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "15 December 2025 - 21:48 · <strong>The Ukrainian side is ready to continue working with maximum quality, constructively and honestly, so that the final agreement on establishing peace is strong</strong>.",
    "published": "13 hours ago"
  },
  {
    "title": "European leaders propose ‘multinational force’ and hail ‘significant progress’ on Ukraine talks – as it happened | Europe | The Guardian",
    "url": "https://www.theguardian.com/world/live/2025/dec/15/ukraine-us-russia-berlin-nato-eu-russian-funds-steve-witkoff-volodymyr-zelenskyy-vladimir-putin-europe-live-news",
    "snippet": "Ukrainian president Volodymyr Zelenskyy also sounded <strong>cautiously positive</strong>, but made it clear that he needed more detail on security guarantees before he can contemplate any far-reaching asks, including for concessions on territory (18:13).",
    "published": "13 hours ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "In December 2024, Zelenskyy resisted ... battlefield losses. In February 2025, he said that <strong>Ukraine would introduce special military contracts for volunteers aged 18 to 24.</strong>...",
    "published": "1 day ago"
  },
  {
    "title": "Zelenskyy: 'Finalizing work' on revised peace plan – DW – 12/11/2025",
    "url": "https://www.dw.com/en/zelenskyy-finalizing-work-on-revised-peace-plan/live-75083319",
    "snippet": "Zelenskyy reaffirmed that Ukraine is not willing to concede territory to Russia · This blog is now closed. Below is a roundup of the latest developments from Russia&#x27;s war in Ukraine on Wednesday, December 10, 2025.",
    "published": "6 days ago"
  }
]