[
  {
    "title": "Al Shabab Club - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al_Shabab_FC_(Riyadh)",
    "snippet": "The club began before 1947, with many conflicts before with its numerous members, but it was settled in 1947 and <strong>Abdulrahman Bin Saeed</strong> was the president. Five years later, Al Shabab won its first tournament beating Sakit Al Hadeed (Railway Club) in Riyadh. In 1955 Al Shabab beat the Military ...",
    "published": "1 week ago"
  },
  {
    "title": "Al-Shabaab (militant group) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al-Shabaab_(militant_group)",
    "snippet": "Harakat al-Shabaab al-Mujāhideen, simply known as Al-Shabaab, or by its state name, the Islamic Emirate of Somalia, is a Sunni Islamist religious extremist militant and political movement based in Somalia. It is involved in the ongoing Somali Civil War as an Islamist group, regularly invoking takfir to rationalize its terrorist attacks on Somali civilians and civil servants.",
    "published": "2 days ago"
  },
  {
    "title": "Al Shabab FC football club - Soccer Wiki: for the fans, by the fans",
    "url": "https://en.soccerwiki.org/squad.php?clubid=626",
    "snippet": "Medium Name: Al Shabab · Short Name: SHA · Year Founded: 1947 · Stadium: King Fahd International (67,000) League: Saudi Pro League · Location: Riyadh · Country: Saudi Arabia · Manager · <strong>Imanol Alguacil</strong> · Age: 54 · None · Team Formation ...",
    "published": null
  },
  {
    "title": "Al-Shabaab - terrorist group",
    "url": "https://www.dni.gov/nctc/groups/al_shabaab.html",
    "snippet": "The Harakat Shabaab al-Mujahidin—commonly known as al-Shabaab—was the militant wing of the Somali Council of Islamic Courts that took over most of southern Somalia in the second half of 2006. Despite the group’s defeat by Somali and Ethiopian forces in 2007, al-Shabaab—a clan-based insurgent and terrorist group—has continued its violent insurgency in southern and central Somalia.",
    "published": null
  },
  {
    "title": "Al-Shabab FC - Club profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/al-shabab-club-riad-/startseite/verein/9840",
    "snippet": "Al-Shabab Saudi Sport Club, Cultural and Social Club or Al-Shabab Club “for short” is a Saudi club based in the city of Riyadh, and it is considered the oldest club in the capital, Riyadh.",
    "published": null
  }
]