[
  {
    "title": "Saudi Arabia’s leadership upheaval | Brookings",
    "url": "https://www.brookings.edu/articles/saudi-arabias-leadership-upheaval/",
    "snippet": "Bruce Riedel assesses the unusual but not unexpected shakeup in the House of Saud where <strong>King Salman replaced Crown Prince and Minister of the Interior Mohammad bin Nayef with his 31-year-old son Defense Minister Mohammad bin Salman</strong>.",
    "published": "March 9, 2022"
  },
  {
    "title": "Leadership Development in Saudi Arabia: Expanding Capabilities for National Economic Development",
    "url": "https://www.routledge.com/Leadership-Development-in-Saudi-Arabia-Expanding-Capabilities-for-National-Economic-Development/Alanazi-Harvey-McGovern-Maclean/p/book/9781032983158",
    "snippet": "Leadership Development in Saudi Arabia <strong>offers a comprehensive examination of the role of leadership development in expanding capabilities for national economic development</strong>, accelerating realization of the ambitious goals of Vision 2030, the ...",
    "published": null
  },
  {
    "title": "Saudi Leadership",
    "url": "https://www.mofa.gov.sa/en/ksa/Pages/leadership.aspx",
    "snippet": "موقع وزارة الخارجية | المملكة العربية السعودية English About Kingdom Saudi Leadership",
    "published": null
  },
  {
    "title": "Middle East CEO Outlook 2025 Saudi Arabia",
    "url": "https://kpmg.com/sa/en/insights/sector-insights/middle-east-ceo-outlook-2025.html",
    "snippet": "In 2025, <strong>HRH Mohammed bin Salman</strong>, Crown Prince and Prime Minister, announced the launch of HUMAIN, a PIF-owned company that will operate across the AI value chain. HUMAIN represents a strategic shift from adoption to global leadership, consolidating ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Saudi Arabia’s rise as a global soft power leader",
    "url": "https://english.alarabiya.net/views/2025/12/17/saudi-arabia-s-rise-as-a-global-soft-power-leader-",
    "snippet": "Saudi Arabia’s emergence as a soft power leader Saudi Arabia has in recent years become a remarkable example of the strategic use of soft power. Under the leadership of <strong>Crown Prince Mohammed bin Salman (MBS),</strong> the Kingdom has embarked on an ...",
    "published": "1 week ago"
  }
]