[
  {
    "title": "The Carlyle Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Carlyle_Group",
    "snippet": "The Carlyle Group Inc. is an <strong>American</strong> multinational company with operations in private equity, alternative asset management and financial services. As of 2023, the company had $426 billion of assets under management. Carlyle specializes in private equity, real assets, and private credit.",
    "published": "November 13, 2025"
  },
  {
    "title": "The Carlyle Group investment portfolio | PitchBook",
    "url": "https://pitchbook.com/profiles/investor/10048-15",
    "snippet": "... Medical supply maker backed ... » · Founded in 1987, The Carlyle Group is a private equity firm based in <strong>Washington, District of Columbia</strong>....",
    "published": null
  },
  {
    "title": "The Carlyle Group | Institution Profile | Private Equity International",
    "url": "https://www.privateequityinternational.com/institution-profiles/the-carlyle-group.html",
    "snippet": "The Carlyle Group is a global private markets investment and asset management firm with operations across multiple asset classes. It focuses on private equity, global credit, real assets, and secondaries. Its private equity investments include buyouts, growth capital, and co-investments in companies across diverse sectors and geographies.",
    "published": null
  },
  {
    "title": "The Carlyle Group | LinkedIn",
    "url": "https://www.linkedin.com/company/the-carlyle-group",
    "snippet": "At Carlyle, we&#x27;re excited to partner ... the country’s journey and contribute to India’s 2047 Viksit Bharat Vision. Watch his full presentation below. #MIIS2024 ... #MIIS2024 | Unlock the opportunities &amp; challenges of investing in India with a keynote by Amit Jain, MD &amp; Head of The Carlyle Group at the Mint ...",
    "published": null
  },
  {
    "title": "Carlyle - Baby Name, Origin, Meaning, And Popularity | Parenting Patch",
    "url": "https://parentingpatch.com/baby-names/Carlyle/",
    "snippet": "The name Carlyle has its roots in the <strong>Old Norse</strong> and Old English languages. It is derived from the place name &quot;Carlisle,&quot; which is believed to come from the <strong>Old Norse</strong> &quot;karl,&quot; meaning &quot;man,&quot; combined with the Old English &quot;lēah,&quot; meaning &quot;woodland&quot; ...",
    "published": null
  }
]