[
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "Included in its charge is the ... and the organisation and sanctioning of athletics competitions, including the World Athletics Championships. The organisation&#x27;s current president is <strong>Sebastian Coe</strong> of the United Kingdom, who was elected to the four-year position in 2015, ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics Awards 2025: World Athletics President: China creates stronger platform for World Athletics - CGTN",
    "url": "https://news.cgtn.com/news/2025-12-05/VHJhbnNjcmlwdDg3NzIw/index.html",
    "snippet": "Speaking to CGTN, World Athletics President <strong>Sebastian Coe</strong> said China&#x27;s well-developed athletics system is helping build a stronger platform for the global development of the sport of athletics.",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "President/CEO, HSJ, Inc. Established, 1986 - Distributor of Fieldturf artificial turf for sports fields in Japan · Managing Director, BanKo Consulting · UCLA Law School Graduate, Juris Doctorate, 1983 (BA undergrad 1978 Political Science) Lecturer, Chukyo University Japan · Coordinator, Fuji Television Networks · NATIONALITY United States · LANGUAGES English · World Athletics Council Member – as Athletes’ Commission Deputy Chair (2025-present) World Athletics Athletes’ Commission Member (2023-present) World Athletics World Plan Implementation Taskforce Member (2023-present) Council",
    "published": null
  },
  {
    "title": "2025 World Athletics Championships - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_World_Athletics_Championships",
    "snippet": "The United States has won the most medals in the latest edition of World Athletics Championships, with over 450 total medals. ... In October 2019, World Athletics president <strong>Sebastian Coe</strong> stated consideration of a direct choice for Kenya to host ...",
    "published": "10 hours ago"
  },
  {
    "title": "Gold medalists, a multi-millionaire among 7 candidates for Olympic body presidency - India Today",
    "url": "https://www.indiatoday.in/amp/sports/olympics/story/international-olympic-committee-election-7-candidates-sebastian-coe-thomas-bach-2600827-2024-09-16",
    "snippet": "World Athletics president <strong>Sebastian Coe</strong>, Prince Feisal al Hussein of Jordan, International Gymnastics Federation chief Monnan Watanbe and Johan Eliasch are among the candidates who will be in the race to replace Bach.",
    "published": "September 16, 2024"
  }
]