[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Ventura entered politics in 1991 when he was elected mayor of Brooklyn Park, Minnesota, a position he held until 1995. He was the <strong>Reform Party candidate in the 1998 Minnesota gubernatorial election</strong>, running a low-budget campaign centered on grassroots events and unusual advertising that urged ...",
    "published": "3 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Jesse Ventura was the <strong>Governor of Minnesota</strong>. Ventura assumed office on January 8, 1999. Ventura left office on January 6, 2003. Ventura (Green Party of Alaska, Unaffiliated) ran for election for President of the United States. Ventura (Green Party of Alaska) lost in the general election on ...",
    "published": null
  },
  {
    "title": "Governorship of Jesse Ventura | MNopedia",
    "url": "https://www.mnhs.org/mnopedia/search/index/event/governorship-jesse-ventura",
    "snippet": "Afterward, he built a career as ... worked as a talk radio personality. He got his first political experience as <strong>nonpartisan mayor of Brooklyn Park</strong>, 1991–1995....",
    "published": "April 14, 2025"
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "His first foray into politics was as <strong>mayor of Brooklyn Park</strong> (1991–95). In the late 1990s he worked as a radio shock jock. ... In 1998 Ventura ran for governor of Minnesota as the Reform Party candidate.",
    "published": "January 14, 2009"
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th Governor of Minnesota on November 3, 1998 defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He <strong>served as Governor for one term</strong>. Shocking the political establishment, Ventura became the only Reform Party candidate to ...",
    "published": null
  }
]