[
  {
    "title": "2019 Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2019_Ukrainian_presidential_election",
    "snippet": "Poroshenko became the third incumbent Ukrainian president to directly lose reelection, after Viktor Yushchenko in 2010 and Leonid Kravchuk in 1994 (only Leonid Kuchma has ever won reelection, in 1999). <strong>Zelenskyy was sworn in as the sixth President of Ukraine in May 2019.</strong>",
    "published": "1 week ago"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "On 18 June 2015, Yanukovych was officially deprived of the title of President of Ukraine. The sixth and current president is <strong>Volodymyr Zelenskyy</strong>, who defeated Poroshenko in the 2019 presidential election and was inaugurated on 20 May 2019.",
    "published": "1 week ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "This power has only been used twice to date, first by president Viktor Yushchenko in 2007, and by president <strong>Volodymyr Zelenskyy</strong> in 2019. The legislative branches&#x27; check on the president includes the right to overturn a presidential veto with a two-thirds majority vote of the parliament.",
    "published": "November 10, 2025"
  },
  {
    "title": "Ukrainian Presidential Election 2019 - statistics & facts | Statista",
    "url": "https://www.statista.com/topics/5294/ukrainian-presidential-election-2019/",
    "snippet": "The winner of the 2019 election was <strong>Volodymyr Zelenskyy</strong> from the party Servant of the People who received 73.23 percent of the votes. His opponent, an independent candidate Petro Poroshenko, lost the competition with 24.45 percent of the votes.",
    "published": null
  },
  {
    "title": "Geography of the Presidential Elections in Ukraine – ERI",
    "url": "https://www.eurasian-research.org/publication/geography-of-the-presidential-elections-in-ukraine/",
    "snippet": "Therefore, the elections of 2019 are considered as the first act of unification of Ukraine in normal conditions as all regions of the country, except for one, unanimously voted for <strong>Volodymyr Zelensky</strong>.",
    "published": null
  }
]