[
  {
    "title": "José Antonio Kast - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jos%C3%A9_Antonio_Kast",
    "snippet": "José Antonio Kast Rist (born <strong>18 January 1966</strong>), also known by his initials JAK, is a Chilean lawyer and politician. He is the President-elect of Chile, after winning the 2025 Chilean general election.",
    "published": "1 day ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "During the campaign, he gave the roughly 330,000 undocumented migrants – most of them Venezuelan – an ultimatum to leave before the next president takes office on <strong>11 March</strong> or be expelled “with only the clothes on their backs”.",
    "published": "13 hours ago"
  },
  {
    "title": "Chile shifts sharply right as José Antonio Kast wins the presidency",
    "url": "https://www.npr.org/2025/12/14/nx-s1-5644074/chile-kast-right",
    "snippet": "A supporter of Chile&#x27;s presidential candidate Jose Antonio Kast, of the Partido Republicano party. JAVIER TORRES/AFP via Getty Images hide caption toggle caption JAVIER TORRES/AFP via Getty Images · Kast is set to take office <strong>March 11, 2026</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "Chile has elected the far-right wing José Antonio Kast to be its next president, after an election campaign that was dominated by themes of security, immigration and crime.",
    "published": "2 days ago"
  },
  {
    "title": "José Antonio Kast: Chile elects a Catholic, pro-life, and pro-family president – INFOVATICANA",
    "url": "https://infovaticana.com/en/2025/12/15/jose-antonio-kast-chile-elects-a-catholic-pro-life-and-pro-family-president/",
    "snippet": "In the presidential runoff of <strong>December 14, 2025</strong>, José Antonio Kast defeated left-wing candidate Jeannette Jara, becoming the president-elect of Chile. The result was confirmed after the official scrutiny and marks a significant shift in the ...",
    "published": "2 days ago"
  }
]