[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "It consisted of 45 members, mainly politicians from the two aforementioned major parties and the leaders of the other six minor parties. Also leading external figures such as <strong>Giuliano Amato, Marcello De Cecco, Gad Lerner, Carlo Petrini and Tullia Zevi</strong> were included.",
    "published": "1 day ago"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "As soon as <strong>Giorgia Meloni</strong>’s government had a chance to prove its ‘reliability’ to its international partners, former Democrat leader Enrico Letta proclaimed that she had proven ‘better than expected.’ · Clientelism surely has a long ...",
    "published": null
  },
  {
    "title": "Political cheat sheet: What to know about Italy's Democratic Party",
    "url": "https://www.thelocal.it/20170904/what-is-italys-ruling-democratic-party-politics-ideology",
    "snippet": "Italy had a PD-led government between 2013 and 2018, headed by three different prime ministers from the party; <strong>Enrico Letta, Matteo Renzi, and Paolo Gentiloni</strong>. The party brings together a broad range of political groups, and as such, its short ...",
    "published": "September 8, 2022"
  },
  {
    "title": "Democratic Party - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q47729",
    "snippet": "Partito Democratico (Italian) 1 ... · participant in · 2020 Italian regional elections · 0 references · founded by · <strong>Walter Veltroni</strong> ·...",
    "published": null
  },
  {
    "title": "Democratic Party – Democratic and Progressive Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_–_Democratic_and_Progressive_Italy",
    "snippet": "On 29 July, Letta announced the formation of a joint list between the PD, Article One (Art.1), the Italian Socialist Party (PSI), and Solidary Democracy (DemoS) in the upcoming general election, and was officially founded that same day. Other minor parties joined later.",
    "published": "August 9, 2025"
  }
]