[
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "Mariano Rajoy (born March 27, 1955, ... was raised in the Galicia region of northern Spain. He studied law at the <strong>University of Santiago de Compostela</strong>, receiving a degree in 1978....",
    "published": "December 6, 2011"
  },
  {
    "title": "La Moncloa. 26/09/2018. Mariano Rajoy Brey [Presidents since 1978]",
    "url": "https://www.lamoncloa.gob.es/lang/en/presidente/presidents/Paginas/marianorajoy_BIO.aspx",
    "snippet": "26 September 2018. Place of birth: Santiago de Compostela (A Coruña)Date of birth: 27 March 1955Education: Bachelor of Law from the <strong>University of Santiago de Compostela</strong>Married with two children",
    "published": null
  },
  {
    "title": "Mariano Rajoy former President of Spain (2011 to 2018).",
    "url": "https://clubmadrid.org/who/members/rajoy-mariano/",
    "snippet": "Mariano Rajoy is a former President of Spain (2011 to 2018). Rajoy studied Law at the <strong>University of Santiago de Compostela</strong>, in Galicia, where he graduated in 1978.",
    "published": "November 21, 2019"
  },
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "Born 27 March 1955 in Santiago de Compostela, in the Galician province of A Coruña, in Spain, Rajoy is the grandson of Enrique Rajoy Leloup, one of the architects of the Galician Statute of Autonomy (1936) (Estatuto de autonomía de Galicia), who was removed from university teaching by the Franco dictatorship in the early 1950s. He is the son of Olga Brey López and Mariano Rajoy Sobredo, a jurist, and president of the Provincial Court of Pontevedra, the city where he grew up.",
    "published": "March 8, 2004"
  },
  {
    "title": "Mariano Rajoy Life Story: Relationships, Family, Career Highlights & Achievements - Mabumbe",
    "url": "https://mabumbe.com/people/mariano-rajoy-life-story-relationships-family-career-highlights-achievements/",
    "snippet": "Growing up in an environment that valued public service and law, Rajoy was inspired to pursue a career in the legal field. He attended the <strong>University of Santiago de Compostela</strong>, where he earned a law degree in 1978.",
    "published": "December 6, 2024"
  }
]