[
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "When he was less than a year old, Coe and his family moved to Warwickshire, where he later attended <strong>Bridgetown Primary School and Hugh Clopton Secondary School in Stratford-upon-Avon</strong>. The family then moved to Sheffield where he attended Tapton School, a secondary modern school, at Crosspool ...",
    "published": "November 18, 2025"
  },
  {
    "title": "Sebastian Coe Biography - Facts, Childhood, Family Life & Achievements",
    "url": "https://www.thefamouspeople.com/profiles/sebastian-coe-6674.php",
    "snippet": "He received his primary education from <strong>Bridgetown Primary School and Hugh Clopton Secondary School in Stratford-upon-Avon</strong>. His family then moved to Sheffield where he attended Tapton Secondary Modern School and Abbeydale Grange School.",
    "published": null
  },
  {
    "title": "Sebastian Coe | GreatestBritons",
    "url": "https://greatestbritons.com/sebastian-coe-biography/",
    "snippet": "When Sebastian was still very young the family moved to Warwickshire where he attended school in <strong>Stratford-Upon-Avon</strong>, before a further move saw Coe at a comprehensive school in Sheffield, South Yorkshire.",
    "published": "3 weeks ago"
  },
  {
    "title": "Sebastian Coe facts for kids",
    "url": "https://kids.kiddle.co/Sebastian_Coe",
    "snippet": "Sebastian Coe was born in London on 29 September 1956. His father, Peter Coe, was an athletics coach. His mother, Tina Angela Lal, had Indian and English/Irish family. When he was very young, his family moved to Warwickshire. He went to primary and secondary schools there.",
    "published": null
  },
  {
    "title": "Sebastian Coe",
    "url": "https://dcyf.worldpossible.org/rachel/modules/wikipedia_for_schools/wp/s/Sebastian_Coe.htm",
    "snippet": "Coe grew up in Warwickshire where he attended <strong>Bridgetown Primary School and Hugh Clopton Secondary School in Stratford-upon-Avon</strong>. The family then moved to Sheffield where he attended Tapton Secondary Modern School, Crosspool which became a Comprehensive School when he was there and Abbeydale ...",
    "published": null
  }
]