[
  {
    "title": "Minister of Health and Population (Nepal) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_of_Health_and_Population_(Nepal)",
    "snippet": "<strong>Sudha Sharma Gautam</strong> is the current Minister of Health and Population, assuming office from 26 October 2025.",
    "published": "November 17, 2025"
  },
  {
    "title": "Ministry of Health and Population (Nepal) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health_and_Population_(Nepal)",
    "snippet": "<strong>Bikas Devkota</strong> currently holds the position of Secretary of the Ministry of Health and Population. Roshan Pokhrel formerly held the position of health secretary. The Department of Health Services serves under the ministry to facilitate and implement its work, mainly deliver health services and ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Amid controversy, Karki expands Cabinet for third time",
    "url": "https://kathmandupost.com/national/2025/10/27/amid-controversy-karki-expands-cabinet-for-third-time",
    "snippet": "<strong>Gautam, who served as health secretary from 2008 to 2011, will lead the Ministry of Health and Population</strong>, and Gupta will head the Ministry of Youth and Sports.",
    "published": null
  },
  {
    "title": "Category:Health ministers of Nepal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Category:Health_ministers_of_Nepal",
    "snippet": "The following 9 pages are in this category, out of 9 total. This list may not reflect recent changes. Minister of Health and Population (Nepal) <strong>Khagaraj Adhikari · Yagya Bahadur Basnyat · Umakant Chaudhary</strong> · Upendra Devkota · Padam Giri · Giriraj Mani Pokharel ·",
    "published": null
  },
  {
    "title": "Ministry of Health and Population-Nepal | Kathmandu | Facebook",
    "url": "https://www.facebook.com/mohpnep/",
    "snippet": "Ministry of Health and Population-Nepal, Kathmandu. 773,936 likes · 11,999 talking about this · 1 was here. Official Facebook Page of Government of Nepal, Ministry of Health and Population.",
    "published": null
  }
]