[
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "Manmohan Singh was born on September 26, 1932, in a village in the Punjab province of undivided India. He <strong>completed his Matriculation examinations from Punjab University in 1948</strong>. His illustrious academic journey took him from Punjab to the University of Cambridge, UK, where he earned a First ...",
    "published": null
  },
  {
    "title": "Dr. Manmohan Singh: India’s son, the Pride of the World",
    "url": "https://inc.in/congress-sandesh/tribute/dr-manmohan-singh-india-s-son-the-pride-of-the-world",
    "snippet": "Manmohan Singh <strong>received his early education locally. He was a brilliant student in his academic career. He completed his graduation from Punjab University in 1952 and post-graduation in 1954</strong>.",
    "published": null
  },
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Singh was born to Gurmukh Singh ... by his paternal grandmother Jamna Devi, with whom he was very close. Singh was <strong>initially educated at a local gurdwara, where he began studying Urdu and Punjabi</strong>....",
    "published": "2 days ago"
  },
  {
    "title": "Manmohan Singh - Students | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/students/article/Manmohan-Singh/476657",
    "snippet": "Manmohan Singh was born on September ... He <strong>attended Panjab University in Chandigarh, India, and then completed his education in England, first at the University of Cambridge and then at the University of Oxford</strong>....",
    "published": null
  },
  {
    "title": "Former Dr. Manmohan Singh Biography: Age, Education, Political Career, Awards and Honours",
    "url": "https://www.jagranjosh.com/general-knowledge/dr-manmohan-singh-biography-1727329371-1",
    "snippet": "Manmohan Singh started his education at <strong>Panjab University</strong>, receiving his Bachelor of Arts and Master of Arts degrees in Economics in 1952 and 1954, respectively. From here he came to the University of Cambridge and in 1957 received a First Class ...",
    "published": "December 27, 2024"
  }
]