[
  {
    "title": "José Luis Rodríguez Zapatero - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/José_Luis_Rodríguez_Zapatero",
    "snippet": "José Luis Rodríguez Zapatero (Spanish: [xoseˈlwis roˈðɾiɣeθ θapaˈteɾo] ⓘ; born 4 August 1960) is a Spanish politician and member of the Spanish Socialist Workers&#x27; Party (PSOE). He was the Prime Minister of Spain being <strong>elected for two terms, in the 2004 and 2008 general elections</strong>.",
    "published": "November 12, 2025"
  },
  {
    "title": "José Luis Rodríguez Zapatero | Spanish PM, Socialist Leader | Britannica",
    "url": "https://www.britannica.com/biography/Jose-Luis-Rodriguez-Zapatero",
    "snippet": "José Luis Rodríguez Zapatero (born August 4, 1960, Valladolid, Spain) is a Spanish politician, who served as prime minister of Spain from <strong>2004 to 2011.</strong>",
    "published": "January 19, 2006"
  },
  {
    "title": "José Luis Rodríguez Zapatero – International Commission against the Death Penalty",
    "url": "https://icomdp.org/comission/jose-luis-rodriguez-zapatero-2/",
    "snippet": "José Luis Rodríguez Zapatero was Prime Minister of Spain from <strong>2004 to 2011.</strong> Mr. Zapatero has a law degree from the University of Leon, Spain. He was later appointed Professor of Constitutional Law at the same university.",
    "published": null
  },
  {
    "title": "José Luis Rodríguez Zapatero | World Leaders Forum",
    "url": "https://worldleaders.columbia.edu/directory/jose-luis-rodriguez-zapatero",
    "snippet": "José Luis Rodríguez Zapatero is <strong>president of the government of Spain</strong>. Born in 1960, he has a degree in law from the University of Léon. He has been a member of the Spanish Socialists’ Party (PSOE) since 1979. He is the secretary-general of the PSOE and since 2000.",
    "published": null
  },
  {
    "title": "José Luis Rodríguez Zapatero",
    "url": "https://www.un.org/millenniumgoals/advocates/members/jose-luiz-rodriguez-zapatero.shtml",
    "snippet": "José Luis Rodriguez Zapatero, Prime Minister of Spain · <strong>Born in 1960 in Valladolid, José Luis Rodriguez Zapatero graduated in Law at the University of León and began his career as a lecturer in Constitutional Law at the same University</strong>. He became a member of the Spanish Socialist Workers’ ...",
    "published": null
  }
]