[
  {
    "title": "Nicholas Burns | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty/nicholas-burns",
    "snippet": "He is also a Faculty Affiliate at Harvard’s Fairbank Center for Chinese Studies. Burns served as the <strong>U.S. Ambassador to the People&#x27;s Republic of China</strong> from 2021-2025, leading public servants from forty-eight U.S.",
    "published": null
  },
  {
    "title": "Nicholas Burns | The Belfer Center for Science and International Affairs",
    "url": "https://www.belfercenter.org/person/nicholas-burns",
    "snippet": "Roy and Barbara Goodman Family <strong>Professor of the Practice of Diplomacy and International Relations</strong>, Harvard Kennedy School · Faculty Affiliate at Harvard’s Fairbank Center for Chinese Studies ...",
    "published": null
  },
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "Robert Nicholas Burns (born January 28, 1956) is an American diplomat and international relations scholar. He served as the <strong>United States ambassador to China</strong> from 2022 to 2025. He is now Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations at Harvard ...",
    "published": "September 26, 2025"
  },
  {
    "title": "Former U.S. Ambassador to China To Return to Kennedy School Professorship | News | The Harvard Crimson",
    "url": "https://www.thecrimson.com/article/2025/1/27/burns-hks-return/",
    "snippet": "Former U.S. Ambassador to China R. Nicholas Burns will return to the Harvard Kennedy School as a <strong>professor</strong> this April, joining the Fairbank Center for Chinese Studies, the University announced earlier this week.",
    "published": null
  },
  {
    "title": "Longtime Harvard Kennedy School faculty member Nicholas Burns to return to HKS after serving as U.S. envoy to China | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/announcements/nicholas-burns-returns-to-hks",
    "snippet": "— Nicholas Burns, who until recently served as the United States ambassador to the People’s Republic of China, <strong>will rejoin the Harvard Kennedy School faculty</strong> in April, Dean Jeremy M. Weinstein announced today.",
    "published": null
  }
]