[
  {
    "title": "McClatchy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/McClatchy",
    "snippet": "McClatchy Media Company, also known as McClatchy, is an American publishing company incorporated under Delaware&#x27;s General Corporation Law. Originally based in Sacramento, California, <strong>United States</strong>, and known as The McClatchy Company, it became a subsidiary of Chatham Asset Management, headquartered ...",
    "published": "10 hours ago"
  },
  {
    "title": "McClatchy | History",
    "url": "https://www.mcclatchy.com/about/history",
    "snippet": "What began in 1857 as a four-page newspaper in the dusty streets of <strong>Sacramento, California</strong> has grown into a digital network spanning local markets from California to Florida, from Washington state to Washington D.C.",
    "published": null
  },
  {
    "title": "McClatchy Company Overview, Contact Details & Competitors | LeadIQ",
    "url": "https://leadiq.com/c/mcclatchy/5a1d8aa72400002400648c36",
    "snippet": "McClatchy was founded in 1857. Newspaper Publishing<strong>United States</strong>1001-5000 Employees · McClatchy Media Company is shaping the future of media by bringing together trusted journalism, engaging lifestyle and entertainment content, trend analysis, and innovative distribution solutions.",
    "published": null
  },
  {
    "title": "McClatchy Company - Ballotpedia",
    "url": "https://ballotpedia.org/McClatchy_Company",
    "snippet": "In 2006, the McClatchy Company purchased Knight Ridder, becoming the second biggest newspaper publisher in the <strong>United States</strong> at that time.[1][2] In 2020, McClatchy and its affiliated companies filed for Chapter 11 bankruptcy.[3] The company was acquired by Chatham Asset Management, a New ...",
    "published": null
  },
  {
    "title": "McClatchy Media: Contact Information, Journalists, and Overview | Muck Rack",
    "url": "https://muckrack.com/media-outlet/mcclatchy",
    "snippet": "The McClatchy Company is a publicly traded American publishing company based in <strong>Sacramento, California</strong>. It operates 30 daily newspapers in 15 states and has an average weekday circulation of 2.2 million and Sunday circulation of 2.8 million.",
    "published": null
  }
]