[
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Under Chancellor Larive’s leadership, UC Santa Cruz has cemented its place as preeminent research university, with research support now surpassing $200 million annually. She advanced regional economic development by establishing the Innovation and Business Engagement Hub to connect industry with the campus innovation ecosystem.",
    "published": null
  },
  {
    "title": "Office of the Chancellor – The Office of the Chancellor at UC Santa Cruz.",
    "url": "https://chancellor.ucsc.edu/",
    "snippet": "Chancellor Cynthia Larive · Campus notification procedures for immigration enforcement (SB 98)December 4, 2025 · Announcing Inspiring Change: The Campaign for UC Santa CruzNovember 16, 2025 · Campus Provost and Executive Vice Chancellor recruitment underwayNovember 7, 2025 ·",
    "published": null
  },
  {
    "title": "Leadership – UC Santa Cruz",
    "url": "https://www.ucsc.edu/about/leadership/",
    "snippet": "As the <strong>11th chancellor of UC Santa Cruz</strong>, Cynthia Larive leads an institution known worldwide for its interdisciplinary approach to research for the public good, for seeking solutions and giving voice to the challenges of our time, and for its commitment to social and environmental justice.",
    "published": null
  },
  {
    "title": "Letter from Chancellor Cynthia Larive – UC Santa Cruz",
    "url": "https://www.ucsc.edu/annual-report/letter-from-chancellor-cynthia-larive-2025/",
    "snippet": "Cynthia Larive Chancellor · Last modified: Nov 05, 2025",
    "published": null
  },
  {
    "title": "University of California-Santa Cruz | Excelencia Education",
    "url": "https://www.edexcelencia.org/e-action-president-chancellor/university-of-california-santa-cruz",
    "snippet": "Cynthia K. Larive is <strong>Chancellor of the University of California-Santa Cruz and part of Excelencia in Action network</strong>. Seal of Excelencia Certified Institution: 2022-2025 · UC Santa Cruz (UCSC) has earned international distinction for its high-impact ...",
    "published": null
  }
]