[
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "They hired <strong>Francesco Farioli</strong> as new head coach, the first foreign coach since 1998. Under his leadership, Ajax reached the league phase of the Europa League, where it finished eleventh. On 9 February 2025, Ajax finished the weekend on the first place for the first time since November 2022.",
    "published": "1 week ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "Ajax has reached an agreement with <strong>John Heitinga</strong> regarding the coach’s move to Amsterdam. Heitinga is signing a contract with Ajax as head coach until June 30, 2027. Marcel Keizer will be his assistant and is signing a contract of the same ...",
    "published": null
  },
  {
    "title": "r/soccer on Reddit: [VI] Fred Grim will be Ajax first team head coach until at least the winter break",
    "url": "https://www.reddit.com/r/soccer/comments/1p2uetc/vi_fred_grim_will_be_ajax_first_team_head_coach/",
    "snippet": "Ajax coach <strong>John Heitinga</strong>: &quot;Galatasaray is a strong team. They have very fast players. You must not give this team too much space. We need to play very tightly. We must not lose the ball.",
    "published": "November 21, 2025"
  },
  {
    "title": "Francesco Farioli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Francesco_Farioli",
    "snippet": "He is currently the head coach of Primeira Liga club Porto. Farioli started his coaching career in Turkey with spells at Fatih Karagümrük and Alanyaspor. He then had one season in charge of French club Nice in Ligue 1, before being appointed by Ajax in May 2024. He resigned after one season at the club and following that, in July 2025...",
    "published": "7 hours ago"
  },
  {
    "title": "AFC Ajax » Coaching Staff List",
    "url": "https://www.worldfootball.net/teams/te64/afc-ajax/all-managers/",
    "snippet": "Football - results, news, statistics and much more...",
    "published": null
  }
]