[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "In August 2010, the blog became a licensed feature of The New York Times online and was renamed FiveThirtyEight: Nate Silver&#x27;s Political Calculus. <strong>In July 2013, ESPN acquired FiveThirtyEight</strong>, hiring Silver as editor-in-chief and a contributor for ESPN.com; the new publication launched on March ...",
    "published": "November 19, 2025"
  },
  {
    "title": "Publishers Daily: ABC News Buys 'FiveThirtyEight'",
    "url": "https://www.mediapost.com/publications/article/317771/abc-news-buys-fivethirtyeight.html",
    "snippet": "<strong>FiveThirtyEight was purchased by ESPN in 2013.</strong> The site&#x27;s traffic grew from 3.6 million unique visitors in March 2015 to 11.5 million a year later, thanks to the fever surrounding the 2016 presidential election.",
    "published": null
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "<strong>On July 22, 2013, ESPN (a subsidiary of the Walt Disney Company) announced that it had acquired ownership of the FiveThirtyEight website and brand</strong>, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming ...",
    "published": "1 week ago"
  },
  {
    "title": "Like it or not, ESPN isn't sticking to sports - ESPN - Public Editor- ESPN",
    "url": "https://www.espn.com/blog/ombudsman/post/_/id/831/not-sticking-to-sports-the-right-move-for-espn",
    "snippet": "<strong>ESPN assumed ownership in July 2013</strong> and relaunched the site in March 2014. It’s now beyond its first presidential election under ESPN ownership and looking to expand its offerings in a few key subject areas.",
    "published": "April 12, 2017"
  },
  {
    "title": "Nate Silver’s FiveThirtyEight Moving From ESPN To ABC News",
    "url": "https://deadline.com/2018/04/fivethirtyeight-leaving-espn-for-abc-news-nate-silver-1202366322/",
    "snippet": "Nate Silver’s data-driven news site FiveThirtyEight is changing teams, with <strong>ABC News saying it has reached an agreement in principle to acquire the site from its Disney corporate sibling ESPN</strong>.",
    "published": "April 17, 2018"
  }
]