[
  {
    "title": "DFG, German Research Foundation - Announcement of Clusters of Excellence to Receive Funding in the Future, Thursday, 22 May 2025, from approx. 5 pm",
    "url": "https://www.dfg.de/en/news/news-topics/announcements-proposals/2025/ifr-25-29",
    "snippet": "The funding decisions will be announced by the Chair and Deputy Chair of the GWK at that time. The President of the DFG, Professor Dr. <strong>Katja Becker</strong>, and the Chair of the German Science and Humanities Council (WR), Professor Dr.",
    "published": null
  },
  {
    "title": "A new Vice President for the DFG. DFG Press Release no. 17 | EurekAlert!",
    "url": "https://www.eurekalert.org/news-releases/1091102",
    "snippet": "The Deutsche Forschungsgemeinschaft ... annual meeting in Hamburg, the General Assembly elected economist Professor Dr. <strong>Caren Sureth-Sloane</strong> to the Executive Committee of Germany’s largest research funding organisation and central ...",
    "published": null
  },
  {
    "title": "Germany, DFG: von Kaven Award 2025 Goes to Mathematician Andrii Mironchenko",
    "url": "https://ukrainet.eu/2025/11/16/dfg-von-kaven-award-mironchenko/",
    "snippet": "Dr. habil. <strong>Andrii Mironchenko</strong>, Chair of Applied Mathematics at The University of Bayreuth, was awarded von Kaven Award, conferred by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) in recognition of his outstanding research in mathematical systems theory.",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - Executive Board, Vice Presidents and Further Members",
    "url": "https://www.dfg.de/en/about-us/statutory-bodies/executive-committee/members",
    "snippet": "Vice President Elected on 2 July 2025 Inauguration on 1 January 2026 · President of the Stifterverband · Our website uses cookies that are strictly necessary for its technical functionality and cookies for the collection of statistical information (analytical cookies).",
    "published": null
  },
  {
    "title": "DFG funds new research group for developing sustainable data technologies - Faculty of Engineering",
    "url": "https://www.tf.fau.eu/2025/12/general/dfg-funds-new-research-group-for-developing-sustainable-data-technologies/",
    "snippet": "<strong>Dietmar Fey</strong> Chair of Computer Science 3 (Computer Architecture) FAU Post “German Research Foundation awards funding to three FAU research groups”: www.fau.eu/2025/12/news/deutsche-forschungsgemeinschaft-foerdert-drei-fau-forschungsgruppen/ ...",
    "published": "5 days ago"
  }
]