[
  {
    "title": "Ministry of Health, Population and Hospital Reform - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health,_Population_and_Hospital_Reform",
    "snippet": "The Ministry of Health, Population and Hospital Reform (MSPRH) is the health ministry of Republic of Algeria. It is located in El Madania, a municipality of Algiers. The Ministry is responsible for public health facilities and population monitoring. The Minister is a member of the Council of ...",
    "published": "April 15, 2025"
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform (Algeria) | GHDx",
    "url": "https://ghdx.healthdata.org/organizations/ministry-health-population-and-hospital-reform-algeria",
    "snippet": "Formerly named the Ministry of Health and Population (Ministère de la Santé et de la Population).",
    "published": null
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform - Algeria - Health Research Web (HRWeb)",
    "url": "https://healthresearchwebafrica.org.za/en/algeria/regulation_4574",
    "snippet": "Algeria · Regulation Organisations · Contact Info. Organisation Info. Resources · Publications · Supplementary Info. Directorate of Pharmacy and Medicine · Ministry of Health, Population and Hospital Reform · Country Algeria · Institution website address http://www.ands.dz/pharmacie...",
    "published": null
  },
  {
    "title": "Department of Health, Population, and Hospital Reform (Algeria) | Devex",
    "url": "https://www.devex.com/organizations/department-of-health-population-and-hospital-reform-algeria-52456",
    "snippet": "Learn more about Department of Health, Population, and Hospital Reform (Algeria)&#x27;s jobs, projects, latest news, contact information and geographical presence. The Department of Health and Hospital Reform is the government agency responsible for Health in Alge",
    "published": null
  },
  {
    "title": "Ministry of Health and Population (Algeria) | GHDx",
    "url": "https://ghdx.healthdata.org/organizations/ministry-health-and-population-algeria",
    "snippet": "Changed its name around 2000 to Ministry of Health, Population and Hospital Reform (Ministère de la Santé, de la Population et de la Réforme Hospitalière).",
    "published": null
  }
]