[
  {
    "title": "From Political Changes to Economic Growth, from Wars to Disasters: Asia’s Defining Year 2025 (II) - THE AsiaN",
    "url": "https://theasian.asia/archives/203269",
    "snippet": "He has served as president of the People’s Justice Party (PKR) since 2018 and has represented the Tambun constituency in Parliament since 2022. From Reformasi to MADANI: Anwar’s Political and Policy Foundation · Known as a reform-minded politician, Anwar first rose to prominence in September 1998 after he was dismissed as deputy prime minister by then Prime Minister Mahathir Mohamad.",
    "published": "5 days ago"
  },
  {
    "title": "Malaysia’s ex-PM Mahathir quits Pejuang party he founded, picks GTA as new political platform | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/malaysia-ex-pm-mahathir-quits-the-pejuang-party-he-founded-chooses-gta-as-new-political-platform",
    "snippet": "KUALA LUMPUR - Malaysia’s former premier Mahathir Mohamad has <strong>quit Parti Pejuang Tanah Air</strong>, a Malay party he founded just over two years ago, indicating a split in political direction with his son Mukhriz Mahathir, who currently heads the party.",
    "published": "November 22, 2024"
  },
  {
    "title": "Mahathir bin Mohamad | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mahathir-bin-Mohamad",
    "snippet": "During the election campaign, Mahathir had pledged that he would step down after serving two years and cede power to Anwar, and one of his first acts in office was to petition Sultan Muhammad V to pardon Anwar. Anwar was released days later and soon resumed his political career. ... BBC - The Interview - Mahathir Mohamad, Prime Minister of Malaysia (Dec. 03, 2025) (Show more)",
    "published": "July 20, 1998"
  },
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "Mahathir bin Mohamad (Jawi: محاضر بن محمد; IPA: [mahaðɪ(r) bɪn mohamad]; born 10 July 1925) is a Malaysian politician, author and doctor who served as the fourth and seventh prime minister of Malaysia from 1981 to 2003 and again from 2018 to 2020.",
    "published": "1 day ago"
  },
  {
    "title": "Mahathir launches new party as Malaysia’s power struggle intensifies | South China Morning Post",
    "url": "https://www.scmp.com/week-asia/politics/article/3096468/mahathir-launches-new-party-malaysias-power-struggle-intensifies",
    "snippet": "Mahathir, who has felled three ... given an official name. Mahathir said for now the party would be referred to as <strong>Bebas (independent).</strong>...",
    "published": "August 7, 2020"
  }
]