[
  {
    "title": "Mario Draghi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mario_Draghi",
    "snippet": "He has been nicknamed Super Mario by some media, a nickname that was popularised during his time as president of the ECB, when he was credited by numerous sources as having played a key role in combatting the Eurozone crisis. After Draghi&#x27;s term as ECB President ended in 2019, he initially returned to private life.",
    "published": "2 days ago"
  },
  {
    "title": "Mario Draghi | Biography, Prime Minister, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Mario-Draghi",
    "snippet": "Under Draghi the ECB <strong>adopted interventionist monetary policies</strong> that were aimed not just at calming the panic that had gripped the eurozone but at ensuring that Europe’s economies would be better positioned to weather future crises.",
    "published": "October 25, 2011"
  },
  {
    "title": "Mario Draghi | CEPR",
    "url": "https://cepr.org/about/people/mario-draghi",
    "snippet": "Mario Draghi is an Italian economist, central banker, and public servant with a distinguished career in international finance and policy. He served as President of the European Central Bank (ECB) from 2011 to 2019, where he played a pivotal role in navigating the Eurozone through the sovereign ...",
    "published": null
  },
  {
    "title": "Who Is Mario Draghi and Why Is He Important to Economics?",
    "url": "https://www.investopedia.com/investing/who-mario-draghi/",
    "snippet": "Moral suasion is not limited to the U.S. In 2012, European Central Bank (ECB) president Mario Draghi said the bank would do &quot;whatever it takes&quot; to preserve the euro, which served to underpin the beleaguered currency and led to its subsequent rebound.",
    "published": "November 24, 2003"
  },
  {
    "title": "Mario Draghi - European Central Bank",
    "url": "https://www.forbes.com/profile/mario-draghi/",
    "snippet": "Get in TouchGet In Touch With Mario DraghiGet In Touch ... As president of the European Central Bank (ECB), Mario Draghi has <strong>presided over an era of disintegrating faith in EU, notable in the 2016 Brexit vote</strong>.",
    "published": null
  }
]