[
  {
    "title": "Katerina Sakellaropoulou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Katerina_Sakellaropoulou",
    "snippet": "Katerina N. Sakellaropoulou (Greek: Κατερίνα Ν. Σακελλαροπούλου [kateˈrina sacelaroˈpulu]; born 30 May 1956) is a Greek retired judge who served as the president of Greece from 2020 to 2025. She was elected by the Hellenic Parliament to succeed <strong>Prokopis Pavlopoulos</strong> on 22 ...",
    "published": "October 2, 2025"
  },
  {
    "title": "KATERINA SAKELLAROPOULOU - Aρχική",
    "url": "https://www.presidency.gr/en/katerina-sakellaropoulou-en/",
    "snippet": "KATERINA SAKELLAROPOULOU Back to Former Presidents Katerina Sakellaropoulou (2020-2025) biography Katerina N. Sakellaropoulou was born in Thessaloniki in 1956. She is a graduate of the Arsakeio School and has earned a degree from the University of Athens Law School (1978).",
    "published": "March 23, 2025"
  },
  {
    "title": "President - Aρχική",
    "url": "https://www.presidency.gr/en/president/",
    "snippet": "PRESIDENT of the Hellenic Republic The President Constantine An. Tassoulas Personal Info Place and Date οf Birth: He was born in Ioannina in 1959. Marital Status: He is married with lawyer Fani Stathopoulou and has two children Tasos and Magda. Profession: A member of the Athens Bar Association.",
    "published": "March 27, 2025"
  },
  {
    "title": "Katerina Sakellaropoulou | president of Greece | Britannica",
    "url": "https://www.britannica.com/biography/Katerina-Sakellaropoulou",
    "snippet": "Other articles where Katerina Sakellaropoulou is discussed: Greece: Greece’s debt crisis: In mid-January 2020 Mitsotakis nominated Katerina Sakellaropoulou, a high court judge, to become the country’s president. The appointment of Sakellaropoulou, a committed environmentalist and expert on environmental and constitutional law, won support from across the political spectrum, and 261 out of 300 members of parliament voted in her favour on…",
    "published": null
  },
  {
    "title": "Katerina Sakellaropoulou: first-elect female President of the Hellenic Republic - International Alliance of Women",
    "url": "https://womenalliance.org/katerina-sakellaropoulou-first-elect-female-president-of-the-hellenic-republic/",
    "snippet": "International Alliance of Women ... the first-elect female President of Greece. The current Prime Minister of Greece, <strong>Kyriakos Mitsotakis</strong>, nominated ......",
    "published": "February 26, 2020"
  }
]