[
  {
    "title": "Next Greek parliamentary election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Greek_parliamentary_election",
    "snippet": "Immediately following the European ... coercing PASOK – KINAL President Nikos Androulakis to call for early leadership elections for October of the same year, bypassing the planned ones for late 2025....",
    "published": "3 days ago"
  },
  {
    "title": "Movement for Democracy (Greece) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Movement_for_Democracy_(Greece)",
    "snippet": "^ Chourdakis attempted to resign from the party and his position on 30 January 2025 surrounding his position on the Prespa Agreement, but his resignation was rejected by Kasselakis.",
    "published": "November 3, 2025"
  },
  {
    "title": "Making Greece Great Again ━ The European Conservative",
    "url": "https://europeanconservative.com/articles/analysis/making-greece-great-again/",
    "snippet": "Tags: austerity, demographics, ECB, EU, family, Greece, IMF, <strong>Kyriakos Mitsotakis</strong>, tax breaks · You must be logged in to post a comment. Subscribe to any plan available in our store to comment, connect and be part of the conversation!",
    "published": "2 weeks ago"
  },
  {
    "title": "Greece Elects New President Despite MPs' Walkout Over Train Crash | Balkan Insight",
    "url": "https://balkaninsight.com/2025/02/12/greece-elects-new-president-despite-mps-walkout-over-train-crash/",
    "snippet": "Election by parliament of <strong>Konstantinos Tasoulas</strong> as Greece&#x27;s new president was marred by walk-outs by leftist opposition parties, which accuse him of involvement in an alleged government cover-up over the 2023 Tempi train crash.",
    "published": "February 12, 2025"
  },
  {
    "title": "Government at a Glance 2025: Greece",
    "url": "https://www.oecd.org/en/publications/government-at-a-glance-2025-country-notes_da3361e1-en/greece_3bee4427-en.html",
    "snippet": "These country-specific factsheets are based on the data from Government at a Glance 2025, on a wide array of public governance and public administration issues, ranging from trust in government, satisfaction with services, digital government, regulation, and procurement, to public employment ...",
    "published": "June 18, 2025"
  }
]