[
  {
    "title": "Joseph S. Lacob – NBA 2025 All-Star Technology Summit",
    "url": "https://techsummit.nba.com/participants/joseph-s-lacob/",
    "snippet": "In his role as <strong>co-executive chairman &amp; CEO</strong>, Joe Lacob is the managing member of the Golden State Warriors’ ownership group. Entering his 15th year in this capacity, he serves on the NBA Board of Governors and is a member of the League’s Planning Committee and Labor Committee.",
    "published": null
  },
  {
    "title": "Joe Lacob - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Joe_Lacob",
    "snippet": "Joseph Steven Lacob (born January 10, 1956) is an American business executive who was a partner at Kleiner Perkins and is the <strong>principal owner</strong> of the Golden State Warriors of the National Basketball Association (NBA) and the Golden State Valkyries of the Women&#x27;s National Basketball Association ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Are Warriors’ Lacob and Guber the Bay Area’s all-time best sports team owners?",
    "url": "https://www.sfchronicle.com/sports/annkillion/article/warriors-lacob-guber-bay-area-s-all-time-21163580.php",
    "snippet": "Fifteen years into their remarkable run as Golden State Warriors owners, Joe Lacob and Peter Guber reflect on the wild success — and contemplate the challenge of proving “it’s not just Steph...",
    "published": "November 11, 2025"
  },
  {
    "title": "Warriors Owner Joe Lacob: A Relentless Pursuit of Excellence | Stanford Graduate School of Business",
    "url": "https://www.gsb.stanford.edu/insights/warriors-owner-joe-lacob-relentless-pursuit-excellence",
    "snippet": "When longtime Kleiner Perkins venture capitalist Joe Lacob and his fellow investors <strong>bought the Golden State Warriors in 2010 for a record $450 million</strong>, there were plenty of doubters on the sidelines.",
    "published": "November 14, 2016"
  },
  {
    "title": "Joe Lacob | Golden State Warriors",
    "url": "https://www.nba.com/warriors/staff/joe-lacob",
    "snippet": "In his role as <strong>co-executive chairman &amp; CEO</strong>, Joe Lacob is the managing member of the Golden State Warriors’ ownership group.",
    "published": null
  }
]