[
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "Olaf Scholz (born 14 June 1958) is a German politician who served as the Chancellor of Germany from <strong>2021 to 2025</strong>. A member of the Social Democratic Party (SPD), he previously served as Vice Chancellor in the fourth Merkel cabinet and as Federal Minister of Finance from 2018 to 2021.",
    "published": "1 week ago"
  },
  {
    "title": "Olaf Scholz | Facts, Biography, Cabinet, & Chancellor of Germany | Britannica",
    "url": "https://www.britannica.com/biography/Olaf-Scholz",
    "snippet": "Olaf Scholz Chancellor of Germany Olaf Scholz, 2021.",
    "published": "March 31, 2022"
  },
  {
    "title": "Germany’s Merz urges Scholz to drastically move up timeline for snap election",
    "url": "https://www.politico.eu/article/germany-friedrich-merz-olaf-scholz-move-up-timeline-snap-election-collapse-coalition/",
    "snippet": "Speaking to reporters in Germany’s ... collapse, Scholz proposed a far longer timeline — <strong>a vote of confidence in mid January followed by a snap election by the end of March</strong>....",
    "published": "December 17, 2024"
  },
  {
    "title": "Olaf Scholz",
    "url": "https://www.bruegel.org/people/olaf-scholz",
    "snippet": "<strong>In 2007, Scholz became Federal Minister of Labour and Social Affairs, a position he held until 2009.</strong> Following this, he was appointed deputy chair of the SPD parliamentary group. From 2011 to 2018, he served as Mayor of Hamburg.",
    "published": null
  },
  {
    "title": "The revenge of the Scholzomat",
    "url": "https://www.lowyinstitute.org/the-interpreter/revenge-scholzomat",
    "snippet": "Upon returning to Berlin in 2018 to take up the position of Merkel’s Finance Minister and Vice Chancellor, Scholz became the second most powerful politician in the country. Olaf Scholz rose to prominence in the SPD’s powerful youth wing, the Jusos, as an aggressive critic of the North Atlantic Treaty Organisation (NATO/Flickr)",
    "published": null
  }
]