[
  {
    "title": "Enzo Maresca - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Enzo_Maresca",
    "snippet": "Enzo Maresca (born 10 February 1980) is an Italian professional football manager and former player. He is the head coach of Premier League club Chelsea. After starting out at <strong>West Bromwich Albion</strong> in 1998, he went on to play for several clubs in his country, including Juventus, who loaned him ...",
    "published": "2 days ago"
  },
  {
    "title": "Enzo Maresca Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/32374/Enzo-Maresca/overview",
    "snippet": "Premier League Fixtures Fantasy ... Miguel Almirón Marcus Rashford ... Enzo Maresca was appointed Chelsea head coach on 3 June 2024, replacing <strong>Mauricio Pochettino</strong>....",
    "published": null
  },
  {
    "title": "Maresca plays dangerous game as confusion reigns after his Chelsea grenade | Chelsea | The Guardian",
    "url": "https://www.theguardian.com/football/2025/dec/19/enzo-maresca-chelsea-newcastle-manchester-city-premier-league",
    "snippet": "Chelsea remain bemused by their head coach creating speculation that he has issues with the club’s hierarchy by saying that the 48 hours before the Everton game had been his worst since joining the club. Sources say the outburst even caught people close to Maresca by surprise. Confusion reigns. It does not help that Maresca has publicly and privately rejected repeated opportunities to explain the source of his discontent, leaving it open for outsiders to assume that the Italian’s issues are with Chelsea’s hierarchy.",
    "published": "4 days ago"
  },
  {
    "title": "Enzo Maresca - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/enzo-maresca/profil/trainer/53749",
    "snippet": "This is the profile site of the manager Enzo Maresca. The site lists all clubs he coached and all clubs he played for.",
    "published": null
  },
  {
    "title": "Chelsea's Enzo Maresca knocks back Man City job rumours - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/47355796/chelsea-enzo-maresca-knocks-back-man-city-job-rumours",
    "snippet": "Maresca served as Under-23 coach and later as an assistant to his former mentor at the Etihad before leaving to join Leicester in 2023. Enzo Maresca has rejected Manchester City links. Photo by Darren Walsh/Chelsea FC via Getty Images",
    "published": "4 days ago"
  }
]