[
  {
    "title": "IMU Executive Committee | International Mathematical Union Leadership 2023-2026",
    "url": "https://www.mathunion.org/organization/imu-executive-committee",
    "snippet": "The International Mathematical Union is administered by an Executive Committee (EC) which, in accordance with the IMU Statutes and subject to the direction and review of the members, <strong>conducts the business of the Union</strong>.",
    "published": null
  },
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The Chinese Mathematical Society in Beijing has three votes, and the Mathematical Society of the Republic of China, located in Tapei, has two votes. ... The International Mathematical Union is administered by an executive committee (EC) which <strong>conducts the business of the Union</strong>.",
    "published": "February 24, 2025"
  },
  {
    "title": "ICMI Executive Committee | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/icmi/organization/icmi-executive-committee",
    "snippet": "The Executive Committee (EC) of ICMI consists of the following members. Elected by the ICMI General Assembly: Nine members, including the four officers, namely, the President, the two Vice-Presidents, and the Secretary-General. The President shall serve for one, non-renewable, term. Ex-officio members: The immediate Past President of ICMI, the President and the Secretary of IMU...",
    "published": null
  },
  {
    "title": "IMU Commissions and Committees | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/activities/imu-commissions-and-committees",
    "snippet": "In addition to the IMU Executive Committee which <strong>administers the International Mathematical Union in general</strong>, various Committees and Commissions address specific issues on the IMU agenda. In general, Commissions are established by the IMU members and are supposed to have a long lifetime, see ...",
    "published": null
  },
  {
    "title": "IMU Leadership 2011-2014 | International Mathematical Union Executive Committee",
    "url": "https://www.mathunion.org/organization/imu-representatives/imu-leadership-2011-2014",
    "snippet": "Explore the IMU leadership and executive committee members from 2011 to 2014, including presidents, vice presidents, and commission members.",
    "published": null
  }
]