[
  {
    "title": "Versant Capital Management, Inc. BizSpotlight - Dallas Business Journal",
    "url": "https://www.bizjournals.com/dallas/press-release/detail/8796/Versant-Capital-Management-Inc",
    "snippet": "Versant was launched in Phoenix in 2004 by Thomas J. Connelly, CFA, CFP, who has successfully transitioned his majority ownership to longtime business partner <strong>Elizabeth Shabaker, CFP, CDC, and Royce Ramey, CFA</strong>, who together will serve as the ...",
    "published": null
  },
  {
    "title": "Versant Capital Management Announces Ownership Transition",
    "url": "https://finance.yahoo.com/news/versant-capital-management-announces-ownership-170000143.html",
    "snippet": "Connelly expressed his excitement about the July 1, 2023, transition, stating, &quot;One of the greatest joys of my life has been to help families manage their investment portfolios, preserving and growing their financial nest eggs and legacies through market cycles. I will continue to fill that role as CIO and part of the Executive Leadership Team.&quot; With over 13 years of executive leadership at Versant, Shabaker -- recognized as one of the country&#x27;s accomplished wealth management practitioners -- has played a crucial role in the firm&#x27;s growth and practice management.",
    "published": "July 26, 2023"
  },
  {
    "title": "Versant Ventures - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Versant_Ventures",
    "snippet": "In 1999 at the end of the Dot-com bubble, several partners from Brentwood Associates joined with partners from Institutional Venture Partners and Crosspoint Ventures to create two separate industry-focused firms, Redpoint Ventures which focused on technology and Palladium Venture Capital which focused on healthcare. Palladium Venture Capital was later renamed to Versant Ventures.",
    "published": "March 16, 2024"
  },
  {
    "title": "Versant Corporation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Versant_Corporation",
    "snippet": "In early 1990 the company was renamed “Versant Object Technology.” In April 1993 <strong>David Banks</strong> took over as CEO. On July 18, 1996 Versant had their initial public offering (IPO) on the NASDAQ stock exchange and traded under the symbol VSNT.",
    "published": "2 weeks ago"
  },
  {
    "title": "Comcast Sets Board of Directors for Versant Spin-Off Company",
    "url": "https://variety.com/2025/tv/news/versant-board-of-directors-comcast-spinoff-company-1236468998/",
    "snippet": "Comcast CEO <strong>Brian Roberts</strong> will own one-third of the voting interests in Versant (as he does in Comcast); however, Roberts will not serve on Versant board or management team. The Versant brands will reach over 65 million U.S.",
    "published": "July 24, 2025"
  }
]