[
  {
    "title": "Fiat Chrysler Automobiles - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_Chrysler_Automobiles",
    "snippet": "The corporation was established ... Toyota, General Motors, Volkswagen, Hyundai, Ford and Nissan). <strong>Its corporate headquarters were domiciled in Amsterdam and its financial headquarters were in London</strong>....",
    "published": "2 weeks ago"
  },
  {
    "title": "Where is Fiat Chrysler Automobiles Located? HQ, Global Offices & Company Insights",
    "url": "https://www.highperformr.ai/company/fca-group",
    "snippet": "Fiat Chrysler Automobiles established in 2014 and headquartered in <strong>Auburn Hills</strong>., Learn more about Fiat Chrysler Automobiles offices, leadership team, mission, and growth journey.",
    "published": null
  },
  {
    "title": "Chrysler World Headquarters and Technology Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chrysler_World_Headquarters_and_Technology_Center",
    "snippet": "Completed between 1993 and 1996 ... for DaimlerChrysler, Fiat Chrysler Automobiles (FCA) and now Stellantis North America. Before moving to the <strong>Auburn Hills</strong> headquarters, Chrysler was based at the Highland Park Chrysler Plant campus, which predated the formation of the company ...",
    "published": "1 week ago"
  },
  {
    "title": "FCA US 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10358-38",
    "snippet": "To view FCA US’s complete exits history, request access » ... FCA US was founded in 1925. FCA US is headquartered in <strong>Auburn Hills, MI</strong>.",
    "published": null
  },
  {
    "title": "FCA US LLC Company Profile - Overview - GlobalData",
    "url": "https://www.globaldata.com/company-profile/fca-us-llc/",
    "snippet": "In addition to this, the company ... Islands. The company is a subsidiary of Fiat Chrysler Automobiles NV. FCA US is headquartered in <strong>Auburn Hills, Michigan, the US</strong>....",
    "published": null
  }
]