[
  {
    "title": "Christine Lagarde - European Central Bank",
    "url": "https://www.forbes.com/profile/christine-lagarde/",
    "snippet": "Marital Status · Single · Children · 2 · Education · Master of Arts, Institut d&#x27;etudes politiques d&#x27;Aix-en-Provence · Did you know · In her teenage years, Lagarde was a swimmer and a member of the French synchronised swimming team. Lagarde was the first woman to serve as chairman at one of the world&#x27;s largest law firms, Baker &amp;amp; McKenzie.&lt;br&gt; Related People &amp; Companies · France · Citizen of FranceView Profile · Dec 10, 2025 ·",
    "published": null
  },
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "In December 2016, a French court convicted her of negligence relating to her role in the Bernard Tapie arbitration, but did not impose a penalty. Lagarde resigned from the IMF following her nomination as president of the ECB. In 2019, 2020, 2022, 2023, 2024, and 2025, Forbes ranked her number two on its World&#x27;s 100 Most Powerful Women list. Christine ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Christine Lagarde",
    "url": "https://www.theceo.in/women/christine-lagarde",
    "snippet": "Lagarde has been involved in three significant long-term relationships, with varying marital outcomes. Her first confirmed marriage was to French financial analyst Wilfried Lagarde in 1982, which ultimately ended in divorce in 1992.",
    "published": "October 31, 2023"
  },
  {
    "title": "Christine Lagarde Biography for Kids",
    "url": "https://www.lottie.com/blogs/strong-women/christine-lagarde",
    "snippet": "She was married to Wilfried Lagarde from 1982 to1992 and bore two kids Thomas and Pierre-Henri, and then <strong>divorced later married to Eachran Gilmour and divorced</strong>. Christine was appointed the first female to head the Ministry of Finance, Economy ...",
    "published": null
  },
  {
    "title": "Christine Lagarde Age, Net worth: Weight, Bio-Wiki, Wife, Kids 2024| The Personage",
    "url": "https://thepersonage.com/christine-lagarde/",
    "snippet": "Do you know is Christine Madeleine Odette Lagarde married or single or dating someone? If you a gossip lover then you will enjoy this part here we have talked about the personal life of Christine Madeleine Odette Lagarde. In the table you will get the information about the affair, marital status, hobbies and others.",
    "published": "March 8, 2024"
  }
]