[
  {
    "title": "Mike Downey • Producer and chairman of the European Film Academy - Cineuropa",
    "url": "https://cineuropa.org/en/interview/440528/",
    "snippet": "Mike Downey OBE is a producer and the <strong>chairman of the European Film Academy</strong>, as well as being one of the founding board members of the International Coalition for Filmmakers at Risk (ICFR).",
    "published": null
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) - IMDb",
    "url": "https://www.imdb.com/news/ni65127703/",
    "snippet": "Producer Mike Downey, who is <strong>chair of the European Film Academy</strong> and whose co-production “Girls on Wire” is in Berlin competition, has unveiled a diverse slate of films from his production company Downey Ink at the European Film Market.",
    "published": null
  },
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "<strong>In 2019 Mike took over the chairmanship</strong> and he was joined by Agnieszka Holland as President 2020 taking over from Wim Wenders. ... The European Film Awards have been presented annually since 1988 by the European Film Academy to recognize excellence ...",
    "published": null
  },
  {
    "title": "Mike Downey (producer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mike_Downey_(producer)",
    "snippet": "He is the co-founder and CEO of Film and Music Entertainment and <strong>as of 2020 the Chairman of the European Film Academy</strong>. Downey was born in Devon, England, the son of Brigid Downey (née Flood) and Thomas Downey, who were economic migrants ...",
    "published": "July 19, 2025"
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/mike-downey-downey-ink-berlin-slate-1236306279/",
    "snippet": "Producer Mike Downey, who is <strong>chair of the European Film Academy</strong> and whose co-production “Girls on Wire” is in Berlin competition, has unveiled a diverse slate of films from his production company Downey Ink at the European Film Market.",
    "published": "February 16, 2025"
  }
]