[
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Jesse Ventura was the Governor of Minnesota. Ventura assumed office on January 8, 1999. Ventura left office on January 6, 2003. Ventura (<strong>Green Party of Alaska, Unaffiliated</strong>) ran for election for President of the United States.",
    "published": null
  },
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Jesse Ventura (born James George ... (WWF, now WWE), he served as the 38th governor of Minnesota from 1999 to 2003. He was elected governor with the <strong>Reform Party</strong> and is the party&#x27;s only candidate to win a major government office....",
    "published": "2 days ago"
  },
  {
    "title": "Green Party Nominee Other: Jesse Ventura is a former ...",
    "url": "https://www.elections.alaska.gov/election/2020/General/Janos-McKinney_Pres-VP_WEB.pdf",
    "snippet": "James G. “Jesse Ventura” Janos – United States President – Green ... The views expressed in this statement are from the candidate and not endorsed by the Division of Elections. The text of this statement was provided and paid for by the candidate in accordance with AS 15.58.030 and 6 AAC 25.690. Cynthia McKinney – United States Vice President – Green Party",
    "published": null
  },
  {
    "title": "Jesse Ventura says he’s ‘testing the waters’ for Green Party bid for president",
    "url": "https://thehill.com/homenews/campaign/494875-jesse-ventura-says-hes-testing-the-waters-for-green-party-bid-for-president/",
    "snippet": "Jesse Ventura, who served as Minnesota governor as a member of the Reform Party, said Monday that <strong>he is “testing the waters” for a potential 2020 run for president on the Green Party ticket</strong>.",
    "published": "April 27, 2020"
  },
  {
    "title": "Jesse Ventura Joins the Minnesota Green Party - Green Party of Minnesota",
    "url": "https://www.mngreens.org/jesse_ventura_joins_the_minnesota_green_party",
    "snippet": "We are honored to announce that ... 1991 to 1995 and as the 38th Governor of Minnesota from 1999 to 2003 <strong>has officially joined the Minnesota Green Party</strong>......",
    "published": null
  }
]