[
  {
    "title": "Issa Hayatou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Issa_Hayatou",
    "snippet": "Issa Hayatou (9 August 1946 – 8 August 2024) was a Cameroonian sports executive, athlete, and football administrator best known for serving as the president of the Confederation of African Football (CAF) between 1988 and 2017. He <strong>served as the acting FIFA president until 26 February 2016</strong> as the ...",
    "published": "October 20, 2025"
  },
  {
    "title": "Who We Are - News - Information regarding Acting FIFA President Issa Hayatou - FIFA.com",
    "url": "https://www.fifa.com/about-fifa/who-we-are/news/information-regarding-acting-fifa-president-issa-hayatou-2732634",
    "snippet": "Issa Hayatou has never hidden the fact that, for several years now, he has been suffering from a renal insufficiency, a situation that has not, however, prevented him from fully performing his duties at the heart of world and African football’s governing bodies, without interruption. He will continue to fulfil his role as Acting FIFA President as intended.",
    "published": null
  },
  {
    "title": "Stella Dimoko Korkus.com: Issa Hayatou Named FIFA Acting President",
    "url": "https://www.stelladimokokorkus.com/2015/10/issa-hayatou-named-fifa-acting-president.html",
    "snippet": "Issa Hayatou on Thursday took temporary ... suspension, the world body said. <strong>Hayatou, 69, is president of the Confederation of African Football, and takes over as senior vice president of FIFA</strong>....",
    "published": null
  },
  {
    "title": "Former FIFA interim president and long-time leader of African soccer Issa Hayatou dies at 77 | AP News",
    "url": "https://apnews.com/article/issa-hayatou-fifa-ioc-olympic-ab10305e84624493a8e612602a868541",
    "snippet": "PARIS (AP) — Issa Hayatou, the long-time leader of African soccer who was made interim president of FIFA during its corruption crisis in 2015, <strong>died on Thursday</strong>.",
    "published": "August 9, 2024"
  },
  {
    "title": "Issa Hayatou to be acting Fifa president following suspension of Sepp Blatter | Sepp Blatter | The Guardian",
    "url": "https://www.theguardian.com/football/2015/oct/08/iss-hayatou-acting-president-fifa-sepp-blatter-suspended",
    "snippet": "The world governing body said in a statement: “Issa Hayatou, as the longest-serving vice-president on Fifa’s executive committee, will serve as acting president of Fifa.”",
    "published": "November 27, 2017"
  }
]