[
  {
    "title": "Igor Tudor - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Igor_Tudor",
    "snippet": "<strong>On 23 March 2025, Tudor replaced Thiago Motta as head coach of Serie A club Juventus</strong>. This appointment marked the first time Juventus had appointed a foreign manager since Didier Deschamps in the 2006–07 season. He eventually guided the club to the fourth place of league table and Champions ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Back in Bianconero | All you need to know about new Juventus coach Igor Tudor - Juventus",
    "url": "https://www.juventus.com/en/news/articles/back-in-bianconero-all-you-need-to-know-about-new-juventus-coach-igor-tudor",
    "snippet": "<strong>After hanging up his boots and starting his coaching career, he returned to Turin in 2020/21 to work with Andrea Pirlo</strong>, offering his experience to the team and helping to win the Italian Cup and Italian Super Cup.",
    "published": null
  },
  {
    "title": "Igor Tudor to remain as Juventus head coach for 2025-26 season - The Athletic",
    "url": "https://www.nytimes.com/athletic/6415592/2025/06/10/igor-tudor-juventus-next-season/",
    "snippet": "He <strong>began his coaching career with Hajduk Split in his native Croatia in 2013 and had spells with PAOK, Karabukspor, Galatasaray and Udinese (twice) before returning to Hajduk in 2020.</strong>",
    "published": "June 19, 2025"
  },
  {
    "title": "Igor Tudor Stats - Juventus Manager | FootyStats",
    "url": "https://footystats.org/managers/croatia/igor-tudor",
    "snippet": "Igor Tudor is a 47 year-old manager from Croatia who is currently in charge of Juventus. Igor Tudor has a <strong>win percentage of 46.74% across their coaching career thus far</strong>.",
    "published": null
  },
  {
    "title": "Igor Tudor Juventus: Player, Coach, and Now Manager - Italian Football",
    "url": "https://www.italian-football.org/igor-tudor-juventus/",
    "snippet": "Igor Tudor was appointed Juventus manager in March 2025 after the sacking of Thiago Motta. Tudor <strong>previously served Juventus both as a player (1998-2007) and as an assistant coach under Andrea Pirlo (2020-2021).</strong>",
    "published": "June 4, 2025"
  }
]