[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "Mélenchon has been labelled a populist by numerous diverse people, with the <strong>Socialist Party</strong> senator Luc Carvounas saying he goes to &quot;the summits of demagoguery and populism&quot;, and the magazine Slate stating that Mélenchon&#x27;s rhetoric is &quot;shocking&quot; and implying his entire political life is based ...",
    "published": "2 days ago"
  },
  {
    "title": "Jean-Luc Mélenchon - World news, culture and opinion",
    "url": "https://www.lemonde.fr/en/jean-luc-melenchon/",
    "snippet": "The <strong>Parti Socialiste</strong>, which has broken free of radical-left leader Jean-Luc Mélenchon, is not done with its battles. It will, by 2027, need to win back moderate voters who have shunned it for the past seven years, at a time when PM François ...",
    "published": null
  },
  {
    "title": "The Crisis Engulfing the French Left | The Nation",
    "url": "https://www.thenation.com/article/world/french-left-split-new-popular-front-melonchon-socialists/",
    "snippet": "Indeed, to truly understand the tensions roiling the New Popular Front, one must also consider the dynamics within <strong>La France Insoumise</strong>. According to several current and former LFI MPs, as well as former parliamentary aides from LFI, Jean-Luc ...",
    "published": "March 7, 2025"
  },
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "Beginning in late 2018, Mélenchon and the leadership of <strong>La France Insoumise</strong> made a significant shift by abandoning their sovereigntist and ultra-secularist stances. This decision led to the expulsion of key members, marking a clear change in ...",
    "published": "2 days ago"
  },
  {
    "title": "Jean-Luc Mélenchon – POLITICO",
    "url": "https://www.politico.eu/person/jean-luc-melenchon/",
    "snippet": "... Responses to the 96-year-old’s death have become something of a political Rorschach test in France. ... <strong>The Socialists</strong> have taken timid steps toward emancipation from far-left firebrand Jean-Luc Mélenchon.",
    "published": null
  }
]