[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "On January 15, 1991, Milchan and ... to be distributed by <strong>Warner Bros. Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan</strong> Enterprises) and two new ...",
    "published": "4 days ago"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "<strong>Yariv Milchan</strong> (PRODUCER) is the Chairman and CEO of the Academy Award®-winning New Regency Productions where he oversees the day-to-day management, creative direction, and overall growth strategy of the company.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Its films were distributed by Warner Bros. until 1998, and by 20th Century Fox (later under their current parent company <strong>The Walt Disney Studios</strong>) from 1999 onward (with some released by Columbia Pictures, Paramount Pictures, Focus Features, ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Regency Enterprises Services, LLC | LinkedIn",
    "url": "https://www.linkedin.com/company/regency-enterprises-services-llc",
    "snippet": "Louis, Regency was named one of the Top 25 Minority Owned Companies by St. Louis Business Journal and the owner, <strong>Charles Brown</strong>, was named one of the Top 100 People To Know In St. Louis by St.",
    "published": null
  },
  {
    "title": "Regency Enterprises (Creator) - TV Tropes",
    "url": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/RegencyEnterprises",
    "snippet": "Regency Enterprises&#x27; current logo, with a theme you might be familiar with.Regency Enterprises (commonly referred to as Regency onscreen) is an American entertainment company formed by <strong>Arnon Milchan</strong>.",
    "published": "October 2, 2025"
  }
]