[
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "In the early days of Putin’s reign, it seemed that opposition groups might hold some sway in the State Duma, but the unification of pro-Putin parties under the banner of <strong>United Russia</strong> in 2001 would stifle much dissent.",
    "published": "March 7, 2023"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "<strong>Russia of the Future</strong> (Russian: ... (Партия Прогресса, Partiya Progressa), is a banned opposition political party in Russia founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018 by Alexei Navalny, who was also the founder of the non-profit ...",
    "published": "1 month ago"
  },
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Alexei Anatolyevich Navalny (Russian: Алексей Анатольевич Навальный, IPA: [ɐlʲɪkˈsʲej ɐnɐˈtolʲjɪvʲɪtɕ nɐˈvalʲnɨj]; 4 June 1976 – 16 February 2024) was a Russian opposition leader, anti-corruption activist and political prisoner.",
    "published": "1 week ago"
  },
  {
    "title": "Russia Labels Navalny’s Anti-Corruption Group as Terrorist Organization - The New York Times",
    "url": "https://www.nytimes.com/2025/11/27/world/europe/russia-navalny-terrorist.html",
    "snippet": "Russia’s Supreme Court on Thursday designated the anti-corruption organization founded by Aleksei A. Navalny as a terrorist group, ratcheting up a legal onslaught against the opposition leader’s movement that has continued even after his death last year in an Arctic penal colony.",
    "published": "4 weeks ago"
  },
  {
    "title": "5 things to know about Russian opposition leader Alexei Navalny – POLITICO",
    "url": "https://www.politico.eu/article/5-things-you-need-to-know-about-alexei-navalny/",
    "snippet": "In 2018, he became the leader of opposition party <strong>Russia of the Future</strong>, but was barred from running for president against Putin that year because of his criminal record. He’s lately been campaigning for politicians running in Russia’s upcoming ...",
    "published": "August 21, 2020"
  }
]