[
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "Lagarde <strong>resigned from the IMF following her nomination as president of the ECB</strong>. In 2019, 2020, 2022, 2023, 2024, and 2025, Forbes ranked her number two on its World&#x27;s 100 Most Powerful Women list. Christine Lagarde was born in Paris, France, into a family of teachers.",
    "published": "6 days ago"
  },
  {
    "title": "'Europe's existential crisis': ECB's Lagarde calls for urgent reforms | Euronews",
    "url": "https://www.euronews.com/business/2025/12/10/europes-existential-crisis-ecbs-lagarde-calls-for-urgent-reforms",
    "snippet": "European Central Bank President Christine Lagarde speaks during the press conference following the Governing Council meeting in Florence, Italy. 30 Oct. 2025. - LaPresse ... European Central Bank (ECB) President Christine Lagarde has issued a stark warning over the European Union’s competitiveness, calling on the European Commission to urgently dismantle internal barriers that are stifling innovation, productivity, and investment across the bloc.",
    "published": "1 week ago"
  },
  {
    "title": "Christine Lagarde",
    "url": "https://www.ecb.europa.eu/ecb/decisions/html/cvlagarde.en.html",
    "snippet": "<strong>President of the European Central Bank</strong> Chair of the European Systemic Risk Board Member of the Board of Directors at the Bank for International Settlements Member of the G7 Member of the G20",
    "published": "November 22, 2023"
  },
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "The president of the European Central ... policy in the eurozone of the European Union (EU). <strong>The current president of the European Central Bank is Christine Lagarde</strong>, ......",
    "published": "September 25, 2025"
  },
  {
    "title": "ECB may lift growth outlook again, Lagarde says | Reuters",
    "url": "https://www.reuters.com/business/ecb-may-upgrade-growth-projections-again-december-lagarde-says-2025-12-10/",
    "snippet": "European Central Bank President Christine Lagarde delivers her keynote speech at Euro Finance Week, a weeklong annual financial conference in Frankfurt, Germany, <strong>November 21, 2025</strong>.",
    "published": "4 days ago"
  }
]