[
  {
    "title": "Alexander Van der Bellen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_Van_der_Bellen",
    "snippet": "Despite the far-right Freedom Party winning a plurality, Van der Bellen asked caretaker Chancellor Karl Nehammer of the People&#x27;s Party to form the next government instead, citing other parties&#x27; refusals to join a coalition with the Freedom Party. After the Nehammer-led coalition talks collapsed, however, Van der Bellen reversed course and asked Herbert Kickl to attempt to form a coalition government with the People&#x27;s Party on 5 January 2025.",
    "published": "5 days ago"
  },
  {
    "title": "Alexander Van der Bellen: News der FAZ zum Politiker",
    "url": "https://www.faz.net/aktuell/politik/thema/alexander-van-der-bellen",
    "snippet": "12.02.2025 17:08 Uhr · Alexander Van der Bellen: Der österreichische Bundespräsident Alexander Van der Bellen hat bereits einige Regierungskrisen hinter sich. <strong>Nun soll er den ersten Kanzler der FPÖ ernennen</strong>. Stephan Löwenstein, Wien · 11.01.2025 13:56 Uhr ·",
    "published": null
  },
  {
    "title": "Alexander Van der Bellen: News und Infos | DIE ZEIT",
    "url": "https://www.zeit.de/thema/alexander-van-der-bellen",
    "snippet": "Zugriff auf die mp3-Datei zum Download ... Koalitionsverhandlungen, FPÖ und ÖVP streiten über die Verteilung der Ressorts. Präsident <strong>Van der Bellen</strong> will mit den Parteichefs sprechen....",
    "published": "October 10, 2022"
  },
  {
    "title": "Alexander Van der Bellen - DER SPIEGEL",
    "url": "https://www.spiegel.de/thema/alexander_van_der_bellen/",
    "snippet": "Amtsinhaber <strong>Alexander Van der Bellen hat gute Chancen, als Bundespräsident direkt wiedergewählt zu werden</strong>.",
    "published": "June 17, 2025"
  },
  {
    "title": "Alexander Van der Bellen - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q78869",
    "snippet": "Obwohl es den Staat nicht mehr gibt, bleiben die Van der Bellens estnische Staatsbürger. (German) · Brigitte Van der Bellen etwa, seit 46 Jahren mit Alexander Van der Bellen verheiratet, war am gestrigen Sonntag nicht dabei, als ihr Mann seine Stimme abgab.",
    "published": null
  }
]