[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "On 5 July 2015, Kasyanov was elected as the only leader of RPR-PARNAS, and the party was renamed to just PARNAS. He added he would like to eventually re-establish the institution of co-chairmanship, adding, &quot;Neither Alexei Navalny nor Mikhail Khodorkovsky will enter our party today and be elected as co-chairmen.",
    "published": "2 days ago"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "The <strong>People&#x27;s Alliance party</strong> was founded on 15 December 2012 at the party&#x27;s founding congress. Initially, Russian opposition figure Alexei Navalny declined to join the political party which was formed mostly by his followers.",
    "published": "September 30, 2025"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. In 2000, while he was still a student, Navalny joined <strong>Yabloko</strong>, ...",
    "published": "March 7, 2023"
  },
  {
    "title": "Alexei Navalny, Russia",
    "url": "https://www.europarl.europa.eu/cmsdata/240201/Profile of the 2021 Sakharov Prize nominee, Alexei Navalny.pdf",
    "snippet": "Alexei Navalny is a Russian opposition leader, lawyer and anti-corruption activist, who has · become known for organising anti-government demonstrations and establishing himself as the · strongest opposition candidate to the ruling party in Russia. Navalny was a member of the ·",
    "published": null
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "This alignment with the nationalist movement garnered a certain level of scrutiny, forcing him and the <strong>Yabloko party</strong> to declare that, “Yabloko condemned any ethnic or racial hatred and any xenophobia” and called on the police to oppose “any ...",
    "published": null
  }
]