[
  {
    "title": "Google AI manager resigns following controversial firings of two top researchers | The Verge",
    "url": "https://www.theverge.com/2021/4/6/22370372/google-research-manager-resigns-timnit-gebru-margaret-mitchell-firing",
    "snippet": "After Gebru’s departure, Google reorganized its research department, slotting the ethical AI team under Marian Croak, a leader in the engineering department. The move cut Bengio’s responsibilities, according to Bloomberg.",
    "published": "April 6, 2021"
  },
  {
    "title": "r/MachineLearning on Reddit: [D] Samy Bengio resigns from Google",
    "url": "https://www.reddit.com/r/MachineLearning/comments/mloj16/d_samy_bengio_resigns_from_google/",
    "snippet": "358 votes, 142 comments. Source: Bloomberg ( archive.fo link ) (N.B. Samy ≠ Yoshua Bengio, they are brothers). He co-founded Google Brain, and…",
    "published": "April 7, 2021"
  },
  {
    "title": "Prominent Google Brain manager Samy Bengio has quit the company months after 2 fellow AI researchers were fired",
    "url": "https://www.businessinsider.com/google-brain-cofounder-quits-following-internal-disputes-2021-4",
    "snippet": "Shortly after news broke of Bengio&#x27;s departure, Mitchell tweeted: &quot;Resignations coming now bc people started interviewing soon after we were fired.",
    "published": "April 7, 2021"
  },
  {
    "title": "Google's Samy Bengio is leaving amid fallout from AI researcher firing",
    "url": "https://www.cnbc.com/2021/04/06/googles-samy-bengio-is-leaving-amid-fallout-from-ai-researcher-firing.html",
    "snippet": "At least a few employees have resigned, citing the company&#x27;s handling of Gebru&#x27;s research and departure. Though Bengio didn&#x27;t mention Gebru specifically in his departure email Tuesday, he gave kudos to his team for improving their &quot;understanding of machine learning and its impact on the world.&quot;",
    "published": "April 6, 2021"
  },
  {
    "title": "Samy Bengio - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Samy_Bengio",
    "snippet": "Bengio is senior director of Artificial Intelligence and Machine Learning Research at Apple and an adjunct professor at École Polytechnique Fédérale de Lausanne. He was a <strong>longtime scientist at Google</strong>, where he led a large group of researchers ...",
    "published": "November 14, 2025"
  }
]