[
  {
    "title": "NIST Organization Structure | NIST",
    "url": "https://www.nist.gov/director/nist-organization-structure",
    "snippet": "Director &amp; Under Secretary of Commerce for Standards and Technology",
    "published": "September 22, 2025"
  },
  {
    "title": "Office of the Director | NIST",
    "url": "https://www.nist.gov/director",
    "snippet": "Communications Engineering recognizes Veruska Malavé of the NIST Material Measurement Laboratory as the September 2025 Reviewer of the Month · Principal Investigators: Lilliam Ambroggio, PhD (CU Anschutz) and Jun Ye, PhD (CU Boulder) Using quantum sensing and advanced laser · Request a meeting with NIST leadership or an appearance at an event.",
    "published": "March 16, 2009"
  },
  {
    "title": "National Institute of Standards and Technology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/National_Institute_of_Standards_and_Technology",
    "snippet": "Due to a changing mission, the &quot;National Bureau of Standards&quot; became the &quot;National Institute of Standards and Technology&quot; in 1988. Following the September 11, 2001 attacks, under the National Construction Safety Team Act (NCST), NIST conducted the official investigation into the collapse of the World Trade Center buildings.",
    "published": "1 month ago"
  },
  {
    "title": "NIST Senior Leadership | NIST",
    "url": "https://www.nist.gov/director/leadership",
    "snippet": "Dr. Boehm is NIST&#x27;s Chief of Staff where he provides strategic guidance and advice to the NIST Director and senior leadership to help the Institute accomplish its mission by maximizing budgetary resources, expanding partnerships and improving operations.",
    "published": "June 2, 2025"
  },
  {
    "title": "NIST Special Publication 955 Suppl. Responding to National Needs:",
    "url": "https://www.nist.gov/system/files/documents/nvl/SP955_Suppl.pdf",
    "snippet": "gram manager for FACNET and shall provide for overall direction of policy and leadership in the devel-",
    "published": null
  }
]