[
  {
    "title": "Leadership | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/about/leadership",
    "snippet": "Ileana Cruz-Marden, MPA *19 Director of Partnerships Tent Partnerships for Refugees Julieta Cuéllar, MPA *19 Director of Strategic Initiatives and Implementation Division of Family and Medical Leave Insurance, Maryland Department of Labor Robert Doar ‘83 President American Enterprise Institute Amber Greene, MPP *12 Chief Equity Officer &amp; Director of Civil Rights City of Baltimore Anna Grzymala-Busse ’92 Michelle and Kevin Douglas Professor of International Studies Stanford University Larry Handerhan, MPA *12 Former Biden-Harris Administration Official, Administration for Children and Fami",
    "published": null
  },
  {
    "title": "Princeton School of Public and International Affairs - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Princeton_School_of_Public_and_International_Affairs",
    "snippet": "De W.C. Poole Quits Diplomatic Service to Be Its Liaison Officer With World Affairs. The establishment of a school of public and international affairs at Princeton University was announced today by President <strong>John Grier Hibben</strong> in his annual message to the National Alumni Association.",
    "published": "October 26, 2025"
  },
  {
    "title": "Faculty | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/graduate-programs/phd-public-affairs/science-technology-and-environmental-policy-step/faculty",
    "snippet": "<strong>Wei Peng</strong>, Assistant Professor of Public and International Affairs and the Andlinger Center for Energy and the Environment ... Elke U. Weber, Gerhard R. Andlinger Professor in Energy and the Environment; Professor of Psychology and Public Affairs; Faculty Chair, Princeton School of Public and ...",
    "published": null
  },
  {
    "title": "Home | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/",
    "snippet": "For the Princeton School of Public and International Affairs, 2025 was a year that required meeting an extraordinary moment.Shortly after President…",
    "published": null
  },
  {
    "title": "Dean's Leadership Series | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/graduate-programs/beyond-classroom/deans-leadership-series",
    "snippet": "Fmr. Ukranian Minister of Foreign Affairs",
    "published": null
  }
]