[
  {
    "title": "Mark Aguiar | IDEAS/RePEc",
    "url": "https://ideas.repec.org/e/c/pag57.html",
    "snippet": "Sergi Barcons &amp; Eduardo D‡vila &amp; Andreas Schaab, 2025. &quot;Intergenerational Welfare Assessments,&quot; Cowles Foundation Discussion Papers 2427, Cowles Foundation for Research in Economics, Yale University. George‐Marios Angeletos &amp; Chen Lian &amp; Christian K. Wolf, 2024. &quot;Can Deficits Finance Themselves?,&quot; Econometrica, Econometric Society, vol. 92(5), pages 1351-1390, September. Mark A. Aguiar &amp; Manuel Amador &amp; Cristina Arellano, 2021.",
    "published": null
  },
  {
    "title": "Mark Aguiar - Mark Aguiar",
    "url": "https://www.markaguiar.com/CV/",
    "snippet": "Aguiar, Mark, Mark Bils, Kerwin Kofi Charles, and Erik Hurst (2021): “Leisure Luxuries and the Labor Supply of Young Men,” Journal of Political Economy.",
    "published": null
  },
  {
    "title": "Mark Aguiar | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is a consultant at the Federal Reserve Bank of Minneapolis and the Walker Professor of Economics and International Finance at Princeton University. Previously, he was a professor of economics at the University of Rochester and a senior economist at the Federal Reserve Bank of Boston.",
    "published": null
  },
  {
    "title": "Mark A. Aguiar",
    "url": "https://jrc.princeton.edu/people/mark-aguiar",
    "snippet": "Mark A. Aguiar is the Walker Professor of Economics and International Finance at Princeton University. His research focuses on models of consumption and savings with applications in both open- and closed-economy macroeconomics. Specific interests include life cycle consumption and savings, ...",
    "published": null
  },
  {
    "title": "Mark A. Aguiar - Princeton University",
    "url": "https://collaborate.princeton.edu/en/persons/mark-a-aguiar/",
    "snippet": "Dive into the research topics where Mark A. Aguiar is active. These topic labels come from the works of this person. Together they form a unique fingerprint. ... Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list · Select a country/territory to view shared publications and projects Close ... Aguiar, M., Mar 2025, In: IMF Economic Review.",
    "published": null
  }
]