[
  {
    "title": "List of Real Madrid CF managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Real_Madrid_CF_managers",
    "snippet": "Real Madrid Club de Fútbol is a professional football club based in Madrid, Spain, which plays in La Liga. This chronological list comprises all those who have held the position of manager of the first team of Real Madrid from 1910, when the first professional manager was appointed, to the ...",
    "published": "September 27, 2025"
  },
  {
    "title": "Real Madrid Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=2165&teamTabs=managers",
    "snippet": "From Allardyce to Zola, our massive manager database, with histories and win ratios, is sure to get your vote of confidence",
    "published": null
  },
  {
    "title": "List of Real Madrid C.F. managers - FamousFix List",
    "url": "https://www.famousfix.com/list/real-madrid-c-f-managers",
    "snippet": "Carlos Manuel Brito Leal Queiroz, (born 1 March 1953), is a Portuguese football manager. A former manager of Real Madrid, he has also been the manager of the Portuguese national team and Alex Ferguson&#x27;s assistant manager at English club Manchester United.",
    "published": null
  },
  {
    "title": "Real Madrid CF | Real Madrid CF Oficial Website",
    "url": "https://www.realmadrid.com/en-US/the-club/history/football/first-team/coaches",
    "snippet": "Official Real Madrid channel. All the Real Madrid information with news, players, ticket sales, member services and club information.",
    "published": null
  },
  {
    "title": "Real Madrid - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/real-madrid-cf/mitarbeiterhistorie/verein/418",
    "snippet": "Real Madrid UEFA U19 · The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along. Under &quot;Position&quot;, you can select a specific role from the drop-down menu.",
    "published": null
  }
]