[
  {
    "title": "German Research Foundation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/German_Research_Foundation",
    "snippet": "The German Research Foundation is a member of Science Europe. The Heisenberg Programme of the DFG is aimed at young outstanding scientists who meet all the requirements for appointment to a permanent professorship. The programme was named after the German physicist Werner Heisenberg, who received the Nobel Prize in Physics at the age of 31. The funding programme aims to enable scientists to prepare for a scientific leadership position and to work on further research topics during this time.",
    "published": "October 2, 2025"
  },
  {
    "title": "DFG - German Research Foundation",
    "url": "https://www.dfg.de/en",
    "snippet": "The political breakthrough achieved in the negotiations strengthens Europe as a research hub and opens up new pathways towards climate-resilient and resource-efficient agriculture, says DFG President <strong>Katja Becker</strong>.",
    "published": null
  },
  {
    "title": "German Research Foundation - Humboldt-Universität zu Berlin",
    "url": "https://www.hu-berlin.de/en/research-teaching/projects/research-projects/german-research-foundation",
    "snippet": "<strong>The DFG&#x27;s Heisenberg Programme is aimed at excellent researchers who meet all the formal requirements for appointment to a permanent professorship</strong>. It enables them to further develop their own research profile in a targeted manner and to prepare for an academic leadership position.",
    "published": null
  },
  {
    "title": "German Research Foundation // University of Oldenburg",
    "url": "https://uol.de/en/researchfunding/national-funding/german-research-foundation",
    "snippet": "All universities that are members of the German Research Foundation appoint a professor to act as a DFG Liaison Officer. The Liaison Officers are the local DFG contacts for researchers who are considering applying to the DFG for funding.",
    "published": null
  },
  {
    "title": "Germany, German Research Foundation (DFG) - International Science Council",
    "url": "https://council.science/member/germany-deutsche-forschungsgemeinschaft-dfg/",
    "snippet": "The DFG funds research projects, creates competitive opportunities and conducts procedures for the review, evaluation, selection and decision of research proposals. It helps shape the overall conditions and standards of academic research. The DFG maintains dialogue with society, politics and business and supports the transfer of knowledge.",
    "published": "August 13, 2024"
  }
]