[
  {
    "title": "Zentrum campus | ETH Zurich",
    "url": "https://ethz.ch/en/campus/access/zentrum.html",
    "snippet": "The historic main building (HG) is freely accessible to the public and is open to the curious from Monday to Friday from 6 am to 10 pm and at weekends from 8 am to 5 pm. Those interested can also take a virtual tour of the ETH halls. Tram no. 6 from &quot;Bahnhofstrasse/HB&quot; (direction Zoo) to stop &quot;ETH/Universitätsspital&quot;. Journey time: approx. 6 minutes · Tram no. 10 from &quot;Bahnhofplatz/HB&quot; (direction &quot;Flughafen&quot; or &quot;Bahnhof Oerlikon&quot;) to the stop &quot;ETH/Universitätsspital&quot;",
    "published": null
  },
  {
    "title": "Main Building of the ETH Swiss Federal Institute of Technology Zurich | zuerich.com",
    "url": "https://www.zuerich.com/en/visit/attractions/main-building-of-the-eth-swiss-federal-institute-of-technology-zurich",
    "snippet": "Special feature: the later dome by Gustav Gull is today the distinguishing feature of the ETH. ... If you walk from Zurich Main Station towards Central and the River Limmat, you may just be able to make out the main building of the ETH Zurich on the hillside.",
    "published": null
  },
  {
    "title": "Contact | ETH Zurich",
    "url": "https://ethz.ch/en/utils/contact.html",
    "snippet": "ETH Zurich · Main building <strong>Rämistrasse 101 8092 Zurich Switzerland</strong> Show more Show less · Campus Info · Phone +41 44 632 11 11 · Website Show more Show less · People directory · Locations and how to find them · Building opening hours ...",
    "published": null
  },
  {
    "title": "ETH Zurich - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ETH_Zurich",
    "snippet": "The main building stands directly across the street from the University Hospital of Zurich and, right alongside the main building of the University of Zurich. The Hönggerberg campus is a more classical university campus, consisting mainly of university buildings and student accommodation. ... There is also an ASVZ sports centre which is accessible to all students and faculty, and includes a gym, beach volleyball court, football field, and martial-arts rooms. In 2005, ETH Zurich&#x27;s 150th anniversary, an extensive project called &quot;Science City&quot; for the Hönggerberg Campus was started with the goal to transform the campus into an attractive district based on the principle of sustainability.",
    "published": "19 hours ago"
  },
  {
    "title": "Campus | ETH Zurich",
    "url": "https://ethz.ch/en/campus.html",
    "snippet": "The main site is completed by strategically selected &quot;external sites&quot; in the Canton of Zurich, in Switzerland and in Singapore. Do you have an appointment or event you’re attending at ETH Zurich? Are you looking for the precise location of the building or office where you need to be?",
    "published": null
  }
]