[
  {
    "title": "Igor Tudor sacked by Juventus after seven months in charge - The Athletic",
    "url": "https://www.nytimes.com/athletic/6733046/2025/10/27/igor-tudor-juventus-sacked/",
    "snippet": "Igor Tudor has been dismissed as Juventus head coach after <strong>24 games in charge</strong>.",
    "published": "October 27, 2025"
  },
  {
    "title": "Igor Tudor - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Igor_Tudor",
    "snippet": "Tudor announced his retirement on <strong>22 July 2008</strong> at age 30, after problems with his right ankle reappeared. He spent his final season playing for his youth club, Hajduk Split. As manager, Tudor took charge of Hajduk from 2013 to 2015, and spent eight months with PAOK in the 2015–16 season.",
    "published": "October 30, 2025"
  },
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "Juventus Football Club announces that it has today relieved Igor Tudor of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": null
  },
  {
    "title": "Juventus sack manager Igor Tudor after miserable eight-game winless run | Juventus | The Guardian",
    "url": "https://www.theguardian.com/football/2025/oct/27/juventus-sack-manager-igor-tudor-winless-run-serie-a",
    "snippet": "Juventus have sacked their head coach, Igor Tudor, after failing to win their last eight matches in all competitions, the Serie A club said on Monday. “Juventus FC announces that it has today relieved Igor Tudor of his duties as coach of the men’s first team, along with his staff,” the Italian club said in a statement, a day after their 1-0 defeat to Lazio.",
    "published": "October 27, 2025"
  },
  {
    "title": "Juventus Sack Igor Tudor as Head Coach",
    "url": "https://sportscafe.in/football/articles/2025/oct/28/juventus-sack-igor-tudor-as-head-coach",
    "snippet": "As the managerial situation at Juventus takes another turn, the club has officially announced the departure of Igor Tudor as head coach of the men’s first team. The decision, made on <strong>27 October 2025</strong>, also includes the dismissal of Tudor’s ...",
    "published": "October 28, 2025"
  }
]