[
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "From 13 to 16 May 2025, Donald Trump undertook his first major international trip of his second term, visiting Saudi Arabia, Qatar, and the United Arab Emirates. Trump and Mohammed signed a &quot;strategic economic partnership&quot; agreement. The visit elevated Mohammed&#x27;s standing within the Saudi government as King Salman, who did not appear during the Saudi visit, has largely receded from public view.",
    "published": "1 day ago"
  },
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "9, 2025 •History Table of Contents · Table of Contents Quick Summary Ask the Chatbot a Question ... Mohammed bin Salman has served as crown prince (2017– ), <strong>prime minister</strong> (2022– ), and previously as minister of defense (2015–22).",
    "published": "July 17, 2019"
  },
  {
    "title": "Crown Prince and Prime Minister of Saudi Arabia Mohammed bin Salman Meets with Wang Yi_Ministry of Foreign Affairs of the People's Republic of China",
    "url": "https://www.fmprc.gov.cn/mfa_eng/wjbzhd/202512/t20251216_11773559.html",
    "snippet": "On December 14, 2025 local time, <strong>Crown Prince and Prime Minister of Saudi Arabia</strong> Mohammed bin Salman met with Member of the Political Bureau of the CPC Central Committee and Foreign Minister Wang Yi in Riyadh.",
    "published": "1 week ago"
  },
  {
    "title": "Opinion | Saudi Arabia got the better end of the deal in MBS visit with Trump - The Washington Post",
    "url": "https://www.washingtonpost.com/opinions/2025/11/19/saudi-arabia-mbs-mohammed-bin-salman-trump/",
    "snippet": "The crown prince gets F-35s, new security status and legitimacy in exchange for promised investment.",
    "published": "November 20, 2025"
  },
  {
    "title": "Mohammed bin Salman’s Power and Wealth in 2025",
    "url": "https://www.ceotodaymagazine.com/2025/05/mohammed-bin-salman-saudi-arabias-crown-prince-of-influence/",
    "snippet": "Though technically the wealth belongs to the royal family or the state, MBS <strong>exercises significant personal control over financial decisions, especially those tied to the $700 billion Public Investment Fund (PIF) of Saudi Arabia</strong>.",
    "published": "May 13, 2025"
  }
]