[
  {
    "title": "Josep Borrell - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Josep_Borrell",
    "snippet": "In July 2019, Borrell was announced as the European Council&#x27;s nominee to be appointed High Representative of the Union for Foreign Affairs and Security Policy. He took office in December 2019. Josep (or José) Borrell Fontelles was born on 24 April 1947 in the Catalan village of La Pobla de Segur, province of Lleida, near the Pyrenees, son of Joan Borrell (father) and Luisa Fontelles Doll (mother).",
    "published": "1 month ago"
  },
  {
    "title": "Josep Borrell - | EEAS - European Union",
    "url": "https://www.eeas.europa.eu/taxonomy/term/400381_en",
    "snippet": "The Diplomatic Service of the European Union · Editorial team · Former EU High Representative for Foreign Affairs. Visit HR/VP Josep Borrell personal blog post",
    "published": null
  },
  {
    "title": "High Representative of the Union for Foreign Affairs and Security Policy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/High_Representative_of_the_Union_for_Foreign_Affairs_and_Security_Policy",
    "snippet": "The High Representative of the Union for Foreign Affairs and Security Policy/Vice-President of the European Commission (HR/VP) is the chief co-ordinator and representative of the Common Foreign and Security Policy (CFSP) within the European Union (EU). The position is currently held by <strong>Kaja Kallas</strong>.",
    "published": "October 20, 2025"
  },
  {
    "title": "Josep Borrell Fontelles - Groupe d'études géopolitiques",
    "url": "https://geopolitique.eu/en/authors/josep-borrell-fontelles/",
    "snippet": "He then served as Chair of the Committee on Development (2007-2009), President of the European University Institute in Florence (2010-2012), Jean Monnet Chair of European Economic Integration at Complutense University of Madrid (2013-2016), Minister of Foreign Affairs for the European Union and Cooperation with Spain (2018-2019). Mr. Borrell has received numerous honors, among them the French Légion d’honneur in 2015, the Spanish Medal of the Order of Constitutional Merit in 2011, and the Grand Cross of the Order of the Sun of Peru in 2019.",
    "published": null
  },
  {
    "title": "Josep Borrell Fontelles - The Commissioners - European Union",
    "url": "https://commissioners.ec.europa.eu/josep-borrell-fontelles_en",
    "snippet": "High Representative of the Union for Foreign Affairs and Security Policy/Vice-President of the Commission for a Stronger Europe in the World",
    "published": null
  }
]