[
  {
    "title": "Zelensky says negotiations 'close to real result' as Russia renews drone attacks - France 24",
    "url": "https://www.france24.com/en/europe/20251222-live-us-ukraine-hail-productive-miami-talks-but-no-breakthrough",
    "snippet": "“This is a working process,” Peskov said when asked whether the negotiations that took place in Miami on December 20–21 could be seen as a turning point. ... ⁠Russian ‍forces ​launched ⁠a new evening drone attack on ​Ukraine&#x27;s ‍Black ​Sea port of ​Odesa on Monday, the second in less than 24 ‍hours, ​damaging port facilities and a civilian ‌ship, regional Governor ‍Oleh Kiper said on Telegram. ... Ukrainian President Volodymyr Zelensky said on ‍Monday that negotiations ​conducted with the United States and European nations aimed at ending the nearly four-year war with Russia ⁠were &quot;very close to a real result&quot;.",
    "published": "20 hours ago"
  },
  {
    "title": "Russian Offensive Campaign Assessment, December 22, 2025",
    "url": "https://understandingwar.org/research/russia-ukraine/russian-offensive-campaign-assessment-december-22-2025/",
    "snippet": "Ukrainian President Volodymyr Zelenskyy stated on December 22 that <strong>Ukrainian and US delegations have completed 90 percent of the “first developments” in negotiations and have a concrete but unfinalized 20-point plan</strong>.[11] Zelensky stated ...",
    "published": "5 hours ago"
  },
  {
    "title": "Russian Offensive Campaign Assessment, December 20, 2025",
    "url": "https://understandingwar.org/research/russia-ukraine/russian-offensive-campaign-assessment-december-20-2025/",
    "snippet": "Zelensky stated that he is <strong>ready to hold elections in Ukraine if conditions are in place for Ukrainian authorities to ensure “proper, decent, and democratic elections.”</strong>[7] Zelensky stated that the Ukrainian Ministry of Foreign Affairs (MFA) ...",
    "published": "1 day ago"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "In Warsaw, President of Ukraine Volodymyr Zelenskyy met with the Marshal of the Polish Senate, Małgorzata Kidawa-Błońska. 19 December 2025 - 17:20 · President of Ukraine Volodymyr Zelenskyy held a meeting with the Marshal of the Sejm of Poland, Włodzimierz Czarzasty.",
    "published": "4 days ago"
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "On Energy Workers’ Day, President of Ukraine Volodymyr Zelenskyy met with employees of the energy sector and presented them with state awards. ... Since the beginning of 2025, more than two million children in Ukraine have been provided with free hot meals.",
    "published": "1 day ago"
  }
]