[
  {
    "title": "Unai Emery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Unai_Emery",
    "snippet": "There, he won a Ligue 1 title, two Coupe de France titles, two Coupe de la Ligues, and two Trophée des Champions, including a domestic quadruple in his second season. <strong>After the expiry of his contract, Emery was appointed as head coach of English club Arsenal in 2018,</strong> succeeding Arsène Wenger.",
    "published": "2 days ago"
  },
  {
    "title": "Unai Emery Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/7247/unai-emery/overview",
    "snippet": "More trophies followed during his two years in France with Paris Saint-Germain, including Ligue 1 in 2017/18. <strong>Emery took charge of Arsenal in 2018,</strong> with Arsene Wenger departing following 22 years in the dugout.",
    "published": null
  },
  {
    "title": "Did Arsenal treat Unai Emery badly? The complete timeline of his tenure | FourFourTwo",
    "url": "https://www.fourfourtwo.com/features/was-unai-emery-badly-treated-at-arsenal-the-complete-timeline-of-his-tenure",
    "snippet": "Stories Ex-Manchester United coach&#x27;s disastrously short tenure reveals shocking backroom revelations: report · Sport &#x27;It was like being in Big Brother, you never felt comfortable, it was a bit of an issue for us&#x27;: The inside story of Sunderland, Netflix and the streaming drama that ended happily ever after · Football Daniel Levy reveals behind-the-scenes conversations which led to Ange Postecoglou&#x27;s Tottenham Hotspur sack ... Arsenal hired Unai Emery to replace Arsene Wenger - but his time in charge was wildly unpopular with Gooners",
    "published": "August 24, 2024"
  },
  {
    "title": "Welcome Unai | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/welcome-unai",
    "snippet": "Unai, 46, previously spent <strong>three seasons</strong> with Sevilla, leading them to an unprecedented three consecutive Europa League titles, establishing the club as a major force in the Spanish league.",
    "published": null
  },
  {
    "title": "Unai Emery at Arsenal: a failure or a victim of circumstance? - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/39048034/unai-emery-arsenal-failure-victim-circumstance",
    "snippet": "Unai Emery is enjoying so much ... the departing Wenger, who had fallen from legend to lamented in a tenure spanning <strong>almost 22 years</strong>....",
    "published": "December 8, 2023"
  }
]