[
  {
    "title": "The REAL Power: Who Owns 51% of Google?",
    "url": "https://surgegraph.io/business/who-owns-51-of-google",
    "snippet": "Try the same AI Humanizer for free!Try Free AI Humanizer · Share this post: Google is a subsidiary of <strong>Alphabet Inc.</strong>, a publicly traded corporation with a market capitalization of $2.4 trillion.",
    "published": null
  },
  {
    "title": "Google Stock Ownership - Who Owns Google in 2025? | WallStreetZen",
    "url": "https://www.wallstreetzen.com/stocks/us/nasdaq/googl/ownership",
    "snippet": "<strong>Brin Sergey</strong> is the largest individual Google shareholder, owning 360.14M shares representing 2.98% of the company. <strong>Brin Sergey</strong>&#x27;s Google shares are currently valued at $108.93B. If you&#x27;re new to stock investing, here&#x27;s how to buy Google stock. ©2025 WallStreetZen ·",
    "published": "4 days ago"
  },
  {
    "title": "Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Google",
    "snippet": "Similar investigations are ongoing in the U.S. and EU, where regulators have suggested that Google may need to sell part of its ad-tech business. It was ruled in 2025 by <strong>the Justice Department</strong> alongside 17 other states that Google operates a monopoly in online advertising technology. The case ...",
    "published": "3 days ago"
  },
  {
    "title": "Who Owns Google in 2025? Read about Alphabet Inc.!",
    "url": "https://www.jagranjosh.com/us/explainers/who-is-the-owner-of-google-1860000139",
    "snippet": "<strong>Alphabet Inc.</strong>’s unique ownership structure balances founder control with public investment, enabling Google to remain a tech titan in 2025.",
    "published": "September 20, 2025"
  },
  {
    "title": "Who Owns Google?",
    "url": "https://www.companieshistory.com/who-owns-google/",
    "snippet": "<strong>Alphabet Inc.</strong> owns Google through a corporate structure established in October 2015. The restructuring separated Google’s core internet business from experimental ventures while maintaining founder control through a dual-class share system.",
    "published": "October 9, 2025"
  }
]