[
  {
    "title": "John Garamendi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Garamendi",
    "snippet": "In 1990, Garamendi became the first elected <strong>California insurance commissioner</strong>, serving from 1991 to 1995. He ran for governor in the 1994 election, losing in the Democratic primary. He left elective office and served as President Bill Clinton&#x27;s deputy secretary of the interior from 1995 to ...",
    "published": "2 weeks ago"
  },
  {
    "title": "John Garamendi - Ballotpedia",
    "url": "https://ballotpedia.org/John_Garamendi",
    "snippet": "John Garamendi (Democratic Party) is a <strong>member of the U.S. House, representing California&#x27;s 8th Congressional District</strong>. He assumed office on January 3, 2023.",
    "published": null
  },
  {
    "title": "John Garamendi | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/john-garamendi/G000559",
    "snippet": "John Garamendi, the Representative from California - in Congress from 2009 through Present",
    "published": null
  },
  {
    "title": "About John Garamendi | Congressman John Garamendi",
    "url": "https://garamendi.house.gov/about",
    "snippet": "From 1991 to 1995, and again from 2003 to 2006, Garamendi served as the <strong>California Insurance Commissioner</strong>, earning a reputation as the most effective protector of consumer interests in the nation. He successfully forced insurance companies to pay claims to policyholders and significantly curtailed ...",
    "published": "August 22, 2023"
  },
  {
    "title": "Rep. John Garamendi [D-CA8, 2023-2026], Representative for California's 8th Congressional District - GovTrack.us",
    "url": "https://www.govtrack.us/congress/members/john_garamendi/412382",
    "snippet": "3, 2023. Garamendi is next up for reelection in 2026 and serves until Jan. 3, 2027. He is 80 years old. He was previously the representative for California’s 3rd congressional district as a Democrat from 2013 to 2022; and the representative for California’s 10th congressional district as a Democrat from Nov.",
    "published": null
  }
]