[
  {
    "title": "Golden State Warriors - Arena History - RetroSeasons.com",
    "url": "https://www.retroseasons.com/teams/golden-state-warriors/history/stadiums/",
    "snippet": "<strong>Founded in 1946 in Philadelphia, the Warriors moved to the San Francisco Bay Area in 1962 and took the city&#x27;s name, before changing its geographic moniker to Golden State in 1971</strong>.",
    "published": "March 21, 2023"
  },
  {
    "title": "Chase Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chase_Center",
    "snippet": "The Warriors, who have been located in the San Francisco Bay Area since 1962, played their home games at <strong>Oakland Arena in Oakland from 1971 to 2019</strong> (except 1996-97, when the franchise temporarily relocated to the SAP Center in San Jose while the Oakland Arena was under renovation).",
    "published": "1 day ago"
  },
  {
    "title": "Golden State Warriors - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Golden_State_Warriors",
    "snippet": "<strong>Oakland Arena became the team&#x27;s exclusive home court in 1971</strong>. The Warriors made the playoffs from 1971 to 1977 except in 1974, and won their first NBA championship on the West Coast in 1974–75. In what many consider the biggest upset in NBA history, Golden State not only defeated the heavily ...",
    "published": "3 days ago"
  },
  {
    "title": "History of Golden State Warriors Franchise - Archived Information and Materials Pertaining to The Warriors Piers 30-32 Project | SFGOV",
    "url": "https://www.sfgov.org/sfc/mbs-pavilion/history-golden-state-warriors-franchise-archived-information-and-materials-pertaining-warriors-piers",
    "snippet": "After playing in Oakland for nearly ... started as the San Francisco Warriors. <strong>In 1962, the Warriors franchise relocated to the San Francisco Bay Area after spending nearly twenty years in its founding city of Philadelphia, Pennsylvania</strong>. Without an official arena, the ...",
    "published": null
  },
  {
    "title": "History behind Golden State's Chase Center and when tenure ended at Oracle",
    "url": "https://www.nbcsportsboston.com/nba/boston-celtics/history-behind-golden-states-chase-center-and-when-tenure-ended-at-oracle/255934/",
    "snippet": "<strong>The Warriors have been hosted by the Chase Center since 2019.</strong> Before that, they played their home games in Oakland at Oakland Arena, otherwise known as Oracle Arena, from 1971 to 2019.",
    "published": "June 1, 2022"
  }
]