[
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "Although coached by <strong>Jean Desclaux between 1973 and 1980</strong>, the French team&#x27;s main influence during the late 1970 was captain Jacques Fouroux. Fouroux played scrum-half and captained France to their 1977 Five Nations Grand Slam, during which France played a very forward-oriented style of rugby.",
    "published": "1 week ago"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Charged with leading France’s golden generation of players, <strong>Fabien Galthie</strong> has overseen one of rugby’s great revolutions. With the otherworldly talents of Antoine Dupont, Damien Penaud, Romain Ntamack and Gregory Alldritt at his fingertips, ...",
    "published": "May 30, 2025"
  },
  {
    "title": "France rugby union team: Fixtures, squad and head coach",
    "url": "https://news.bet365.com/en-gb/article/france-rugby-union-team-profile/2025012409221201023",
    "snippet": "The top tryscorer in the Six Nations ... himself, receiving 64 international caps for Les Bleus as a scrum-half between 1991 and 2003, <strong>Fabien Galthie became France head coach in 2019.</strong>...",
    "published": null
  },
  {
    "title": "France national rugby union team | Rugby Union | Fandom",
    "url": "https://rugbyunion.fandom.com/wiki/France_national_rugby_union_team",
    "snippet": "He continued to promote a forward-oriented style of play, and France won six Five Nations titles — including two Grand Slams — while he was coach. After nearly ten years in the role he resigned in 1990 after a defeat to Romania.[51] Fouroux was succeeded by Daniel Dubroca, who coached the team to the 1991 Rugby World Cup.[52] Dubroca&#x27;s tenure as coach did not last long, however, as he resigned after violently confronting referee David Bishop following France&#x27;s World Cup quarter-final against England.[52][53] Dubroca was replaced by Pierre Berbizier, who coached the team until after the 1995 Rugby World Cup.[54] Berbizier&#x27;s replacement, Jean-Claude Skrela, coached France to Five Nations Grand Slams in 1997 and 1998 before they came last in the tournament in 1999.[55] He officially resigned following France&#x27;s loss to Australia in the 1999 Rugby World Cup final.",
    "published": null
  },
  {
    "title": "List of France national rugby union team coaches - FamousFix List",
    "url": "https://www.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "<strong>Marc Lièvremont (born 28 October 1968) is a former rugby union footballer and was the head coach of the French national rugby union team. He played as a back-row forward for France, gaining 25 caps from 1995 to 1999</strong>, and was selected in France&#x27;s ...",
    "published": null
  }
]