[
  {
    "title": "2025 German federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_German_federal_election",
    "snippet": "The governing parties and the CDU/CSU agreed that 23 February 2025 should be the date for the snap election. The president is not obliged to grant a dissolution, and the Basic Law allows him 21 days to decide. The president also has the sole authority to set the election date, though he agreed with the parties&#x27; proposal. Steinmeier first held discussions with all party leaders, as he has a constitutional duty to determine whether there is any possible majority in the current Bundestag. On 20 December, Steinmeier&#x27;s office released a statement confirming that the talks were completed and that there was no possible majority.",
    "published": "2 weeks ago"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "The current officeholder is <strong>Friedrich Merz</strong> of the Christian Democratic Union, sworn in on 6 May 2025. The office of chancellor has a long history, stemming back to the Holy Roman Empire (c. 900–1806). The title of chancellor (Latin: cancellarius) was given to the head of the clerics at the ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Germany - Federal Foreign Office",
    "url": "https://www.auswaertiges-amt.de/en/aussenpolitik/germany-230318",
    "snippet": "Head of Government: Federal Chancellor <strong>Friedrich Merz (CDU),</strong> since Mai 2025",
    "published": null
  },
  {
    "title": "Merz cabinet - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Merz_cabinet",
    "snippet": "It is the fifth time a governing ... then-Chancellor Angela Merkel in 2018. The Union (CDU/CSU) with its Chancellor candidate <strong>Friedrich Merz</strong> emerged from 2025 German federal election as the strongest faction in the new ...",
    "published": "1 month ago"
  },
  {
    "title": "No honeymoon for Merz as the new German government already faces domestic constraints | Chatham House – International Affairs Think Tank",
    "url": "https://www.chathamhouse.org/2025/05/no-honeymoon-merz-new-german-government-already-faces-domestic-constraints",
    "snippet": "Image — New Chancellor <strong>Friedrich Merz</strong> of the German Christian Democrats (CDU) speaks during a handover ceremony at the Chancellery following his election at a special session of the Bundestag on 6 May 2025 in Berlin, Germany.",
    "published": "June 6, 2025"
  }
]