[
  {
    "title": "Background note For internal EP use only",
    "url": "https://www.europarl.europa.eu/meetdocs/2014_2019/plmrep/COMMITTEES/AFET/DV/2020/11-27/Russian_opposition_background_note_2020_final_EN.pdf",
    "snippet": "Alexei Navalny is a Russian politician, lawyer, founder of the Anti-Corruption Foundation and · leader of the political party “Russia of the Future”. In September 2013, he ran in the Moscow · <strong>mayoral election from the RPR-Parnas party</strong>.",
    "published": null
  },
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "To become an official candidate, ... of municipal deputies from 110 different subdivisions (three-quarters of Moscow&#x27;s 146). <strong>Navalny chose to be pegged by a party, RPR–PARNAS</strong>....",
    "published": "1 day ago"
  },
  {
    "title": "Parnas Party Envisions Navalny, Khodorkovsky as Future Leaders",
    "url": "https://www.themoscowtimes.com/2015/07/05/parnas-party-envisions-navalny-khodorkovsky-as-future-leaders-a47908",
    "snippet": "Kasyanov told reporters during the convention that though <strong>Russian opposition leader Alexei Navalny and prominent former oil tycoon-turned-activist Mikhail Khodorkovsky were not yet members of the party</strong>, that may soon change.",
    "published": "July 5, 2015"
  },
  {
    "title": "RPR-PARNAS to insist Navalny refuses from radical nationalism, left course - Russia - TASS",
    "url": "https://tass.com/russia/716064",
    "snippet": "/ITAR-TASS/. RPR-PARNAS (Republican Party of Russia – People’s Freedom Party) <strong>will suggest Alexei Navalny refuses from radical nationalism and left course</strong>, the opposing party’s co-chair Boris Nemtsov told Itar-Tass commenting on the ...",
    "published": "January 24, 2014"
  },
  {
    "title": "People's Freedom Party (Russia) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/RPR-PARNAS",
    "snippet": "Using its recently regained official party status, <strong>the party nominated a key leader of the protests and opposition figure Alexei Navalny for the September 2013 Moscow mayoral election</strong>, eliminating the need for Navalny to collect a huge number ...",
    "published": "October 20, 2024"
  }
]