[
  {
    "title": "MS NOW - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/MS_NOW",
    "snippet": "In 2025, with Comcast preparing to divest most of NBCUniversal&#x27;s cable networks as the new company Versant in 2026, MSNBC separated itself from the <strong>NBCUniversal News Group</strong> and rebranded as &quot;MS NOW&quot; (a backronym of &quot;My Source [for] News, Opinion, [and the] World&quot;) on November 15, 2025, relocating ...",
    "published": "5 days ago"
  },
  {
    "title": "MSNOW | Formerly MSNBC, Anchors, Shows, History, & Rachel Maddow | Britannica Money",
    "url": "https://www.britannica.com/money/MS-NOW",
    "snippet": "It was owned by <strong>NBCUniversal, which is a subsidiary of Comcast until 2025</strong>. MS NOW is generally considered to be liberal or left-leaning. In November 2025, the network changed its name to MS NOW to reflect its separation from NBC.",
    "published": null
  },
  {
    "title": "Why MS NOW? What the MSNBC name change means for viewers - Los Angeles Times",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2025-11-14/msnbcs-name-will-change-but-its-political-leanings-will-not",
    "snippet": "Tap to enable a layout that focuses on the article. ... <strong>Hollywood Inc</strong>. Lawrence O’Donnell and Rachel Maddow attend an MSNBC fan festival in New York in October. ... Staff Writer Follow Nov.",
    "published": "November 14, 2025"
  },
  {
    "title": "MSNBC is becoming MS NOW. What to know about the change and how to watch.",
    "url": "https://www.usatoday.com/story/entertainment/tv/2025/11/14/msnbc-turns-ms-now-watch/87248614007/",
    "snippet": "It&#x27;s a new dawn for MSNBC, which ... its current parent company, Comcast NBCUniversal, and moves to <strong>Versant, an independent publicly traded media company</strong>....",
    "published": "November 14, 2025"
  },
  {
    "title": "MSNBC Makes The Shift To MS NOW As Part Of Split From Comcast",
    "url": "https://deadline.com/2025/11/msnbc-changes-to-ms-now-comcast-1236618370/",
    "snippet": "The website has changed as well, to MS.NOW, with MSNBC.com redirecting to that page. MSNBC was launched in 1996 as a partnership between NBC News and Microsoft. With an initial focus on internet connectivity, the network eventually transformed into a channel offering a mix of news and opinion, and Microsoft eventually sold its stake but the name remained.",
    "published": "November 15, 2025"
  }
]