[
  {
    "title": "Buffalo Bills finalize 2025 coaching staff",
    "url": "https://www.buffalobills.com/news/buffalo-bills-finalize-2025-coaching-staff",
    "snippet": "Full list of Bills coaches and coordinators for the 2025 NFL season",
    "published": null
  },
  {
    "title": "The Official Website of the Buffalo Bills",
    "url": "https://www.buffalobills.com/team/coaches-roster/",
    "snippet": "The browser you are using is no longer supported on this site. It is highly recommended that you use the latest versions of a supported browser in order to receive an optimal viewing experience. The following browsers are supported: Chrome, Edge (v80 and later), Firefox and Safari",
    "published": null
  },
  {
    "title": "Buffalo Bills finalize coaching staff ahead of 2025 NFL season | Buffalo Rumblings",
    "url": "https://www.buffalorumblings.com/2025/3/21/24390424/buffalo-bills-finalize-coaching-staff-ahead-of-2025-nfl-season",
    "snippet": "While the majority of the staff remains the same, there are a couple changes to discuss. There was no change at the top of the coaching hierarchy for the Bills. Sean McDermott once again is returning as the team’s head coach, still searching to get Buffalo over the hump after reaching his second AFC Championship game with the Bills.",
    "published": "March 21, 2025"
  },
  {
    "title": "Buffalo Bills announce full coaching staff for 2025 NFL season",
    "url": "https://www.democratandchronicle.com/story/sports/football/nfl/bills/2025/03/19/buffalo-bills-coaching-staff-2025-nfl-season/82551548007/",
    "snippet": "<strong>McDermott, tight ends coach Rob Boras, running backs coach Kelly Skipper, passing game specialist Marc Lubick</strong> are the longest-tenured Bills coaches at nine years. The Bills have have five assistants, not including Brady and Babich, with NFL ...",
    "published": "March 19, 2025"
  },
  {
    "title": "2025 Football Coaches - University at Buffalo",
    "url": "https://ubbulls.com/sports/football/coaches",
    "snippet": "The official Football Coach List for the University at Buffalo",
    "published": null
  }
]