[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "The original de Havilland Aircraft of Canada, Limited was created in 1928 by <strong>the British de Havilland Aircraft Company</strong> to build Moth aircraft for the training of Canadian airmen, and subsequently after the Second World War, designed and produced indigenous designs.",
    "published": "3 days ago"
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "The de Havilland company became a member of the <strong>Hawker Siddeley</strong> group in 1960, but lost its separate identity in 1963. Later, <strong>Hawker Siddeley</strong> merged into what is eventually known today as BAE Systems, the British aerospace and defence business. The de Havilland name lives on in De Havilland ...",
    "published": "November 1, 2025"
  },
  {
    "title": "About - De Havilland Canada",
    "url": "https://dehavilland.com/about/",
    "snippet": "Brian retired from PAL in 2019; however, he was enticed back into aviation after applying for and earning the role of CEO at De Havilland Canada, which he views as the best aerospace job in the country – taking on the task of rebuilding an iconic Canadian company and preparing it to succeed in its second century.",
    "published": "March 15, 2023"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "De Havilland Aircraft of Canada was founded as a subsidiary of England’s de Havilland Aircraft Company in 1928. During the Second World War, de Havilland produced the multi-purpose Mosquito and training airplane Tiger Moth at its Downsview facility in Toronto.",
    "published": null
  },
  {
    "title": "De Havilland Aircraft of Canada Limited",
    "url": "https://www.baesystems.com/en/heritage/de-havilland-canada",
    "snippet": "De Havilland Aircraft of Canada Limited was established in 1928 at De Lesseps Field, Toronto although they relocated to Downsview just a year later in order to build De Havilland DH60 Moth aircraft for the training of Canadian airmen.",
    "published": null
  }
]