[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Jesse Ventura (born James George Janos; July 15, 1951) is an American politician, political commentator, actor, media personality, and retired professional wrestler. After achieving fame in the World Wrestling Federation (WWF, now WWE), he served as the 38th governor of Minnesota from 1999 to 2003.",
    "published": "2 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Biden received 306 electoral votes and President Donald Trump (R) received 232 electoral votes. In the national popular vote, Biden received 81.2 million votes and Trump received 74.2 million votes. The <strong>Green Party</strong> of Alaska nominated Ventura as its nominee rather than Howie Hawkins, the national ...",
    "published": null
  },
  {
    "title": "Green Party Nominee Other: Jesse Ventura is a former ...",
    "url": "https://www.elections.alaska.gov/election/2020/General/Janos-McKinney_Pres-VP_WEB.pdf",
    "snippet": "James G. “Jesse Ventura” Janos – United States President – Green",
    "published": null
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th Governor of Minnesota on November 3, 1998 defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He served as Governor for one term. Shocking the political establishment, Ventura became the only <strong>Reform Party</strong> candidate to ...",
    "published": null
  },
  {
    "title": "Jesse Ventura: A Profile | MPR Archive Portal",
    "url": "https://archive.mpr.org/collections/special-collections/jesse-ventura",
    "snippet": "Ventura is opposed to open enrollment, sees school busing as a mess, and questions parents role in school issues. July 31, 1998 - On this Midday program, MPR’s Gary Eichten talks with Jesse Ventura, <strong>Reform Party</strong> candidate for governor. Ventura ...",
    "published": null
  }
]