[
  {
    "title": "Morena (political party) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Morena_(political_party)",
    "snippet": "The National Regeneration Movement (Spanish: Movimiento de Regeneración Nacional), commonly referred to by its syllabic abbreviation Morena ([moˈɾena]), is a left-wing political party in Mexico. <strong>Founded in 2011 by Andrés Manuel López Obrador as a civil association</strong> and registered as a political ...",
    "published": "5 days ago"
  },
  {
    "title": "Movimiento de Regeneración Nacional (Morena) - Explainer | Wilson Center",
    "url": "https://www.wilsoncenter.org/article/movimiento-de-regeneracion-nacional-morena-explainer",
    "snippet": "Morena, Movimiento de Regeneración Nacional (National Regeneration Movement), was <strong>created in 2014 as Andrés Manuel López Obrador (AMLO) led an exodus of politicians from across the entire political spectrum into a new political party</strong>.",
    "published": null
  },
  {
    "title": "How Morena Broke Mexico’s Glass Ceiling — International Relations Review",
    "url": "https://www.irreview.org/articles/2025/3/7/how-morena-broke-mexicos-glass-ceilingnbsp",
    "snippet": "Claudia Sheinbaum of the far-left ... predecessor, <strong>Andres Manuel Lopez Obrador, widely known by his initials AMLO, founded the Morena party as a personal campaign vehicle for himself and his allies in 2012.</strong>...",
    "published": "March 8, 2025"
  },
  {
    "title": "Morena | Political Party, Mexico, Andrés Manuel López Obrador, & Claudia Sheinbaum | Britannica",
    "url": "https://www.britannica.com/topic/Morena-political-party",
    "snippet": "<strong>Founded in 2014 by Mexican politician Andrés Manuel López Obrador</strong>, it stresses an anti-corruption agenda, supports energy nationalism, and advocates policies traditionally associated with left-wing ideologies in Latin America.",
    "published": "February 25, 2025"
  },
  {
    "title": "The Rise of Morena",
    "url": "https://jacobin.com/2016/07/morena-mexico-obrador-df-nieto-pri-oaxaca",
    "snippet": "Morena was founded in <strong>early 2013</strong> when it split from the PRD over the latter’s support for neoliberal structural reforms. The PRD had itself emerged in 1989 as a left-wing electoral alternative to the long-dominant Institutional Revolutionary ...",
    "published": null
  }
]