[
  {
    "title": "Embassy Pictures - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Embassy_Pictures",
    "snippet": "By the early 1990s, key rights to the Embassy library transferred from company to company due to the bankruptcies of the companies that separately owned them (De Laurentiis for theatrical, Nelson for home video). Dino De Laurentiis&#x27;s assets went to Parafrance International, in conjunction with Village Roadshow, while Nelson&#x27;s assets were acquired by Crédit Lyonnais Bank and later sold to PolyGram.",
    "published": "2 weeks ago"
  },
  {
    "title": "Embassy Films Associates - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Embassy_Films_Associates",
    "snippet": "In January 1982, when TV producers Norman Lear and Jerry Perenchio acquired Avco Embassy Television and dropped &quot;Avco&quot; from its name, the film division followed suit, reverting to the previous Embassy Pictures name. In 1984, the film division was renamed Embassy Film Associates. Lord Lew Grade (who had just stepped down as head of ITC Entertainment) was brought in to run the international unit, until Lear and Perenchio sold Embassy to The Coca-Cola Company on June 18, 1985.",
    "published": "3 weeks ago"
  },
  {
    "title": "Embassy Pictures | Idea Wiki | Fandom",
    "url": "https://ideas.fandom.com/wiki/Embassy_Pictures",
    "snippet": "<strong>Sony Pictures Entertainment</strong> retained the television rights to most of the Embassy theatrical library and the Embassy logo, names, and trademarks through its subsidiary ELP Communications. any of the Stant&#x27;s productions were owned by Garland ...",
    "published": null
  },
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "<strong>Arnon Milchan</strong> founded his company as Embassy International Pictures N.V., which held the name for seven years until it was changed to Regency International Pictures.",
    "published": "2 days ago"
  },
  {
    "title": "Embassy Films Associates | Closing Logo Group | Fandom",
    "url": "https://closinglogogroup.fandom.com/wiki/Embassy_Films_Associates",
    "snippet": "In January 1982, when <strong>Norman Lear and Jerry Perenchio</strong> acquired the studio, the film division changed accordingly, reverting to the previous Embassy Pictures by dropping off &quot;Avco&quot;.",
    "published": null
  }
]