[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "He played in Murphy in the first division of the regional Venadense league together with his older brother, Javier. He studied agriculture in a school 20 miles from home. When he was 13, Pochettino was scouted by Jorge Griffa, director of football at Newell&#x27;s Old Boys, and his future manager Marcelo Bielsa, then the reserve team coach at Newell&#x27;s.",
    "published": "2 weeks ago"
  },
  {
    "title": "Mauricio Pochettino - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1167021/bio/",
    "snippet": "In his first full season at Southampton, Pochettino led the team to an eighth-place finish, their highest league position since 2002/03, while also recording their highest points tally since the Premier League began in 1992/93. After one season at Southampton, he joined Tottenham - finishing in the top-four in four consecutive seasons.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino facts for kids",
    "url": "https://kids.kiddle.co/Mauricio_Pochettino",
    "snippet": "In this Spanish name, the first or paternal family name is Pochettino and the second or maternal family name is Trossero. Mauricio Roberto Pochettino Trossero (born 2 March 1972) is a famous Argentine football manager and former player.",
    "published": null
  },
  {
    "title": "Five Things to Know: Mauricio Pochettino | U.S. Soccer Official Website",
    "url": "https://www.ussoccer.com/stories/2024/09/five-things-to-know-about-us-mens-national-team-head-coach-mauricio-pochettino",
    "snippet": "“The younger player needs faith in them and you need to translate the feeling that you believe in them,” Pochettino told The Guardian in 2015 (https://www.theguardian.com/football/blog/2015/nov/07/mauricio-pochettino-tottenham-youth). “The important thing is that they need to believe that you believe because, if not, it’s nothing. If they feel that you only want to add some names in your list, this is the worst thing you can show.",
    "published": "September 11, 2024"
  },
  {
    "title": "Mauricio Pochettino - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/mauricio-pochettino/profil/trainer/9044",
    "snippet": "This is the profile site of the manager Mauricio Pochettino. The site lists all clubs he coached and all clubs he played for.",
    "published": null
  }
]