[
  {
    "title": "TF1 Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1_Group",
    "snippet": "The group was formed after TF1 was privatized in April 1987 in which the channel was launched back on 6 January 1975 twelve years prior. It is controlled with a 43% stake by industrial group Bouygues, and is quoted on Euronext Paris. The history of TF1 traces back to 1975, when the Office de Radiodiffusion-Télévision Française (ORTF) was split into 7 successor institutions.",
    "published": "2 weeks ago"
  },
  {
    "title": "TF1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1",
    "snippet": "On 16 April, its president, Francis Bouygues, presented a check of three billion francs to the government, completing the privatisation of TF1. TF1&#x27;s current logo was unveiled on February 2nd, 1990. It launched a news network, La Chaîne Info (LCI), in 1994. The channel was available in Italy alongside LCI on digital terrestrial television from 2004 to December 2006 on Dfree multiplex. In 2005, TF1 launched TF1 Vision, a video on demand service. On 20 May 2021, it was announced that TF1 Group, owners of the channel, proposed a merger with Groupe M6, which owns M6.",
    "published": "1 week ago"
  },
  {
    "title": "Nos principaux dirigeants | Le Groupe | Groupe TF1 : actualités, communiqués, agenda, événements, publications",
    "url": "https://groupe-tf1.fr/en/group/our-directors",
    "snippet": "He then became Executive Vice President of the Canal+ group with responsibility for freeview operations (D8, D17 and itélé), and Chairman of D8 and D17. In September 2015, he founded Massoco, an audiovisual strategy consultancy. In October 2015, the TF1 Group commissioned Ara Aprikian to carry out a consultancy assignment on the editorial positioning of the Group’s free-to-air channels.",
    "published": null
  },
  {
    "title": "TF1 Group - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/tf1-group",
    "snippet": "www.groupe-tf1.fr/en · Broadcasting · Digital Entertainment · TV · Trending · Among all Broadcasting companies · Low ActivityHigh Activity · <strong>Rodolphe Belmer</strong>: Chief Executive Officer · Past Role: Atos, Group CEO · Gilles Pelisson: CEO ...",
    "published": null
  },
  {
    "title": "Groupe TF1 : Team (videos, interviews, photos)",
    "url": "https://www.welcometothejungle.com/en/companies/groupe-tf1/team-1",
    "snippet": "Pictures, videos and interviews of Groupe TF1 founders and employees. Meet your future team!",
    "published": null
  }
]