[
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman bin Abdulaziz Al Saud (Arabic: سلمان بن عبد العزيز آل سعود; born 31 December 1935) is <strong>King of Saudi Arabia</strong>, a position he has held since 2015. He was also Prime Minister of Saudi Arabia from 2015 to 2022. He is the 25th son of King Abdulaziz, the founder of Saudi Arabia.",
    "published": "November 3, 2025"
  },
  {
    "title": "Salman of Saudi Arabia | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/history/salman-saudi-arabia",
    "snippet": "Salman bin Abdulaziz Al Saud, born on December 31, 1935, in Riyadh, is the <strong>King of Saudi Arabia</strong>, having ascended to the throne in January 2015 following the death of his brother, King Abdullah.",
    "published": null
  },
  {
    "title": "King Salman bin Abdulaziz Al Saud – House of Saud",
    "url": "https://houseofsaud.com/king-salman-bin-abdulaziz-al-saud/",
    "snippet": "King Salman bin Abdulaziz Al Saud is the <strong>King of Saudi Arabia and Custodian of the Two Holy Mosques</strong>. Prior to his appointment to throne he served as the Deputy Governor and then the Governor of Riyadh between 1963 and 2011.",
    "published": null
  },
  {
    "title": "5,529 King Salman Of Saudi Arabia Photos & High Res Pictures - Getty Images",
    "url": "https://www.gettyimages.com/photos/king-salman-of-saudi-arabia",
    "snippet": "<strong>King Salman bin Abdulaziz Al Saud</strong> of Saudi Arabia makes his way off after the family photo during the first Arab-European Summit on February 24, 2019...",
    "published": null
  },
  {
    "title": "4,647 Saudi Prince Salman Bin Abdulaziz Al Saud Stock Photos, High-Res Pictures, and Images - Getty Images",
    "url": "https://www.gettyimages.com/photos/saudi-prince-salman-bin-abdulaziz-al-saud",
    "snippet": "King of Saudi Arabia, Salman bin Abdulaziz Al Saud meets with Emir of Kuwait, Sheikh Sabah IV Ahmad Al-Jaber Al-Sabah in Kuwait City, Kuwait on...",
    "published": null
  }
]