[
  {
    "title": "Julian Nagelsmann - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Julian_Nagelsmann",
    "snippet": "<strong>In 2010, he began his coaching career as a youth coach at TSG Hoffenheim, eventually coaching their first team in 2015, where he led them to a third-place finish in the Bundesliga and Champions League qualification. He departed Hoffenheim in 2019 and was appointed at fellow Bundesliga club RB Leipzig, reaching the semi-finals of the UEFA Champions League in 2020. Nagelsmann was appointed by Bayern Munich in 2021 for a world record managerial transfer worth €25 million (£21.7 million),</strong> ...",
    "published": "3 days ago"
  },
  {
    "title": "Julian Nagelsmann: News & coaching profile - FC Bayern Munich",
    "url": "https://fcbayern.com/en/teams/first-team/former-players/julian-nagelsmann",
    "snippet": "Julian Nagelsmann was <strong>born on 23 July 1987 and has been head coach at Bayern since July 2021</strong>. Info, honours and news here.",
    "published": null
  },
  {
    "title": "Julian Nagelsmann: 10 things on the coach hoping to lead Germany to FIFA World Cup success | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/julian-nagelsmann-10-things-on-bayern-munich-s-coach-rb-leipzig-baby-mourinho-5300",
    "snippet": "<strong>He&#x27;s the youngest coach to reach the final four</strong>, surpassing Didier Deschamps&#x27; previous record of 35 years, and did so by knocking out Atletico Madrid and Diego Simeone, who made his senior debut as a player the year Nagelsmann was born.",
    "published": "March 10, 2025"
  },
  {
    "title": "Julian Nagelsmann - Coach on the hunt for success",
    "url": "https://www.ispo.com/en/heroes/julian-nagelsmann",
    "snippet": "His remarkable success at Hoffenheim ... Europe&#x27;s greatest coaching talents. <strong>In 2021, Nagelsmann moved to German record champions FC Bayern Munich for a transfer fee of around 25 million euros</strong>, making him the most expensive coach ...",
    "published": "March 5, 2025"
  },
  {
    "title": "Julian Nagelsmann - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/nagelsmann-julian/profil/trainer/8402",
    "snippet": "Avg. term as coach : <strong>2.24 Years</strong>",
    "published": null
  }
]