[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "On 21 September 2025, <strong>Prabowo</strong> signed a presidential decree that officially made Nusantara as the political capital city of Indonesia and targeted for its realization to be implemented in 2028.",
    "published": "1 day ago"
  },
  {
    "title": "President of Indonesia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Indonesia",
    "snippet": "The president is the leader of ... to a five-year term, once renewable, allowing for a maximum of ten years in office. The current president is <strong>Prabowo Subianto</strong>, who assumed office on 20 October 2024....",
    "published": "November 21, 2025"
  },
  {
    "title": "What policies to expect from Indonesia's new president",
    "url": "https://www.voanews.com/amp/what-policies-to-expect-from-indonesia-s-new-president/7827157.html",
    "snippet": "The former special forces commander would review the possibility of lowering corporate income tax to 20% from 22%, according to media reports citing his adviser, though this would depend on its impact on revenues. It also remains to be seen whether Prabowo would raise the value-added tax (VAT) rate to 12% from 11% on January 1, 2025, an unpopular plan that has been set in motion by the current administration. ... Outgoing leader Widodo has made the $32 billion project to move Indonesia&#x27;s capital 1,200 kilometers away from sinking Jakarta to Nusantara, on Borneo island, his main legacy project.",
    "published": "October 18, 2024"
  },
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "<strong>Prabowo Subianto</strong> (born October 17, 1951, Jakarta, Indonesia) is a former general of the Indonesian army and businessman who is now president of Indonesia (2024– ). Prabowo is the third of four children born to Sumitro Djojohadikusumo, a Javanese ...",
    "published": "December 9, 2024"
  },
  {
    "title": "To glimpse Indonesia’s future, look to its president’s view of the past",
    "url": "https://www.economist.com/asia/2025/11/20/to-glimpse-indonesias-future-look-to-its-presidents-view-of-the-past",
    "snippet": "Why <strong>Prabowo Subianto</strong> is rehabilitating the late Suharto | Asia",
    "published": "November 20, 2025"
  }
]