[
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "He has held several cabinet positions ... He served as <strong>Minister of Production under Eduardo Duhalde, as Interior Minister under Néstor Kirchner, as Minister of Justice under Cristina Fernández de Kirchner, and as the President&#x27;s Cabinet Chief from 2009 to 2011.</strong>...",
    "published": "November 15, 2025"
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "<strong>By 1999, he became the president of his political party in Quilmes</strong>. In December 1999, he was appointed Secretary of Labour for the province. In 2001, he became the first Minister of Labour for Buenos Aires Province.",
    "published": null
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "<strong>Entre 1985 y 1987 fue secretario administrativo del Movimiento Peronista de dicha Cámara y luego accedió a la secretaría administrativa de esta institución. Durante el gobierno del Presidente Duhalde, Fernández fue designado secretario de Gobierno de la Provincia de Buenos Aires, secretario general de la Presidencia y ministro de producción</strong>...",
    "published": null
  },
  {
    "title": "Aníbal Fernández (@FernandezAnibal) / X",
    "url": "https://twitter.com/FernandezAnibal",
    "snippet": "JavaScript is not available · We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center · Help Center · Terms of Service Privacy Policy ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández (Politician) - Age, Birthday, Bio, Facts, Family, Net Worth, Height & More | AllFamous.org",
    "url": "https://allfamous.org/people/anibal-fernandez-19570126.html",
    "snippet": "He served as <strong>Minister of Production under Eduardo Duhalde, Interior Minister under Néstor Kirchner, Justice Minister under Cristina Fernández de Kirchner and Chief of Staff for the President from 2009 to 2011</strong> ..",
    "published": "March 20, 2023"
  }
]