[
  {
    "title": "Bio - Aníbal Fernández",
    "url": "https://www.anibalfernandez.com.ar/biografia-de-anibal-fernandez/",
    "snippet": "<strong>Jefe de Gabinete de Ministros de la Nación por segunda vez</strong>. Ministro de tres presidentes sin solución de continuidad con Eduardo Duhalde, Néstor Kirchner y Cristina Fernández de Kirchner.",
    "published": "October 24, 2021"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Aníbal Fernández es candidato a gobernador de la Provincia de Buenos Aires y <strong>actualmente jefe de Gabinete de Ministros de la presidencia de la República Argentina</strong>. Previamente se desempeñó en el Senado Nacional como representante de la ...",
    "published": null
  },
  {
    "title": "Regreso de Aníbal Fernández a la Jefatura de Gabinete – Comercio y Justicia",
    "url": "https://comercioyjusticia.info/informacion-general/regreso-de-anibal-fernandez-a-la-jefatura-de-gabinete/",
    "snippet": "<strong>La Presidenta tomó juramento a Aníbal Fernández como nuevo jefe del Gabinete de Ministros, en reemplazo de Jorge Capitanich</strong>.",
    "published": "February 26, 2015"
  },
  {
    "title": "Cambio de gabinete: Quien es Aníbal Fernández, el nuevo ministro de Seguridad | Reemplazará a Sabina Frederic | Página|12",
    "url": "https://www.pagina12.com.ar/369173-cambio-de-gabinete-quien-es-anibal-fernandez-el-nuevo-minist",
    "snippet": "<strong>En 2009, después de la derrota de Néstor Kirchner en la provincia de Buenos Aires en las elecciones de medio mandato, asumió la Jefatura de Gabinete de Ministros, tras la renuncia en ese puesto de Sergio Massa</strong>.",
    "published": "September 18, 2021"
  },
  {
    "title": "Aníbal Fernández | perfil, información y las últimas noticias",
    "url": "https://elagora.digital/perfiles/anibal-fernandez/",
    "snippet": "Luego de la asunción de Cristina Fernández de Kirchner en 2007, <strong>pasó a ocupar el puesto de Ministro de Justicia, Seguridad y Derechos Humanos de la Nación hasta ser nombrado como Jefe de Gabinete en 2009.</strong>",
    "published": null
  }
]