[
  {
    "title": "Geoff Culbert - Business Council of Australia",
    "url": "https://www.bca.com.au/geoff_culbert",
    "snippet": "Geoff assumed the role of <strong>President of the Business Council of Australia in February 2024</strong>.",
    "published": null
  },
  {
    "title": "Geoff Culbert to lead the BCA Board - Business Council of Australia",
    "url": "https://www.bca.com.au/geoff_culbert_to_lead_the_bca_board",
    "snippet": "The Business Council of Australia is pleased to announce <strong>Geoff Culbert will succeed Tim Reed as the next BCA president</strong>.",
    "published": null
  },
  {
    "title": "New BCA President starts today - Business Council of Australia",
    "url": "https://www.bca.com.au/new_bca_president_starts_today",
    "snippet": "The Business Council of Australia welcomes incoming BCA President Geoff Culbert, who today <strong>takes over leadership of the BCA Board from outgoing President Tim Reed</strong>.",
    "published": null
  },
  {
    "title": "Business Council of Australia President Geoff Culbert Annual Dinner address 2025 - Business Council of Australia",
    "url": "https://www.bca.com.au/business_council_of_australia_president_geoff_culbert_annual_dinner_address_2025",
    "snippet": "Speaker: Geoff Culbert, <strong>President of the Business Council of Australia</strong> ** CHECK AGAINST DELIVERY ** It’s a pleasure to be back here as President of the BCA, co-hosting this evening...",
    "published": null
  },
  {
    "title": "Business Council of Australia President Geoff Culbert address to Australian Financial Review Business Summit Dinner - Business Council of Australia",
    "url": "https://www.bca.com.au/bca_president_geoff_culbert_address_to_australian_financial_review_business_summit_dinner",
    "snippet": "Speakers: BCA President, Geoff Culbert **Check against delivery** Thank you, Bran. And welcome everyone here tonight. It’s great to see you. Let me start with a few acknowledgements. First, I’d... ... Speakers: Business Council Chief Executive, Bran Black **Check against delivery** Good ...",
    "published": null
  }
]