[
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "<strong>Raphaël Ibañez</strong> was appointed general manager of the team along with four staff membres: William Servat and Karim Ghezal as forwards coaches; Laurent Labit as backs coach and Englishman Shaun Edwards, responsible for the defense. Thibault Giroud, former Toulon head of physical training where ...",
    "published": "2 weeks ago"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "This could no more be seen than when France beat New Zealand 30-29 to register their third-straight win over the All Blacks in enthralling fashion. ... France’s head coach <strong>Jacques Brunel</strong> (L) before the Japan 2019 Rugby World Cup quarter-final ...",
    "published": "May 30, 2025"
  },
  {
    "title": "France rugby union team: Fixtures, squad and head coach",
    "url": "https://news.bet365.com/en-gb/article/france-rugby-union-team-profile/2025012409221201023",
    "snippet": "A distinguished former player himself, receiving 64 international caps for Les Bleus as a scrum-half between 1991 and 2003, Fabien Galthie became France head coach in 2019. Galthie led France to the Six Nations Grand Slam in 2022 with his coaching philosophy for the team revolving around an emphasis on &#x27;French flair and fight&#x27;. The France national rugby union team typically wear an iconic all blue home kit, with red and white details aligning with the colours of the country&#x27;s flag.",
    "published": null
  },
  {
    "title": "List of France national rugby union team coaches - FamousFix List",
    "url": "https://www.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "... <strong>Bernard Laporte</strong> (born 1 July 1964) is a rugby player, coach and former French Secretary of State for Sport. From 1999 to 2007, Laporte was the head coach of the France national team.",
    "published": null
  },
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Galthié was a crucial member of the French team that upset New Zealand in the semifinal of the 1999 Rugby World Cup at Twickenham. In 2000, Colomiers reached the French championship final, but Galthié had to watch from the stands due to a knee injury. The club lost 28–23 to Stade Français, whom he joined the following season. In 2001 Galthié was appointed captain of France. A successful year in 2002, including a Six Nations Grand Slam, saw France dominate the 2002 IRB Awards, with Galthié named Player of the Year, as well as French coach Bernard Laporte being named Coach of the Year.",
    "published": "1 month ago"
  }
]