[
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Following a career in the NSW and ... the role of <strong>chief executive of the Business Council of Australia</strong>. She is also a non-executive director of Wesfarmers. She received an honorary doctorate from the University of New South Wales in 2017. In 2018, Westacott was awarded an Officer of the Order ...",
    "published": "June 10, 2025"
  },
  {
    "title": "Chancellor | Western Sydney University",
    "url": "https://www.westernsydney.edu.au/about_uws/leadership/chancellor",
    "snippet": "As Australia’s Business Champion to Indonesia, she is building closer investment, business and talent links with our nearest neighbour and emerging economic powerhouse. She also serves NSW as a global ambassador for business events. From 1 March 2025, Jennifer has served on the Reserve Bank of Australia’s new Governance Board.",
    "published": null
  },
  {
    "title": "Installation ceremony formally welcomes new Western Sydney University Chancellor, Professor Jennifer Westacott AO | Western Sydney University",
    "url": "https://www.westernsydney.edu.au/newscentre/news_centre/story_archive/2023/installation_ceremony_formally_welcomes_new_western_sydney_university_chancellor_professor_jennifer_westacott_ao",
    "snippet": "Professor Westacott, who also serves as Business Council chief executive, was elected as Chancellor by Western Sydney University’s Board of Trustees in August 2022. She succeeds Emeritus Chancellor Professor Peter Shergold AC, who retired as Chancellor in December 2022 after 12 years of outstanding service to the University.",
    "published": null
  },
  {
    "title": "Canadian Utilities Appoints Jennifer Westacott to Board of Directors",
    "url": "https://finance.yahoo.com/news/canadian-utilities-appoints-jennifer-westacott-120000814.html",
    "snippet": "Westacott&#x27;s wide-ranging background in leadership and policy development includes her role as the <strong>Chief Executive of the Business Council of Australia</strong> from 2011 to 2023. She is Chair of the Western City &amp; Aerotropolis Authority, Studio Schools ...",
    "published": "January 2, 2025"
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "Jennifer is a National Fellow of the Institute of Public Administration Australia and a Fellow of the Australian Institute of Company Directors, and since 2013 has been a <strong>Non-Executive Director of Wesfarmers Limited and Chair of the Mental Health Council of Australia</strong>.",
    "published": null
  }
]