[
  {
    "title": "Luxembourg U21 live scores, results, fixtures | Football, Europe",
    "url": "https://www.flashscore.com/team/luxembourg/fsjoGwpC/",
    "snippet": "Flashscore.com offers Luxembourg U21 livescore, final and partial results, standings, home stadium with official capacity, squad updates (signed and sold players, transfer fees, loan deals, free agents and complete squad list), team coach and match details (goal scorers, red cards, odds comparison, ...",
    "published": null
  },
  {
    "title": "Italy U21 vs Luxembourg U21 H2H stats - SoccerPunter",
    "url": "https://www.soccerpunter.com/h2h/Italy-U21-vs-Luxembourg-U21/60073/132967/",
    "snippet": "Luxembourg U21 did not win any of their last five matches in Europe UEFA U21 Championship Qualification and they registered only 0 win in the last five home games at <strong>Stade Parc des Sports</strong>.",
    "published": null
  },
  {
    "title": "England U21 vs Luxembourg U21 - live score, predicted lineups and H2H stats",
    "url": "https://www.fotmob.com/matches/luxembourg-u21-vs-england-u21/14lr3b",
    "snippet": "England U21 is playing home against Luxembourg U21 at <strong>Toughsheet Community Stadium</strong> on Tue, Mar 26, 2024, 19:00 UTC. This is 1 of the EURO U21 Qualification Grp. F. Predicted lineups are available for the match a few days in advance while the ...",
    "published": null
  },
  {
    "title": "Luxembourg national under-21 football team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Luxembourg_national_under-21_football_team",
    "snippet": "The Luxembourg national under-21 football team is the national representative under-21 football team of Luxembourg. It is controlled by the Luxembourg Football Federation (FLF). The team is the feeder team to the Luxembourg&#x27;s national team. The team competes in the biennial European Under-21 Championship.",
    "published": "November 14, 2025"
  },
  {
    "title": "Luxembourg U21 vs Switzerland U21 live score, H2H and lineups | Sofascore",
    "url": "https://www.sofascore.com/football/match/luxembourg-u21-switzerland-u21/BXbsOvc",
    "snippet": "Luxembourg U21 Switzerland U21 live score (and video online live stream) starts on 18 Nov 2025 at 18:30 UTC time at <strong>Stade de la Frontière stadium, Esch-sur-Alzette city, Luxembourg</strong> in U21 EURO, Qualification, Group C, Europe.",
    "published": null
  }
]