[
  {
    "title": "Office of the Director | NIST",
    "url": "https://www.nist.gov/director",
    "snippet": "In this role, he will serve as Acting Under Secretary and Acting NIST Director until a new director is confirmed by Congress. ... The National Institute for Innovation in Manufacturing Biopharmaceuticals (NIIMBL) is pleased to announce student applications are now open for the 2026 NIIMBL ... Making metals processing more sustainable and resilient will support U.S industrial innovation and competitiveness. ... Bell is the associate lead of NIST’s investigation into the 2021 partial collapse of the Champlain Towers South condominium.",
    "published": "March 16, 2009"
  },
  {
    "title": "NIST Organization Structure | NIST",
    "url": "https://www.nist.gov/director/nist-organization-structure",
    "snippet": "Associate Director S. Shyam Sunder · Communications Technology Laboratory Ari Feldman (Acting) ... NIST Center for Neutron Research James M. Adams · Physical Measurement Laboratory James G. Kushmerick · Research Data and Computing Office Gretchen Greene",
    "published": "September 22, 2025"
  },
  {
    "title": "List of directors of the National Institute of Standards and Technology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_directors_of_the_National_Institute_of_Standards_and_Technology",
    "snippet": "The National Institute of Standards and Technology succeeded the National Bureau of Standards in 1988. Following is a list of the directors of both agencies. The number of NIST directors is a continuation of the number of NBS directors since Locascio is considered the 17th NIST director",
    "published": "3 weeks ago"
  },
  {
    "title": "NIST Director Updates | NIST",
    "url": "https://www.nist.gov/pml/owm/nist-director-updates",
    "snippet": "Left to right: <strong>Kevin Schnepp, Craig VanBuren, Don Onwiler, and Mahesh Albuquerque of NCWM, Laurie Locascio and Katrice Lippa of NIST, Gene Robertson of NCWM, David Sefcik of NIST</strong>.",
    "published": "January 21, 2025"
  },
  {
    "title": "NIST Senior Leadership | NIST",
    "url": "https://www.nist.gov/director/leadership",
    "snippet": "Dr. Boehm is NIST&#x27;s Chief of Staff where he provides strategic guidance and advice to the NIST Director and senior leadership to help the Institute accomplish its mission by maximizing budgetary resources, expanding partnerships and improving operations.",
    "published": "June 2, 2025"
  }
]