[
  {
    "title": "Akron Beacon Journal 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/153167-50",
    "snippet": "Information on acquisition, funding, investors, and executives for Akron Beacon Journal. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Akron Beacon Journal Sold to GateHouse Media, Owner of Columbus Dispatch, Canton Repository",
    "url": "https://www.clevescene.com/news/akron-beacon-journal-sold-to-gatehouse-media-owner-of-columbus-dispatch-canton-repository-17221068/",
    "snippet": "Sam AllardApril 11, 2018June 2, ... on Bluesky (Opens in new window) Bluesky · The Akron Beacon Journal has been sold to <strong>Gatehouse Media</strong>, the largest publisher of daily newspapers in the United States and the owner of the Columbus ...",
    "published": "June 2, 2025"
  },
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The Akron Beacon Journal is a morning newspaper in Akron, Ohio, United States. <strong>Owned by Gannett</strong>, it is the sole daily newspaper in Akron and is distributed throughout Northeast Ohio. The paper&#x27;s coverage focuses on local news.",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal - Bias and Credibility - Media Bias/Fact Check",
    "url": "https://mediabiasfactcheck.com/akron-beacon-journal/",
    "snippet": "The Akron Beacon Journal is owned by <strong>Gannett (Gatehouse Media),</strong> which publishes USA Today. In August 2019, Gatehouse Media purchased and merged with Gannett, becoming the largest newspaper chain in the USA.",
    "published": "October 7, 2023"
  },
  {
    "title": "Akron RubberDucks sold by Ken Babby to Prospector Baseball Group",
    "url": "https://www.beaconjournal.com/story/sports/mlb/cleveland-guardians/2025/12/09/akron-rubberducks-sold-ken-babby-prospector-baseball-group/87595741007/",
    "snippet": "The RubberDucks have new ownership. The sale of the team to <strong>Prospector Baseball Group</strong> has been made official by the club on Dec. 9 after approval by Major League Baseball. Ken Babby had owned the team since October 2012, when the Double-A affiliate ...",
    "published": "1 week ago"
  }
]