[
  {
    "title": "Mexico is Transforming for the Good | Dissident VoiceDissident Voice",
    "url": "https://dissidentvoice.org/2025/12/mexico-is-transforming-for-the-good/",
    "snippet": "Despite predictions that her gender and background would be detrimental, <strong>she and Morena candidates won the election by an even greater majority</strong>. Sheinbaum won 61% of the popular vote compared to 28% and 11% for the next competitors. Morena now has a supermajority in the Congress and Senate.",
    "published": "5 days ago"
  },
  {
    "title": "Marcelo Ebrard - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Ebrard",
    "snippet": "In June 2023, Ebrard resigned from his position as secretary of foreign affairs to run for President in the 2024 election, but lost Morena&#x27;s nomination to Claudia Sheinbaum. On 20 June 2024, President-elect Sheinbaum announced that Ebrard would serve as secretary of economy in her cabinet beginning 1 October 2024. A descendant of the French emigrant wave from Barcelonnette in 1915, Ebrard is the son of architect Marcelo Ebrard Maure and Marcela Casaubón.",
    "published": "November 14, 2025"
  },
  {
    "title": "Ebrard announces possible split with Mexico’s ruling Morena party | Courthouse News Service",
    "url": "https://www.courthousenews.com/ebrard-announces-possible-split-with-mexicos-ruling-morena-party/",
    "snippet": "<strong>He came in second with 25.8% of the votes</strong>. Conducted in 12,500 homes across the country, the poll was designed to be free of manipulation, according to Morena party leader Mario Delgado.",
    "published": null
  },
  {
    "title": "Marcelo Ebrard Issues Ultimatum",
    "url": "https://mexicobusiness.news/policyandeconomy/news/marcelo-ebrard-issues-ultimatum",
    "snippet": "<strong>Ebrard has requested the annulment of MORENA&#x27;s presidential candidate election process due to several irregularities in the process</strong>.",
    "published": "September 12, 2023"
  },
  {
    "title": "Cabinet Profile: Marcelo Ebrard, Secretary of the Economy | Mexico News Report",
    "url": "https://mexiconewsreport.com/index.php/2025/02/19/cabinet-profile-marcelo-ebrard-secretary-of-the-economy/",
    "snippet": "<strong>Ebrard ran again for president, this time as part of the MORENA party, but was defeated in the party by Claudia Sheinbaum</strong>. But all was not lost for Marcelo.",
    "published": null
  }
]