[
  {
    "title": "8 Potential Replacements for Xabi Alonso as Real Madrid Head Coach",
    "url": "https://bleacherreport.com/articles/25323948-8-potential-replacements-xabi-alonso-real-madrid-head-coach",
    "snippet": "So, let&#x27;s talk about the man at the center of all the drama: manager Xabi Alonso. The club&#x27;s former midfield maestro took charge on <strong>June 1,</strong> succeeding the most decorated coach in Madrid&#x27;s illustrious history, Carlo Ancelotti.",
    "published": null
  },
  {
    "title": "Xabi Alonso named new Real Madrid coach",
    "url": "https://www.realmadrid.com/en-US/news/football/first-team/latest-news/perfil-xabi-alonso-25-05-2025",
    "snippet": "<strong>Xabi Alonso (Tolosa, 25/11/1981) is Real Madrid&#x27;s new coach</strong>. The 43-year-old Spanish manager returns to the club where he clinched six trophies as a player to become a madridista legend.",
    "published": "May 25, 2025"
  },
  {
    "title": "Xabi Alonso unveiled as new Real Madrid coach",
    "url": "https://www.realmadrid.com/en-US/news/football/first-team/latest-news/acto-de-presentacion-de-xabi-alonso-26-05-2025",
    "snippet": "The coach coming in is already one of the best in the world and the embodiment of the Real Madrid values because he is fully aware of all this crest and this shirt represents. He was here as a player when this new golden age in our history got underway, when we lifted the unforgettable tenth European Cup in Lisbon. Today, we&#x27;re welcoming back one of our own, Xabi Alonso.” “We&#x27;re proud to have you here to continue building on our club&#x27;s incredible history.",
    "published": "May 26, 2025"
  },
  {
    "title": "Real Madrid name Xabi Alonso as Carlo Ancelotti's successor - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/44929786/real-madrid-name-xabi-alonso-carlo-ancelotti-successor",
    "snippet": "<strong>Xabi Alonso has been confirmed as Real Madrid&#x27;s new head coach</strong>, taking over from Carlo Ancelotti for this summer&#x27;s Club World Cup.",
    "published": "May 25, 2025"
  },
  {
    "title": "Real Madrid firing Alonso would be easy. Replacing him? Much harder - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/47312994/real-madrid-firing-alonso-easy-replacing-much-harder",
    "snippet": "Real Madrid manager Xabi Alonso may have bought himself more time and the lack of viable alternatives available right now might help keep him in the job. Juan Manuel Serrano Arce/Getty Images · Firstly, who to hire, and how could they avoid the eternal &quot;out of the frying pan into the fire&quot; dilemma? The dream appointment is Zinedine Zidane.",
    "published": "1 day ago"
  }
]