[
  {
    "title": "Josep Borrell - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Josep_Borrell",
    "snippet": "Josep Borrell Fontelles (Western Catalan: [dʒuˈzɛb boˈreʎ fonˈteʎes]; born 24 April 1947) is a Spanish politician who served as <strong>High Representative of the Union for Foreign Affairs and Security Policy and Vice-President of the European Commission</strong> from 2019 to 2024.",
    "published": "1 month ago"
  },
  {
    "title": "Josep Borrell",
    "url": "https://www.realinstitutoelcano.org/en/biographies/josep-borrell/",
    "snippet": "A graduate in Aeronautical Engineering from the Universidad Politécnica de Madrid and in Economics from the UCM, Mr. Borrell was a Mathematics Professor at the Higher Technical School of Aeronautical Engineering and at the UCM from 1972 to 1982. Roundtable “The future of Russia’s war on Ukraine: What role for the EU?” (2025)",
    "published": "April 10, 2025"
  },
  {
    "title": "Josep Borrell begins his term as President of CIDOB | CIDOB",
    "url": "https://www.cidob.org/en/news/josep-borrell-begins-his-term-president-cidob",
    "snippet": "CIDOB Apr 02 2025 · Following his appointment by the institution’s Board on 13 December, the former head of European diplomacy has begun his agenda as <strong>President of CIDOB</strong>, a leading think tank in international relations based in Barcelona. In his first hours as President of the institution, ...",
    "published": null
  },
  {
    "title": "Josep Borrell – POLITICO",
    "url": "https://www.politico.eu/person/josep-borrell/",
    "snippet": "The current foreign policy chief says that while “we managed to get humanitarian aid to Gaza,” Josep Borrell’s “forceful” language made no headway. September 11, 2025 11:16 am CET · July 8, 2025 4:01 am CET · July 3, 2025 9:45 pm CET · June 20, 2025 6:25 pm CET ·",
    "published": null
  },
  {
    "title": "Josep Borrell | CIDOB",
    "url": "https://www.cidob.org/en/expertos/josep-borrell",
    "snippet": "Jul 22 2025 · Josep Borrell, <strong>President of CIDOB and former EU High Representative for Foreign Affairs and Security Policy and former vice president of the European Commission</strong> and Domènec Ruiz Devesa, CIDOB Senior Research Fellow and former MEP · View all · Ara Nov 21 2025 ·",
    "published": null
  }
]