[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 and resigned on 6 October 2025, but was re-appointed on 10 October.",
    "published": "1 week ago"
  },
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "<strong>Sébastien Lecornu</strong> (French: [sebastjɛ̃ ləkɔʁny]; born 11 June 1986) is a French politician who has served as Prime Minister of France since 2025.",
    "published": "1 week ago"
  },
  {
    "title": "Macron names ally Sébastien Lecornu as new French PM",
    "url": "https://www.bbc.com/news/articles/crmenp1k0mjo",
    "snippet": "President Emmanuel Macron has named close ally <strong>Sébastien Lecornu</strong> as the new French prime minister, 24 hours after a vote of confidence ousted François Bayrou as head of government.",
    "published": "September 9, 2025"
  },
  {
    "title": "List of prime ministers of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_France",
    "snippet": "The head of the government of France has been called the prime minister of France (French: Premier ministre) since 1959, when <strong>Michel Debré</strong> became the first officeholder appointed under the Fifth Republic. During earlier periods of French history, the country&#x27;s head of government was known ...",
    "published": "1 week ago"
  },
  {
    "title": "Opinion | France Needs a New France - The New York Times",
    "url": "https://www.nytimes.com/2025/12/22/opinion/france-macron-sixth-republic.html",
    "snippet": "First, the government was toppled by an irate Parliament. Then, in a panic, President Emmanuel Macron tapped a protégé, <strong>Sébastien Lecornu</strong>, to be prime minister; he resigned less than a month later. Confusion raged.",
    "published": "1 day ago"
  }
]