[
  {
    "title": "Yulia Svyrydenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yulia_Svyrydenko",
    "snippet": "Yulia Anatoliivna Svyrydenko (Ukrainian: Юлія Анатоліївна Свириденко, IPA: [ˈjul⁽ʲ⁾ijɐ ɐnɐˈtɔl⁽ʲ⁾ijiu̯nɐ swɪrɪˈdɛnko]; born 25 December 1985) is a Ukrainian politician who has served as the <strong>19th prime minister of Ukraine since 17 July 2025</strong>.",
    "published": "1 month ago"
  },
  {
    "title": "Yulia Svyrydenko – Prime Minister of Ukraine 🇺🇦",
    "url": "https://ua.linkedin.com/in/yulia-svyrydenko-0522b745",
    "snippet": "I was pleased to welcome EU Ambassador to Ukraine Katarina Mathernova to the Cabinet of Ministers and to receive the Annual Report within the EU… · I met with the Ambassadors to NATO from Canada, France, Germany, Italy, the Netherlands, Poland, the United States, and the United Kingdom during… · Last night, russia again struck Ukraine’s civilian infrastructure. Our cities were hit — primarily energy facilities, but also residential… · We concluded the intergovernmental consultations in Košice. Together with Prime Minister Robert Fico, we discussed energy security, defense…",
    "published": "January 28, 2025"
  },
  {
    "title": "Yuliia Svyrydenko | Cabinet of Ministers of Ukraine",
    "url": "https://www.kmu.gov.ua/en/profile/yuliya-sviridenko",
    "snippet": "She was awarded the Diploma of the Cabinet of Ministers of Ukraine. On <strong>17 July 2025</strong>, she was appointed Prime Minister of Ukraine.",
    "published": null
  },
  {
    "title": "Zelenskyy appoints Yulia Svyrydenko as new prime minister for war-weary Ukraine | PBS News",
    "url": "https://www.pbs.org/newshour/world/zelenskyy-appoints-yulia-svyrydenko-as-new-prime-minister-for-war-weary-ukraine",
    "snippet": "By naming Yulia Svyrydenko, the <strong>former economy minister</strong>, to become the country’s first new head of government since Russia’s full-scale invasion in 2022, Zelenskyy on Thursday elevated a loyal politician who has experience in diplomacy with ...",
    "published": "July 17, 2025"
  },
  {
    "title": "Minister of Economy, Environment and Agriculture of Ukraine | Ministry of Economy, Environment and Agriculture of Ukraine",
    "url": "https://me.gov.ua/Documents/Detail?lang=en-GB&id=3c5cb542-2ce5-4240-bab3-7c6a7e616cfd&title=Minister",
    "snippet": "Minister of Economy, Environment and Agriculture of Ukraine | Міністерство економіки України – державний орган виконавчої влади України, який здійснює функції з вироблення та реалізації ...",
    "published": null
  }
]