[
  {
    "title": "Samy Bengio - Apple | LinkedIn",
    "url": "https://www.linkedin.com/in/bengio",
    "snippet": "Experience: Apple · Location: Mountain View · 500+ connections on LinkedIn. View Samy Bengio’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": null
  },
  {
    "title": "Soutenir les femmes en informatique: le pari de Samy Bengio et Elaine McMurray - UdeMNouvelles",
    "url": "https://nouvelles.umontreal.ca/article/2025/10/24/soutenir-les-femmes-en-informatique-le-pari-de-samy-bengio-et-elaine-mcmurray",
    "snippet": "Pour Samy Bengio, aujourd’hui <strong>directeur de la recherche en intelligence artificielle chez Apple</strong>, ce don s’inscrit dans la continuité d’un long engagement en faveur de la diversité.",
    "published": null
  },
  {
    "title": "Samy Bengio - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Samy_Bengio",
    "snippet": "Samy Bengio (born 1965) is a Canadian computer scientist working as <strong>senior director of Artificial Intelligence and Machine Learning Research at Apple</strong>. Bengio obtained his Ph.D. in Computer Science in 1993 with a thesis titled Optimization of a Parametric Learning Rule for Neural Networks from ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Fame | Samy Bengio net worth and salary income estimation Oct, 2025 | People Ai",
    "url": "https://peopleai.com/fame/identities/samy-bengio",
    "snippet": "Samy Bengio is a Canadian computer scientist, Senior Director of AI and Machine Learning Research at Apple, and a former long-time scientist at Google known for leading a large group of researchers working in machine learning including adversarial settings. Bengio left Google shortly after the company fired his report, Timnit Gebru, without first notifying him.",
    "published": null
  },
  {
    "title": "Samy Bengio on LinkedIn: AI/ML - Machine Learning Researcher, MLR - Careers at Apple",
    "url": "https://www.linkedin.com/posts/bengio_aiml-machine-learning-researcher-mlr-activity-6921941917932945408-CZVQ?trk=public_profile_share_view",
    "snippet": "The MLR team at <strong>Apple</strong>, recently started by Samy Bengio, is hiring world-class Research Scientists and Software Engineers.",
    "published": "April 18, 2022"
  }
]