[
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "In July 2023, it was reported that Burns&#x27;s email account had been hacked in a breach of Microsoft emails by the Chinese government. On February 3, 2025, The Cohen Group announced that <strong>Burns will rejoin as a vice chair on February 17, 2025</strong>.",
    "published": "September 26, 2025"
  },
  {
    "title": "Ambassador Nicholas Burns to Rejoin The Cohen Group as a Vice Chair | The Cohen Group",
    "url": "https://cohengroup.net/ambassador-nicholas-burns-rejoin-cohen-group-vice-chair",
    "snippet": "<strong>Ambassador Nicholas Burns will return to The Cohen Group following his service as US Ambassador to China from 2021 to early 2025</strong>, the firm announced today. Ambassador Burns will rejoin the firm as a Vice Chair on February 17, 2025.",
    "published": "February 3, 2025"
  },
  {
    "title": "Nicholas Burns | The Belfer Center for Science and International Affairs",
    "url": "https://www.belfercenter.org/person/nicholas-burns",
    "snippet": "3, 2025 · It’s a remarkable, historic success that 80 years after World War II, Japan and Germany have become vital U.S. allies.&amp;amp;nbsp;But as Beijing... Professor Nicholas Burns is the Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations at Harvard University’s Kennedy School of Government.",
    "published": null
  },
  {
    "title": "R Nicholas Burns - The New York Times",
    "url": "https://www.nytimes.com/topic/r-nicholas-burns",
    "snippet": "News about R Nicholas Burns. Commentary and archival information about R Nicholas Burns from The New York Times.",
    "published": null
  },
  {
    "title": "R. Nicholas Burns, U.S. Ambassador, Says China Is Aligned With ‘Agents of Disorder’ - The New York Times",
    "url": "https://www.nytimes.com/2025/01/10/business/nicholas-burns-ambassador-china.html",
    "snippet": "U.S. ambassador to China R. Nicholas Burns, at left, with Antony Blinken, the secretary of state, and President Biden during a meeting in November with China’s leader, Xi Jinping, and other top officials. Credit...Eric Lee/The New York Times ... Jan. 10, 2025",
    "published": "January 10, 2025"
  }
]