[
  {
    "title": "AS Roma appoint Gian Piero Gasperini as new Head Coach",
    "url": "https://www.asroma.com/en/news/73319/as-roma-appoint-gian-piero-gasperini-as-new-head-coach",
    "snippet": "AS Roma announces the appointment of Gian Piero Gasperini as the Club’s new Head Coach.",
    "published": "June 6, 2025"
  },
  {
    "title": "Gian Piero Gasperini - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gian_Piero_Gasperini",
    "snippet": "<strong>On 6 June 2025, Gasperini was announced as the new head coach of Roma</strong>. He signed a contract valid until the end of the 2027–28 season. At Roma, he reunited with Bryan Cristante and Gianluca Mancini, as well as Pierluigi Gollini, all of whom had played for Gasperini during his time with Atalanta.",
    "published": "1 day ago"
  },
  {
    "title": "Roma appoint Gian Piero Gasperini as head coach after Claudio Ranieri exit - The Athletic",
    "url": "https://www.nytimes.com/athletic/6408436/2025/06/06/roma-manager-gasperini-ranieri/",
    "snippet": "<strong>Gian Piero Gasperini has been appointed Roma head coach following his exit from Serie A rivals Atalanta</strong>.",
    "published": "June 6, 2025"
  },
  {
    "title": "AS Roma appoint Gian Piero Gasperini as new coach: Why the former Atalanta boss was the best decision - CBS Sports",
    "url": "https://www.cbssports.com/soccer/news/as-roma-appoint-gian-piero-gasperini-as-new-coach-why-the-former-atalanta-boss-was-the-best-decision/",
    "snippet": "Gasperini, who <strong>coached Atalanta from 2016 to 2025</strong>, and marked one of the most successful eras at the club, including the 2023-24 UEFA Europa League win, will now start a new chapter at Roma.",
    "published": "June 6, 2025"
  },
  {
    "title": "Roma confirm Gian Piero Gasperini as new head coach | OneFootball",
    "url": "https://onefootball.com/en/news/roma-confirm-gian-piero-gasperini-as-new-head-coach-41213070",
    "snippet": "<strong>Roma have confirmed the appointment of Gian Piero Gasperini as their new head coach</strong>.",
    "published": null
  }
]