[
  {
    "title": "Olena Zelenska Took Part in the Opening of a Kitchen Factory in the Kharkiv Region — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/na-harkivshini-olena-zelenska-vzyala-uchast-u-vidkritti-fabr-101925",
    "snippet": "News · President&#x27;s wife · 11 December 2025 - 20:18 · In the Kharkiv region, First Lady of Ukraine Olena Zelenska <strong>took part in the launch of a kitchen factory opened as part of the school nutrition reform</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "Since the beginning of 2025, <strong>more than two million children in Ukraine have been provided with free hot meals</strong>. This was announced by First Lady Olena Zelenska as she summed up this year’s results of implementing the school nutrition reform.",
    "published": "6 hours ago"
  },
  {
    "title": "The Olena Zelenska Foundation Opened the First “12–21” Youth Space in Bila Tserkva — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/fundaciya-oleni-zelenskoyi-vidkrila-pershij-molodizhnij-pros-101965",
    "snippet": "News · President&#x27;s wife · 12 December 2025 - 21:09 · <strong>The first youth space of the “12–21” network, created by the Olena Zelenska Foundation, has opened in Bila Tserkva</strong>. This is a barrier-free center designed for leisure, peer-to-peer ...",
    "published": "1 week ago"
  },
  {
    "title": "Olena Zelenska Took Part in the Annual Educational Conference “Serpneva-2025” — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/olena-zelenska-vzyala-uchast-u-shorichnij-osvitnij-konferenc-99641",
    "snippet": "First Lady of Ukraine Olena Zelenska <strong>took part in the annual educational conference “Serpneva-2025,” organized by the Ministry of Education and Science</strong>.",
    "published": "August 21, 2025"
  },
  {
    "title": "In Japan, Olena Zelenska Took Part in Ukraine’s National Day at EXPO 2025 — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/u-yaponiyi-olena-zelenska-vzyala-uchast-u-nacionalnomu-dni-u-99333",
    "snippet": "First Lady of Ukraine Olena Zelenska took part in Ukraine’s National Day at EXPO 2025, held in Osaka.",
    "published": "August 5, 2025"
  }
]