[
  {
    "title": "Portuguese President Rebelo de Sousa hospitalised following emergency surgery | Euronews",
    "url": "https://www.euronews.com/2025/12/02/portuguese-president-rebelo-de-sousa-hospitalised-following-emergency-surgery",
    "snippet": "The Portuguese head of state was admitted to hospital late on Monday afternoon &quot;after feeling unwell following digestive issues,&quot; but is <strong>said to be recovering following an emergency hernia operation</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "On 1 December 2025, Marcelo Rebelo de Sousa was <strong>admitted to University Hospital of São João, in Porto, for urgent surgery due to an incarcerated hernia, after feeling unwell</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Marcelo Rebelo de Sousa valida OE2026 e valoriza contributo parlamentar",
    "url": "https://www.idealista.pt/news/imobiliario/habitacao/2025/12/23/73213-marcelo-rebelo-de-sousa-valida-oe2026-e-valoriza-contributo-parlamentar",
    "snippet": "O Presidente da República promulgou esta segunda-feira, dia 22 de dezembro de <strong>2025</strong> o Orçamento do Estado para 2026 (OE2026), salientando a contribuição do parlamento “para a estabilidade financeira interna e externa” e considerando que ...",
    "published": "4 hours ago"
  },
  {
    "title": "Rebelo de Sousa cancels state visit to Spain, scheduled for next week, due to health problems",
    "url": "https://thediplomatinspain.com/en/2025/12/05/rebelo-de-sousa-cancels-state-visit-to-spain-scheduled-for-next-week-due-to-health-problems/",
    "snippet": "Rebelo de Sousa was discharged two days later, but doctors estimate that <strong>his recovery could take approximately two weeks</strong>. For this reason, Marcelo Rebelo de Sousa’s state visit to Spain, scheduled for December 11-13, has been postponed, and ...",
    "published": "3 weeks ago"
  },
  {
    "title": "“Unstoppable” President leaves hospital following hernia surgery",
    "url": "https://www.portugalresident.com/unstoppable-president-leaves-hospital-following-hernia-surgery",
    "snippet": "Speaking to journalists before he left hospital today, Marcelo conceded that <strong>this was his 4th operation for a hernia of this kind</strong> – and this way he was aware of what might have been wrong when he began feeling unwell after a packed schedule ...",
    "published": "3 weeks ago"
  }
]