[
  {
    "title": "Dirk Helbing - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Dirk_Helbing",
    "snippet": "Dirk Helbing (born January 19, 1965) is <strong>Professor of Computational Social Science at the Department of Humanities, Social and Political Sciences of ETH Zurich and affiliate of its Computer Science Department</strong>. Dirk Helbing studied physics and mathematics at the University of Göttingen.",
    "published": "1 week ago"
  },
  {
    "title": "Amazon.com: Dirk Helbing: books, biography, latest update",
    "url": "https://www.amazon.com/Dirk-Helbing/e/B001JP12P2",
    "snippet": "In 2014, he received an honorary PhD from Delft University of Technology (TU Delft), where he led the PhD school in “Engineering Social Technologies for a Responsible Digital Future”. Dirk Helbing <strong>started as a physicist</strong>.",
    "published": null
  },
  {
    "title": "Dirk Helbing",
    "url": "https://www.edx.org/bio/dirk-helbing",
    "snippet": "Dirk Helbing is <strong>Professor of Computational Social Science at the Department of Humanities, Social and Political Sciences and affiliate of the Computer Science Department at ETH Zurich</strong>. He earned a PhD in physics and was Managing Director of the Institute of Transport &amp; Economics at Dresden ...",
    "published": null
  },
  {
    "title": "Prof.dr. Dirk Helbing",
    "url": "https://www.tudelft.nl/en/tpm/research/projects/engineering-social-technologies-for-a-responsible-digital-future/profdr-dirk-helbing/",
    "snippet": "Dirk Helbing <strong>started as a physicist</strong>. With his diploma thesis, he initiated the area of pedestrian, crowd, and evacuation modeling and simulation. During his PhD and habilitation in physics, he helped to establish the fields of socio-, econo- ...",
    "published": null
  },
  {
    "title": "Prof. Dirk Helbing – Computational Social Science | ETH Zurich",
    "url": "https://coss.ethz.ch/people/helbing.html",
    "snippet": "Computational Social Science Stampfenbachstrasse 48 8092 Zürich Switzerland",
    "published": null
  }
]