[
  {
    "title": "Josep Borrell begins his term as President of CIDOB | CIDOB",
    "url": "https://www.cidob.org/en/news/josep-borrell-begins-his-term-president-cidob",
    "snippet": "Following his appointment by the institution’s Board on 13 December, <strong>the former head of European diplomacy has begun his agenda as President of CIDOB</strong>, a leading think tank in international relations based in Barcelona. In his first hours as President of the institution, Josep Borrell has ...",
    "published": null
  },
  {
    "title": "The Board of CIDOB proposes Josep Borrell for the presidency of the institution | CIDOB",
    "url": "https://www.cidob.org/en/news/board-cidob-proposes-josep-borrell-presidency-institution",
    "snippet": "<strong>Josep Borrell will take office soon, once the necessary administrative formalities have been completed</strong>.",
    "published": null
  },
  {
    "title": "Josep Borrell será el nuevo presidente del CIDOB | CIDOB,",
    "url": "https://www.cidob.org/cidob-en-medios/josep-borrell-sera-el-nuevo-presidente-del-cidob",
    "snippet": "<strong>El veterano político Josep Borrell se pondrá al frente del CIDOB</strong>, el &#x27;think tank&#x27; con sede en Barcelona dedicado a la investigación en el ámbito de las rel",
    "published": null
  },
  {
    "title": "Josep Borrell | CIDOB",
    "url": "https://www.cidob.org/en/expertos/josep-borrell",
    "snippet": "<strong>President of CIDOB (Barcelona Centre for International Affairs).</strong> From 2019 to 2024 he served as the High Representative of the Union for Foreign Affairs an",
    "published": null
  },
  {
    "title": "Josep Borrell presidirá el Cidob, la puerta de Barcelona al mundo | CIDOB",
    "url": "https://www.cidob.org/en/cidob-media/josep-borrell-presidira-el-cidob-la-puerta-de-barcelona-al-mundo",
    "snippet": "<strong>Josep Borrell, exjefe de la diplomacia y la seguridad europeas, será el nuevo presidente del Cidob</strong>, uno de los think tanks mejor valorados del mundo en el ámbito de las relaciones internacionales. Así lo decidió el patronato, encabezado por la Generalitat, el Ayuntamiento de Barcelona, ...",
    "published": null
  }
]