[
  {
    "title": "New Trafford Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_Trafford_Stadium",
    "snippet": "<strong>New Trafford Stadium</strong> is the name given by the architects Foster + Partners to a potential new stadium for Manchester United that would replace Old Trafford, their home stadium since 1910. In 2025 the club announced plans designed by Foster + Partners for a 100,000-seater stadium under a canopy.",
    "published": "6 days ago"
  },
  {
    "title": "Old Trafford - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Old_Trafford",
    "snippet": "<strong>Old Trafford</strong> (/ˈtræfərd/) is a football stadium in <strong>Old Trafford</strong>, Greater Manchester, England, and is the home of Manchester United. With a capacity of 74,197, it is the largest club football stadium (and second-largest football stadium overall after Wembley Stadium) in the United Kingdom, ...",
    "published": "1 day ago"
  },
  {
    "title": "Stadium | Manchester United",
    "url": "https://www.manutd.com/en/stadium",
    "snippet": "MUST-SEE | Take a look at these exclusive visuals for a new, world-class, 100,000-capacity stadium at <strong>Old Trafford</strong>... ... Sir Jim Ratcliffe, co-owner of Manchester United, said: “Today marks the start of an incredibly exciting journey.&quot;",
    "published": null
  },
  {
    "title": "Designs for Old Trafford Stadium District revealed | Foster + Partners",
    "url": "https://www.fosterandpartners.com/news/designs-for-old-trafford-stadium-district-revealed",
    "snippet": "Sir Jim Ratcliffe, Co-owner of Manchester United, said: “Today marks the start of an incredibly exciting journey to the delivery of what will be the world’s greatest football stadiums, at the centre of a regenerated <strong>Old Trafford</strong>.",
    "published": null
  },
  {
    "title": "Man Utd’s New Record-Breaking Stadium Given Official Timeline",
    "url": "https://www.si.com/soccer/man-utd-new-record-breaking-stadium-official-timeline",
    "snippet": "The revamped version of <strong>Old Trafford</strong>, pleasingly dubbed ‘New Trafford,’ was one of 22 venues included in the list of stadiums put forward by Britain’s joint bid for the major tournament this week.",
    "published": "4 weeks ago"
  }
]