[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a <strong>British evolutionary biologist, zoologist, science communicator and author</strong>. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and ...",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and doctorate degrees in zoology in 1966 at the University of Oxford under famed ethologist Nikolaas Tinbergen (who was best known for his work with both instinctive and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley.",
    "published": "July 15, 2009"
  },
  {
    "title": "Professor Richard Dawkins FRS",
    "url": "https://royalsociety.org/people/richard-dawkins-11316/",
    "snippet": "Richard is <strong>a prominent scientist, having published bestselling books on genetics and evolution, including The Selfish Gene (1976), The Blind Watchmaker (1986)</strong> — with the latter winning a number of awards.",
    "published": null
  },
  {
    "title": "Richard Dawkins: A Biography | Discovery Institute",
    "url": "https://www.discovery.org/a/10291/",
    "snippet": "The most readily recognizable figure in the Darwin debate, Dawkins <strong>retired in 2008 as Professor for Public Understanding of Science at Oxford University</strong>, a position he held from 1995, by which time he had effectively discontinued his career ...",
    "published": "October 15, 2024"
  },
  {
    "title": "Richard Dawkins | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/richard-dawkins",
    "snippet": "Richard Dawkins is a <strong>prominent evolutionary biologist and science writer</strong>, known for his influential work in neo-Darwinian theory and his advocacy for atheism. Born in 1941 in Nairobi, Kenya, he was educated at Balliol College, University of ...",
    "published": null
  }
]