[
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/mike-downey-downey-ink-berlin-slate-1236306279/",
    "snippet": "Producer Mike Downey, who is <strong>chair of the European Film Academy</strong> and whose co-production “Girls on Wire” is in Berlin competition, has unveiled a diverse slate of films from his production company Downey Ink at the European Film Market.",
    "published": "February 16, 2025"
  },
  {
    "title": "Meet the new Board - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/european-film-academy-new-board/",
    "snippet": "Three incumbent Board members who put themselves forward for a new mandate, have been re-elected. <strong>Mike Downey (Ireland/UK) will continue as Chair of the Board</strong>, with Joanna Szymańska (Poland) now joining ...",
    "published": "May 13, 2024"
  },
  {
    "title": "Mike Downey • Producer and chairman of the European Film Academy - Cineuropa",
    "url": "https://cineuropa.org/en/interview/440528/",
    "snippet": "Mike Downey OBE is a producer and the <strong>chairman of the European Film Academy</strong>, as well as being one of the founding board members of the International Coalition for Filmmakers at Risk (ICFR).",
    "published": null
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "Solomon has served on the Academy board for six years as deputy chair herself alongside outgoing chair Mike Downey, and was a regular board member before.",
    "published": "2 weeks ago"
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) - IMDb",
    "url": "https://www.imdb.com/news/ni65127703/",
    "snippet": "Producer Mike Downey, who is <strong>chair of the European Film Academy</strong> and whose co-production “Girls on Wire” is in Berlin competition, has unveiled a diverse slate of films from his production company Downey Ink at the European Film Market.",
    "published": null
  }
]