[
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "In July 2024 Jennifer was appointed as a <strong>Special Advisor to KPMG</strong>.",
    "published": null
  },
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Jennifer Westacott AC is an <strong>Australian business executive</strong>. She served as the chief executive of the Business Council of Australia (BCA) from 2011 to 2023.",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "Jennifer is a National Fellow of the Institute of Public Administration Australia and a Fellow of the Australian Institute of Company Directors, and since 2013 has been a <strong>Non-Executive Director of Wesfarmers Limited and Chair of the Mental Health Council of Australia</strong>.",
    "published": null
  },
  {
    "title": "The boss of the Business Council defies the stereotype of the blue-blooded big shot",
    "url": "https://www.smh.com.au/politics/federal/the-boss-of-the-business-council-defies-the-stereotype-of-the-blue-blooded-big-shot-20180322-p4z5l6.html",
    "snippet": "Craig Knowles, a Carr government ... with Westacott, says his former departmental secretary shared little about her personal background but worked hard. And made enemies. &quot;She had a great strategic mind,&quot; says Knowles. &quot;The problem I think for Jennifer was she probably bruised a few people along the way. She had a job to do and prosecuted it with excellence and that maybe affected the status ...",
    "published": "March 24, 2018"
  },
  {
    "title": "Jennifer Westacott AC - KPMG Australia | LinkedIn",
    "url": "https://www.linkedin.com/in/jennifer-westacott-ac-9aa853146/",
    "snippet": "We had a full house of industry leaders who heard from Secretary Department of Planning and Environment Kiersten Fishburn, WPCA Chair Jennifer Westacott AO, Acting CEO Anne Skewes and our expert panellists on key directions for the Aerotropolis to inform the future of the Western Parkland City.",
    "published": "November 17, 2021"
  }
]