[
  {
    "title": "Death and funeral of Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Death_and_funeral_of_Alexei_Navalny",
    "snippet": "United States: President Joe Biden praised Navalny&#x27;s legacy, saying he &quot;was everything Putin is not. He was brave, he was principled, he was dedicated to building a Russia where rule of law existed and where it applied to everybody&quot;, and, stating that he held Putin responsible, added that he was &quot;both not surprised and outraged&quot; by reports of Navalny&#x27;s death in prison.",
    "published": "3 weeks ago"
  },
  {
    "title": "Alexei Navalny’s death and legacy | Penn Today",
    "url": "https://penntoday.upenn.edu/news/alexei-navalnys-death-and-legacy",
    "snippet": "Penn Today reached out to three University experts on Russian politics for their perspectives on what Navalny’s death means for the opposition movement, for Putin’s grip on power, and for Russia going forward. Last week, Vladimir Putin snuffed out the last remaining flicker of hope for democratic change in Russia with Alexei Navalny’s death at a prison camp in Siberia. That is not to say, of course, that Navalny, or anyone else for that matter, could have defeated Putin in the forthcoming March “elections.” But Navalny represented—both for those of us looking at Russia from the outside and for the many Russians who still quietly resist Putin’s despotic rule—the hope of a very different Russia, the hope for a country committed to the basic norms of rights and democracy.",
    "published": null
  },
  {
    "title": "Why Alexei Navalny’s legacy after news of his death is ‘one of tragedy’ for Russians | PBS News",
    "url": "https://www.pbs.org/newshour/show/why-alexei-navalnys-legacy-after-news-of-his-death-is-one-of-tragedy-for-russians",
    "snippet": "Russia&#x27;s leader has stayed in power for nearly a quarter-century by, in Russian terms (Speaking in foreign language) which means lack of alternatives. So Vladimir Putin and his political team have cleared the landscape of any serious political opponent, save Navalny.",
    "published": "February 17, 2024"
  },
  {
    "title": "The Power of Memory: Thinking of Alexei Navalny’s Political Legacy | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/power-memory-thinking-alexei-navalnys-political-legacy",
    "snippet": "One year after Alexei Navalny’s death, the Russian opposition in exile is in deep crisis. Many in the democratic movement are engaged in painful soul-searching. Is his legacy now wasted in fruitless internal disputes? What should those who remember him do to safeguard his memory and his mission?",
    "published": null
  },
  {
    "title": "Opinion: One year on from Alexei Navalny’s death, what will his legacy be for Russia?",
    "url": "https://www.ucl.ac.uk/news/2025/feb/opinion-one-year-alexei-navalnys-death-what-will-his-legacy-be-russia",
    "snippet": "While he was alive, Navalny stood ... his death, his lasting legacy in Russia remains <strong>the ability for some to think – if only in private – of other possible Russias</strong>....",
    "published": "September 17, 2025"
  }
]