[
  {
    "title": "Steffen Baumgart is Union's New Head Coach | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/steffen-baumgart-is-unions-new-head-coach-SmIvQK",
    "snippet": "Baumgart&#x27;s professional path is ... on Thursday, 2 January 2025. Two long-standing Union players, <strong>co-trainer Sebastian Bönig and match analyst Adrian Wittmann</strong>, are returning to the coaching team....",
    "published": null
  },
  {
    "title": "How Union's co-coaching team collaborates | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/how-unions-co-coaching-team-collaborates-CvSQEZ",
    "snippet": "Four assistant coaches accompany the daily work – with different tasks, characters, and competencies, but with a common goal: to develop the team further. <strong>Danilo de Souza, Kevin McKenna, Sebastian Bönig, and Adrian Wittmann</strong> form the extended ...",
    "published": null
  },
  {
    "title": "1.FC Union Berlin - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.us/1-fc-union-berlin/mitarbeiterhistorie/verein/89",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along. Under &quot;Position&quot;, you can select a specific role from the drop-down menu. 2025-01-022024-07-012024-05-062023-11-272023-11-152018-07-012017-12-05...",
    "published": null
  },
  {
    "title": "1. FC Union Berlin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/1._FC_Union_Berlin",
    "snippet": "In the 2022–23 season, Union Berlin qualified for the Champions League group stage for the first time in its history, after a 1–0 home win against Werder Bremen on the final matchday. In the 2023–24 season, the club experienced a bad start including 14 winless competitive matches in a row, hence they decided to separate with coach Urs Fischer by &quot;mutual agreement&quot;.",
    "published": "3 weeks ago"
  },
  {
    "title": "1.FC Union Berlin - Staff | Transfermarkt",
    "url": "https://www.transfermarkt.us/1-fc-union-berlin/mitarbeiter/verein/89",
    "snippet": "Trainer, Manager und Co.: Diese Statistik listet alle Mitarbeiter, gegliedert nach ihrer Funktion, von dem Verein Union Berlin auf, die aktuell für den Verein arbeiten.",
    "published": null
  }
]