[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "Prabowo Subianto’s decision to appoint <strong>Purbaya Yudhi Sadewa</strong> as Minister of Finance on 8 September 2025 signaled a change in economic policymaking, a departure from the fiscal-orthodoxy of his predecessor Sri Mulyani Indrawati.",
    "published": "1 day ago"
  },
  {
    "title": "Titiek Suharto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Titiek_Suharto",
    "snippet": "In May 1983, <strong>Titiek</strong> married Prabowo Subianto, who was then a senior officer in the Indonesian Army&#x27;s Kopassandha.",
    "published": "3 days ago"
  },
  {
    "title": "Indonesia's first ladies have always been influential, but soon the country won't have one - ABC News",
    "url": "https://www.abc.net.au/news/2024-05-05/role-first-lady-indonesia-election-prabowo-subianto/103787902",
    "snippet": "In a country that in many ways strongly holds onto its traditional values, Mr Subianto&#x27;s lack of a partner was considered an issue ahead of the February election. Prabowo Subianto was married to <strong>Siti Hediati Hariyadi</strong>, daughter of then-president ...",
    "published": "May 4, 2024"
  },
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "Prabowo is the third of four children born to Sumitro Djojohadikusumo, a Javanese economist, and Dora Marie Sigar, a Minahasan woman from Langowan, North Sulawesi. The family was well-off: Prabowo’s grandfather was the cofounder of Bank Negara Indonesia (now BNI), and, at the time of Prabowo’s birth, Sumitro had just finished serving a term as minister of trade and industry for the country’s president, Sukarno.",
    "published": "December 9, 2024"
  },
  {
    "title": "Crowd Roars as Prabowo Welcomes Former Wife Titiek Soeharto during Final Rally",
    "url": "https://jakartaglobe.id/news/crowd-roars-as-prabowo-welcomes-former-wife-titiek-soeharto-during-final-rally",
    "snippet": "Presidential candidate Prabowo Subianto paused for a moment, allowing the crowd to roar as he welcomed his former wife, <strong>Siti Hediati Hariyadi</strong>, more popularly known as Titiek Soeharto, during the final campaign rally at Bung Karno Stadium in ...",
    "published": "February 10, 2024"
  }
]