[
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "After Indira Gandhi&#x27;s assassination, her son Rajiv Gandhi took charge until 1989, when a decade with five unstable governments began. This was followed by the full terms of P. V. Narasimha Rao, Atal Bihari Vajpayee, Manmohan Singh, and <strong>Narendra Modi</strong>, who is the current prime minister of India, ...",
    "published": "3 days ago"
  },
  {
    "title": "List of all Prime Ministers of India (1947-2025) | India PM List",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1",
    "snippet": "List of all Prime Ministers of India till 2025: <strong>Narendra Modi</strong> is the current and 14th Prime Minister of India who assumed office on 10 June 2024. Jawaharlal Nehru is the first and the longest-serving Prime Minister of India while Indira Gandhi ...",
    "published": "August 22, 2025"
  },
  {
    "title": "Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/",
    "snippet": "16 Dec, 2025 · The Prime Minister, <strong>Shri Narendra Modi</strong> on Vijay Diwas, remembered the brave soldiers whose courage and sacrifice ensured India had a historic victory in 1971. View More · Photo Gallery · Quotes · Videos · PM&#x27;s Speeches · Our Mantra should be: ‘Beta Beti, Ek Samaan’ ...",
    "published": "6 hours ago"
  },
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "Following a terrorist attack in Indian-administered Jammu and Kashmir, Modi presided over the 2025 India–Pakistan conflict, which resulted in a ceasefire. Under Modi&#x27;s tenure, India has experienced democratic backsliding and has shifted towards an authoritarian style of government, with a cult of personality centred around him. As prime minister, he has received consistently high approval ratings within India.",
    "published": "2 days ago"
  },
  {
    "title": "Know the PM | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/pms-profile/",
    "snippet": "The unprecedented third term underscores <strong>Shri Modi</strong>’s enduring appeal and the trust placed in him by millions of Indians to lead the nation towards greater prosperity and stability. The first ever Prime Minister to be born after Independence, <strong>Shri Modi</strong> has previously served as the Prime Minister ...",
    "published": "3 weeks ago"
  }
]