[
  {
    "title": "2025 Chilean general election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Chilean_general_election",
    "snippet": "Voters went to the polls to elect the 38th President of Chile, renew all 155 seats in the Chamber of Deputies, and fill 23 of the 50 seats in the Senate. <strong>Republican Party candidate José Antonio Kast defeated Communist Party member Jeannette Jara in a runoff election on 14 December</strong>.",
    "published": "3 hours ago"
  },
  {
    "title": "Conservative Kast's victory in Chile suggests a hard-right, pro-Trump surge across Latin America - The Washington Post",
    "url": "https://www.washingtonpost.com/world/2025/12/15/election-chile-kast-jara-boric-trump/225ad3b6-da04-11f0-b484-4459fa8e79e5_story.html",
    "snippet": "<strong>Chile has become the latest country in Latin America to veer toward the right</strong>, electing a deeply conservative veteran politician who has long attracted comparisons to Donald Trump · December 15, 2025 at 5:19 p.m. ESTYesterday at 5:19 p.m.",
    "published": "20 hours ago"
  },
  {
    "title": "Chile ahead of the 2025 elections: Will the political pendulum swing from the left to the far right? | Think Tank | European Parliament",
    "url": "https://www.europarl.europa.eu/thinktank/en/document/EPRS_BRI(2025)779176",
    "snippet": "Chile will hold presidential and congressional elections on 16 November 2025, with <strong>a possible runoff between the two best placed presidential candidates on 14 December</strong>, if no candidate secures the absolute majority in the first round.",
    "published": null
  },
  {
    "title": "Far-right José Antonio Kast favored to win as Chile votes in presidential runoff | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/14/chile-presidential-election",
    "snippet": "For that reason, and given recent polling, Kast – the son of a Nazi party member, an admirer of the dictator Augusto Pinochet and a staunch Catholic known for his opposition to abortion and same-sex marriage – is widely expected to rule Chile for the next four years. One novelty in this election, however, has led analysts to urge caution in calling his victory: for the first time in more than a decade, voting is once again compulsory. In past elections, about a third of the country’s 15 million voters did not usually take part. “These 5 million people are more distrustful of politics,” said Claudia Heiss, a political scientist at the Universidad de Chile, who argued that in November’s first round, this “new” electorate was attracted by rightwing populist promises and voted against the ruling coalition.",
    "published": "1 day ago"
  },
  {
    "title": "Chile elects Kast as president in sharp rightward shift | Reuters",
    "url": "https://www.reuters.com/world/americas/chile-votes-presidential-race-expected-lurch-country-right-2025-12-14/",
    "snippet": "SANTIAGO, Dec 14 (Reuters) - <strong>Jose Antonio Kast won Chile&#x27;s presidential election</strong> on Sunday, leveraging voter fears over rising crime and migration to steer the country in its sharpest rightward shift since the end of the military dictatorship ...",
    "published": "1 day ago"
  }
]