[
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "He is now Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations at Harvard John F. Kennedy School of Government, Harvard University. Burns has had a <strong>25-year career in the State Department and has served as under secretary of state for political affairs</strong>.",
    "published": "September 26, 2025"
  },
  {
    "title": "Nicholas Burns | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty/nicholas-burns",
    "snippet": "Burns was the <strong>Ambassador to Greece (1997-2001) and State Department Spokesman (1995-1997).</strong> He worked for five years (1990–1995) on the National Security Council at the White House at the end of the Cold War where he was Senior Director for ...",
    "published": null
  },
  {
    "title": "R. Nicholas Burns - Former Under Secretary of State for Political Affairs",
    "url": "https://georgewbush-whitehouse.archives.gov/government/nburns-bio.html",
    "snippet": "Mr. Burns, a career Senior Foreign Service Officer, <strong>served for five years (1990-1995) on the National Security Council staff at the White House</strong>. He was Special Assistant to President Clinton and Senior Director for Russia, Ukraine, and Eurasia Affairs. He had lead responsibility in the White ...",
    "published": null
  },
  {
    "title": "Biography: Amb. R. Nicholas Burns",
    "url": "https://1997-2001.state.gov/about_state/biography/burns.html",
    "snippet": "He was <strong>Special Assistant to the Counselor of the Department of State from 1989-1990</strong>, responsible for Soviet and Eastern European Affairs. He was a member of the Department&#x27;s Transition Team in 1988, and served as Staff Officer in the Department&#x27;s Operations Center and Secretariat in 1987-1988.",
    "published": null
  },
  {
    "title": "Nicholas Burns | The Belfer Center for Science and International Affairs",
    "url": "https://www.belfercenter.org/person/nicholas-burns",
    "snippet": "Burns <strong>worked in the United States government for over three decades, serving six presidents and nine secretaries of state</strong>. As a career Foreign Service Officer, he was Under Secretary of State for Political Affairs from 2005 to 2008; the State ...",
    "published": null
  }
]