[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She and Paris Saint-Germain lost 5–2 on aggregate to Juventus in the 2024–25 UEFA Women&#x27;s Champions League qualifying rounds. On 12 November 2025, Earps returned to <strong>Manchester United</strong> in the Champions League for the first time since her move, where they lost 2-1.",
    "published": "1 month ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in 2024, Mary took on a new challenge by joining French giants <strong>Paris Saint-Germain</strong>. Earps called time on her spell with the Lionesses in May 2025, after collecting a total of 53 caps.",
    "published": null
  },
  {
    "title": "Mary Earps details emerge after Lionesses legend snubbed invite from FA following retirement announcement",
    "url": "https://www.gbnews.com/sport/football/mary-earps-snubs-fa-invite",
    "snippet": "Earps currently plays her club football for <strong>Paris Saint-Germain</strong>.",
    "published": "October 29, 2025"
  },
  {
    "title": "Women's EURO champion Mary Earps announces retirement from international football",
    "url": "https://www.olympics.com/en/news/womens-euro-champion-mary-earps-announces-international-retirement",
    "snippet": "The 32-year-old, who plays her club football in France for <strong>Paris Saint-Germain</strong>, was named goalkeeper of the tournament at both the UEFA Women&#x27;s EURO 2022 tournament, which England won on home soil, as well as the 2023 FIFA Women&#x27;s World Cup, ...",
    "published": "July 24, 2025"
  },
  {
    "title": "England goalkeeper Mary Earps retires ahead of 2025 Euros in shock announcement",
    "url": "https://www.thepinknews.com/2025/05/27/england-footballer-mary-earps-retired/",
    "snippet": "Although she is retiring from international football, Mary Earps will still play club football, after joining <strong>Paris Saint-Germain</strong> from Manchester United last year. The UEFA Women’s Euro 2025 tournament will be played in Switzerland from 2 ...",
    "published": "May 27, 2025"
  }
]