[
  {
    "title": "Manchester United W.F.C. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manchester_United_W.F.C.",
    "snippet": "United were to play their fixtures at <strong>Leigh Sports Village</strong> until this was completed, however the stadium has become the club&#x27;s official home ground as the return to The Cliff never materialised. Moss Lane served as a backup venue, during the teams early years, when <strong>Leigh Sports Village</strong> is ...",
    "published": "2 days ago"
  },
  {
    "title": "Leigh Sports Village - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Leigh_Sports_Village",
    "snippet": "<strong>Leigh Sports Village</strong> is a multi-use sports, retail and housing development in Leigh, Greater Manchester, England. The centrepiece of the development is a 12,000-capacity stadium which is home to professional rugby league team Leigh Leopards, the Manchester United Women&#x27;s senior team, and Manchester ...",
    "published": "September 5, 2025"
  },
  {
    "title": "Leigh Sports Village Venue Hire | Manchester United WFC Stadium",
    "url": "https://stadiumexperience.com/clubs/manchester-united-women-football-club/",
    "snippet": "<strong>Leigh Sports Village</strong> is proud to be the home of Manchester United Women FC, competing in the Barclays Women’s Super League and The FA Women’s Continental Cup.",
    "published": "August 7, 2025"
  },
  {
    "title": "The Progress With Unity Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Progress_With_Unity_Stadium",
    "snippet": "<strong>The Progress With Unity Stadium</strong> is a multi-use sports, retail and housing development in Leigh, Greater Manchester, England. The centrepiece of the development is a 12,000-capacity stadium which is home to professional rugby league team Leigh ...",
    "published": "1 week ago"
  },
  {
    "title": "Progress with Unity! Man Utd Women set for stadium name change with immediate effect as local council launches new initiative | Goal.com",
    "url": "https://www.goal.com/en/lists/progress-with-unity-man-utd-stadium-name-change-immediate-effect-local-council-new-initiative/blt2df5c0e6c07a63b9",
    "snippet": "Marc Skinner&#x27;s Manchester United will continue to use the Progress With <strong>Unity Stadium</strong> as their primary home ground, alongside occasional fixtures at Old Trafford. The venue will also keep serving rugby and grassroots events, ensuring it remains ...",
    "published": "September 25, 2025"
  }
]