[
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "Under Kast’s leadership, “we are confident Chile will advance shared priorities to include strengthening public security, ending illegal immigration, and revitalising our commercial relationship,” Rubio said in a statement.",
    "published": "13 hours ago"
  },
  {
    "title": "2025 Chilean general election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Chilean_general_election",
    "snippet": "General elections were held in Chile on 16 November 2025. Voters went to the polls to elect the 38th President of Chile, renew all 155 seats in the Chamber of Deputies, and fill 23 of the 50 seats in the Senate.",
    "published": "3 hours ago"
  },
  {
    "title": "Who is Jose Antonio Kast, Chile’s newly elected far-right leader? | Elections News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/12/15/who-is-jose-antonio-kast-chiles-newly-elected-far-right-leader",
    "snippet": "Presidential candidate <strong>Jose Antonio Kast</strong>, of the Republican Party of Chile, gives a speech as he celebrates the results of the presidential run-off election in Santiago on December 14, 2025 [AFP]",
    "published": "1 day ago"
  },
  {
    "title": "Chile’s new far-right head is latest Latin American leader to ride hardline wave to power | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-chile-election-analysis",
    "snippet": "<strong>José Antonio Kast</strong>’s victory in Chile’s presidential election has been widely praised by leaders of the global right, with congratulations coming from the US secretary of state Marco Rubio, Hungary’s Viktor Orbán, Italy’s Giorgia Meloni, ...",
    "published": "1 day ago"
  },
  {
    "title": "Kast’s Victory in Chile Is Another Win for Global Right-Wing Movement - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/americas/chile-kast-right-wing-movement.html",
    "snippet": "This Sunday, he finally did. Mr. Kast was elected as Chile’s president on his third try, scoring a resounding victory against his leftist opponent and pushing the country decidedly to the right as Chileans sought iron-fisted solutions to increased violence and illegal immigration.",
    "published": "19 hours ago"
  }
]