[
  {
    "title": "Alexander Van der Bellen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_Van_der_Bellen",
    "snippet": "Despite the far-right Freedom Party ... Party. After the Nehammer-led coalition talks collapsed, however, Van der Bellen reversed course and asked <strong>Herbert Kickl</strong> to attempt to form a coalition government with the People&#x27;s Party on 5 January 2025....",
    "published": "5 days ago"
  },
  {
    "title": "President of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Austria",
    "snippet": "However, the Social Democratic Worker&#x27;s Party, fearing that such a president would become a &quot;substitute emperor&quot;, favored reverting to a parliamentary presidium acting as collective head of state. In the end, the framers of the Constitution opted for a compromise, creating a presidency that was separate from the legislature but lacked even nominal power. On 1 October, the Federal Constitutional Law, the centerpiece of the new Constitution, was ratified by the National Assembly and on 10 November, it became effective, making Seitz president of Austria in all but name.",
    "published": "2 weeks ago"
  },
  {
    "title": "Austrian Federal President Alexander Van der Bellen",
    "url": "https://www.bundespraesident.at/en/index",
    "snippet": "The Federal President is at the service of all Austrian citizens. He is the only state representative on the federal level to be elected directly by the citizens. This places the President in a strong position within the constitutional framework, as he is backed by a majority of the electorate. As the Head of State of the Republic, the Federal President has extensive, clearly defined powers:",
    "published": null
  },
  {
    "title": "Federal Ministers and State Secretaries - Federal Chancellery of Austria",
    "url": "https://www.bundeskanzleramt.gv.at/en/federal-chancellery/the-austrian-federal-government/ministers.html",
    "snippet": "State Secretary in the Federal Ministry of the Interior ... Duties and designations of the Federal Ministries are established on the basis of the Amended Ministerial Law, last updated on 18 March 2025.",
    "published": null
  },
  {
    "title": "The Federal President of the Republic of Austria — Austria in USA",
    "url": "https://www.austria.org/the-federal-president",
    "snippet": "He was a member of the National Council (the Austrian House of Representatives) from 1994 to 2012, and a member of the Vienna State Parliament and Vienna City Council from 2012 to 2015. He was appointed a full professor in Economics at the University of Vienna, and served as Deputy Dean and then Dean of the University of Vienna School of Social and Economic Sciences. The Federal President of Austria is the Head of State elected by the Austrian people for a term of six years.",
    "published": null
  }
]