[
  {
    "title": "Petro Poroshenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Petro_Poroshenko",
    "snippet": "In November 2014, he became a People&#x27;s Deputy of Ukraine with 64.04% of votes in constituency No.12. Poroshenko became a grandfather on the day of his presidential inauguration, 7 June 2014. His wife is actively involved in the activities of the Petro Poroshenko Charity Foundation.",
    "published": "1 week ago"
  },
  {
    "title": "Maryna Poroshenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Maryna_Poroshenko",
    "snippet": "<strong>Maryna Anatoliyvna Poroshenko</strong> (Ukrainian: Марина Анатоліївна Порошенко, née Perevedentseva; born 1 February 1962) is a Ukrainian cardiologist who served as First Lady of Ukraine from 2014 to 2019, as wife of President Petro Poroshenko.",
    "published": "November 9, 2025"
  },
  {
    "title": "Petro Poroshenko Biography - Facts, Childhood, Family Life & Achievements",
    "url": "https://www.thefamouspeople.com/profiles/petro-poroshenko-13346.php",
    "snippet": "He was given the Order of Merit by Ukraine, Order of the Republic by Moldova, Order of Civil Merit by Spain, among other titles. ... Petro Poroshenko is married to <strong>Maryna Perevedentseva</strong>, a cardiologist, since 1984.",
    "published": null
  },
  {
    "title": "Petro Poroshenko - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q58077",
    "snippet": "Petro Poroschenko · place of birth ... Oleksii Poroshenko · mother · Yevheniia Poroshenko · 0 references · sibling · <strong>Mykhailo Poroshenko</strong> · 0 references · spouse ·...",
    "published": null
  },
  {
    "title": "Maryna Poroshenko appointed head of Ukrainian Cultural Foundation",
    "url": "https://www.kyivpost.com/post/8160",
    "snippet": "Ukrainian President Petro Poroshenko’s wife, <strong>Maryna Poroshenko</strong>, has been appointed head of the Ukrainian Cultural Foundation, and the organization’s executive director will be selected through a competition, which is to be held from Jan.22 ...",
    "published": "January 19, 2018"
  }
]