[
  {
    "title": "A historical timeline of post-independence Ukraine | PBS News",
    "url": "https://www.pbs.org/newshour/world/a-historical-timeline-of-post-independence-ukraine",
    "snippet": "Adding up to more than 100,000 troops, along with tanks, rocket launchers and other weaponry, analysts call it the largest troop buildup since Russia’s 2014 annexation of Crimea. Biden, now U.S. president, and Putin agree to a June summit to discuss a range of contentious issues, including Ukraine, and launch dialogues on strategic stability and cybersecurity. The following month, Putin publishes an article titled “On the Historical Unity of Russians and Ukrainians,” in which he questions the legitimacy of Ukraine’s borders, asserts that Russians and Ukrainians are “one people,” and blames the collapse in bilateral ties on foreign plots and anti-Russia conspiracies.",
    "published": "March 12, 2025"
  },
  {
    "title": "Ukraine crisis of 2013-14 | Euromaidan, Annexation of Crimea, & War in the Donbas | Britannica",
    "url": "https://www.britannica.com/topic/Ukraine-crisis",
    "snippet": "The Ukraine crisis of 2013-14 encompassed <strong>months of popular protests in Ukraine, the replacement of President Viktor Yanukovych with a pro-Western interim government, the Russian annexation of Crimea, and war in the Donbas</strong>.",
    "published": "August 28, 2014"
  },
  {
    "title": "Modern history of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Modern_history_of_Ukraine",
    "snippet": "In April 2014 <strong>Russian collaborators self-proclaimed the Donetsk People&#x27;s Republic and Luhansk People&#x27;s Republic and held illegal referendums on 11 May 2014</strong>; the collaborators claimed nearly 90% voted in favour of independence. Later in April 2014 fighting between the Ukrainian army and ...",
    "published": "1 week ago"
  },
  {
    "title": "Revolution of Dignity - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Revolution_of_Dignity",
    "snippet": "<strong>The Revolution of Dignity</strong> (Ukrainian: Революція гідності, romanized: Revoliutsiia hidnosti), also known as the Maidan Revolution or the Ukrainian Revolution, took place in Ukraine in February 2014 at the end of the Euromaidan ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Conflict in Ukraine: A timeline (2014 - eve of 2022 invasion) - House of Commons Library",
    "url": "https://commonslibrary.parliament.uk/research-briefings/cbp-9476/",
    "snippet": "This paper provides a timeline of the major events that happened in the conflict in Ukraine from the 2014 annexation of Crimea to the eve of the 2022 Russian invasion. A timeline covering the events since Russia’s invasion of Ukraine in 2022 is available in Commons Library research briefing CBP-9847, Conflict in Ukraine: A timeline (current conflict, 2022-present). In November 2013, the Ukrainian Government of pro-Russian President Viktor Yanukovych decided not to sign a planned Association Agreement with the European Union and demonstrations ensued in the capital Kyiv.",
    "published": "April 12, 2025"
  }
]