[
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "In September 2022, the King resigned from the post of prime minister, handing this role to his son Mohammed. Salman was often a mediator in settling royal conflicts among the extended Al Saud family – estimated at 4,000 princes.",
    "published": "November 3, 2025"
  },
  {
    "title": "King Salman Al-Saud - Genealogy",
    "url": "https://www.geni.com/people/King-Salman-bin-Abdul-Aziz/6000000070154971835",
    "snippet": "King Khalid Bin Abdul Aziz Al Saud, King Fahd Al Saud, Sultan Bin Abdulaziz Al Saud, &lt;Private&gt; Al Saud ... ...hmed Bin Salman Al Saud, &lt;Private&gt; Al Saud, &lt;Private&gt; Al Saud, &lt;Private&gt; Al Saud, &lt;Private&gt; Al Saud, &lt;Private&amp;...",
    "published": null
  },
  {
    "title": "Salman of Saudi Arabia | King, Father, Siblings, & Son | Britannica",
    "url": "https://www.britannica.com/biography/Salman-of-Saudi-Arabia",
    "snippet": "Salman is king of Saudi Arabia (2015– ) and the last of the sons of <strong>Abdulaziz ibn Saud</strong> to rule the country. His son Mohammed bin Salman has assumed many of his father’s duties as head of state and government.",
    "published": "December 14, 2023"
  },
  {
    "title": "House of Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/House_of_Saud",
    "snippet": "The family has had conflicts with the Ottoman Empire, the Sharif of Mecca, the Al Rashid family of Ha&#x27;il and their vassal houses in Najd along with numerous Islamist groups both inside and outside Saudi Arabia and Shia minority in Saudi Arabia. The succession to the Saudi Arabian throne was designed to pass from one son of the first king, Ibn Saud, to another. The monarchy was hereditary by agnatic seniority until 2006, when a royal decree provided that future Saudi kings are to be elected by a committee of Saudi princes. King Salman, who reigns currently, first replaced the next crown prince, his brother Muqrin, with his nephew Muhammad bin Nayef.",
    "published": "1 month ago"
  },
  {
    "title": "Saudi Royal Family Tree – House of Saud",
    "url": "https://houseofsaud.com/saudi-royal-family-tree/",
    "snippet": "The country is ruled by the <strong>Al Saud family</strong>, and its members have held the throne for more than eight decades. The current monarch is King Salman, who took over in 2015 after the death of his half-brother, King Abdullah.",
    "published": null
  }
]