[
  {
    "title": "Stanford",
    "url": "https://hai.stanford.edu/",
    "snippet": "We have a historical opportunity ... a human-centered frameworkfor AI research, education, practice and policy. At HAI, we view the field of AI as spanning the entire university. Unless we tap into the full gamut of disciplinary expertise we cannot hope to realize the potential of the technology while avoiding its pitfalls. ... HAI was established to support innovative AI research that bridges disciplines and fields. The Institute aims to appoint ...",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/company/stanfordhai",
    "snippet": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | 91,795 followers on LinkedIn. Advancing AI research, education, policy, and practice to improve humanity. | At Stanford HAI, our vision for the future is led by our commitment to studying, guiding and developing human-centered AI technologies and applications.",
    "published": null
  },
  {
    "title": "Human-Centered Artifical Intelligence | Stanford Momentum",
    "url": "https://momentum.stanford.edu/initiatives/human-centered-artificial-intelligence",
    "snippet": "Drawing on expertise from faculty across the university, including Stanford’s renowned computer science department, and collaborating closely with industry and government, the institute aims to guide the development of AI systems that are groundbreaking, ethical, and equitable—an AI moonshot to serve and uplift humanity. Stanford HAI’s leaders share a commitment to the mission of guiding human-centered AI.",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/stanford-institute-for-human-centered-artificial-intelligence",
    "snippet": "Stanford HAI, vision for the future is led by our commitment to studying, guiding, and developing human-centered AI technologies and applications. They believe AI should be collaborative, augmentative, and enhancing human productivity and quality of life. Stanford HAI leverages the university’s strength across all disciplines, including business, economics, genomics, law, literature, medicine, neuroscience, philosophy, and more. These complement Stanford&#x27;s tradition of leadership in AI, computer science, engineering, and robotics.",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | Stanford Online",
    "url": "https://online.stanford.edu/schools-centers/stanford-institute-human-centered-artificial-intelligence-hai",
    "snippet": "<strong>Stanford founded the Institute for Human-Centered AI in 2019</strong> to guide and build the future of AI.HAI advances AI research, education, policy and practice to improve the human condition.",
    "published": "October 17, 2024"
  }
]