[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "On March 24, 1999, Regency executive <strong>David Matalon</strong> joined the supervisory board of Puma AG, an international sports company. At the time, Regency Enterprises (the holding company) was the largest single shareholder in Puma, with more than a 25% stake.",
    "published": "4 days ago"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "<strong>Yariv Milchan</strong> (PRODUCER) is the Chairman and CEO of the Academy Award®-winning New Regency Productions where he oversees the day-to-day management, creative direction, and overall growth strategy of the company.",
    "published": null
  },
  {
    "title": "Regency Enterprises Executive Team | Comparably",
    "url": "https://www.comparably.com/companies/regency-enterprises/executive-team",
    "snippet": "<strong>Brad Weston</strong> serves as the CEO / President of Regency Enterprises.",
    "published": null
  },
  {
    "title": "Charles Brown Jr - President at Regency Enterprises Services LLC | LinkedIn",
    "url": "https://www.linkedin.com/in/charles-brown-jr-21207414/",
    "snippet": "Regency Enterprise Services, LLC 2004 - Present Managing Member I am the Managing Member of this sole owner Limited Liability Corporation that is a dynamic General Contractor specializing in event and large gathering organization, logistics and reclamation. This organization has completed full scale projects in St.",
    "published": null
  },
  {
    "title": "Ron Regenstreif: Co-Chairman of the Board at Regency Supply / Founder and Owner",
    "url": "https://www.regencysupply.com/about-regency-supply/leadership-team/ron-regenstreif/",
    "snippet": "<strong>Ron Regenstreif</strong> founded the corporation of Regency Enterprises in February of 1981 and served as CEO of Regency Supply for 35+ years. Through the years, Ron’s primary focus has been on growing the sales and marketing efforts as well as ...",
    "published": "April 20, 2023"
  }
]