[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "In its announcement of its acquisition of FiveThirtyEight, ESPN reported that &quot;Silver will serve as the editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming months. Much like Grantland, which ESPN launched in 2011, the site will retain an independent brand sensibility and editorial point-of-view, while interfacing with other websites in the ESPN and Disney families.",
    "published": "1 month ago"
  },
  {
    "title": "Polling website FiveThirtyEight closes | News | Research live",
    "url": "https://www.research-live.com/article/news/polling-website-fivethirtyeight-closes/id/5136753",
    "snippet": "American political polling news website FiveThirtyEight (538) has <strong>closed down</strong>, with owner The Walt Disney Company rolling it into ABC News.",
    "published": null
  },
  {
    "title": "FiveThirtyEight on Twitter",
    "url": "https://twitter.com/FiveThirtyEight/status/510472699907682304",
    "snippet": "Follow Follow @FiveThirtyEight Following Following @FiveThirtyEight Unfollow Unfollow @FiveThirtyEight Blocked Blocked @FiveThirtyEight Unblock Unblock @FiveThirtyEight Pending Pending follow request from @FiveThirtyEight Cancel Cancel your follow request to @FiveThirtyEight ... Scotland&#x27;s independence referendum is next week. Thousands of votes have already been cast. http://53eig.ht/1tCns3g ... Twitter may be over capacity or experiencing a momentary hiccup. Try again or visit Twitter Status for more information.",
    "published": null
  },
  {
    "title": "Daring Fireball: ABC Shuts Down FiveThirtyEight, and Pulls the Plug on Its Website",
    "url": "https://daringfireball.net/2025/03/abc_shuts_down_fivethirtyeight",
    "snippet": "I’m told he appeared to be reading from a script as he delivered the devastating news. He offered no explanation for why the Disney-owned network had decided to shutter FiveThirtyEight, which it acquired in 2018 along with data whiz and then-editor Nate Silver.",
    "published": null
  },
  {
    "title": "FiveThirtyEight is shutting down completely – FlowingData",
    "url": "https://flowingdata.com/2025/03/05/fivethirtyeight-is-shutting-down-completely",
    "snippet": "As reported, the entire staff of 538 was laid off this morning. This is a severe blow to political data journalism, and I feel for my colleagues. Readers note: As we were instructed not to publish any new content, all planned updates to polls data and averages are canceled indefinitely. Huge loss :( After the layoffs a couple years ago and the shift from the dot com address to an abcnews address, it seemed like this was where FiveThirtyEight was headed, but still.",
    "published": "March 5, 2025"
  }
]