[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Through his social media accounts, Navalny and his team published material about corruption in Russia, organised political demonstrations and promoted his campaigns. In a 2011 interview, he described Russia&#x27;s ruling party—United Russia—as a &quot;party of crooks and thieves&quot;, which became a popular byname.",
    "published": "2 days ago"
  },
  {
    "title": "Russia: Year After Navalny’s Death, Supporters Targeted | Human Rights Watch",
    "url": "https://www.hrw.org/news/2025/02/20/russia-year-after-navalnys-death-supporters-targeted",
    "snippet": "On February 16, 2025, Russian law enforcement officers detained at least 42 people at gatherings commemorating Navalny on the first anniversary of his death in prison. Throughout the year, the authorities have used their extensive arsenal of repressive tools to try to suppress public outcry and erase Navalny’s political legacy...",
    "published": "February 20, 2025"
  },
  {
    "title": "Opinion: One year on from Alexei Navalny’s death, what will his legacy be for Russia?",
    "url": "https://www.ucl.ac.uk/news/2025/feb/opinion-one-year-alexei-navalnys-death-what-will-his-legacy-be-russia",
    "snippet": "While he was alive, Navalny stood for the freer Russia in which he had emerged as a leading opposition figure – and also what he called the “Beautiful Russia of the Future”. Perhaps, after his death, his lasting legacy in Russia remains the ability for some to think – if only in private – of other possible Russias. This article was originally published in The Conversation on 13 February 2025...",
    "published": "September 17, 2025"
  },
  {
    "title": "One year on from his death, Alexei Navalny's legacy is still alive in Russia",
    "url": "https://www.indexoncensorship.org/2025/02/alexei-navalny-death-anniversary-legacy-alive-russia-putin/",
    "snippet": "Women lay flowers in memory of Russian opposition leader Alexei Navalny a year after his death at the Memorial to the Victims of Political Repressions in St. Petersburg. Photo by Andrei Bok / SOPA Images via ZUMA Press Wire · “Dear Alexei, it’s been a year that darkness has fallen upon us – and yet, your ideas and your determination give us strength,” read a letter placed on opposition leader Alexei Navalny’s grave on 16 February 2025, marking the one-year anniversary of his death.",
    "published": "June 27, 2025"
  },
  {
    "title": "What is Alexei Navalny’s legacy for the people of Russia?",
    "url": "https://theconversation.com/what-is-alexei-navalnys-legacy-for-the-people-of-russia-249692",
    "snippet": "Russian law enforcement has also used nebulous anti-extremism and anti-terrorism legislation to crack down on dissenting voices. Three of Navalny’s lawyers were sentenced in January 2025 for participating in an “extremist organisation”, as the ACF was designated by a Moscow court in June 2021.",
    "published": "2 weeks ago"
  }
]