[
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "<strong>Before arriving at Manchester United, Earps spent time playing for hometown club Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg</strong>. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in ...",
    "published": null
  },
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "Earps <strong>made her debut for Manchester United against Manchester City in the FA WSL on 7 September 2019,</strong> a 1–0 loss in the inaugural Manchester derby. She kept her first clean sheet for the club on 28 September 2019 in a 2–0 win over Liverpool, the club&#x27;s first FA WSL victory.",
    "published": "6 hours ago"
  },
  {
    "title": "Mary Earps to depart Man Utd Women | June 2024 | Manchester United",
    "url": "https://www.manutd.com/en/news/detail/mary-earps-to-depart-man-utd-women-june-2024",
    "snippet": "<strong>Mary joined United in 2019 and went on to make a total of 125 appearances in red</strong>, breaking the record for WSL clean sheets in one season and overall, respectively. Last season, Mary made history for United by beating Tottenham 4-0 at Wembley ...",
    "published": "November 18, 2024"
  },
  {
    "title": "Who is Mary Earps? Everything you need to know about the England goalkeeper",
    "url": "https://www.fourfourtwo.com/features/mary-earps-everything-you-need-to-know",
    "snippet": "The goalkeeper <strong>signed for Reading in 2016</strong> and impressed at the club, who played in the English top-flight at the time. In her first season at Reading she made the PFA Team of the Year.",
    "published": "October 18, 2024"
  },
  {
    "title": "Mary Earps transfer: Man Utd and England goalkeeper leaves club and set to join Paris Saint-Germain | Transfer Centre News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13160817/mary-earps-transfer-man-utd-and-england-goalkeeper-leaves-club-and-set-to-join-paris-saint-germain",
    "snippet": "<strong>Earps made 125 appearances for United and helped the club win the Women&#x27;s FA Cup last season</strong>, although their Women&#x27;s Super League campaign was a disappointing one, finishing fifth.",
    "published": "June 29, 2024"
  }
]