[
  {
    "title": "Anne-Marie Slaughter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anne-Marie_Slaughter",
    "snippet": "Anne-Marie Slaughter (born September 27, 1958) is an American <strong>lawyer and political scientist, and author. She is the current president and CEO of New America</strong> (formerly the New America Foundation). Previously, Slaughter served as the dean of Princeton School of Public and International Affairs ...",
    "published": "October 1, 2025"
  },
  {
    "title": "Anne-Marie Slaughter - CEO, New America. Former Harvard Law Professor; Dean of Princeton's School of Public and International Affairs; Director of Policy Planning, U.S. State Department. Patriot, Public Commentator, Mother, Mentor, Feminist. | LinkedIn",
    "url": "https://www.linkedin.com/in/anne-marie-slaughter-74015st/",
    "snippet": "<strong>CEO, New America</strong>. Former Harvard Law Professor; Dean of Princeton&#x27;s School of Public and International Affairs; Director of Policy Planning, U.S. State Department. Patriot, Public Commentator, Mother, Mentor, Feminist.",
    "published": "November 1, 2025"
  },
  {
    "title": "Anne-Marie Slaughter",
    "url": "https://www.newamerica.org/our-people/anne-marie-slaughter/",
    "snippet": "Currently <strong>CEO of the think and action tank New America</strong>, Anne-Marie Slaughter is a global leader, scholar, and public intellectual. She was the J. Sinclair Armstrong Professor of International, Foreign, and Comparative Law at Harvard Law School ...",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter - New America | LinkedIn",
    "url": "https://www.linkedin.com/in/anne-marie-slaughter-52188b23b/",
    "snippet": "* I adapted these to some extent #community #neighborhood #economy #finance #cities #mainstreet Cormac Russell Frances Kraft Sarah Strimmenos Lauren Hall Jennifer Prophete Gordon Strause Kara Revel Jarzynski Sam Pressler Tracy Hadden Loh PlacemakingX Kevin Ervin Kelley, AIA Lory Warren Noah Baskett Dr J.R. Baker Matt Abrams Daniel Selz Daron Babcock Anna Scott John B.",
    "published": "3 weeks ago"
  },
  {
    "title": "Anne-Marie Slaughter - Project Syndicate",
    "url": "https://www.project-syndicate.org/columnist/anne-marie-slaughter",
    "snippet": "Anne-Marie Slaughter, a former director of policy planning in the US State Department, is <strong>CEO of the think tank New America, Professor Emerita of Politics and International Affairs at Princeton University</strong>, and the author of Renewal: From Crisis ...",
    "published": null
  }
]