[
  {
    "title": "Sadyr Japarov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sadyr_Japarov",
    "snippet": "Investigative journalists also identified relatives of the head of state in the Vostokelectro company. Japarov&#x27;s niece Perizat Japarova holds the position of Deputy Head of the Digital Development Department of the Presidential Administration. Since the start of Japarov&#x27;s presidency, Kyrgyzstan has dropped 70 positions in Reporters Without Borders&#x27; freedom of speech rating - from 72nd in 2022 to 144 in 2025.",
    "published": "3 weeks ago"
  },
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "The president of Kyrgyzstan, officially the president of the Kyrgyz Republic, is the head of state and government of the Kyrgyz Republic. The president directs the executive branch of the national government, is the commander-in-chief of the Kyrgyz military and also heads the National Security ...",
    "published": "November 11, 2025"
  },
  {
    "title": "Kyrgyzstan - Politics, Society, Culture | Britannica",
    "url": "https://www.britannica.com/place/Kyrgyzstan/Government-and-society",
    "snippet": "Russia’s President receives a quick music lesson in Kyrgyzstan • Nov. 26, 2025, 4:44 AM ET (CNN) Money laundering networks funding Russia&#x27;s war efforts uncovered in Britain • Nov. 21, 2025, 1:26 AM ET (ABC News (Australia)) Show less · Under the 2021 constitution, the president, who serves as the head of state ...",
    "published": "July 26, 1999"
  },
  {
    "title": "Allies of Kyrgyzstan's president set to win snap parliamentary election | Reuters",
    "url": "https://www.reuters.com/business/media-telecom/allies-kyrgyzstans-president-set-win-snap-parliamentary-election-2025-11-29/",
    "snippet": "A populist and nationalist, Japarov has since 2020 established firm control of Kyrgyzstan, which was traditionally Central Asia’s most democratic country. Victory for his allies would set the stage for a presidential election due in 2027, when Japarov is expected to seek another term. Sign up here. &quot;The current leadership is very motivated to maintain tight control, to prevent any potential sources of destabilisation, which we have seen throughout these five years,&quot; said Emil Juraev, a Kyrgyz political scientist.",
    "published": "3 weeks ago"
  },
  {
    "title": "Kyrgyzstan: Government",
    "url": "https://globaledge.msu.edu/countries/kyrgyzstan/government",
    "snippet": "Kyrgyzstan · Government · Chief of State: <strong>President Sadyr Japarov</strong> · Head of Government: <strong>President Sadyr Japarov</strong> · Government Name: Kyrgyz Republic · Constitution: Adopted: 2010; Introduces a strong parliament to the country, reducing the ...",
    "published": null
  }
]