[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "In her first term, she was appointed to the Banking, Finance, and Urban Affairs Committee as well as the Veterans’ Affairs Committee. During the 1980s, she developed a good working relationship with Speaker Jim Wright, who later appointed her as vice chair of a task force on trade and to the Democratic Steering and Policy Committee. In her fourth term, she gained a position on the Budget Committee and afterwards secured a seat on the Appropriations Committee. In 1987, Kaptur introduced the World War II Memorial Act in the House.",
    "published": "1 week ago"
  },
  {
    "title": "Lecture: Congresswoman Marcy Kaptur, An Urban Planner in Congress | Taubman College of Architecture & Urban Planning",
    "url": "https://taubmancollege.umich.edu/events/2010/04/08/lecture-congresswoman-marcy-kaptur-urban-planner-congress",
    "snippet": "She has risen in seniority and ... to three important subcommittees: <strong>Agriculture, the leading industry in her state; Transportation/Housing and Urban Development (HUD); and Defense</strong>....",
    "published": null
  },
  {
    "title": "Marcy Kaptur - BW Center for Women and Politics in Ohio | Baldwin Wallace University",
    "url": "https://www.bw.edu/centers/women-and-politics-of-ohio/bios/04-kaptur-marcy/",
    "snippet": "Prior Experience: <strong>Urban Planner for the Toledo-Lucas County Plan Commissions from 1969-1975</strong>; Director of Planning for the National Center for Urban Ethnic Affairs from 1975-1977; Domestic Policy Advisor for President Jimmy Carter from 1977-1979 ...",
    "published": null
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "Ursula Academy, she became the ... city and regional planner, primarily in Toledo and Chicago, she accepted an appointment as a <strong>domestic policy advisor to President Jimmy Carter</strong>....",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Kaptur was born in Toledo, Ohio, ... the Toledo-Lucas County Plan Commissions from 1969 to 1975 before becoming <strong>director of planning at the National Center for Urban Ethnic Affairs from 1975 to 1977</strong>....",
    "published": null
  }
]