[
  {
    "title": "Eqtgroup",
    "url": "https://eqtgroup.com/about/history",
    "snippet": "Over the course of Sweden’s modern history, the Wallenberg family has been a main influencer of the country’s industrial, entrepreneurial and banking sphere, partly through its industrial holding company Investor AB, founded in 1916. Inspired by the Wallenberg family’s philosophy of responsible ownership, Conni Jonsson received a mandate from the board of Investor AB to establish EQT in 1994 with the backing from Investor AB, AEA Investors and SEB.",
    "published": null
  },
  {
    "title": "EQT AB - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_AB",
    "snippet": "EQT is owned by the Wallenberg family and Investor AB. Its funds invest in private equity, infrastructure, real estate, growth equity, and venture capital in Europe, North America, Asia Pacific, including Oceania. As of March 2025 the firm and its associates have offices in Amsterdam, Berlin, Copenhagen, Helsinki, Hong Kong, London, Luxembourg, Madrid, Milan, Mumbai, Munich, New York City, Oslo, Paris, San Francisco, Seoul, Shanghai, Singapore, Stockholm, Sydney, Tokyo, and Zurich.",
    "published": "3 weeks ago"
  },
  {
    "title": "EQT Corporation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_Corporation",
    "snippet": "EQT Corporation is an <strong>American</strong> energy company engaged in hydrocarbon exploration and pipeline transport. It is headquartered in EQT Plaza in Pittsburgh, Pennsylvania. EQT is the largest natural gas producer in the Appalachian Basin with 19.802 trillion cubic feet equivalent of proved reserves ...",
    "published": "July 14, 2025"
  },
  {
    "title": "EQT Corporation Profile",
    "url": "https://www.eqt.com/about/corporate-profile",
    "snippet": "EQT Corporation is a premier, vertically integrated <strong>American</strong> natural gas company with production and midstream operations focused in the Appalachian Basin. With operations in Pennsylvania, West Virginia and Ohio, we are dedicated to the development of our world-class asset base.",
    "published": null
  },
  {
    "title": "EQT AB Company Profile - Overview - GlobalData",
    "url": "https://www.globaldata.com/company-profile/eqt-ab/",
    "snippet": "The company operates in Finland, the UK, Spain, Italy, Germany, France, India, Hong Kong, Singapore, the US, Japan, Australia, and others. EQT is headquartered in <strong>Stockholm, Sweden</strong>. Gain a 360-degree view of EQT AB and make more informed decisions for your business Gain a 360-degree view of ...",
    "published": null
  }
]