[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "His honours thesis, a demographic ... Christian Brethren Collection. Morrison contemplated studying theology at Regent College in Vancouver, Canada, but he instead chose to enter the workforce after completing his <strong>undergraduate education</strong>, in part due to the disapproval of his ...",
    "published": "6 days ago"
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "In addition to returning to the theme of border security as he framed his candidacy, Morrison sought the electorate’s endorsement of his stewardship of the economy and threatened that a Labor government’s increased spending on social programs would torpedo Australia’s economic well-being. Morrison’s opposite number with Labor, Bill Shorten, leader of the party since 2013, focused instead on pledges to share the benefits of economic prosperity more widely and to improve education and health care.",
    "published": "August 30, 2018"
  },
  {
    "title": "Scott Morrison: before office | naa.gov.au",
    "url": "https://www.naa.gov.au/explore-collection/australias-prime-ministers/scott-morrison/before-office",
    "snippet": "Scott John Morrison was born on 13 May 1968 in Sydney, New South Wales, to John Morrison, a policeman, and his wife Marion. He was educated at <strong>Sydney Boys High School, then attended the University of New South Wales, where he received an honours degree in applied economic geography</strong>.",
    "published": null
  },
  {
    "title": "Scott Morrison, Professor of Education | Education and Wellness | Elon University",
    "url": "https://www.elon.edu/u/directory/profile/smorrison7/",
    "snippet": "Dr. Morrison spent 11 years as a <strong>6th grade English and social studies teacher in Blowing Rock, North Carolina</strong>. His research focuses on ecologically minded teaching, everyday environmental education, and social media in teacher education (e.g., ...",
    "published": null
  },
  {
    "title": "Scott Morrison - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "Morrison was born in Sydney. He <strong>studied economic geography at University of New South Wales</strong>. Before entering politics, he worked in tourism in Australia and New Zealand. He is married and has two children.",
    "published": "May 14, 2025"
  }
]