[
  {
    "title": "Steffen Baumgart is Union's New Head Coach | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/steffen-baumgart-is-unions-new-head-coach-SmIvQK",
    "snippet": "A year later, Köln finished the Bundesliga season in a safe 11th place before they parted ways in December 2023. This was followed in February by his engagement at Hamburger SV, which ended in November despite their promising position in the promotion race of the current 2. Bundesliga season. Baumgart&#x27;s professional path is now leading him back to the Alte Försterei for the second time, where he will take charge of the men&#x27;s team&#x27;s training for the first time on Thursday, 2 January 2025.",
    "published": null
  },
  {
    "title": "Union Berlin install Steffen Baumgart as new head coach | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/union-berlin-install-steffen-baumgart-as-new-head-coach-30249",
    "snippet": "Union Berlin have turned to their former forward and captain <strong>Steffen Baumgart</strong> to lead the club into the New Year following the dismissal of Bo Svensson.",
    "published": "December 30, 2024"
  },
  {
    "title": "1. FC Union Berlin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/1._FC_Union_Berlin",
    "snippet": "Speaking about the reports on Zingler ... were this big anti-Stasi club. These are stories that get simplified in the media.&quot; On 1 June 2018, Swiss coach <strong>Urs Fischer</strong> was announced as new head coach of the club....",
    "published": "3 weeks ago"
  },
  {
    "title": "Union Berlin - News, Schedule, Scores, Roster, and Stats - The Athletic",
    "url": "https://www.nytimes.com/athletic/football/team/union-berlin/",
    "snippet": "Drewes was struck on the head and was unable to continue the game. The referee ordered both sets of players to the dressing-room and the match was delayed for 28... ... Union Berlin have parted company with head coach <strong>Bo Svensson</strong>.",
    "published": null
  },
  {
    "title": "1. FC Union Berlin » Manager history",
    "url": "https://www.worldfootball.net/teams/1-fc-union-berlin/9/",
    "snippet": "Bochum were handed all three points ... more » ... Union Berlin, on a nine-game winless run, announced Monday they had hired <strong>Steffen Baumgart</strong> as coach after firing Dane Bo Svensson last week.......",
    "published": null
  }
]