[
  {
    "title": "Latest News | Barry Andrews",
    "url": "https://www.fiannafail.ie/news/tag/barry-andrews",
    "snippet": "Barry Andrews MEP <strong>welcomes steps by European Parliament to guarantee the security of the supply of medicines to Northern Ireland</strong>.",
    "published": null
  },
  {
    "title": "Barry Andrews: At the front, it's clear Ireland must continue to support Ukraine",
    "url": "https://www.irishexaminer.com/opinion/commentanalysis/arid-41744664.html",
    "snippet": "If cuts to Ukrainian supports here are necessary, due to the accommodation crisis in Ireland, then we should make up that support in other ways, writes MEP Barry Andrews",
    "published": "1 month ago"
  },
  {
    "title": "Barry Andrews (politician) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Barry_Andrews_(politician)",
    "snippet": "In June 2023, Andrews was the recipient of the Defence, Security and Space Award at The Parliament Magazine&#x27;s annual MEP Awards. Barry Andrews is a member of the Committee on International Development, the Committee on International Trade, the Committee on Women&#x27;s Rights and Gender Equality, the Delegation to the EU-UK Parliamentary Partnership Assembly, the Delegation to the EU-Turkey Joint Parliamentary Assembly and the Delegation for relations with South Africa.",
    "published": "September 29, 2025"
  },
  {
    "title": "Barry Andrews MEP For Dublin – Fianna Fáil Party Member",
    "url": "https://www.barryandrews.ie",
    "snippet": "By focusing on minimising the effects on households through targeted government spending and tax reliefs, <strong>Barry is seeking effective and practical methods to manage issues surrounding the cost-of-living crisis</strong>.",
    "published": null
  },
  {
    "title": "‘We messed up’ – MEP Barry Andrews on Fianna Fáil’s botched presidential election campaign | Irish Independent",
    "url": "https://www.independent.ie/irish-news/we-messed-up-barry-andrews-on-fianna-fails-botched-presidential-election-campaign/a1746385870.html",
    "snippet": "<strong>Barry Andrews has said he has “no regrets” about his decision not to contest the presidential election</strong> and urged Fianna Fáil to he “honest” when it presents an internal party review into its failed campaign.",
    "published": "3 weeks ago"
  }
]