[
  {
    "title": "Konstantinos Tasoulas - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Konstantinos_Tasoulas",
    "snippet": "Konstantinos Tasoulas (Greek: Κωνσταντίνος Τασούλας [konstaˈdinos taˈsulas]; born 17 July 1959) is a Greek politician and lawyer who has served as the president of the Hellenic Republic since <strong>13 March 2025</strong>. He previously served as President of the Hellenic Parliament from ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Konstantinos Tasoulas Becomes the New President of Greece - GreekReporter.com",
    "url": "https://greekreporter.com/2025/02/12/konstantinos-tasoulas-new-president-greece/",
    "snippet": "All 156 MPs of the governing New Democracy party voted for Tasoulas, in addition to former PM Antonis Samaras and three independent lawmakers. Tasoulas will be sworn in before the Parliament on <strong>March 13, 2025</strong>, when the term of the outgoing ...",
    "published": "February 12, 2025"
  },
  {
    "title": "Greece Elects New President Despite MPs' Walkout Over Train Crash | Balkan Insight",
    "url": "https://balkaninsight.com/2025/02/12/greece-elects-new-president-despite-mps-walkout-over-train-crash/",
    "snippet": "Tasoulas mustered 160 votes; a majority of 151 was required to be elected in what was a fourth round of balloting among MPs. The centre-left PASOK party’s candidate, Tasos Giannitsis, won 34 votes, the left-wing SYRIZA party’s Louka Katseli won 29 and the far-right Niki party’s Konstantinos Kyriakou won 14.",
    "published": "February 12, 2025"
  },
  {
    "title": "Who is Who – Konstantinos Tasoulas: Promised Greece’s constructive approach to Kosovo - Kosovo Online",
    "url": "https://www.kosovo-online.com/en/news/kontext/who-who-konstantinos-tasoulas-promised-greeces-constructive-approach-kosovo-13-3-2025",
    "snippet": "Konstantinos Tasoulas, who took the oath today as the <strong>ninth President of the Hellenic Republic</strong>, is a former Speaker of the Greek Parliament with a parliamentary career spanning 25 years.",
    "published": "March 13, 2025"
  },
  {
    "title": "Presidential Election 2025 Greece",
    "url": "https://www.robert-schuman.eu/en/monitor/6474-konstantinos-tasoulas-is-elected-president-of-greece",
    "snippet": "Appointed in 2019, he was the outgoing Speaker of Parliament. <strong>The new President of the Hellenic Republic will take office on 13 March</strong>. Results of the January &amp; February 2025 presidential elections in Greece",
    "published": null
  }
]