[
  {
    "title": "American Airlines Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/American_Airlines_Center",
    "snippet": "Principal design work was carried out by the Driehaus Prize winner and New Classical architect David M. Schwarz of Washington D.C. <strong>American Airlines Center</strong> was designed to be the heart of a new urban, commercial area designed to reinvigorate the city of Dallas called Victory Park.",
    "published": "1 week ago"
  },
  {
    "title": "Reunion Arena - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Reunion_Arena",
    "snippet": "The arena was the home of the Dallas Mavericks from 1980 to 2001 and the Dallas Stars from 1993 to 2001. Both teams moved to the new <strong>American Airlines Center</strong> in 2001.",
    "published": "2 weeks ago"
  },
  {
    "title": "American Airlines Center",
    "url": "http://basketball.ballparks.com/NBA/DallasMavericks/newindex.htm",
    "snippet": "<strong>American Airlines Center</strong> · Venue Particulars Address 2500 Victory Avenue Dallas, TX 75201 Phone (214) 665-4299 Official Website Seating Weather Newspaper Satellite View Mavericks Gear Venue Resources Hotels, Dining &amp; Deals in Dallas",
    "published": null
  },
  {
    "title": "Dallas Mavericks - Arena History - RetroSeasons.com",
    "url": "https://www.retroseasons.com/teams/dallas-mavericks/history/stadiums/",
    "snippet": "The Mavericks compete in the National Basketball Association (NBA) as a member of the Western Conference Southwest Division. The team plays its home games at the <strong>American Airlines Center</strong>, which it shares with the National Hockey League&#x27;s Dallas ...",
    "published": "March 21, 2023"
  },
  {
    "title": "Dallas Mavericks: Everything to Know Before the Game | Visit Dallas",
    "url": "https://www.visitdallas.com/blog/dallas-mavericks/",
    "snippet": "<strong>American Airlines Arena (AAC)</strong> isn’t just a sports arena - it&#x27;s an entertainment powerhouse. Built in 2001, the AAC is a premier sports and entertainment arena that’s home to both the Dallas Mavericks and Dallas Stars, as well as concerts ...",
    "published": null
  }
]