[
  {
    "title": "Mario Mutsch - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/mario-mutsch/profil/trainer/69243",
    "snippet": "Luxembourg U19 Manager and other occupations Appointed: Jul 1, 2022 Contract until: Jun 30, 2025 ... Avg. term as coach : 1.40 Years ... Last club : Pr. Niederkorn Most games for : FC St. Gallen Retired : Jul 1, 2019 ... This is an overview of the career of a manager. ... This page displays all transfers for the selected player. Alongside the date of the transfer, the clubs involved and the transfer fee, it also displays the market value of the player at the time of the transfer. Mario Mutsch is the brother of Manuel Mutsch (Retired).",
    "published": null
  },
  {
    "title": "Luxemburg sucht neuen Trainer: Folgt Mario Mutsch auf Luc Holtz? - GrenzEcho",
    "url": "https://www.grenzecho.net/125949/artikel/2025-07-11/luxemburg-sucht-neuen-trainer-folgt-mario-mutsch-auf-luc-holtz",
    "snippet": "Bei der luxemburgischen Nationalmannschaft kommt es nach 15 Jahren zum Trainerwechsel: <strong>Der Ende 2025 auslaufende Vertrag von Luc Holtz wird nicht verlängert</strong>. Sein Nachfolger könnte Wurzeln in Ostbelgien haben.",
    "published": "July 11, 2025"
  },
  {
    "title": "Mario Mutsch - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mario_Mutsch",
    "snippet": "Vith, Mutsch started his career at Belgian lower leagues sides Spa and Kelmis (La Calamine) before heading to Germany to play for the Alemannia Aachen reserve team. In summer 2007 he joined Swiss Super League FC Aarau on the suggestion of his former national team coach Jeff Saibene, who was assistant manager ...",
    "published": "November 12, 2025"
  },
  {
    "title": "FootballScoop, the premier source for coaching information",
    "url": "https://www.footballscoop.com/",
    "snippet": "FootballScoop since 1999, is the trusted leader in football coaching news, jobs, and insider updates. Discover breaking coaching changes and opportunities.",
    "published": "6 hours ago"
  },
  {
    "title": "2025 Leadership & Career Coaching Trends | Christina Noble, PCC",
    "url": "https://topcoachawards.com/articles/three-leadership-and-career-coaching-trends-to-watch-in-2025",
    "snippet": "Just like HYROX athletes need to manage both physical and mental stamina, modern leaders must train for clarity under pressure. Coaching strengthens emotional intelligence, equipping leaders to regulate stress responses and lead with composure and purpose. As the workplace continues to evolve, many professionals are reassessing their next chapter. Coaching—sometimes paired with mentoring—helps prepare high potentials for new roles, transitions across verticals, or even semi-retirement.",
    "published": "June 6, 2025"
  }
]