[
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | Stanford Online",
    "url": "https://online.stanford.edu/schools-centers/stanford-institute-human-centered-artificial-intelligence-hai",
    "snippet": "Stanford founded the Institute for Human-Centered AI in 2019 to guide and build the future of AI.HAI advances AI research, education, policy and practice to improve the human condition. Led by faculty from multiple departments across Stanford, research focuses on developing AI technologies inspired by human intelligence; studying, forecasting and guiding the human and societal impact of AI; and designing and creating AI applications that augment human capabilities.",
    "published": "October 17, 2024"
  },
  {
    "title": "Stanford",
    "url": "https://hai.stanford.edu/",
    "snippet": "&quot;The AI Index equips policymakers, ... Wald, Executive Director of Stanford HAI and Steering Committee member of the AI Index. HAI founding co-director <strong>Fei-Fei Li</strong> has been named one of TIME&#x27;s 2025 Persons of the Year....",
    "published": null
  },
  {
    "title": "At five years old, Institute for Human-Centered AI looks to the future",
    "url": "https://stanforddaily.com/2024/11/05/stanford-hai-five-years/",
    "snippet": "In HAI’s five years of operation, the institute has focused on policy, research and education and has funded the research projects of more than 400 faculty, said HAI co-founder and co-director <strong>James Landay</strong>, a computer science professor.",
    "published": "November 5, 2024"
  },
  {
    "title": "Stanford Human-Centered Artificial Intelligence (HAI) | Stanford Impact Labs",
    "url": "https://impact.stanford.edu/organization/stanford-human-centered-artificial-intelligence-hai",
    "snippet": "Stanford founded the Institute for Human-Centered AI in 2019 to guide and build the future of AI. HAI advances AI research, education, policy and practice to improve the human condition.",
    "published": null
  },
  {
    "title": "‘Big steps ahead’ for Stanford HAI | Stanford Report",
    "url": "https://news.stanford.edu/stories/2024/03/stanford-hai-now-whats-next",
    "snippet": "In just five years, the institute has made major strides engaging policy, industry, and civil society to ensure that AI is developed with humans at the center. <strong>John Etchemendy and Fei-Fei Li</strong>, founding co-directors of the Stanford Institute for ...",
    "published": null
  }
]