[
  {
    "title": "News Updates | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/news-updates/",
    "snippet": "Prime Minister Shri Narendra Modi today paid solemn tribute to the brave security personnel who sacrificed their lives while defending the Parliament of India during the heinous terrorist attack on 13 December 2001. ... The Governor of Himachal Pradesh, Shri Shiv Prathap Shukla, met Prime Minister Shri Narendra Modi in New Delhi today. Loading... PM interacts with farmers at South India Natural Farming Summit 2025 in Coimbatore, Tamil Nadu",
    "published": null
  },
  {
    "title": "Prime Minister Narendra Modi departed for Ethiopia from Jordan - The Hindu",
    "url": "https://www.thehindu.com/news/national/pm-narendra-modi-ethiopia-visit-updates-december-16-2025/article70402401.ece",
    "snippet": "Prime Minister Narendra Modi on Tuesday (December 16, 2025) <strong>departed for Ethiopia from Jordan</strong> on the second leg of his four-day, three-nation tour. Jordanian Crown Prince Al Hussein bin Abdullah II specially drove PM Modi to the airport and ...",
    "published": "1 hour ago"
  },
  {
    "title": "PM Modi embarks on three-nation visit beginning with Jordan - The Hindu",
    "url": "https://www.thehindu.com/news/national/pm-modi-embarks-on-three-nation-visit-beginning-with-jordan/article70397710.ece",
    "snippet": "Prime Minister Narendra Modi on Monday (December 15, 2025) <strong>embarked on a visit to Jordan, Ethiopia and Oman</strong> — countries which enjoy civilizational ties and exceptional bilateral relations with India.",
    "published": "1 day ago"
  },
  {
    "title": "Narendra Modi | Latest News on Narendra Modi | Who is Narendra Modi?",
    "url": "https://www.business-standard.com/about/who-is-narendra-modi",
    "snippet": "Monday, December 15, 2025 | 12:00 AM ISTहिंदी में पढें ... Narendra Modi is the current <strong>Prime Minister of India</strong>. He represents Varanasi constituency in the Lok Sabha.",
    "published": "2 days ago"
  },
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "In the 2024 general election, Modi&#x27;s ... attack in Indian-administered Jammu and Kashmir, <strong>Modi presided over the 2025 India–Pakistan conflict, which resulted in a ceasefire</strong>....",
    "published": "2 days ago"
  }
]