[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "Former members have included Giorgio Napolitano (President of Italy, 2006–2015), <strong>Sergio Mattarella</strong> (President of Italy, 2015–present), four Prime Ministers (Romano Prodi, Giuliano Amato, Massimo D&#x27;Alema and Renzi), three former leaders (Pier Luigi Bersani, Guglielmo Epifani and, again, ...",
    "published": "1 day ago"
  },
  {
    "title": "Democratic Party – Democratic and Progressive Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_–_Democratic_and_Progressive_Italy",
    "snippet": "In July 2022, the centre-right coalition was forecast to win a parliamentary absolute majority under the Rosatellum electoral law of 2017, which was pushed by the Democratic Party (PD) under Matteo Renzi&#x27;s leadership and was now rejected by the party under the leadership of <strong>Enrico Letta</strong>.",
    "published": "August 9, 2025"
  },
  {
    "title": "List of presidents of the Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Presidents_of_the_Democratic_Party_(Italy)",
    "snippet": "The president of the Democratic Party is one of the leaders of the Democratic Party, the main centre-left political party in Italy. The current president is <strong>Stefano Bonaccini</strong>.",
    "published": "April 29, 2025"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "Italy’s Democrats have often posed as a guarantor of institutional stability and Rome’s Atlanticist line. Current leader <strong>Elly Schlein</strong> has tacked left, but it’s done little to change the party’s identity as a force for steadying Italian ...",
    "published": null
  },
  {
    "title": "List of secretaries of the Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Secretaries_of_the_Democratic_Party",
    "snippet": "<strong>The secretary of the Democratic Party</strong> is the leader of the Democratic Party, the main centre-left political party in Italy.",
    "published": "May 13, 2025"
  }
]