[
  {
    "title": "Nalini Anantharaman - USIAS - University of Strasbourg",
    "url": "https://www.usias.fr/en/chairs/nalini-anantharaman/",
    "snippet": "She was Visiting Miller Professor at the University of California Berkeley in 2008 and <strong>became a full Professor at the University of Paris-Sud in 2009.</strong> From January to June 2013, she was at the Princeton Institute for Advanced Study. Between 2014 and 2016, she held a temporary chair at USIAS, ...",
    "published": null
  },
  {
    "title": "Nalini Anantharaman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nalini_Anantharaman",
    "snippet": "She completed her PhD in Paris under the supervision of François Ledrappier in 2000 at Université Pierre et Marie Curie (Paris 6). She <strong>became a full Professor, at the University of Paris-Sud, Orsay in 2009</strong> following time out at the University of California in Berkeley in the year before as ...",
    "published": "August 7, 2025"
  },
  {
    "title": "Biography and publications | Nalini Anantharaman - Spectral Geometry | Collège de France",
    "url": "https://www.college-de-france.fr/en/chair/nalini-anantharaman-spectral-geometry-statutory-chair/biography",
    "snippet": "<strong>From 2009 to 2022, she was a professor at the University of Paris-Sud (Orsay)</strong> and then at the University of Strasbourg. She made several long-term stays at Berkeley (2009, 2015, 2019) and at Princeton IAS (2013).",
    "published": "October 3, 2024"
  },
  {
    "title": "Nalini Anantharaman | Académie des sciences",
    "url": "https://www.academie-sciences.fr/en/nalini-anantharaman",
    "snippet": "Nalini Anantharaman is a professor at the IRMA Institute for Advanced Mathematical Research (CNRS/Université de Strasbourg). After a thesis in mathematics defended in 2000, Nalini Anantharaman became a lecturer at ENS Lyon, then a research fellow at CNRS and <strong>a professor at Université Paris-Sud</strong>.",
    "published": null
  },
  {
    "title": "Nalini Anantharaman",
    "url": "https://grokipedia.com/page/Nalini_Anantharaman",
    "snippet": "Nalini Anantharaman entered the ... Université Paris-Sud (now part of Université Paris-Saclay), <strong>building a foundation in mathematical analysis and dynamical systems</strong>.[2][10] Anantharaman obtained her PhD in 2000 from Université ...",
    "published": null
  }
]