[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Alfa Romeo have been in a technical partnership with the Sauber F1 Team since 2018. In February 2019, Sauber announced that it would compete as Alfa Romeo Racing although the ownership, racing licence and management structure would remain unchanged.",
    "published": "3 weeks ago"
  },
  {
    "title": "Alfa Romeo USA - Luxury Italian Sports Cars & SUVs",
    "url": "https://www.alfaromeousa.com/",
    "snippet": "<strong>No monthly payments for 90 days when financed through Stellantis Financial Services on 2025</strong> Alfa Romeo Giulia, Stelvio and Tonale models.",
    "published": null
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "When you see the stylish Giulia or Stelvio cruising on the streets around Grosse Pointe, you may start to wonder, “who owns Alfa Romeo?” <strong>Alfa Romeo has been owned by Fiat-Chrysler Automobiles (FCA) since 2007.</strong>",
    "published": "April 26, 2021"
  },
  {
    "title": "Who Owns Alfa Romeo? | Who Makes Alfa Romeo? | Zeigler Alfa Romeo of Schaumburg",
    "url": "https://www.alfaromeousaofschaumburg.com/who-owns-alfa-romeo/",
    "snippet": "<strong>Fiat-Chrysler Automobiles (FCA) now owns Alfa Romeo</strong>. Learn more about this acquisition and how it’s inspired innovation since 2007 from Zeigler Alfa Romeo of Schaumburg.",
    "published": "July 13, 2019"
  },
  {
    "title": "Who Owns Alfa Romeo? | Where is Alfa Romeo Made?",
    "url": "https://www.aristocratmotorsalfaromeo.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "While <strong>the luxury brand belongs to FCA</strong>, the commitment to Italian performance and design is still powerful. They continue to push boundaries to create models like the Alfa Romeo Giulia Quadrifoglio in 2017 and the Alfa Romeo Stelvio in 2018, ...",
    "published": "July 25, 2025"
  }
]