[
  {
    "title": "David Hurley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley",
    "snippet": "His term concluded in May 2019 and he was subsequently appointed by Queen Elizabeth II as governor-general on the nomination of Prime Minister Scott Morrison. His five-year term <strong>commenced in July 2019 and expired in July 2024</strong>, with Sam Mostyn succeeding him. David ...",
    "published": "October 31, 2025"
  },
  {
    "title": "David Hurley - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/David_Hurley",
    "snippet": "On 16 December 2018, it was said that Queen Elizabeth II had allowed Hurley to become the next Governor-General of Australia. This was on the advice of Prime Minister Scott Morrison. He began his term in <strong>July 2019.</strong> Hurley was born in Wollongong, New South Wales. He is married to Linda.",
    "published": "May 3, 2025"
  },
  {
    "title": "David John Hurley AC CVO DSC (Retd) – Parliament of Australia",
    "url": "https://www.aph.gov.au/Visit_Parliament/Art/Stories_and_Histories/HMC/Monarchs_and_Govenors-General/David_John_Hurley_AC_CVO_DSC_Retd",
    "snippet": "Parliament House is currently · Governor-General <strong>1 July 2019 to 1 July 2024</strong>",
    "published": null
  },
  {
    "title": "General (Retd) the Honourable David Hurley AC CVO DSC and Mrs Linda Hurley | Soldier On Australia",
    "url": "https://soldieron.org.au/people/general-rtd-the-honourable-david-hurley-ac-cvo-dsc-and-mrs-linda-hurley/",
    "snippet": "General (Retd) the Honourable David Hurley AC CVO DSC was sworn in as the Governor-General of the Commonwealth of Australia on 1 July 2019 and completed his term on <strong>30 June 2024</strong>. David Hurley joined the Australian Army in January 1972, graduating ...",
    "published": "June 5, 2025"
  },
  {
    "title": "Patron-in-Chief – His Excellency General the Honourable David Hurley AC DSC (Retd) |",
    "url": "https://fffaif.org.au/?p=13880",
    "snippet": "Prior to being sworn in as Governor-General, David Hurley served as the 38th Governor of New South Wales from <strong>October 2014 – May 2019.</strong>",
    "published": null
  }
]