[
  {
    "title": "John Elkann - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Elkann",
    "snippet": "In March 2009, he merged the holding companies IFI and IFIL to create Exor, stepping to the role of chairman. <strong>In 2010, he became chairman of Fiat S.p.A. (then FCA),</strong> succeeding Luca Cordero di Montezemolo, and chairman of the Giovanni Agnelli Sapaz, succeeding Gabetti; at the time, Fiat had ...",
    "published": "1 week ago"
  },
  {
    "title": "Top 100 Executives 2020: John Elkann, Chairman, FCA ...",
    "url": "https://www.leadersleague.com/en/news/top-100-executives-2020-john-elkann-chairman-fca-group",
    "snippet": "Leaders League offers media and business services for leaders. We provide strategic information, company rankings, and B to B networking events.",
    "published": null
  },
  {
    "title": "John Elkann Chairman Executive Director",
    "url": "https://www.stellantis.com/content/dam/stellantis-corporate/group/governance/leadership/bio/eng/John-Elkann.pdf",
    "snippet": "John Elkann was <strong>appointed Chairman of Stellantis on January · 17, 2021</strong>. He had previously been Chairman of Fiat S.p.A. from",
    "published": null
  },
  {
    "title": "John Elkann | Bio | Cambridge Institute for Family Enterprise - 17 Next Generation Leaders of 2017",
    "url": "https://cfeg.com/nextgenleaders2017/bio/john-elkann.html",
    "snippet": "After WWII, Gianni Agnelli had to rebuild Fiat at 24. After Gianni’s death, his grandson John Elkann faced the same task himself at 28.",
    "published": null
  },
  {
    "title": "Board of Directors | EXOR",
    "url": "https://www.exor.com/pages/exor/governance/board-directors",
    "snippet": "<strong>Born in New York in 1976, Elkann earned a scientific baccalauréat from Lycée Victor Duruy in Paris and an engineering degree from Politecnico di Torino (Italy). He began his career in 2001 at General Electric on the Corporate Audit Staff, working across Asia, Europe, and North America</strong>.",
    "published": null
  }
]