[
  {
    "title": "Warner Bros. Discovery - Discovery Communications Agrees to Take Full Control of Eurosport",
    "url": "https://ir.corporate.discovery.com/news-and-events/financial-news/financial-news-details/2015/Discovery-Communications-Agrees-to-Take-Full-Control-of-Eurosport/default.aspx",
    "snippet": "– <strong>Discovery Communications (Nasdaq: DISCA, DISCB, DISCK) today announced an agreement to acquire full ownership of Eurosport, the leading sports channels group across Europe and Asia, for €491 million from TF1 Group</strong>, which has announced it will exercise a put option on its 49% ownership ...",
    "published": null
  },
  {
    "title": "Warner Bros. Discovery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Warner_Bros._Discovery",
    "snippet": "The American division manages the ... in 2023, while <strong>the European division handles international sports operations, including Eurosport and TNT Sports UK</strong>, and Warner Bros. Discovery Sports Latin America which owns the sports channel TNT Sports LATAM which replaces Esporte ...",
    "published": "11 hours ago"
  },
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "On 5 January 2021, Discovery began ... company formed after the merger of Discovery with WarnerMedia—<strong>announced an agreement to contribute Eurosport&#x27;s United Kingdom operations into a joint venture with BT Group</strong>....",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport To Be Replaced By TNT In The UK As Warner Bros. Discovery Shakes Up Sports Portfolio",
    "url": "https://deadline.com/2025/01/eurosport-to-be-replaced-by-tnt-in-the-uk-in-warner-bros-discovery-sports-shakes-up-1236269088/",
    "snippet": "“Part of the timing was driven by distribution agreements, but most of it was just timed on firstly landing TNT Sports correctly and successfully. We have got ourselves a point where TNT Sports is in a good space and we’re now ready to migrate the content from Eurosport in this market.” · Warner Bros. Discovery Sports will continue to handle production after the rejig.",
    "published": "January 28, 2025"
  },
  {
    "title": "Warner Bros. Discovery Announces New Corporate Structure To Enhance Strategic Flexibility | Warner Bros. Discovery",
    "url": "https://www.wbd.com/news/warner-bros-discovery-announces-new-corporate-structure-enhance-strategic-flexibility",
    "snippet": "Available in more than 220 countries and territories and 50 languages, Warner Bros. Discovery inspires, informs and entertains audiences worldwide through its iconic brands and products including: Discovery Channel, Max, discovery+, CNN, DC, TNT Sports, Eurosport, HBO, HGTV, Food Network, OWN, Investigation Discovery, TLC, Magnolia Network, TNT, TBS, truTV, Travel Channel, MotorTrend, Animal Planet, Science Channel, Warner Bros.",
    "published": null
  }
]