[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Calling this &quot;social constructionism gone amok,&quot; Dawkins and Sokal argued further that &quot;distort[ing] the scientific facts in the service of a social cause&quot; risks undermining trust in medical institutions. In his role as <strong>professor for public understanding of science</strong>, Dawkins has been a critic ...",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "Richard Dawkins (born March 26, 1941, Nairobi, Kenya) is a British <strong>evolutionary biologist, ethologist, and popular-science writer</strong> who emphasized the gene as the driving force of evolution and generated significant controversy with his enthusiastic ...",
    "published": "July 15, 2009"
  },
  {
    "title": "Professor Richard Dawkins FRS",
    "url": "https://royalsociety.org/people/richard-dawkins-11316/",
    "snippet": "Richard Dawkins is an <strong>evolutionary biologist and expert in animal behaviour</strong>. Richard is well known for his ability to communicate concepts from his research and beyond to a non-specialist audience.",
    "published": null
  },
  {
    "title": "Richard Dawkins | Actor, Writer, Producer",
    "url": "https://www.imdb.com/name/nm1468026/",
    "snippet": "Richard Dawkins was born on 26 March 1941 in Nairobi, Kenya. He is an actor and writer, known for <strong>Doctor Who (2005), Expelled: No Intelligence Allowed (2008) and The Simpsons (1989).</strong> He has been married to Lalla Ward since September 1992.",
    "published": "October 22, 2020"
  },
  {
    "title": "Dawkins, Richard 1941- (Clinton Richard Dawkins) | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/arts/educational-magazines/dawkins-richard-1941-clinton-richard-dawkins",
    "snippet": "As Gordy Black noted in Salon.com, &quot;Dawkins is the world&#x27;s most famous out-of-the-closet living atheist. He is also the world&#x27;s most controversial evolutionary biologist.&quot; Black went on to note: &quot;Given his outspoken defense of Darwin, and natural selection as the force of life, Dawkins has assumed a new role: the religious right&#x27;s Public Enemy No.",
    "published": null
  }
]