[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "Ahead of the 2021 German federal election, <strong>Patrick Sensburg</strong>, Merz&#x27;s successor in his seat in the Bundestag, failed to secure his party&#x27;s support for a new candidacy.",
    "published": "2 days ago"
  },
  {
    "title": "Friedrich Merz und die Konrad-Adenauer-Stiftung: Die nächste Machtprobe für den Kanzler - DER SPIEGEL",
    "url": "https://www.spiegel.de/politik/deutschland/friedrich-merz-und-die-konrad-adenauer-stiftung-die-naechste-machtprobe-fuer-den-kanzler-a-7a4a2b2c-a659-498c-97ed-ef5111560312",
    "snippet": "Wer führt künftig die CDU-nahe Konrad-Adenauer-Stiftung? Friedrich Merz schlägt Unionsfraktionsvize <strong>Krings</strong> vor. Doch der hat zum Ärger des Parteichefs eine prominente Gegenkandidatin.",
    "published": "2 hours ago"
  },
  {
    "title": "New German Chancellor: Bundestag elects Friedrich Merz",
    "url": "https://www.deutschland.de/en/news/friedrich-merz-federal-chancellor-of-germany",
    "snippet": "In a second ballot the Bundestag elects the CDU leader as successor to <strong>Olaf Scholz</strong>. ... Berlin (dpa) - The Bundestag has elected CDU leader Friedrich Merz as Chancellor of the Federal Republic of Germany in the second ballot.",
    "published": "May 7, 2025"
  },
  {
    "title": "The Turbulent Times of Friedrich Merz - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/europe/friedrich-merz-germany.html",
    "snippet": "The new chancellor believes the world needs a stronger Germany. He is still navigating how to do it. Friedrich Merz, the German chancellor, in June in Washington.Credit...Kenny Holston/The New York Times",
    "published": "1 day ago"
  },
  {
    "title": "Friedrich Merz puts Germany in an unfamiliar position: Out front – POLITICO",
    "url": "https://www.politico.eu/article/friedrich-merz-germany-eu-ukraine-defense-leadership-brussels/",
    "snippet": "Breaking from his dithering predecessors Scholz and Merkel, Merz is playing an unusually active role as the defender of Ukraine and Europe as a whole. Friedrich Merz has taken a far more active stance inside the EU — assuming a role more traditionally played by France&#x27;s now weakened President.",
    "published": "9 hours ago"
  }
]