[
  {
    "title": "Samy Bengio - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Samy_Bengio",
    "snippet": "Bengio is senior director of Artificial Intelligence and Machine Learning Research at <strong>Apple</strong> and an adjunct professor at École Polytechnique Fédérale de Lausanne. He was a longtime scientist at Google, where he led a large group of researchers working in machine learning, including adversarial ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Ex-Google AI Scientist Samy Bengio Finds Job at Apple",
    "url": "https://www.techtimes.com/articles/259852/20210504/ex-google-ai-scientist-samy-bengio-job-apple.htm",
    "snippet": "Google&#x27;s former AI scientist Samy Bengio finds a new job at <strong>Apple</strong> after leaving the search engine giant over ethics concern.",
    "published": "May 4, 2021"
  },
  {
    "title": "Research manager resigns amid Google AI ethics controversy | TechTarget",
    "url": "https://www.techtarget.com/searchenterpriseai/news/252499002/Research-manager-resigns-amid-Google-AI-ethics-controversy",
    "snippet": "Prominent <strong>Google</strong> Brain research manager Samy Bengio resigned from <strong>Google</strong> after months of internal rifts between <strong>Google</strong> executives and AI researchers.",
    "published": null
  },
  {
    "title": "Samy Bengio - Apple | LinkedIn",
    "url": "https://www.linkedin.com/in/bengio",
    "snippet": "Experience: Apple · Location: Mountain View · 500+ connections on LinkedIn. View Samy Bengio’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": null
  },
  {
    "title": "Biography:Samy Bengio - HandWiki",
    "url": "https://handwiki.org/wiki/Biography:Samy_Bengio",
    "snippet": "Samy Bengio is a Canadian computer scientist, Senior Director of AI and Machine Learning Research at Apple,[1] and a former long-time scientist at <strong>Google</strong>[2] known for leading a large group of researchers working in machine learning including adversarial settings.",
    "published": null
  }
]