[
  {
    "title": "Marcelo Rebelo De Sousa: Latest News, Photos, Videos on Marcelo Rebelo De Sousa - NDTV.COM",
    "url": "https://www.ndtv.com/topic/marcelo-rebelo-de-sousa",
    "snippet": "Portuguese President Marcelo Rebelo de Sousa <strong>won re-election Sunday</strong>, according to media projections and partial results, after a poll held at the height of the country&#x27;s coronavirus crisis.",
    "published": null
  },
  {
    "title": "Marcelo Rebelo de Sousa | AP News",
    "url": "https://apnews.com/hub/marcelo-rebelo-de-sousa",
    "snippet": "Elections Election Results White House Congress U.S. Supreme Court The latest AP-NORC polls Ground Game Early voting tracker",
    "published": null
  },
  {
    "title": "Portuguese President Rebelo de Sousa hospitalised following emergency surgery | Euronews",
    "url": "https://www.euronews.com/2025/12/02/portuguese-president-rebelo-de-sousa-hospitalised-following-emergency-surgery",
    "snippet": "Portuguese President Marcelo Rebelo de Sousa <strong>underwent surgery for an incarcerated hernia</strong> on Monday evening after feeling unwell while returning from a funeral in Porto.",
    "published": "2 weeks ago"
  },
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "<strong>In March 2020, Marcelo Rebelo de Sousa asked parliament to authorize a state of emergency to contain the COVID-19 pandemic</strong>; this marked the first time the country declared a state of emergency nationwide in 46 years of democratic history.",
    "published": "1 week ago"
  },
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "Marcelo Rebelo de Sousa was elected President of the Republic for the first time on 24 January 2016 and took office on 9 March.",
    "published": null
  }
]