[
  {
    "title": "Brian Kemp - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Brian_Kemp",
    "snippet": "Brian Porter Kemp (born November 2, 1963) is an American politician serving as the 83rd governor of Georgia since 2019. A member of the Republican Party, Kemp served as the state&#x27;s 27th Secretary of State from 2010 to 2018, and as a member of the Georgia State Senate from 2003 to 2007.",
    "published": "2 weeks ago"
  },
  {
    "title": "Brian Kemp - Ballotpedia",
    "url": "https://ballotpedia.org/Brian_Kemp",
    "snippet": "Brian Kemp (Republican Party) is the Governor of Georgia. He assumed office on January 14, 2019. His current term ends on January 11, 2027. Kemp received a bachelor&#x27;s degree in agriculture from the University of Georgia. Before entering politics, Kemp worked as a builder and developer.",
    "published": null
  },
  {
    "title": "Governor Brian P. Kemp Office of the Governor - Georgia.gov",
    "url": "https://gov.georgia.gov/",
    "snippet": "State of Georgia government websites and email systems use “georgia.gov” or “ga.gov” at the end of the address. Before sharing sensitive or personal information, make sure you’re on an official state website. ... Call 1-800-GEORGIA to verify that a website is an official website of the State of Georgia. ... Governor Brian P. Kemp Office of the Governor",
    "published": null
  },
  {
    "title": "About Governor Brian P. Kemp | Governor Brian P. Kemp Office of the Governor",
    "url": "https://gov.georgia.gov/about-us/about-governor-brian-p-kemp",
    "snippet": "A native of Athens, Georgia, Brian Kemp started his first small business over 35 years ago with a pickup truck and a shovel. His experience as a small business owner has driven his mission to put hardworking Georgians first since taking office as Georgia&#x27;s 83rd governor in 2019. Throughout his first term, the Peach State consistently broke economic records, with jobs and investments coming to every region of the state.",
    "published": "October 22, 2025"
  },
  {
    "title": "Brian Kemp | Georgia.gov",
    "url": "https://georgia.gov/brian-kemp",
    "snippet": "The 83rd Governor of Georgia, Brian P. Kemp of Athens took office in January 2019. Kemp’s political career began when he served as a state senator from 2003-07. He served as Georgia Secretary of State from 2010-18 and was re-elected to a second 4-year term as Governor in 2022.",
    "published": null
  }
]