[
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Peter Norvig (born 14 December 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He <strong>previously served as a director of research and search quality at Google</strong>. Norvig is the co-author with Stuart J. Russell of the most ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "Programmer, designer, author, and manager in high tech R&amp;D. Specialties: internet… · Experience: Stanford Institute for Human-Centered Artificial Intelligence (HAI) · Location: Palo Alto · 500+ connections on LinkedIn. View Peter Norvig’s profile on LinkedIn, a professional community ...",
    "published": "1 week ago"
  },
  {
    "title": "Peter Norvig Bio",
    "url": "https://norvig.com/bio.html",
    "snippet": "Peter Norvig is a Distinguished ... and Google&#x27;s Research group. He was <strong>head of NASA Ames&#x27;s Computational Sciences Division, where he was NASA&#x27;s senior computer scientist and a recipient of NASA&#x27;s Exceptional Achievement Award in 2001.</strong>...",
    "published": null
  },
  {
    "title": "Peter Norvig",
    "url": "https://norvig.com/",
    "snippet": "<strong>Distinguished Education Fellow at Stanford HAI, Research Director at Google</strong>. Co-author of Artificial Intelligence: A Modern Approach, the leading AI textbook used in 1,500+ universities worldwide. peter@norvig.com / resume / github / medium / photo gallery / legacy homepage",
    "published": null
  },
  {
    "title": "Dr. Peter Norvig | Stevens Institute of Technology",
    "url": "https://www.stevens.edu/the-presidents-distinguished-lecture-series/dr-peter-norvig",
    "snippet": "BIOGRAPHY: Dr. Peter Norvig is Director of Research at Google Inc. <strong>Previously he was head of Google&#x27;s core search algorithms group, and of NASA Ames&#x27;s Computational Sciences Division, making him NASA&#x27;s senior computer scientist</strong>. He received the NASA Exceptional Achievement Award in 2001.",
    "published": null
  }
]