[
  {
    "title": "Leaders Circle | Google Cloud Next 2025",
    "url": "https://cloud.withgoogle.com/next/25/leaders-circle",
    "snippet": "Join us for Leaders Circle at Google Cloud Next 2025",
    "published": null
  },
  {
    "title": "Google makes play for multi-billion dollar leadership development market | HR Tech and People Data | HR Grapevine USA | News",
    "url": "https://www.hrgrapevine.com/us/content/article/2025-10-29-google-opens-up-its-leadership-development-playbook-with-ai-powered-course",
    "snippet": "Learners will hear directly from more than a dozen Google managers who share their experiences and approaches to leadership. A key component of the course is applying AI as a partner in management. Participants are shown how to use tools such as Gemini and NotebookLM to create SMART goals, craft project plans, and adapt communications for different audiences. Google said the course is designed to be completed in under eight hours, with no prior management experience required.",
    "published": "November 4, 2025"
  },
  {
    "title": "Too many bosses want to be liked, but it's not a sign of good leadership, says Google exec",
    "url": "https://www.cnbc.com/2025/11/28/google-learning-exec-biggest-leadership-skill-people-struggle-with.html",
    "snippet": "The buzz likely stems from people wanting to lead during a time of rapid business changes due to remote and hybrid policies in offices, global politics, changing economic circumstances and the adoption of technology like AI, says Brian Glaser, Google&#x27;s chief learning officer. Glaser has been a manager off and on for the last 20 years and leads the onboarding, training and leadership development for some 150,000 employees worldwide.",
    "published": "3 weeks ago"
  },
  {
    "title": "Google Cloud’s 5 Biggest Executive Exits And Hires In 2025 So Far",
    "url": "https://www.crn.com/news/cloud/2025/google-cloud-s-5-biggest-executive-exits-and-hires-in-2025-so-far",
    "snippet": "CRN breaks down the five biggest Google Cloud hires and executive departures of 2025 so far. ... Microsoft’s longtime executive is jumping ship to Google Cloud as the company’s new president of customer experience for Google’s global multibillion-dollar commercial business. Google is moving teams under Gallot’s leadership including its Global Partner Ecosystem &amp; Channels, Global Customer Engineering, Global Solutions &amp; Industries and Strategic Customer Experiences, which includes Google’s innovation centers.",
    "published": null
  },
  {
    "title": "Alphabet & Google C-Suite Executive Team [2025] - DigitalDefynd",
    "url": "https://digitaldefynd.com/IQ/csuite-team-of-google-meet-the-executives/",
    "snippet": "<strong>Sundar Pichai</strong> has been at the helm of both Google and its parent company Alphabet since 2019, after previously serving as Google’s Product Chief. Known for his calm demeanor and product-centric leadership style, Pichai has overseen Google’s ...",
    "published": "June 9, 2025"
  }
]