[
  {
    "title": "Barry Andrews (musician) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Barry_Andrews_(musician)",
    "snippet": "Barry Andrews (born 12 September 1956) is an English songwriter, singer and keyboard player who is a co-founder of Shriekback and was formerly a member of XTC and the League of Gentlemen. Barry William Andrews was born in West Norwood, London, on 12 September, 1956, the only child of bricklayer ...",
    "published": "September 19, 2025"
  },
  {
    "title": "Barry Andrews (politician) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Barry_Andrews_(politician)",
    "snippet": "Barry Andrews (born 16 May 1967) is an Irish politician who serves as a Member of the European Parliament (MEP) for the Dublin constituency. He is a member of Fianna Fáil, part of Renew Europe. He previously served as Minister of State for Children from 2008 to 2011.",
    "published": "September 29, 2025"
  },
  {
    "title": "Barry Andrews Obituary - Dallas, TX",
    "url": "https://www.dignitymemorial.com/obituaries/dallas-tx/barry-andrews-11467377",
    "snippet": "With his strong faith, he honored God above all in how he lived his life and his family is comforted knowing he is in heaven. Barry was the son of Jewell and <strong>Homer Andrews</strong>, born in Electra, Texas, and raised in Corpus Christi.",
    "published": null
  },
  {
    "title": "Barry Andrews | Actor, Soundtrack",
    "url": "https://www.imdb.com/name/nm0028568/",
    "snippet": "Barry Andrews. Actor: The Spy Who Loved Me. Barry Andrews was born in 1944 in the UK. He is an actor, known for The Spy Who Loved Me (1977), Dracula Has Risen from the Grave (1968) and The Blood on Satan&#x27;s Claw (1971).",
    "published": "October 12, 2021"
  },
  {
    "title": "Barry Andrews | Tardis | Fandom",
    "url": "https://tardis.fandom.com/wiki/Barry_Andrews",
    "snippet": "Barry Andrews (born 1944[1]) played Stott in the Doctor Who television story Nightmare of Eden. He was considered for Sgt. Graham Calder and Galloway in Resurrection of the Daleks. Barry Andrews at the Internet Movie Database",
    "published": null
  }
]