[
  {
    "title": "Tiger Aspect - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tiger_Aspect",
    "snippet": "Tiger Aspect Productions (formerly known as Tiger Television from 1988 until 1993 and also known as Tiger Aspect Films for theatrical films) is a British television and film production company, particularly noted for its situation comedies. Founded by <strong>Peter Bennett-Jones</strong>, its productions have ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Paper Tiger Television - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paper_Tiger_Television",
    "snippet": "Paper Tiger Television (PTTV) is a non-profit, low-budget public access television program and open media collective based in New York City. PPTV was co-founded by media activist and Academy Award nominated documentary filmmaker <strong>Dee Dee Halleck</strong> in 1981. It focuses on raising media literacy ...",
    "published": "October 20, 2025"
  },
  {
    "title": "Contact DeeDee Halleck, Email: ****@papertiger.org & Phone Number | Founder, Media Activist at Paper Tiger Television - ZoomInfo",
    "url": "https://www.zoominfo.com/p/Deedee-Halleck/41781514",
    "snippet": "<strong>DeeDee Halleck</strong> is a Founder and Media Activist, recognized for contributions to social justice and community engagement. Their work encompasses media activism, art advocacy, and educational initiatives. As the Founder of Paper Tiger Television, they focused on nurturing creativity and promoting ...",
    "published": null
  },
  {
    "title": "Paper Tiger Television Records: Paper Tiger Television Records: NYU Special Collections Finding Aids",
    "url": "https://findingaids.library.nyu.edu/fales/mss_276/",
    "snippet": "Paper Tiger Television is a New York-based public access video collective. Co-founded by <strong>DeeDee Halleck</strong> in 1981, Paper Tiger TV was the first nationally distributed public access television program. Its programming critiques media corporatization and censorship, covering issues such as racism, ...",
    "published": null
  },
  {
    "title": "Tiger Television - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Tiger_Television",
    "snippet": "Tiger Television was a British television production company that was formed in 1988 by <strong>Peter Bennett-Jones</strong>. It was particularly known for its sitcoms (most notably Mr. Bean), though it also specialised in shows from other genres.",
    "published": "June 26, 2025"
  }
]