[
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "Yariv Milchan (PRODUCER) is the Chairman and CEO of the Academy Award®-winning New Regency Productions where he oversees the day-to-day management, creative direction, and overall growth strategy of the company. Most recently, Milchan has spearheaded the production of the Academy Award® winning ...",
    "published": null
  },
  {
    "title": "Yariv Milchan - Chairman and CEO @ New Regency Productions - Crunchbase Person Profile",
    "url": "https://www.crunchbase.com/person/yariv-milchan-3665",
    "snippet": "Yariv Milchan is the Chairman and CEO of New Regency Productions. Yariv Milchan (PRODUCER) is the Chairman and CEO of the Academy Award®-win...",
    "published": null
  },
  {
    "title": "Yariv Milchan Email & Phone Number | New Regency Productions Film Production Contact Information",
    "url": "https://rocketreach.co/yariv-milchan-email_5930652",
    "snippet": "Yariv Milchan, based in <strong>Los Angeles, California, United States</strong>, is currently a Film Production at New Regency Productions. With a robust skill set that includes Film Production, Short Films, Film, Post Production and more.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Under the deal with EMJAG Digital Productions, New Regency along with Shine America will co-produce and co-finance select digital products under a first-look deal with EMJAG&#x27;s previous deal with Paramount being transferred to New Regency and Shine America. In May 2016, New Regency announced that Brad Weston had stepped of the company as CEO and president after five years as Yariv Milchan the son of New Regency&#x27;s founder Arnon Milchan had joined the company and became their new chairman and CEO.",
    "published": "4 days ago"
  },
  {
    "title": "r/boxoffice on Reddit: Arnon Milchan's New Regency Is Now Labeled As “TV Studio That Does Occasional Movie” But Its Executives Point Out Company Still Has Films That's In The Works. Insiders Say While “They Just Want To Grind It Out Until It’s Over“, Milchan Has Quietly Explored Selling It, Set At A Too High Price Of $1B.",
    "url": "https://www.reddit.com/r/boxoffice/comments/1kajdb9/arnon_milchans_new_regency_is_now_labeled_as_tv/",
    "snippet": "&quot;I met Yariv Milchan earlier this month in a conference room at the New Regency offices on the <strong>Fox lot</strong>, which has been the production company’s home for almost 30 years, even as the studio and the industry transformed around it.",
    "published": "April 29, 2025"
  }
]