[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and is on the advisory board of the University of Austin.",
    "published": "1 week ago"
  },
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "Teaching the Value of Science and Advancing Secularism Founded in 2006 by Richard Dawkins, the foundation’s mission is to realize Richard’s vision to remove ...",
    "published": "July 17, 2025"
  },
  {
    "title": "Richard Dawkins: A Biography | Discovery Institute",
    "url": "https://www.discovery.org/a/10291/",
    "snippet": "Clinton Richard Dawkins (born March 26, 1941, in Nairobi, Kenya) is a bestselling atheist popularizer of Darwinian evolutionary theory and its counter-religious implications. His scientific field is ethology, the study of animal behavior. The most readily recognizable figure in the Darwin debate, Dawkins retired in 2008 as Professor for Public Understanding of Science at Oxford University, a position he held from 1995, by which time he had effectively discontinued his career as a publishing research scientist.",
    "published": "October 15, 2024"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and ... and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an <strong>assistant professor of zoology</strong> (1967–69) at the University of California, Berkeley....",
    "published": "July 15, 2009"
  },
  {
    "title": "Contact Richard Dawkins, Email: ****@companyx.com & Phone Number | Worker at Company-X - ZoomInfo",
    "url": "https://www.zoominfo.com/p/Richard-Dawkins/8825059920",
    "snippet": "Match relevance is based on profile similarity to job title and location, or job title and industry. ... Worker SMS Data Products Group, Inc. ... Richard Dawkins works in the industry of <strong>Business Services, Custom Software &amp; IT Services</strong>.",
    "published": null
  }
]