[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Two subsidiaries of the IAU were also created at this assembly: the International Time Commission seated at the International Time Bureau in Paris, France, and the International Central Bureau of Astronomical Telegrams initially seated in Copenhagen, Denmark. The seven initial member states were Belgium, Canada, France, Great Britain, Greece, Japan, and the United States, soon to be followed by Italy and Mexico. The first executive committee consisted of Benjamin Baillaud (President, France), Alfred Fowler (General Secretary, UK), and four vice presidents: William Campbell (US), Frank Dyson (UK), Georges Lecointe (Belgium), and Annibale Riccò (Italy).",
    "published": "5 days ago"
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://www.iau.org/administration/executive_bodies/past_committees/executive_committee/",
    "snippet": "<strong>Debra Meloy Elmegreen</strong> · Piero Benvenuti (Interim General Secretary) José Miguel Rodriguez Espinosa",
    "published": null
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "&quot;It is a great honour and a pleasure ... in which the IAU will play a leading role as a catalyst and a coordinator,&quot; said <strong>Catherine Cesarsky</strong>....",
    "published": null
  },
  {
    "title": "Home page - IAU Office of Astronomy for Development",
    "url": "https://astro4dev.org/",
    "snippet": "– <strong>Prof Debra Elmegreen</strong>, Past President, International Astronomical Union",
    "published": "October 21, 2025"
  },
  {
    "title": "international astronomical union: Topics by Science.gov",
    "url": "https://science.gov/topicpages/i/international+astronomical+union.html",
    "snippet": "&quot;It is a great honour and a pleasure ... Year of Astronomy in 2009, in which the IAU will play a leading role as a catalyst and a coordinator,&quot; said <strong>Catherine Cesarsky</strong>....",
    "published": null
  }
]