[
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "Upon the death of the fourth IAAF President Primo Nebiolo on November 7, 1999, he immediately took over as acting President and Diack was subsequently re-elected unopposed to the position in <strong>2001, 2003, 2007 and 2011 before standing down in 2015.</strong>",
    "published": null
  },
  {
    "title": "Lamine Diack becomes first president of the International Association of Athletics Federations | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/lamine-diack-becomes-first-president-of-the-i",
    "snippet": "<strong>1 August 2001</strong> – Edmonton, Canada – An overwhelming majority of IAAF Congress delegates has elected Lamine Diack President of the International Association of Athletics Federations. 168 delegates voted for with just 1 delegate against.",
    "published": null
  },
  {
    "title": "Lamine Diack - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lamine_Diack",
    "snippet": "Lamine Diack (7 June 1933 – 3 December 2021) was a Senegalese businessman, sports administrator, and athlete. He was president of the International Association of Athletics Federations (IAAF) from <strong>1999 to 2015.</strong> He was the subject of numerous investigations into corruption during his tenure ...",
    "published": "October 18, 2025"
  },
  {
    "title": "World Athletics | IAAF World Championships, Beijing 2015 press conference| News",
    "url": "https://worldathletics.org/news/iaaf-news/iaaf-world-championships-beijing-2015-press-c",
    "snippet": "IAAF President Lamine Diack took to the stage for the last IAAF World Athletics Series pre-event press conference of his presidency ahead of the IAAF World Championships, Beijing 2015 in the Chinese National Convention Centre on Thursday (20).",
    "published": null
  },
  {
    "title": "IAAF limps on as rumours, allegations and innuendo race out of control | World Athletics | The Guardian",
    "url": "https://www.theguardian.com/sport/2014/dec/11/iaaf-lamine-diack-presidency-athletics",
    "snippet": "In November 2013 Lamine Diack was ... and Kenya. In reality it was only doing its job. The worry is that <strong>Diack has been IAAF president since 1999</strong>....",
    "published": "September 16, 2020"
  }
]