[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "He <strong>liberalised the Indian economy, allowing it to speed up development dramatically</strong>. During his term as prime minister, Singh continued to encourage growth in the Indian market, enjoying widespread success in these matters. Singh, along with his finance minister, P. Chidambaram, presided over ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "Singh received numerous awards and honours during his lifetime. Among the most prominent are India’s second-highest civilian honour, the Padma Vibhushan (1987), the Jawaharlal Nehru Birth Centenary Award of the Indian Science Congress (1995), the Asia Money Award for Finance Minister of the Year (1993 and 1994), the Euro Money Award for Finance Minister of the Year (1993), the Adam Smith Prize of the University of Cambridge (1956), and the Wright’s Prize for Distinguished Performance at St.",
    "published": null
  },
  {
    "title": "Manmohan Singh | Biography, Reforms, Political Career, & Death | Britannica",
    "url": "https://www.britannica.com/biography/Manmohan-Singh",
    "snippet": "Manmohan SinghAn economist by education, Manmohan Singh brought significant reforms to India as the country&#x27;s finance minister during the 1990s, at a time when India was near economic collapse. He became prime minister in 2004 and was the first prime minister after Jawaharlal Nehru to return to the office after completing a full five-year term.",
    "published": "February 24, 2005"
  },
  {
    "title": "Dr. Manmohan Singh: India’s son, the Pride of the World",
    "url": "https://inc.in/congress-sandesh/tribute/dr-manmohan-singh-india-s-son-the-pride-of-the-world",
    "snippet": "... During the tenure of economist Dr. Manmohan Singh, <strong>the Indian economy grew at the rate of 8.9 percent</strong>. In 2007, India achieved a GDP growth rate of 9 percent and became the second fastest growing economy in the world.",
    "published": null
  },
  {
    "title": "List of awards and honours received by Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_awards_and_honours_received_by_Manmohan_Singh",
    "snippet": "Later that year, prime minister ... as finance minister, he was successful in <strong>implementing reforms aimed at enhancing productivity and liberalising of India&#x27;s economy</strong>....",
    "published": "July 11, 2025"
  }
]