[
  {
    "title": "Anke Domscheit-Berg: \"The most important complex is digital sovereignty\" | heise online",
    "url": "https://www.heise.de/en/news/Anke-Domscheit-Berg-The-most-important-complex-is-digital-sovereignty-10328983.html",
    "snippet": "Newsletter · heise-Bot · ... · Advertisement · Anke Domscheit-Berg, Germany&#x27;s best-known digital politician, <strong>has left the Bundestag</strong>....",
    "published": "March 26, 2025"
  },
  {
    "title": "Anke Domscheit-Berg - Aktivistin, Publizistin, Mitglied des Deutschen Bundestages",
    "url": "https://mdb.anke.domscheit-berg.de/",
    "snippet": "... „<strong>Wir haben kein Geldmangelproblem und mehr Geld hilft nicht</strong>“, sagt auch Anke Domscheit-Berg, (Linksfraktion). Es brauche eher ein zentralgesteuertes Digitalbudget und eine Grundgesetzänderung, damit in diesem Bereich mehr Hilfen vom Bund auf föderaler Ebene ankommen.",
    "published": "March 24, 2025"
  },
  {
    "title": "Digitalexpertin vergleicht neue KI-Verordnung mit zahnlosem Tiger | MDR.DE",
    "url": "https://www.mdr.de/nachrichten/deutschland/politik/domscheit-berg-kritik-ki-gesetz-100.html",
    "snippet": "Aber die gesetzliche Grundlage fehlt trotzdem. Außerdem braucht die BNetzA dafür Haushaltsmittel – und <strong>es gibt immer noch keinen Bundeshaushalt für 2025</strong> – daran wird sich auch bis mindestens Ende September nichts ändern und es ist absehbar, dass es sowieso zu wenig wird.",
    "published": "August 4, 2025"
  },
  {
    "title": "Pressemitteilung: Kleine Anfrage offenbart Souveränitätsrisiken bei Clouds im Bund - Anke Domscheit-Berg",
    "url": "https://mdb.anke.domscheit-berg.de/2025/04/pressemitteilung-cloud-souveranitat/",
    "snippet": "Zusammenfassung: <strong>Bund verdoppelt Ausgaben für Cloud von 2021 bis 2024 auf 286 Mio €</strong> Der Open Source Anteil der Clouds ist mit 2 Prozent extrem niedrig, bei Cloud-Entwicklungskosten beträgt er 5,8 Prozent, beim Cloud-Betrieb nur 0,1 Prozent. Sicherheitsbehörden überraschen als Open Source ...",
    "published": "April 2, 2025"
  },
  {
    "title": "Pressemitteilung: Verheerende Nachhaltigkeitsbilanz der Bundes-IT - Anke Domscheit-Berg",
    "url": "https://mdb.anke.domscheit-berg.de/2025/03/pm-verheerende-nachhaltigkeitsbilanz-it-bund/",
    "snippet": "<strong>Seit 10 Jahren soll die Anzahl der Rechenzentren des Bundes um 90 Prozent sinken, von 100 RZ in 2015 auf 10 RZ in 2025</strong>. Stattdessen zeigen meine Kleinen Anfragen seit Jahren, dass keine Konsolidierung stattfindet. Für Ende 2024 gab der Bund 135 RZ an und noch in diesem Jahr sollen daraus sogar ...",
    "published": "March 4, 2025"
  }
]