[
  {
    "title": "History | Princeton University",
    "url": "https://www.princeton.edu/meet-princeton/history",
    "snippet": "<strong>Chartered in 1746</strong>, Princeton is the fourth-oldest college in the United States. The University has been led by 20 presidents, spanning colonial times to the 21st century. Nobel Peace Prize laureate Maria Ressa ’86 returned to campus to receive ...",
    "published": null
  },
  {
    "title": "History of Princeton University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Princeton_University",
    "snippet": "Princeton University was <strong>founded in Elizabeth, New Jersey, in 1746 as the College of New Jersey</strong>, shortly before moving into the newly built Nassau Hall in Princeton. In 1783, for about four months Nassau Hall hosted the United States Congress, and many of the students went on to become leaders ...",
    "published": "September 15, 2024"
  },
  {
    "title": "Princeton University | History, Location, & Notable Alumni | Britannica",
    "url": "https://www.britannica.com/topic/Princeton-University",
    "snippet": "Princeton University was <strong>originally founded as the College of New Jersey in Elizabeth, New Jersey, in 1746 and moved to nearby Newark in 1747</strong>. Its inception was a direct outgrowth of the Great Awakening, a religious movement to revitalize ...",
    "published": "July 20, 1998"
  },
  {
    "title": "Princeton University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Princeton_University",
    "snippet": "Tilghman also led initiatives for more global programs, the creation of an office of sustainability, and investments into the sciences. Princeton&#x27;s 20th and current president, Christopher Eisgruber, was elected in 2013. In 2017, Princeton University unveiled a large-scale public history and digital humanities investigation into its historical involvement with slavery called the Princeton &amp; Slavery Project.",
    "published": "September 10, 2001"
  },
  {
    "title": "History :: History of Princeton",
    "url": "https://princetonol.com/history/",
    "snippet": "Princeton has always played a significant role in the history of New Jersey and the United States. <strong>Settled in the late 17th century, it was named Prince-Town in honor of Prince William of Orange and Nassau</strong>.",
    "published": null
  }
]