[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Following a steady decline in popular support, the sudden resignation of deputy prime minister Chrystia Freeland in December 2024 and an ensuing political crisis, Trudeau announced in <strong>January 2025</strong> that he would resign as prime minister and leader of the Liberal Party.",
    "published": "5 days ago"
  },
  {
    "title": "Justin Trudeau, Resigned. What Next for US – Canadian Relations? | Wilson Center",
    "url": "https://www.wilsoncenter.org/article/justin-trudeau-resigned-what-next-us-canadian-relations",
    "snippet": "On <strong>January 6, 2025</strong>, Canadian Prime Minister Justin Trudeau announced his intention to resign as Liberal Party leader as soon as the party is able to choose a new leader.",
    "published": null
  },
  {
    "title": "Canada's Prime Minister Justin Trudeau resigns",
    "url": "https://www.bbc.com/news/articles/c878ryr04p8o",
    "snippet": "&quot;Last night, over dinner, I told ... conference in Ottawa. &quot;<strong>I intend to resign as party leader, as prime minister, after the party selects its next leader through a robust nationwide competitive process</strong>,&quot; he said....",
    "published": "January 6, 2025"
  },
  {
    "title": "Canadian Prime Minister Justin Trudeau and his wife announce their separation : NPR",
    "url": "https://www.npr.org/2023/08/03/1191789443/canadian-prime-minister-justin-trudeau-and-his-wife-announce-their-separation",
    "snippet": "TORONTO — Canadian Prime Minister Justin Trudeau and his wife, Sophie Gregoire Trudeau, announced Wednesday that <strong>they are separating after 18 years of marriage</strong>.",
    "published": "August 3, 2023"
  },
  {
    "title": "Canada’s Trudeau announces resignation following party pressure amid criticisms of Trump, budget handling",
    "url": "https://www.foxnews.com/world/canadas-trudeau-announces-resignation-following-party-pressure-amid-criticisms-trump-budget-handling.amp",
    "snippet": "Canadian Prime Minister Justin Trudeau announced his resignation after calls increased for his ouster over his handling of economic policies and threats levied by President-elect Trump that have threatened a &#x27;tariff war.&#x27;",
    "published": "January 6, 2025"
  }
]