[
  {
    "title": "The Past Presidents of the IAAF | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/the-past-presidents-of-the-iaaf",
    "snippet": "Under Burghley - although he was also officially known as the 6th Marquess of Exeter after the death of his father in 1956 - athletics also enhanced its position within the Olympic movement and strengthened its financial position from the distribution of International Olympic Committee television revenues. However, his final years as IAAF president before standing down in 1976 were turbulent, with many countries outside Europe were clamouring for a greater say in the decision making of the Federation.",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "Between 1978 and 1982, World Athletics staged twelve Golden Events, all for men and principally in track running, which saw World Athletics offer prizes to encourage competition. Three years later in 1985, an annual track and field circuit was created in the form of the IAAF Grand Prix, which linked existing top-level one-day meetings with a season-ending IAAF Grand Prix Final for a selection of men&#x27;s and women&#x27;s events.",
    "published": "6 days ago"
  },
  {
    "title": "Past Presidents of the IAAF | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/past-presidents-of-the-iaaf",
    "snippet": "Aside the present incumbent <strong>Lamine Diack</strong>, since the IAAF was founded in 1912 only four other Presidents have been elected by Congress.",
    "published": null
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The role of the Executive Board is to govern World Athletics’ business · The Executive Board has responsibility for all decisions related to the business of World Athletics including developing and reviewing the World Athletics Strategic Plan; adopting and monitoring the annual plan and ...",
    "published": null
  },
  {
    "title": "International Association of Athletics Federations - Oxford Reference",
    "url": "https://www.oxfordreference.com/display/10.1093/oi/authority.20110819140840657",
    "snippet": "The IAAF stages ten regular athletics ... half-marathon championships. The switch from the 64-year-long rule of the patricians <strong>Edström and Burghley</strong> to an African leadership ......",
    "published": null
  }
]