[
  {
    "title": "List of Real Madrid CF managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Real_Madrid_CF_managers",
    "snippet": "The most successful coach with Real Madrid is Carlo Ancelotti, as won 15 titles with the team. Ancelotti, in two spells, won La Liga twice, Copa del Rey twice, UEFA Champions League three times, Spanish Super Cup twice, UEFA Super Cup three times, FIFA Club World Cup twice, and one FIFA Intercontinental Cup. The complete list of Real Madrid managers is shown in the following table: Information correct as of the match played 27 September 2025...",
    "published": "September 27, 2025"
  },
  {
    "title": "Official Real Madrid staff in 2025/26 | LALIGA",
    "url": "https://www.laliga.com/en-GB/clubs/real-madrid/squad",
    "snippet": "Discover all the players and coaches of the official Real Madrid 2025/26 squad in Primera División by going to the official LALIGA website.",
    "published": null
  },
  {
    "title": "Leverkusen's Xabi Alonso confirmed as new Real Madrid coach – DW – 05/25/2025",
    "url": "https://www.dw.com/en/leverkusens-xabi-alonso-confirmed-as-new-real-madrid-coach/a-72663073",
    "snippet": "&quot;<strong>Xabi Alonso</strong> will be the Real Madrid coach for the next three seasons, from June 1, 2025 until June 30, 2028,&quot; the Spanish club said in a statement.",
    "published": "May 26, 2025"
  },
  {
    "title": "Xabi Alonso Brings Two Former Barcelona Staff Members to Real Madrid | beIN SPORTS",
    "url": "https://www.beinsports.com/en-us/soccer/articles-video/xabi-alonso-brings-two-former-barcelona-staff-members-to-real-madrid-2025-05-27",
    "snippet": "Now he returns to Valdebebas, but this time with the first team. In addition to Parrilla, Alonso new coaching staff at Real Madrid will include <strong>Alberto Encinas, Beñat Labaien, and Ismael Cameforte-López</strong>.",
    "published": null
  },
  {
    "title": "Real Madrid - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/real-madrid/mitarbeiterhistorie/verein/418",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along. Under &quot;Position&quot;, you can select a specific role from the drop-down menu. 2025-06-012021-07-012019-03-112018-11-132018-10-292018-07-012016-01-04...",
    "published": null
  }
]