[
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "His parents met in March 1962 on a voyage from Sydney to Southampton, England, on the Sitmar Line&#x27;s TSS Fairsky, where his father worked as a steward, but did not continue their relationship afterwards, going their separate ways. Albanese&#x27;s mother adopted Carlo&#x27;s surname for herself and named Anthony after his cousin Anthony Howett, who had died in a car accident in Northern New South Wales four years earlier.",
    "published": "20 hours ago"
  },
  {
    "title": "Who is Anthony Albanese - Australia's re-elected prime minister?",
    "url": "https://www.bbc.com/news/world-australia-61267489",
    "snippet": "... For many, Albanese&#x27;s ascension to the top job in 2022 had brought a sense of relief - at the demise of his deeply unpopular predecessor <strong>Scott Morrison</strong> - and hope for a new chapter, free of the political instability and national crises which ...",
    "published": "May 3, 2025"
  },
  {
    "title": "Australian PM accuses predecessor Scott Morrison of \"trashing our democracy\" with secret roles",
    "url": "https://www.axios.com/2022/08/16/australia-scott-morrison-secret-roles-albanese",
    "snippet": "Australian Prime Minister Anthony Albanese accused predecessor <strong>Scott Morrison</strong> Tuesday of &quot;an extraordinary and unprecedented trashing of our democracy&quot; after it emerged the former leader quietly took on extra ministerial powers.",
    "published": "August 16, 2022"
  },
  {
    "title": "New Australian Prime Minister Anthony Albanese sworn in",
    "url": "https://www.lemonde.fr/en/international/article/2022/05/23/new-australian-prime-minister-anthony-albanese-sworn-in_5984351_4.html",
    "snippet": "Anthony Albanese&#x27;s center-left Labor Party ousted predecessor <strong>Scott Morrison&#x27;s</strong> conservative coalition at Saturday&#x27;s election. Vote counting is still ongoing to determine whether he will control a majority of the Parliament.",
    "published": "May 23, 2022"
  },
  {
    "title": "Bondi Beach shooting vigil sees Prime Minister Anthony Albanese booed | Fox News",
    "url": "https://www.foxnews.com/world/australian-pm-albanese-gets-booed-during-bondi-beach-vigil-honoring-hanukkah-attack-victims",
    "snippet": "Australian Prime Minister Anthony Albanese was met with boos while attending a vigil honoring the victims of the Bondi Beach shooting on Sunday.",
    "published": "1 day ago"
  }
]