[
  {
    "title": "Stanford",
    "url": "https://hai.stanford.edu/",
    "snippet": "Unless we tap into the full gamut of disciplinary expertise we cannot hope to realize the potential of the technology while avoiding its pitfalls. ... HAI was established <strong>to support innovative AI research that bridges disciplines and fields</strong>. The Institute aims to appoint and support promising ...",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | Stanford Online",
    "url": "https://online.stanford.edu/schools-centers/stanford-institute-human-centered-artificial-intelligence-hai",
    "snippet": "Stanford founded the Institute for Human-Centered AI <strong>in 2019</strong> to guide and build the future of AI.HAI advances AI research, education, policy and practice to improve the human condition.",
    "published": "October 17, 2024"
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/company/stanfordhai",
    "snippet": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | 91,795 followers on LinkedIn. Advancing AI research, education, policy, and practice to improve humanity. | At Stanford HAI, our vision for the future is led by our commitment to studying, guiding and developing human-centered ...",
    "published": null
  },
  {
    "title": "Stanford University launches the Institute for Human-Centered Artificial Intelligence | Stanford Report",
    "url": "https://news.stanford.edu/stories/2019/03/stanford_university_launches_human-centered_ai",
    "snippet": "Stanford HAI aims to become a global, inter-disciplinary hub for discussion and development of AI. Stanford President Marc Tessier-Lavigne said artificial intelligence has the potential to radically change how we live our lives. “Now is our opportunity to shape that future by putting humanists and social scientists alongside people who are developing artificial intelligence,” he said. “This approach aligns with Stanford’s founding purpose to produce knowledge for the betterment of humanity.",
    "published": null
  },
  {
    "title": "At five years old, Institute for Human-Centered AI looks to the future",
    "url": "https://stanforddaily.com/2024/11/05/stanford-hai-five-years/",
    "snippet": "In HAI’s five years of operation, the institute has focused on policy, research and education and has funded the research projects of more than 400 faculty, said HAI co-founder and co-director <strong>James Landay</strong>, a computer science professor.",
    "published": "November 5, 2024"
  }
]