[
  {
    "title": "MIKE BROWN NAMED NEW YORK KNICKS HEAD COACH | New York Knicks",
    "url": "https://knicks.com/news/mike-brown-named-new-york-knicks-head-coach",
    "snippet": "Get all the latest news and announcements from the New York Knicks. Read press releases, breaking news, see the latest videos, galleries, and much more!",
    "published": "July 7, 2025"
  },
  {
    "title": "USD Alumnus Mike Brown ('93) Named New York Knicks Head Coach - University of San Diego Athletics",
    "url": "https://usdtoreros.com/news/2025/7/10/mens-basketball-usd-alumnus-mike-brown-92-named-new-york-knicks-head-coach.aspx",
    "snippet": "Men&#x27;s Basketball July 10, 2025 · NEW YORK – University of San Diego alumnus <strong>Mike Brown</strong> (’93) was named the head coach of one of the NBA’s most storied franchises, the New York Knicks on Monday, July 7. Brown played for the Toreros Men’s ...",
    "published": "July 10, 2025"
  },
  {
    "title": "Knicks hire Mike Brown: How New York looks different in 2025-26 - ESPN",
    "url": "https://www.espn.com/nba/story/_/id/45647695/knicks-hire-mike-brown-how-new-york-looks-different-2025-26",
    "snippet": "Shams Charania joins &quot;The Pat McAfee Show&quot; and breaks the news that <strong>Mike Brown</strong> is expected to be the New York Knicks&#x27; next head coach.",
    "published": "July 3, 2025"
  },
  {
    "title": "New York Knicks hire Mike Brown as new head coach | CNN",
    "url": "https://www.cnn.com/2025/07/08/sport/mike-brown-new-york-knicks-head-coach-spt",
    "snippet": "The New York Knicks have confirmed the hiring of <strong>Mike Brown</strong> as the team’s new head coach.",
    "published": "July 8, 2025"
  },
  {
    "title": "List of New York Knicks head coaches - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_New_York_Knicks_head_coaches",
    "snippet": "<strong>Tom Thibodeau</strong> was the Knicks head coach from 2020 to 2025. ^ A running total of the number of coaches of the Knicks. Thus, any coach who has two or more separate terms as head coach is only counted once. ^ Each year is linked to an article about that particular NBA season.",
    "published": "3 weeks ago"
  }
]