[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "By 1986, IRI was suffering heavy losses—with Alfa Romeo having not been profitable for the last 13 years—and IRI president Romano Prodi put Alfa Romeo up for sale. <strong>Finmeccanica, the mechanical holdings arm of IRI and its predecessors owned Alfa Romeo since 1932</strong>. Prodi first approached fellow ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "The name Alfa is actually an acronym for, “Anonima Lombarda Fabbrica Automobili” – A.L.F.A. In the formative years between 1932 and 1986, the Alfa was owned by <strong>an Italian state holding company</strong>, which then led to Alfa being under the Fiat ...",
    "published": "April 26, 2021"
  },
  {
    "title": "Is Alfa Romeo Part of Stellantis? | Benson Alfa Romeo",
    "url": "https://www.alfaromeousaofgreer.com/research/is-alfa-romeo-part-of-stellantis.htm",
    "snippet": "So who owned Alfa Romeo during this time? Between 1932 and 1986, <strong>an Italian state-holding company owned Alfa, and Alfa Romeo joined the Fiat Chrysler Group</strong>. The company then became Alfa Romeo Automobiles S.p.A as a subsidiary of Fiat, also known as FCA or Fiat Chrysler Automobiles.",
    "published": null
  },
  {
    "title": "Who Owns Alfa Romeo? | Where is Alfa Romeo Made?",
    "url": "https://www.aristocratmotorsalfaromeo.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "In 1932, <strong>the Italian state holding company</strong> owned Alfa, which lasted until 1986. During these years, Alfa joined the Fiat group. Then in February 2007, it became Alfa Romeo Automobiles S.p.A.",
    "published": "July 25, 2025"
  },
  {
    "title": "Who Owns Alfa Romeo? | Who Makes Alfa Romeo? | Zeigler Alfa Romeo of Schaumburg",
    "url": "https://www.alfaromeousaofschaumburg.com/who-owns-alfa-romeo/",
    "snippet": "Between 1932 and 1986, <strong>a state holding company in Italy</strong> owned Alfa. During these years, Alfa Romeo became part of the very popular Fiat group. This merger took another step in the right direction in February of 2007.",
    "published": "July 13, 2019"
  }
]