[
  {
    "title": "Shakeup in Wartime Ukraine Consolidates Power in the President’s Office | German Marshall Fund of the United States",
    "url": "https://www.gmfus.org/news/shakeup-wartime-ukraine-consolidates-power-presidents-office",
    "snippet": "Following the resignation of Dmytro Kuleba, the Verkhovna Rada swiftly appointed <strong>Andrii Sybiha as the new minister of foreign affairs</strong>. Like many others during this wave of appointments, Sybiha previously held the role of deputy to Andrii Yermak ...",
    "published": null
  },
  {
    "title": "perceptions of ideal leadership among public leaders in ...",
    "url": "https://www.emerald.com/insight/content/doi/10.1108/ijpl-11-2024-0136/full/html",
    "snippet": "These gradual changes prior to 2022 prepared the soil and made a soft transition from <strong>autocratic to collectivistic leadership</strong> possible. For understanding the ideals of distributed leadership in ongoing crises of war showcased by Ukraine’s ...",
    "published": "May 27, 2025"
  },
  {
    "title": "Leadership Lessons from Ukraine - by Mick Ryan",
    "url": "https://mickryan.substack.com/p/leadership-lessons-from-ukraine",
    "snippet": "Part two of my special examination of the key lessons about modern leadership from the war in Ukraine. In this final part, strategic and combat leadership are the focus.",
    "published": "June 27, 2024"
  },
  {
    "title": "Lessons from Ukraine’s wartime CEOs on leading through crisis | Insights | Heidrick & Struggles",
    "url": "https://www.heidrick.com/en/insights/chief-executive-officer/lessons-from-ukraines-wartime-ceos-on-leading-through-crisis",
    "snippet": "A year after the outbreak of full-scale war, we began to interview CEOs who lead large-scale Ukrainian businesses in various sectors of the economy in order to understand their leadership journeys: the stages of guiding an organization through a time of war, how these leaders’ behavior has changed, their motivations and footholds, and lessons learned.",
    "published": null
  },
  {
    "title": "Ukraine’s Presidents, Power Elites, and the Country’s Evolution | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/ukraines-presidents-power-elites-and-countrys-evolution",
    "snippet": "After three rounds of elections and two months of protests in Kyiv’s Maidan Nezalezhnosti (Independence Square), <strong>Viktor Yushchenko became president</strong>. Under his leadership, Ukraine rose in the measurements of democracy, but the president’s ...",
    "published": null
  }
]