[
  {
    "title": "Juventus appoint Luciano Spalletti as manager until end of season - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cy7epp72ek0o",
    "snippet": "Juventus have appointed former Italy head coach Luciano Spalletti as their manager until the end of the season.",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_FC",
    "snippet": "After a two-and-a-half-season absence, Lippi returned to the club in 2001, following his replacement Carlo Ancelotti&#x27;s dismissal, signing big name players like Gianluigi Buffon, David Trezeguet, Pavel Nedvěd, and Lilian Thuram, helping the team to win the 2001–02 Serie A, which was their first since 1998, and confirmed themselves in the 2002–03 Serie A. Juventus were also part of the all Italian 2003 UEFA Champions League final but lost out to Milan on penalties after the game ended in a 0–0 draw. At the conclusion of the following season, Lippi was appointed as the Italy national team&#x27;s head coach, bringing an end to one of the most fruitful managerial spells in Juventus&#x27;s history.",
    "published": "3 days ago"
  },
  {
    "title": "List of Juventus FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Juventus_FC_managers",
    "snippet": "Juventus Football Club is an Italian professional association football club based in Turin, Piedmont, who currently play in the Serie A. They have played at their current home ground, Juventus Stadium, since 2011. This chronological list comprises all those who have held the position of manager ...",
    "published": "November 2, 2025"
  },
  {
    "title": "Juventus have a smart new coach in Luciano Spalletti – now the club needs to get its act together - The Athletic",
    "url": "https://www.nytimes.com/athletic/6759612/2025/10/30/juventus-spalletti-coach/",
    "snippet": "<strong>Cristiano Giuntoli</strong> was appointed to run recruitment, having assembled the Napoli team Spalletti guided to their first league title in 33 years. Giuntoli, people forget, had been considered best-in-class in his role and, to put his stamp on Juventus, ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=1408&teamTabs=managers",
    "snippet": "Juventus Football Club Managers, full history, past and present. Provided courtesy of Soccerbase.com, the Football Betting Site.",
    "published": null
  }
]