[
  {
    "title": "Federal Reserve Bank of Boston - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Federal_Reserve_Bank_of_Boston",
    "snippet": "It has been headquartered since 1977 in the distinctive 614-foot (187 m) tall, 32-story Federal Reserve Bank Building at <strong>600 Atlantic Avenue, Boston</strong>. Designed by architecture firm Hugh Stubbins &amp; Associates, the tower portion of the building is suspended between two towers on either side.",
    "published": "October 24, 2025"
  },
  {
    "title": "Federal Reserve Bank Building (Boston) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Federal_Reserve_Bank_Building_(Boston)",
    "snippet": "The Federal Reserve Bank Building is the seventh tallest building in Boston, Massachusetts. It is located at <strong>Dewey Square, on the convergence of Fort Point and the Financial District neighborhoods</strong>.",
    "published": "November 21, 2025"
  },
  {
    "title": "Federal Reserve Bank of Boston Offices: Locations & Headquarters | Built In",
    "url": "https://builtin.com/company/federal-reserve-bank-boston/offices",
    "snippet": "Federal Reserve Bank of Boston is headquartered in <strong>Boston, Massachusetts, USA</strong>. ... Employees engage in a combination of remote and on-site work. Most jobs are eligible for a hybrid schedule with some on-site work expected. Additionally, remote roles are available and have been labeled as such.",
    "published": null
  },
  {
    "title": "Federal Reserve Bank of Boston - Overview, News & Similar companies | ZoomInfo.com",
    "url": "https://www.zoominfo.com/c/federal-reserve-bank-of-new-york/44207686",
    "snippet": "Federal Reserve Bank of Boston&#x27;s headquarters are located at <strong>600 Atlantic Ave, Boston, Massachusetts, 02210, United States</strong>",
    "published": null
  },
  {
    "title": "Home - Federal Reserve Bank of Boston",
    "url": "https://www.bostonfed.org/",
    "snippet": "The Boston Fed works to promote sound growth and financial stability in New England and the nation.",
    "published": "August 15, 2025"
  }
]