[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the <strong>chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "As the <strong>11th chancellor of the University of California at Santa Cruz</strong>, Cynthia Larive leads an institution known worldwide for its high-impact research, for seeking interdisciplinary solutions to the world’s greatest challenges, and for its commitment to social and environmental justice.",
    "published": null
  },
  {
    "title": "Cynthia Larive - Chancellor - Univerisity of California Santa Cruz | LinkedIn",
    "url": "https://www.linkedin.com/in/cynthia-larive-83218a8",
    "snippet": "View Cynthia Larive’s profile on LinkedIn, the world’s largest professional community. Cynthia has 3 jobs listed on their profile. See the complete profile on LinkedIn and discover Cynthia’s connections and jobs at similar companies.",
    "published": null
  },
  {
    "title": "Cynthia Larive to become 11th chancellor of UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2019/05/chancellor-designate/",
    "snippet": "Cynthia K. Larive as the eleventh chancellor of UC Santa Cruz. Currently the <strong>provost and executive vice chancellor at UC Riverside</strong>, Larive has served the UC community for nearly a decade and a half as a faculty member, administrator ...",
    "published": "May 13, 2025"
  },
  {
    "title": "Chancellor Larive assumes position as new Board Chair for Monterey Bay Economic Partnership - News",
    "url": "https://news.ucsc.edu/2022/04/chancellor-larive-mbep/",
    "snippet": "University of California, Santa Cruz Chancellor Cynthia K. Larive will assume the role of <strong>incoming board chair for the Monterey Bay Economic Partnership</strong>.",
    "published": "March 18, 2025"
  }
]