[
  {
    "title": "TF1 Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1_Group",
    "snippet": "The history of TF1 traces back to 1975, when the Office de Radiodiffusion-Télévision Française (ORTF) was split into 7 successor institutions. Allegedly to provide competition for Canal+, La Cinq and M6, the French government decided to privatize TF1. In April 1987, the construction conglomerate Bouygues won the resulting auction for the sale of TF1, ahead of the Lagardère Group.",
    "published": "2 weeks ago"
  },
  {
    "title": "Nos principaux dirigeants | Le Groupe | Groupe TF1 : actualités, communiqués, agenda, événements, publications",
    "url": "https://groupe-tf1.fr/en/group/our-directors",
    "snippet": "In addition to these activities, <strong>Rodolphe Belmer</strong> is president of the foundation created by SACD - Auteurs Solidaires - since 2018. This fondation aims to engage in cultural actions to improve social ties and integration for all. From 2019 to 2022, he chaired the Séries Mania festival, which ...",
    "published": null
  },
  {
    "title": "Arnaud Bosom",
    "url": "http://arnaudbosom.com/tf1-group.php",
    "snippet": "TF1 Group&#x27;s collaborator for more than twenty years, <strong>Arnaud Bosom</strong> has brought numerous contributions via various job positions as a technical manager, or more recently Deputy Director General of Human Relations then CSR director since last March. To better identify his activities, it is convenient ...",
    "published": null
  },
  {
    "title": "TF1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1",
    "snippet": "Key figures within TF1 are close friends to some of the most powerful politicians in France, and the relationship between Bouygues and the public-sector contracting system often raises suspicions. Immigration and violence are arguably conflated in the channel&#x27;s news programmes. In addition, it is occasionally alleged that news reports from TF1 tend to ignore issues yielding a bad light on their parent group (Bouygues), while stressing the problems of competitors (such as Vinci SA).",
    "published": "1 week ago"
  },
  {
    "title": "Notre histoire | Le Groupe | Groupe TF1 : actualités, communiqués, agenda, événements, publications",
    "url": "https://groupe-tf1.fr/en/group/our-history",
    "snippet": "From privatisation in 1987 through European expansion in the 1990s and recent moves into digital, production and music, TF1 has kept pace with our changing society and left its mark on popular culture. Revisit the key dates in the history of the Group – which is still being written and re-invented – and discover just how much our story is your story too.",
    "published": null
  }
]