[
  {
    "title": "EBRD Shareholders and Board of Governors",
    "url": "https://www.ebrd.com/shareholders-and-board-of-governors.html",
    "snippet": "Learn about the EBRD&#x27;s journey to investing more than €210 billion in over 7,500 projects. ... Through projects, business services and involvement in high-level policy reform, we&#x27;re doing more than ever before. ... We draw on three decades of regional knowledge and financial expertise to tailor our products and approaches to each client&#x27;s needs. ... While retaining overall authority over the Bank, the Board of Governors delegates most powers to the Board of Directors, which is responsible for approving the EBRD&#x27;s country, sector and thematic strategies, policies and operations.",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Bank_for_Reconstruction_and_Development",
    "snippet": "The creation of the EBRD has led to the financing of various projects in the years following its first operations, for instance there were twenty projects in 1992 in which the EBRD provided financing worth ECU 2.1 billion. Divided between its headquarters located in London, and field offices located elsewhere, the European Bank for reconstruction and development is made of a three-tier structure composed of firstly, the president and the staff, secondly the Board of Governors and finally the Board of Directors.",
    "published": "1 week ago"
  },
  {
    "title": "Board of Governors Information",
    "url": "https://www.ebrd.com/board-of-governors-information.html",
    "snippet": "Learn about the EBRD&#x27;s journey to investing more than €210 billion in over 7,500 projects. ... Through projects, business services and involvement in high-level policy reform, we&#x27;re doing more than ever before. ... We draw on three decades of regional knowledge and financial expertise to tailor our products and approaches to each client&#x27;s needs.",
    "published": null
  },
  {
    "title": "EBRD: staff, structure, history",
    "url": "https://www.ebrd.com/home/who-we-are.html",
    "snippet": "The EBRD is owned by 77 countries, as well as the European Union and the European Investment Bank. Each shareholder is represented on the Board of Governors, which has overall authority over the Bank. Our President is Odile Renaud-Basso (left). The President manages our work under the guidance ...",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development Shareholders and Board of Governors",
    "url": "https://web.archive.org/web/20170228141219/http:/www.ebrd.com/shareholders-and-board-of-governors.html",
    "snippet": "Full list of the shareholders and board of governors of the European Bank for Reconstruction and Development (EBRD) which is owned by 65 countries and two European insitutions.",
    "published": null
  }
]