[
  {
    "title": "Televerket (Sweden) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Televerket_(Sweden)",
    "snippet": "Kongliga Elektriska Telegraf-Werket was <strong>founded in 1853</strong> when the first electric telegraph line was established between Stockholm and Uppsala, and was the government agency for telegraph services. From 1871 the company was known as Kongl. Telegrafverket. The first telephone network in Sweden ...",
    "published": "June 4, 2025"
  },
  {
    "title": "Swedish Telecom | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/books/politics-and-business-magazines/swedish-telecom",
    "snippet": "Swedish Telecom began in 1853, established by <strong>the Swedish government</strong> as Kongl. Elektriska Telegraf-Verket when an electric telegraph line using the Morse system was opened between Stockholm and Uppsala. Since then the company has operated under a variety of names, including Telegrafverket after ...",
    "published": null
  },
  {
    "title": "The Swedish Newspaper of America",
    "url": "https://nordstjernan.com/news/sweden/5206/",
    "snippet": "The Swedish end was Kongl. Telegrafverket (founded in 1853 as Konglige Elektriska Telegraf-Werket - literally: Royal Electric Telegraph Agency), later changed to Kungl. Telegrafverket in 1903. The Kungliga (Royal) was dropped in 1946 and the name was further modernized to Televerket in 1953.",
    "published": null
  },
  {
    "title": "Televerket (Sweden) - Alchetron, The Free Social Encyclopedia",
    "url": "https://alchetron.com/Televerket-(Sweden)",
    "snippet": "Kongliga Elektriska Telegraf-Werket was <strong>founded in 1853</strong> when the first electric telegraph line was established between Stockholm and Uppsala, and was the government agency for telegraph services.",
    "published": "December 30, 2024"
  },
  {
    "title": "TELEVERKET",
    "url": "https://www.britishtelephones.com/ericsson/televerket.htm",
    "snippet": "Televerket was a Swedish State authority acting as a state-owned corporation (public enterprise), responsible for telecommunications in Sweden from 1853 until 1993. Originally it was named Kongl. Elektriska Telegraf-Werket (literally: Royal Electric Telegraph Agency), which was <strong>founded in 1853</strong>.",
    "published": null
  }
]