[
  {
    "title": "Mikel Arteta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikel_Arteta",
    "snippet": "The victory put them a five-point advantage at the top of the Premier League with a game in hand, and meant that Arsenal had 50 points from 19 games at the halfway stage of the league season – their best start to a top-flight campaign – 15 more than they had at the same stage last season. After leading the Gunners to two wins and a draw in January from their Premier League games against three teams vying for a place in the top four, Mikel Arteta was named Premier League Manager of the Month for the third time this season – the fifth time since December 2019.",
    "published": "13 hours ago"
  },
  {
    "title": "Six players miss return to Arsenal training as Mikel Arteta given fresh headache | Football London",
    "url": "https://www.football.london/arsenal-fc/news/five-players-miss-return-arsenal-33064897",
    "snippet": "Mikel Arteta has welcomed back his Arsenal squad from their two days off on Tuesday but some players are still yet to return as they continue working back from injury",
    "published": "5 hours ago"
  },
  {
    "title": "Mikel Arteta on injury crisis: Arsenal in 'really dangerous circle' as Max Dowman also sidelined | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13481715/mikel-arteta-on-injury-crisis-arsenal-in-really-dangerous-circle-as-max-dowman-also-sidelined",
    "snippet": "Mikel Arteta says Arsenal are caught in a really dangerous circle after a consistent spate on injuries across this season; Max Dowman is the latest Gunners player to be ruled out, but Arteta denies over-training is to blame; Arsenal play Club Brugge in the Champions League on Wednesday",
    "published": "6 days ago"
  },
  {
    "title": "Mikel Arteta - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/mikel-arteta/profil/trainer/47620",
    "snippet": "<strong>Arsenal Manager</strong> Premier League Appointed: Dec 22, 2019 Contract until: Jun 30, 2027 · IMAGO + Date of birth/Age: Mar 26, 1982 (43) Place of birth: Donostia-San ... Citizenship: Spain · Coaching Licence : UEFA Pro Licence · Avg. term as coach ...",
    "published": null
  },
  {
    "title": "Mikel Arteta: Arsenal boss has transformed Arsenal five years on from his appointment but what's next? | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/story-telling/11095/13276017/mikel-arteta-arsenal-boss-has-transformed-arsenal-five-years-on-from-his-appointment-but-whats-next",
    "snippet": "Arsenal&#x27;s upcoming fixtures | Live Premier League table · But lagging behind Premier League leaders Liverpool this season and having fallen just short of Manchester City in the previous two campaigns, can he take the next step and bring major silverware back to north London? With exclusive insight from the man himself, as well as his players, we look back at the highs and lows of his tenure so far and ponder what comes next. Mikel Arteta knew the importance of projecting authority and self-assurance in his early days as Arsenal boss.",
    "published": null
  }
]