[
  {
    "title": "Francesco Farioli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Francesco_Farioli",
    "snippet": "He is currently the head coach of Primeira Liga club Porto. Farioli started his coaching career in Turkey with spells at <strong>Fatih Karagümrük</strong> and Alanyaspor. He then had one season in charge of French club Nice in Ligue 1, before being appointed by Ajax in May 2024.",
    "published": "20 hours ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "<strong>Heitinga</strong> (Alphen aan den Rijn, November 15, 1983) has spent the past two seasons working in the English Premier League as an assistant coach at West Ham United and Liverpool. Before his move to England in the summer of 2023, the former Ajax ...",
    "published": null
  },
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "In the cup, Ajax was eliminated 3–2 by the third division amateurs of USV Hercules. In the summer of 2024, a rebuild began, with a new board of directors and Alex Kroes and Marijn Beuker as Technical Director and Director of Football. They hired Francesco Farioli as new head coach, the first foreign coach since 1998.",
    "published": "2 weeks ago"
  },
  {
    "title": "AFC Ajax » Coaching Staff List",
    "url": "https://www.worldfootball.net/teams/afc-ajax/9/",
    "snippet": "Football - results, news, statistics and much more...",
    "published": null
  },
  {
    "title": "Liverpool assistant manager John Heitinga appointed Ajax head coach - The Athletic",
    "url": "https://www.nytimes.com/athletic/6386426/2025/05/31/liverpool-heitinga-ajax-manager/",
    "snippet": "“I’m ready to continue as a head coach and I’m honoured to be given that opportunity at Ajax.” · Heitinga joined <strong>Arne Slot</strong>’s backroom staff at Anfield last summer after having had a similar role at West Ham United under David Moyes ...",
    "published": "May 31, 2025"
  }
]