[
  {
    "title": "Golden State Warriors - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Golden_State_Warriors",
    "snippet": "The departure of these players for various reasons symbolized the franchise&#x27;s futility during this period, as head coach Attles moved up to the front office as general manager in 1980 and the team made several coaching changes. New owners <strong>Jim Fitzgerald and Dan Finane</strong> finally managed to return ...",
    "published": "3 days ago"
  },
  {
    "title": "Joe Lacob - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Joe_Lacob",
    "snippet": "<strong>Joseph Steven Lacob</strong> (born January 10, 1956) is an American business executive who was a partner at Kleiner Perkins and is the principal owner of the Golden State Warriors of the National Basketball Association (NBA) and the Golden State Valkyries of the Women&#x27;s National Basketball Association ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Guber | Golden State Warriors",
    "url": "https://www.nba.com/warriors/staff/peter-guber",
    "snippet": "<strong>Peter Guber</strong>, a prominent figure in the sports and entertainment industry for more than 35 years, is owner and co-executive chairman of the Golden State Warri...",
    "published": null
  },
  {
    "title": "Joe Lacob",
    "url": "https://www.forbes.com/profile/joe-lacob/",
    "snippet": "<strong>Peter Guber and Joe Lacob</strong> have revived the Warriors franchise, but can the co-owners meet their players&#x27; rising salary demands? (AP Photo/Ben Margot) In the span of one offseason, the reigning NBA champion Golden State Warriors have gone from ...",
    "published": null
  },
  {
    "title": "Golden State Warriors 2025 Company Profile: Valuation, Funding & Investors | PitchBook",
    "url": "https://pitchbook.com/profiles/company/61947-64",
    "snippet": "The deal was made on 11-Feb-2025. To view Golden State Warriors’s complete investments history, request access » ... Golden State Warriors was founded in 1946. Golden State Warriors is headquartered in San Francisco, CA. Golden State Warriors has 1,422 total employees. Golden State Warriors’s primary industry is Other Restaurants, Hotels and Leisure. Golden State Warriors is a Private company. The current revenue for Golden State Warriors is .",
    "published": null
  }
]