[
  {
    "title": "Leadership | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/about/leadership",
    "snippet": "Ileana Cruz-Marden, MPA *19 Director of Partnerships Tent Partnerships for Refugees Julieta Cuéllar, MPA *19 Director of Strategic Initiatives and Implementation Division of Family and Medical Leave Insurance, Maryland Department of Labor Robert Doar ‘83 President American Enterprise Institute Amber Greene, MPP *12 Chief Equity Officer &amp; Director of Civil Rights City of Baltimore Anna Grzymala-Busse ’92 Michelle and Kevin Douglas Professor of International Studies Stanford University Larry Handerhan, MPA *12 Former Biden-Harris Administration Official, Administration for Children and Fami",
    "published": null
  },
  {
    "title": "Faculty | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/graduate-programs/phd-public-affairs/security-studies/faculty",
    "snippet": "Alexander Glaser, Professor of Mechanical and Aerospace Engineering and International Affairs; Co-Director, Program in Science and Global Security · Adam M. Goldstein, Associate Professor of Sociology and Public Affairs",
    "published": null
  },
  {
    "title": "Faculty Directory | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/research-faculty-centers/faculty-directory",
    "snippet": "Donald E. Stokes Professor of Public and International Affairs; Professor of Politics and Public Affairs, Emeritus ... Frederick D. Barton · Lecturer in Princeton School of Public and International Affairs",
    "published": null
  },
  {
    "title": "Staff | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/undergraduate-program/staff",
    "snippet": "The Director also provides career ... pursuing public service internships and assists them in securing fellowships and jobs in government and nonprofit organizations. Jennifer Skillman Academic Coordinator, Undergraduate Program 114 Robertson Hall jks4@princeton.edu 609-258-4817 · The Academic Coordinator&#x27;s responsibilities include the administrative oversight and management of the School&#x27;s undergraduate ...",
    "published": null
  },
  {
    "title": "Princeton School of Public and International Affairs - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Princeton_School_of_Public_and_International_Affairs",
    "snippet": "The establishment of a school of public and international affairs at Princeton University was announced today by President <strong>John Grier Hibben</strong> in his annual message to the National Alumni Association.",
    "published": "October 26, 2025"
  }
]