[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "Micheál Martin (Irish: [ˈmʲiːçaːl̪ˠ]; born 16 August 1960) is an Irish Fianna Fáil politician serving as Taoiseach since January 2025, having previously held the position from 2020 to 2022. Martin served as <strong>Tánaiste, Minister for Foreign Affairs and Minister for Defence</strong> from December ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Micheal Martin | Taoiseach, Previous Offices, & Family Tragedy | Britannica",
    "url": "https://www.britannica.com/biography/Micheal-Martin",
    "snippet": "Under the agreement that led to the formation of the government some four months after the indecisive February 2020 general election, the premiership transferred to Fine Gael in December 2022. After a strong showing by Fianna Fáil in the 2024 general election, he again took office as taoiseach in January 2025. Martin grew up in a working-class family in the Turners Cross area of Cork city.",
    "published": "February 3, 2022"
  },
  {
    "title": "Micheál Martin - Taoiseach and Uachtarán Fhianna Fáil. TD for Cork South Central. | LinkedIn",
    "url": "https://ie.linkedin.com/in/miche%C3%A1l-martin-b6a7b4b9",
    "snippet": "TD for Cork South Central. · Taoiseach and Uachtarán Fhianna Fáil, TD for Cork South Central. <strong>Tánaiste &amp; Minister for Foreign Affairs &amp; Minister for Defence</strong> from 2022 to 2025.",
    "published": "November 6, 2025"
  },
  {
    "title": "Taoiseach - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taoiseach",
    "snippet": "The incumbent Taoiseach is Micheál Martin, TD, <strong>leader of Fianna Fáil</strong>, who took office on 23 January 2025, following the 2024 general election and an agreement between Fianna Fáil, Fine Gael and independent TDs.",
    "published": "4 days ago"
  },
  {
    "title": "Micheál Martin becomes Irish prime minister for second time | ...",
    "url": "https://www.euractiv.com/section/politics/news/micheal-martin-becomes-irish-prime-minister-for-second-time/",
    "snippet": "The new coalition deal, like the old one, requires Martin to resign part-way through the government’s term and to pass the baton to the Fine Gael leader – currently <strong>Simon Harris</strong>, the outgoing Taoiseach.",
    "published": "January 24, 2025"
  }
]