[
  {
    "title": "2025 IAU Election Results and New Council Announcement - IAU - International Association of Ultrarunners",
    "url": "https://iau-ultramarathon.org/2025-iau-election-results-and-new-council-announcement.html",
    "snippet": "IAU President <strong>Nadeem Khan</strong> expresses his sincere gratitude to the outgoing members of the Council, including Vice President Robert Boyce, General Secretary Hilary Walker, Directors Jacek Bedkowski, Hilmy Aboud Said, Paco Rico, Diana Amza (stepped ...",
    "published": "October 17, 2025"
  },
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "Contact: To contact the IAU Secretary General please get in touch with het assistant: Jessica Huang at: j.huang [@] iau-aiu.net ... <strong>Prof Andrew Deeks</strong> IAU President (2022-2026) President and Vice-Chancellor, Murdoch University, Australia biography ... Welcome to the IAU.",
    "published": null
  },
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Subsequent history is recorded in the form of reminiscences of past IAU Presidents and General Secretaries. Twelve of the fourteen past General Secretaries in the period 1964–2006 contributed their recollections of the Union&#x27;s history in IAU Information Bulletin No.",
    "published": "3 weeks ago"
  },
  {
    "title": "Presidency — International Association of Universities",
    "url": "https://iau.global/presidency",
    "snippet": "She or he chairs the Administrative Board and the Executive Committee. The current IAU President, <strong>Professor Andrew Deeks</strong>, was elected during the IAU’s 16th General Conference in Dublin, Ireland in October 2022.",
    "published": null
  },
  {
    "title": "Simone Lepore Elected President & Policy Recommendations for Erasmus+ 2028–2034 Released — International Association of Universities",
    "url": "https://iau.global/news/esn-new-president-2025",
    "snippet": "ESN has elected <strong>Simone Lepore</strong> as its new President. Simone will officially begin his mandate on 1st August 2025. He succeeds Rita Dias, whom we thank for her dedication and leadership.",
    "published": "August 4, 2025"
  }
]