[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "If so, the president may serve as both the head of state and de facto head of government, while the prime minister serves as his deputy, acting as a link between the legislature and the executive. The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 ...",
    "published": "18 hours ago"
  },
  {
    "title": "Welcome to the website of the French Presidency",
    "url": "https://www.elysee.fr/en/",
    "snippet": "Find out all the news of the President <strong>Emmanuel Macron</strong> on the official website and discover our pages on the history of the French Republic.",
    "published": null
  },
  {
    "title": "French PM wins crucial budget vote",
    "url": "https://www.bbc.com/news/articles/c3w7530w37po",
    "snippet": "<strong>Lecornu is Macron&#x27;s fourth prime minister since then</strong> – the two previous incumbents Michel Barnier and François Bayrou were both forced to resign after trying to rein in France&#x27;s burgeoning debt.",
    "published": "1 week ago"
  },
  {
    "title": "POLITICO Poll of Polls — French polls, trends and election news for France",
    "url": "https://www.politico.eu/europe-poll-of-polls/france/",
    "snippet": "France — National parliament voting intention What is Poll of Polls and how does it work? Read more here. France — 2024 general election France — President <strong>Emmanuel Macron</strong>’s approval rating De…",
    "published": "September 26, 2025"
  },
  {
    "title": "Emmanuel Macron - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emmanuel_Macron",
    "snippet": "After Bayrou was himself brought down by a confidence vote in September 2025, Macron appointed <strong>Sébastien Lecornu</strong>, Minister of the Armed Forces, as Prime Minister. Lecornu resigned less than a month later following political backlash over the ...",
    "published": "2 weeks ago"
  }
]