[
  {
    "title": "Old Trafford - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Old_Trafford",
    "snippet": "<strong>Old Trafford</strong> (/ˈtræfərd/) is a football stadium in <strong>Old Trafford</strong>, Greater Manchester, England, and is the home of Manchester United. With a capacity of 74,197, it is the largest club football stadium (and second-largest football stadium overall after Wembley Stadium) in the United Kingdom, ...",
    "published": "1 day ago"
  },
  {
    "title": "Manchester United Stadium Information - United In Focus",
    "url": "https://www.unitedinfocus.com/club/stadium/",
    "snippet": "Manchester United have called <strong>Old Trafford</strong> their home since 1910 following a move to their third stadium since being founded. The Red Devils initially called North Road their base between their formation in 1878 and 1893 before switching to ...",
    "published": "December 8, 2023"
  },
  {
    "title": "Manchester United F.C. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manchester_United_F.C.",
    "snippet": "After the war, the club received compensation from the War Damage Commission in the amount of £22,278. While reconstruction took place, the team played its &quot;home&quot; games at Manchester City&#x27;s <strong>Maine Road ground</strong>; Manchester United was charged £5,000 per year, plus a nominal percentage of gate ...",
    "published": "2 days ago"
  },
  {
    "title": "Manchester United to leave Old Trafford as Sir Jim Ratcliffe announces plans for new 100,000-seater ground | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11667/13326081/man-utd-to-leave-old-trafford-as-sir-jim-ratcliffe-announces-plans-for-new-100-000-seater-ground",
    "snippet": "These are the key takeaways from Foster and Partners&#x27; report about the new stadium: Foster and Partners have referred to Manchester United’s new ground as “<strong>New Trafford Stadium</strong>” in their report It will be the become the tallest building ...",
    "published": "March 12, 2025"
  },
  {
    "title": "Our Guide To Old Trafford – The Home Of Manchester United | Football Ticket Pad",
    "url": "https://www.footballticketpad.com/news/our-guide-to-old-trafford-the-home-of-manchester-united",
    "snippet": "So without further ado, this is our guide to <strong>Old Trafford</strong> - the home of Manchester United. Manchester United began as a club named Newton Heath and changed its name in 1902. Before they moved to <strong>Old Trafford</strong>, they played their football games at North Road and Bank Street in Clayton.",
    "published": null
  }
]