[
  {
    "title": "Ministry of Health, Population and Hospital Reform - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health,_Population_and_Hospital_Reform",
    "snippet": "Former ministers include: fr:<strong>Abderrahmane Benbouzid</strong> (January 4, 2020–September 8, 2022) ... In 2020, there were according to the Ministry 586 public health establishments in Algeria. There are 69,948 beds in CHU, EHU, EH, EHS, and EPH establishments and 6,584 beds in community hospitals (EPSP).",
    "published": "April 15, 2025"
  },
  {
    "title": "List of health departments and ministries - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_health_departments_and_ministries",
    "snippet": "Ministry of Health, Population and Hospital Reform (Algeria) Ministry of Health and the Environment (Antigua and Barbuda) Barbuda&#x27;s Public Health Department · Ministry of Health (Argentina) Ministry of Health (Armenia) Department of Health and Aged Care (Australia) Ministry of Health (New South Wales), known as NSW Health ·",
    "published": "October 29, 2025"
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform (Algeria) | GHDx",
    "url": "https://ghdx.healthdata.org/organizations/ministry-health-population-and-hospital-reform-algeria",
    "snippet": "Formerly named the Ministry of Health and Population (Ministère de la Santé et de la Population).",
    "published": null
  },
  {
    "title": "Ministry of Health and Family Welfare - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health_and_Family_Welfare",
    "snippet": "The current minister is <strong>Jagat Prakash Nadda</strong>, while the current Minister of State for health (MOS: assistant to Minister i.e. currently assistant to J. P. Nadda) are Anupriya Patel and Prataprao Ganpatrao Jadhav.",
    "published": "2 weeks ago"
  },
  {
    "title": "Ministry of Health and Population (Nepal) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health_and_Population_(Nepal)",
    "snippet": "These include four regional hospitals, 11 zonal hospitals, five teaching hospitals, as well as district hospitals and general hospitals. <strong>Bikas Devkota</strong> currently holds the position of Secretary of the Ministry of Health and Population. Roshan ...",
    "published": "November 10, 2025"
  }
]