[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "On 5 July 2022, it was announced that Paris Saint-Germain had parted ways with Pochettino. On 29 May 2023, it was announced Pochettino would be appointed as head coach of Chelsea on <strong>1 July 2023</strong>, on a two-year contract with an option to extend for another year.",
    "published": "5 days ago"
  },
  {
    "title": "Mauricio Pochettino's Chelsea timeline: A year of highs and lows, which ultimately ended in bitter injustice",
    "url": "https://www.thechelseachronicle.com/news/mauricio-pochettino-chelsea-timeline/",
    "snippet": "... Chelsea confirmed that Pochettino would be the head coach on the <strong>29th of May 2023</strong>, with the Argentine set to begin his new role on the 1st of July 2023 on a two-year contract, with a club option of a further year.",
    "published": "May 22, 2024"
  },
  {
    "title": "Mauricio Pochettino to become Chelsea head coach | News | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/news/article/mauricio-pochettino-to-become-chelsea-head-coach",
    "snippet": "Chelsea Football Club is pleased to confirm Mauricio Pochettino will become head coach of the men’s team <strong>from the beginning of the 2023/24 season</strong>.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/mauricio-pochettino",
    "snippet": "Welcome to the official Chelsea FC website. All the latest news, videos and ticket information as well as player profiles and information about Stamford Bridge, the home of the Blues. Browse the online shop for Chelsea FC products and merchandise.",
    "published": null
  },
  {
    "title": "Latest Mauricio Pochettino News, Updates & Views - The Chelsea Chronicle",
    "url": "https://www.thechelseachronicle.com/tag/mauricio-pochettino/",
    "snippet": "Mauricio Pochettino is an Argentinian football manager who has previously been at the helm of Tottenham Hotspur, PSG and Chelsea. Chelsea confirmed that Pochettino would be their new head coach on the <strong>29th of May 2023</strong>, with the Argentine set to begin his new role on the 1st of July 2023 on ...",
    "published": "September 21, 2025"
  }
]