[
  {
    "title": "Terry Pegula - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Terry_Pegula",
    "snippet": "<strong>Terrence Michael Pegula</strong> (born March 27, 1951) is an American billionaire businessman and petroleum engineer. He is the owner of the Buffalo Sabres of the National Hockey League (NHL) and, with a consortium of private equity firms and athletes, the Buffalo Bills of the National Football League (NFL).",
    "published": "1 week ago"
  },
  {
    "title": "Buffalo Bills welcome 10 new limited partners to ownership group",
    "url": "https://www.buffalobills.com/news/buffalo-bills-welcome-10-new-limited-partners-to-ownership-group",
    "snippet": "The Buffalo Bills and <strong>Terry Pegula</strong> are proud to confirm the addition of 10 limited partners to the ownership group. The non-controlling, minority interests were approved on Dec. 11, 2024 at the NFL meetings in Dallas, TX.",
    "published": null
  },
  {
    "title": "Buffalo Bills owner sells portion of franchise to multiple partners: What we know",
    "url": "https://www.democratandchronicle.com/story/sports/football/nfl/bills/2024/12/11/terry-pegula-sells-portion-of-buffalo-bills-to-multiple-owners/76920162007/",
    "snippet": "Previously, Ralph Wilson and his ... the story and it reported that two of the new investors have ties to Rochester - <strong>Rob Ward and Rob Palumbo</strong>....",
    "published": "December 11, 2024"
  },
  {
    "title": "The Official Website of the Buffalo Bills",
    "url": "https://www.buffalobills.com/team/front-office-roster/terry-pegula",
    "snippet": "<strong>The Pegulas</strong> received the unanimous approval of NFL owners to succeed Pro Football Hall of Famer Ralph C. Wilson, Jr. and become the second owners in the storied history of the Buffalo Bills.",
    "published": null
  },
  {
    "title": "Buffalo Bills - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Buffalo_Bills",
    "snippet": "On October 8, 2014, Buffalo Sabres owners <strong>Terry and Kim Pegula</strong> received unanimous approval to acquire the Bills during the NFL owners&#x27; meetings, becoming the second ownership group of the team after team founder Ralph Wilson.",
    "published": "2 weeks ago"
  }
]