[
  {
    "title": "r/soccer on Reddit: [VI] Fred Grim will be Ajax first team head coach until at least the winter break",
    "url": "https://www.reddit.com/r/soccer/comments/1p2uetc/vi_fred_grim_will_be_ajax_first_team_head_coach/",
    "snippet": "Ko Itakura stated in Japanese media that <strong>Fred Grim informed him the day before Ajax-Benfica that he would be playing at CDM</strong>. They had not trained for this ... Simonis next Ajax coach - about to get fired.",
    "published": "4 weeks ago"
  },
  {
    "title": "🚨 Fred Grim will be the Ajax Head Coach until at least ...",
    "url": "https://www.facebook.com/DeadlineDayLive/posts/-fred-grim-will-be-the-ajax-head-coach-until-at-least-the-winter-breakgrim-was-a/1263805042457005/",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "Fred Grim assistant coach Ajax 1",
    "url": "https://english.ajax.nl/articles/fred-grim-assistant-coach-ajax-1",
    "snippet": "<strong>Fred Grim has been appointed as assistant coach to the Ajax 1 technical staff</strong>. Grim (60) previously served as Head of Coaching within Ajax&#x27;s youth academy.",
    "published": null
  },
  {
    "title": "Fred Grim - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fred_Grim",
    "snippet": "Grim was appointed manager of a relegated FC Emmen side as a replacement of Dick Lukkien in June 2023. On 9 April 2024 FC Emmen announced that Grim was sacked with only 5 games left. <strong>Grim was named assistant to manager John Heitinga at Ajax in October 2025</strong>, only to take over Heitinga&#x27;s tasks ...",
    "published": "2 days ago"
  },
  {
    "title": "Signs of life at Ajax: Three wins on the bounce show progress for Fred Grim | OneFootball",
    "url": "https://onefootball.com/en/news/signs-of-life-at-ajax-three-wins-on-the-bounce-show-progress-for-fred-grim-42083798",
    "snippet": "It means that the Eredivisie side finally have a first win in the competition, even if it likely comes too late to make it through to the next round. Yet for interim head coach Fred Grim, <strong>it shows that perhaps progress is being made at Ajax</strong>.",
    "published": null
  }
]