[
  {
    "title": "Manchester United W.F.C. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manchester_United_W.F.C.",
    "snippet": "Following the club&#x27;s acceptance into the 2018–19 FA Women&#x27;s Championship, it was revealed that the women&#x27;s team would be based in Broughton, Salford at The Cliff training ground; subject to completion of redevelopment work. United were to play their fixtures at <strong>Leigh Sports Village</strong> until this ...",
    "published": "2 days ago"
  },
  {
    "title": "Leigh Sports Village - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Leigh_Sports_Village",
    "snippet": "<strong>Leigh Sports Village</strong> is a multi-use sports, retail and housing development in Leigh, Greater Manchester, England. The centrepiece of the development is a 12,000-capacity stadium which is home to professional rugby league team Leigh Leopards, the Manchester United Women&#x27;s senior team, and Manchester ...",
    "published": "September 5, 2025"
  },
  {
    "title": "Manchester United Women – Leigh Sports Village",
    "url": "https://www.leighsportsvillage.co.uk/manchester-united-women/",
    "snippet": "Manchester United Women&#x27;s team, play all their home games in the Barclays FA Women&#x27;s Super League at <strong>Leigh Sports Village</strong> Manchester United Women have been playing their fixtures at <strong>Leigh Sports Village</strong> for their entire existence, beginning ...",
    "published": null
  },
  {
    "title": "Progress with Unity! Man Utd Women set for stadium name change with immediate effect as local council launches new initiative | Goal.com",
    "url": "https://www.goal.com/en/lists/progress-with-unity-man-utd-stadium-name-change-immediate-effect-local-council-new-initiative/blt2df5c0e6c07a63b9",
    "snippet": "Marc Skinner&#x27;s Manchester United will continue to use the Progress With <strong>Unity Stadium</strong> as their primary home ground, alongside occasional fixtures at Old Trafford. The venue will also keep serving rugby and grassroots events, ensuring it remains ...",
    "published": "September 25, 2025"
  },
  {
    "title": "Manchester United Women football club information at Football Ground Map",
    "url": "https://www.footballgroundmap.com/team/manchester-united-women",
    "snippet": "Sun 15th March 2026 12:00 Barclays Women&#x27;s Super League at <strong>Victoria Road (Chigwell Construction Stadium)</strong> ... Fixture data compiled from multiple sources, please check before travelling. ... Nobody has added any facts about Manchester United Women.",
    "published": null
  }
]