[
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "Beginning in late 2018, Mélenchon and the leadership of La France Insoumise made a significant shift by abandoning their sovereigntist and ultra-secularist stances. This decision led to the expulsion of key members, marking a clear change in the party&#x27;s ideological direction. The 2022 L&#x27;Avenir en commun programme for the Popular Union includes a number of proposals, such as replacing capitalism. In August 2025, during the congress of France Insoumise, in Châteauneuf-sur-Isère, near Valence in the Drôme, the party called for a strike for 10 September 2025, to oppose the 2026 budget bill, presented by François Bayrou.",
    "published": "5 days ago"
  },
  {
    "title": "The leader of a French party called on Europeans to \"find common ground\" with Russia - Pravda EN",
    "url": "https://news-pravda.com/world/2025/12/06/1915755.html",
    "snippet": "<strong>Jean-Luc Mélenchon</strong>, founder and leader of the &quot;Unbowed France&quot; (La France Insoumise) party, which is considered a left-wing party, called on Europeans to end confrontation and &quot;find common ground&quot; with Russia during a speech in the national ...",
    "published": "2 weeks ago"
  },
  {
    "title": "La France Insoumise group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise_group",
    "snippet": "It is chaired by <strong>Mathilde Panot</strong> since 2021, having previously been led by Jean-Luc Mélenchon between 2017 and 2021. As of 2023, the group, which includes representatives of La France Insoumise (FI) and other left-wing parties, has seventy five members.",
    "published": "October 26, 2025"
  },
  {
    "title": "The Rise of France Insoumise",
    "url": "https://jacobin.com/2025/11/france-insoumise-hegemonic-left-democracy",
    "snippet": "France Insoumise activity does not have a single form. This is why, when it comes to forming a space of identified leadership for the movement, we wanted to represent this confederal structure. We thus have a national coordination of spaces. This is a body in which each space recognized by France Insoumise is represented and comes together once a week to discuss short-term objectives that the movement needs to take positions on.",
    "published": null
  },
  {
    "title": "France in Crisis: an Interview with Jean Luc Melenchon and La France Insoumise - CounterPunch.org",
    "url": "https://www.counterpunch.org/2025/10/29/france-in-crisis-an-interview-with-jean-luc-melenchon-and-la-france-insoumise/",
    "snippet": "La France Insoumise describes its orientation as democratic socialist and ecosocialist. The following is a composite interview. When he visited Paris in July 2025, Walden Bello interviewed some of the leaders of LFI, including Nadege Abomangoli, vice president of the National Assembly; Aurelie Trouve, chairwoman of the Economic Affairs Committee of the Assembly; and members of parliament Arnaud Le Gall, Aurelien Tache, and Aurelien Saintoul.",
    "published": "October 29, 2025"
  }
]