[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "De Havilland Aircraft of Canada Limited (DHC) is a Canadian aircraft manufacturer founded in 2018 that purchased the aircraft programs of the original the de Havilland Canada, which was founded in 1928. The aircraft types currently in production or planned for production include the DHC-6 Twin Otter, DHC-8 Dash 8, and DHC-515 Firefighter turboprop aircraft.",
    "published": "1 month ago"
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "Later, Hawker Siddeley merged into what is eventually known today as BAE Systems, the British aerospace and defence business. The de Havilland name lives on in De Havilland Canada, which owns the rights to the name and the aircraft produced by de Havilland&#x27;s former Canadian subsidiary, including the Dash 8 regional airliner previously produced by Bombardier Aerospace.",
    "published": "November 1, 2025"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "De Havilland Aircraft of Canada Limited, with head offices in Toronto, Ontario, is an aircraft manufacturer incorporated in 1928. It has designed and built iconic Canadian bush planes such as the Beaver, the Otter and the Twin Otter, as well as transport and commuter aircraft.",
    "published": null
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "De Havilland Canada&#x27;s history includes being a UK subsidiary and producing iconic aircraft like the Chipmunk and Beaver. The company transitioned from British ownership to Canadian to American, ultimately landing under Longview&#x27;s umbrella.",
    "published": "February 21, 2024"
  },
  {
    "title": "De Havilland Aircraft of Canada 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/292700-62",
    "snippet": "Information on acquisition, funding, investors, and executives for De Havilland Aircraft of Canada. Use the PitchBook Platform to explore the full profile.",
    "published": null
  }
]