[
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "There are too many places in the world where it‘s difficult to obtain books that explain and celebrate science written in the local language, particularly within more restrictive Islamic regimes. The Translations Project produces professionally translated versions of landmark books on science and nature for free, beginning with the works of Richard Dawkins himself.",
    "published": "July 17, 2025"
  },
  {
    "title": "Homepage | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/home/",
    "snippet": "Nov 25, 2025 · From the Richard Dawkins Foundation Newsletter. Subscribe here. Hello! The Richard Dawkins Foundation for Reason &amp; Science’s mission is to promote scientific literacy and a secular worldview. For some, the connection is not obvious; they may seem like different objectives at first glance, but if you’ve ever doubted just how inextricably linked they are, all you …",
    "published": "November 8, 2023"
  },
  {
    "title": "Richard Dawkins Foundation for Reason and Science - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins_Foundation_for_Reason_and_Science",
    "snippet": "The atheist Sikivu Hutchinson criticized the merger of the secular organizations Center for Inquiry and the Richard Dawkins Foundation for Reason and Science which gave Richard Dawkins a seat on the board of directors of the Center for Inquiry.",
    "published": "September 22, 2025"
  },
  {
    "title": "Aug 16, 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/2025/",
    "snippet": "From the Richard Dawkins Foundation Newsletter. Subscribe here. Hello! As you know, <strong>2025 marks the 100th anniversary of the Scopes Monkey Trial</strong>. It’s also the twenty-year anniversary of the landmark Kitzmiller v. Dover trial.",
    "published": null
  },
  {
    "title": "What We Do | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/aboutus/",
    "snippet": "For more information about TIES or to get involved, click here. With more than one million “Likes” on Facebook, the foundation is a social media powerhouse. Pair this with Richard Dawkins’ more than one million personal Twitter followers and the foundation is able to communicate to a huge audience around the world.",
    "published": "February 4, 2021"
  }
]