[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Singh was initially educated at a local gurdwara, where he began studying Urdu and Punjabi. On 17 April 1937, he was enrolled in the <strong>local Government Primary School</strong>, where he continued his Urdu-medium education until the age of 10 (Class 4), after which he and his family moved to Peshawar.",
    "published": "2 days ago"
  },
  {
    "title": "From a village 600 km away in Pakistan, a last dua for ‘Mohna’, the boy who left during Partition | Chandigarh News - The Indian Express",
    "url": "https://indianexpress.com/article/cities/chandigarh/last-dua-mohna-village-pakistan-9747681/",
    "snippet": "However, during the end of his tenure as PM in 2014, he had expressed his wish to visit his birthplace in Pakistan, but only “when circumstances were appropriate”. That however, never happened. ... <strong>The Government Primary School at Gah</strong> has ...",
    "published": "December 29, 2024"
  },
  {
    "title": "Manmohan Singh Education: Former PM Schooling, Colleges, Degrees and Academic Achievements",
    "url": "https://www.jagranjosh.com/articles/manmohan-singh-education-qualification-1735280163-1",
    "snippet": "Here is an overview of the schools, colleges, and degrees that shaped Dr. Manmohan Singh&#x27;s life: Students can get the educational background of Dr. Manmohan Singh from the information provided below: Dr. Manmohan Singh began his educational journey in Gah, a small village in Punjab (now in Pakistan). He attended the local primary school in his village.",
    "published": "December 27, 2024"
  },
  {
    "title": "‘Aapka mukhlis Manmohan Singh’: In letters to Pakistan, when former PM spoke of love for ancestral village, childhood memories | Chandigarh News - The Indian Express",
    "url": "https://indianexpress.com/article/cities/chandigarh/aapka-mukhlis-manmohan-singh-letters-pakistan-9756537/",
    "snippet": "The letter dated September 30, ... fluency in Urdu can also be credited to the fact that he studied at the <strong>local government primary school in Gah</strong> till Class 4 where his admission records are still preserved....",
    "published": "January 2, 2025"
  },
  {
    "title": "Manmohan Singh: Age, Biography, Education, Wife, Caste, Net Worth & More - Oneindia",
    "url": "https://www.oneindia.com/politicians/manmohan-singh-71660.html",
    "snippet": "Manmohan Singh got his primary education in Urdu from a <strong>rural school in Gah</strong>, now in Pakistan. Later joined the Panjab University in Hoshiyarpur as his family moved to Amritsar post partition.",
    "published": null
  }
]