[
  {
    "title": "BC Partners to acquire Com Hem — BC Partners",
    "url": "https://www.bcpartners.com/news/bc-partners-to-acquire-com-hem/",
    "snippet": "<strong>July 21, 2011</strong> – BC Partners, a leading international private equity firm, today announces that it has signed an agreement to acquire Com Hem, Sweden&#x27;s leading",
    "published": "April 28, 2025"
  },
  {
    "title": "BC Partners to acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/bc-partners-acquire-com-hem",
    "snippet": "London – <strong>BC Partners, a leading international private equity firm, today announces that it has signed an agreement to acquire Com Hem</strong>, Sweden’s leading TV, broadband and telephony company, from The Carlyle Group (“Carlyle”) and Providence Equity Partners (“Providence”). Financial ...",
    "published": null
  },
  {
    "title": "BC Partners agrees to sell remaining stake in Com Hem — BC Partners",
    "url": "https://www.bcpartners.com/news/bc-partners-agrees-to-sell-remaining-stake-in-com-hem/",
    "snippet": "LONDON – <strong>28 April 2017</strong> – Funds advised by BC Partners (“BC Partners”), a leading private equity firm, have reached an agreement to sell a ca. 18.5% interest (33.9 million shares) in Com Hem Group (“Com Hem”), Sweden’s leading cable ...",
    "published": "April 28, 2025"
  },
  {
    "title": "Bc Partners Fundraising Hits 65bn Cap | News And Insights | BC ...",
    "url": "https://bcpartners.com/news/bc-partners-fundraising-hits-65bn-cap",
    "snippet": "BCEC IX will focus on acquiring controlling equity positions in market leading businesses exhibiting defensive growth characteristics. In line with this strategy, BCEC IX completed its first investment in <strong>September 2011</strong> with the acquisition ...",
    "published": null
  },
  {
    "title": "BC Partners - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/BC_Partners",
    "snippet": "<strong>In 2019, BC Partners announced their backing for the acquisition (via the United Group) of Vivacom</strong>, the largest Bulgarian telecom. The acquisition became an issue of the media and legal dispute with the company&#x27;s previous owner, Empreno Ventures, ...",
    "published": "October 22, 2025"
  }
]