[
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "In the interim, Gizikis, remained in office as President. After the plebiscite, he was succeeded by the first elected president, Michail Stasinopoulos. A new constitution, promulgated on 11 June 1975, declared Greece a presidential parliamentary democracy (or republic – the Greek δημοκρατία can be translated both ways).",
    "published": "2 weeks ago"
  },
  {
    "title": "Konstantinos Tasoulas - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Konstantinos_Tasoulas",
    "snippet": "In January 2025, Prime Minister Kyriakos Mitsotakis submitted to the Parliament for approval the candidacy of Tasoulas for the office of the Greek Presidency. Tasoulas accepted the nomination, which was met with criticism from the opposition. After four rounds of voting, he was elected by the parliament on 12 February 2025, after winning the votes 160 of 300 MPs.",
    "published": "3 weeks ago"
  },
  {
    "title": "Konstantinos Tasoulas sworn in as Greece’s new president | eKathimerini.com",
    "url": "https://www.ekathimerini.com/politics/1263974/konstantinos-tasoulas-sworn-in-as-greeces-new-president/",
    "snippet": "<strong>Tasoulas, 66,</strong> was elected to the largely ceremonial presidency with a majority of 160 votes in the 300-seat House on February 12, backed chiefly by members of his party, the governing center-right New Democracy.",
    "published": "March 13, 2025"
  },
  {
    "title": "President - Aρχική",
    "url": "https://www.presidency.gr/en/president/",
    "snippet": "PRESIDENT of the Hellenic Republic The President <strong>Constantine An. Tassoulas</strong> Personal Info Place and Date οf Birth: He was born in Ioannina in 1959. Marital Status: He is married with lawyer Fani Stathopoulou and has two children Tasos and Magda.",
    "published": "March 27, 2025"
  },
  {
    "title": "A veteran conservative lawmaker is sworn in as Greece’s new president | AP News",
    "url": "https://apnews.com/article/greece-president-politics-tassoulas-db1f4771e16254a234a713908c01f5b7",
    "snippet": "Greece’s new President <strong>Constantine Tassoulas</strong>, right, takes an oath next to Archbishop of Athens and All Greece Ieronimos during the swearing in ceremony at the Parliament, in Athens, Greece, Thursday, March 13, 2025.",
    "published": "March 13, 2025"
  }
]