[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "Martin was awarded &quot;Politician of the Year&quot; by the Journal for his performance and election result. He was elected again as <strong>Taoiseach</strong> in a 95–76 vote by the Dáil on 23 January 2025 following a coalition agreement between Fianna Fáil, Fine Gael and with the support of several independent TDs.",
    "published": "2 weeks ago"
  },
  {
    "title": "Fianna Fáil: Micheál Martin 'confident over leadership' amid review tensions",
    "url": "https://www.bbc.com/news/articles/cn7k1dxnk63o",
    "snippet": "<strong>Taoiseach (Irish Prime Minister)</strong> Micheál Martin has said he is &quot;absolutely&quot; confident he will remain as leader of Fianna Fáil, despite criticism within the party over a review into its handling of the presidential election.",
    "published": "6 hours ago"
  },
  {
    "title": "Micheál Martin – Houses of the Oireachtas",
    "url": "https://oireachtas.ie/en/members/member/Micheál-Martin.D.1989-06-29",
    "snippet": "Deputy Micheál Martin asked the Tánaiste and <strong>Minister for Foreign Affairs and Trade</strong> if he has spoken with his other EU counterparts recently regarding Brexit. [10641/20] View · See more questions from this Member · Questions put to vote: ...",
    "published": null
  },
  {
    "title": "Micheál Martin hits back at criticism of Irish presidential election review - BBC News",
    "url": "https://www.bbc.com/news/articles/cn7k1dxnk63o.amp",
    "snippet": "Image caption, Taoiseach Micheál Martin has been under pressure since Jim Gavin dropped out of the Irish presidential race earlier this year",
    "published": "1 day ago"
  },
  {
    "title": "Micheal Martin | Taoiseach, Previous Offices, & Family Tragedy | Britannica",
    "url": "https://www.britannica.com/biography/Micheal-Martin",
    "snippet": "With the backing of a handful of independents, Harris and Martin secured a parliamentary majority, and they renewed the power-sharing agreement that had been in place since 2020. <strong>Martin returned to office as taoiseach</strong> on January 23, 2025, with ...",
    "published": "February 3, 2022"
  }
]