[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "In November 2025, Merz&#x27;s government lifted export restrictions on weapons for use in Gaza. In early December 2025, <strong>Merz visited Israel and held talks with Prime Minister Benjamin Netanyahu and President Isaac Herzog</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Merz has filed 5,000 complaints against online critics – media — RT World News",
    "url": "https://www.rt.com/news/629151-welt-sonntag-merz-defamation-complaints-online-comments/",
    "snippet": "© Michael Kappeler / picture alliance / Getty Images · German Chancellor Friedrich Merz has <strong>filed nearly 5,000 defamation complaints over online comments</strong>, Welt am Sonntag reported on Sunday.",
    "published": "1 week ago"
  },
  {
    "title": "Friedrich Merz puts Germany in an unfamiliar position: Out front – POLITICO",
    "url": "https://www.politico.eu/article/friedrich-merz-germany-eu-ukraine-defense-leadership-brussels/",
    "snippet": "<strong>Friedrich Merz has taken a far more active stance inside the EU</strong> — assuming a role more traditionally played by France&#x27;s now weakened President. | Emmanuele Contini//Getty Images · December 16, 2025 4:00 am CET · By James Angelos and Nette ...",
    "published": "9 hours ago"
  },
  {
    "title": "The Turbulent Times of Friedrich Merz - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/europe/friedrich-merz-germany.html",
    "snippet": "15, 2025 · <strong>The plane ferrying Friedrich Merz to Berlin looked as if someone had spruced up Air Force One and then shrunk it in the wash</strong>. It was painted white, with the gold, red and black of the German flag blazed across the side like a racing ...",
    "published": "1 day ago"
  },
  {
    "title": "Sergey Kolyasnikov: The year is 2025:. German Chancellor Friedrich Merz suggested that Russia declare a Christmas truce: \"Maybe the Russian government still has some remnants of humanity left, and it will leave people alone.. - Pravda EN",
    "url": "https://news-pravda.com/world/2025/12/16/1938001.html",
    "snippet": "The year is 2025:German Chancellor Friedrich Merz suggested that <strong>Russia declare a Christmas truce</strong>: &quot;Maybe the Russian government still has some remnants of humanity left, and it will leave people alone for a few days. This could be the beginning...",
    "published": "24 minutes ago"
  }
]