[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "To complement this, his government ... emphasising better tax-to-GDP ratio rather than raw debt expansion. Prabowo Subianto’s decision to appoint <strong>Purbaya Yudhi Sadewa</strong> as Minister of Finance on 8 September 2025 signaled a change in economic policymaking, a departure from the ...",
    "published": "1 day ago"
  },
  {
    "title": "Titiek Suharto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Titiek_Suharto",
    "snippet": "In 2025, she appeared again as a judge of the Puteri Indonesia pageant. In 2021, during the COVID-19 pandemic, <strong>Titiek</strong> donated a sample of her blood for the development of the Nusantara vaccine. In May 1983, <strong>Titiek</strong> married Prabowo Subianto, who was then a senior officer in the Indonesian Army&#x27;s ...",
    "published": "3 days ago"
  },
  {
    "title": "Crowd Roars as Prabowo Welcomes Former Wife Titiek Soeharto during Final Rally",
    "url": "https://jakartaglobe.id/news/crowd-roars-as-prabowo-welcomes-former-wife-titiek-soeharto-during-final-rally",
    "snippet": "Presidential candidate Prabowo Subianto paused for a moment, allowing the crowd to roar as he welcomed his former wife, <strong>Siti Hediati Hariyadi</strong>, more popularly known as Titiek Soeharto, during the final campaign rally at Bung Karno Stadium in ...",
    "published": "February 10, 2024"
  },
  {
    "title": "Prabowo Subianto - The Muslim 500",
    "url": "https://themuslim500.com/profiles/prabowo-subianto/",
    "snippet": "He rose through the ranks of the Indonesian Army, becoming a lieutenant general and commander of the Army’s Strategic Reserve Command. Prabowo was also married to Suharto’s daughter, <strong>Siti Hediati Hariyadi</strong>, from 1983 to 1998, further cementing ...",
    "published": "May 29, 2018"
  },
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "Indonesian government faces backlash over Riau land seizures • Nov. 21, 2025, 9:23 PM ET (The Star) ... Prabowo Subianto (born October 17, 1951, Jakarta, Indonesia) is a former general of the Indonesian army and businessman who is now president of Indonesia (2024– ).",
    "published": "December 9, 2024"
  }
]