[
  {
    "title": "Luxembourg Under 21, statistics, games and players",
    "url": "https://www.bettingacademyus.com/stats/team/luxembourg/luxembourg-u21/4372",
    "snippet": "Currently, the stadium of Luxembourg U21 is <strong>Stade Josy Barthel</strong>, in the city of Luxembourg, with a maximum capacity of 8100 spectators. ... We already are 289182 members. Register here.",
    "published": null
  },
  {
    "title": "Luxembourg U21 live scores, results, fixtures | Football, Europe",
    "url": "https://www.flashscore.com/team/luxembourg/fsjoGwpC/",
    "snippet": "Flashscore.com offers Luxembourg U21 livescore, final and partial results, standings, home stadium with official capacity, squad updates (signed and sold players, transfer fees, loan deals, free agents and complete squad list), team coach and match details (goal scorers, red cards, odds comparison, ...",
    "published": null
  },
  {
    "title": "Luxembourg U21 vs Switzerland U21 live score, H2H and lineups | Sofascore",
    "url": "https://www.sofascore.com/football/match/luxembourg-u21-switzerland-u21/BXbsOvc",
    "snippet": "Luxembourg U21 Switzerland U21 live score (and video online live stream) starts on 18 Nov 2025 at 18:30 UTC time at <strong>Stade de la Frontière stadium</strong>, Esch-sur-Alzette city, Luxembourg in U21 EURO, Qualification, Group C, Europe.",
    "published": null
  },
  {
    "title": "Luxembourg - Stadium - Stade de Luxembourg | Transfermarkt",
    "url": "https://www.transfermarkt.com/3580/stadion/verein/3580",
    "snippet": "Luxembourg U21 · Luxembourg U19 · Luxembourg U18 · Luxembourg U17 · Luxembourg U16 · Luxembourg B · Luxembourg U15 · Luxemburg Olympia · This page provides you with information about the stadium of the selected club. In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights.",
    "published": null
  },
  {
    "title": "France U21 vs Luxembourg U21 live score, H2H and lineups | Sofascore",
    "url": "https://www.sofascore.com/football/match/luxembourg-u21-france-u21/LtcsOvc",
    "snippet": "France U21 Luxembourg U21 live score (and video online live stream) starts on 5 Sept 2025 at 16:30 UTC time at <strong>Stade Yves Allainmat-Le Moustoir stadium</strong>, Lorient city, France in U21 EURO, Qualification, Group 3, Europe.",
    "published": null
  }
]