[
  {
    "title": "Ministry of Health, Population and Hospital Reform - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health,_Population_and_Hospital_Reform",
    "snippet": "At the Provincial level, there are 48 Directorates of Health and Population (one per province). The current minister is <strong>Abdelhak Saihi</strong> (since 9 September 2022). Former ministers include: fr:Abderrahmane Benbouzid (January 4, 2020–September 8, 2022) ... In 2020, there were according to the ...",
    "published": "April 15, 2025"
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform (Algeria) | GHDx",
    "url": "https://ghdx.healthdata.org/organizations/ministry-health-population-and-hospital-reform-algeria",
    "snippet": "Formerly named the Ministry of Health and Population (Ministère de la Santé et de la Population).",
    "published": null
  },
  {
    "title": "Division of Powers - Algeria Public health",
    "url": "https://portal.cor.europa.eu/divisionpowers/Pages/Algeria-Public-health.aspx",
    "snippet": "Ministry of Health, Population and Hospital Reforms (FR)",
    "published": null
  },
  {
    "title": "Leadership in the Ministry of Health - PMC",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4267023/",
    "snippet": "Incoordination within different sectors and lack of action-oriented heads of departments can happen due to the enormity and complexity of the Ministry. It is important to have capable leadership at every level to drive their organisations to higher achievements.",
    "published": null
  },
  {
    "title": "Department of Health, Population, and Hospital Reform (Algeria) | Devex",
    "url": "https://www.devex.com/organizations/department-of-health-population-and-hospital-reform-algeria-52456",
    "snippet": "Learn more about Department of Health, Population, and Hospital Reform (Algeria)&#x27;s jobs, projects, latest news, contact information and geographical presence. The Department of Health and Hospital Reform is the government agency responsible for Health in Alge",
    "published": null
  }
]