[
  {
    "title": "John Elkann - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Elkann",
    "snippet": "In 2008, Elkann was seen as &quot;the great unknown&quot;, and he replaced 83-year-old Gabetti as the head of IFIL, which managed a portfolio worth eight billion euros. In <strong>March 2009</strong>, he merged the holding companies IFI and IFIL to create Exor, stepping to the role of chairman.",
    "published": "1 week ago"
  },
  {
    "title": "John Elkann Height, Weight, Religion, Net Worth, Age, Biogr",
    "url": "https://thefamouspersonalities.com/profile/ceo-john-elkann",
    "snippet": "2003: He was appointed as the vice chairman of Fiat S.p.A., serving under his grandfather, Gianni Agnelli. <strong>2004: John Elkann, who is 28 years old, was named chairman of Fiat S.p.A.&#x27;s board of directors, becoming the company&#x27;s youngest chairman</strong>.",
    "published": null
  },
  {
    "title": "Board of Directors | EXOR",
    "url": "https://www.exor.com/pages/exor/governance/board-directors",
    "snippet": "Born in New York in 1976, Elkann earned a scientific baccalauréat from Lycée Victor Duruy in Paris and an engineering degree from Politecnico di Torino (Italy). He <strong>began his career in 2001</strong> at General Electric on the Corporate Audit Staff, working across Asia, Europe, and North America. In ...",
    "published": null
  },
  {
    "title": "Top 100 Executives 2020: John Elkann, Chairman, FCA ...",
    "url": "https://www.leadersleague.com/en/news/top-100-executives-2020-john-elkann-chairman-fca-group",
    "snippet": "Leaders League offers media and business services for leaders. We provide strategic information, company rankings, and B to B networking events.",
    "published": null
  },
  {
    "title": "John Elkann Chairman Executive Director",
    "url": "https://www.stellantis.com/content/dam/stellantis-corporate/group/governance/leadership/bio/eng/John-Elkann.pdf",
    "snippet": "John Elkann was appointed Chairman of Stellantis on <strong>January · 17, 2021</strong>. He had previously been Chairman of Fiat S.p.A. from",
    "published": null
  }
]