[
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "Born 27 March 1955 in Santiago de Compostela, in the Galician province of A Coruña, in Spain, Rajoy is the grandson of Enrique Rajoy Leloup, one of the architects of the Galician Statute of Autonomy (1936) (Estatuto de autonomía de Galicia), who was removed from university teaching by the Franco dictatorship in the early 1950s. He is the son of Olga Brey López and Mariano Rajoy Sobredo, a jurist, and president of the Provincial Court of Pontevedra, the city where he grew up.",
    "published": "March 8, 2004"
  },
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "Mariano Rajoy, Spanish politician who <strong>served as prime minister of Spain from 2011 to 2018</strong>. He took office amid the European debt crisis and implemented harsh but effective austerity measures.",
    "published": "December 6, 2011"
  },
  {
    "title": "La Moncloa. 26/09/2018. Mariano Rajoy Brey [Presidents since 1978]",
    "url": "https://www.lamoncloa.gob.es/lang/en/presidente/presidents/Paginas/marianorajoy_BIO.aspx",
    "snippet": "26 September 2018. Place of birth: Santiago de Compostela (A Coruña)Date of birth: 27 March 1955Education: Bachelor of Law from the University of Santiago de Compostela<strong>Married with two children</strong>",
    "published": null
  },
  {
    "title": "Mariano Rajoy Biography - Facts, Childhood, Family & Achievements of Spanish Politician",
    "url": "https://www.thefamouspeople.com/profiles/mariano-rajoy-10666.php",
    "snippet": "Mariano Rajoy is <strong>married to Elvira Fernandez Balboa since 1996 and the couple have two children</strong>. Rajoy had his biography ‘En Confianza’ published during the campaign trail in 2011, giving the general population a glimpse of his life.",
    "published": null
  },
  {
    "title": "Mariano Rajoy Life Story: Relationships, Family, Career Highlights & Achievements - Mabumbe",
    "url": "https://mabumbe.com/people/mariano-rajoy-life-story-relationships-family-career-highlights-achievements/",
    "snippet": "Additionally, Rajoy made headlines ... to civilian life. In 1996, Rajoy <strong>married Elvira Fernández Balboa, known affectionately as “Viri.” The couple has two sons, Mariano and Juan</strong>....",
    "published": "December 6, 2024"
  }
]