[
  {
    "title": "Ines Schwerdtner und Jan van Aken als Linken-Vorsitzende gewählt | tagesschau.de",
    "url": "https://www.tagesschau.de/inland/innenpolitik/neue-fuehrungsspitze-die-linke-100.html",
    "snippet": "<strong>Die Publizistin Ines Schwerdtner und der frühere Bundestagsabgeordnete Jan van Aken sind neue Vorsitzende der Partei Die Linke</strong>. Beide erhielten auf dem Bundesparteitag in Halle (Saale) große Zustimmung.",
    "published": "October 19, 2024"
  },
  {
    "title": "Bundesparteitag in Halle: Ines Schwerdtner und Jan van Aken führen künftig die Linke | rbb24",
    "url": "https://www.rbb24.de/politik/beitrag/2024/10/ines-schwerdtner-jan-van-aken-neue-linke-vorsitzende-vorsitzende.html",
    "snippet": "Zuletzt hatte Ines Schwerdtner ... mehrfach von Gesine Lötzsch geholt - anzustreben. <strong>Zusammen mit Jan van Aken wurde sie nun zur neuen Bundesspitze der Partei gewählt</strong>....",
    "published": null
  },
  {
    "title": "Germany's hard-left Die Linke party has elected new leaders",
    "url": "https://www.yahoo.com/news/germanys-hard-left-die-linke-143424719.html",
    "snippet": "<strong>Members of Germany&#x27;s hard-left Die Linke (The Left) have elected the journalist Ines Schwerdtner and former member of the German lower house of parliament Jan van Aken as the party&#x27;s new leaders</strong>.",
    "published": "October 19, 2024"
  },
  {
    "title": "Die Linke: Ines Schwerdtner und Jan van Aken zu neuen Vorsitzenden gewählt - DER SPIEGEL",
    "url": "https://www.spiegel.de/politik/deutschland/die-linke-ines-schwerdtner-und-jan-van-aken-zu-neuen-vorsitzenden-gewaehlt-a-891affc4-8c68-476e-8885-85c8c84f0bd9",
    "snippet": "<strong>Die Journalistin Ines Schwerdtner und der frühere Bundestagsabgeordnete Jan van Aken sind neue Vorsitzende der Linken</strong>. Das neue Führungsduo wurde bei einem Bundesparteitag in Halle mit großer Mehrheit gewählt.",
    "published": "October 19, 2024"
  },
  {
    "title": "Linkspartei unter Schwerdtner und van Aken: Auferstanden aus Ruinen – wie die Linken wieder zweistellig wurden",
    "url": "https://rp-online.de/politik/deutschland/wie-die-linken-wieder-zweistellig-wurden-unter-schwerdtner-und-van-aken_aid-137435761",
    "snippet": "Analyse | Berlin · Vor einem Jahr lag die Linke in Umfragen bei drei Prozent. <strong>Dann übernahmen Jan van Aken und Ines Schwerdtner die Parteiführung</strong> – und schafften es auch dank Social-Media-Star Heidi Reichinnek, die Linke wieder auf Kurs ...",
    "published": "October 22, 2025"
  }
]