[
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "Mike <strong>first joined the board of the European Film Academy 15 years ago</strong> and has served alongside a broad range of European film makers including Istvan Szabo, Volker Schloendorff, Wim Wenders, Nikita Mikhalkov, Pawel Pawlikowski, Agnes Jaoui, ...",
    "published": null
  },
  {
    "title": "Story - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/story/",
    "snippet": "Wim Wenders (1996-2020) Agnieszka Holland (2020-2024) and Juliette Binoche (2024- ) followed in Bergman’s footsteps as Presidents of the Academy. <strong>The current chair of the Board is Mike Downey</strong>.",
    "published": "June 13, 2025"
  },
  {
    "title": "Mike Downey elected new EFA chairman - Cineuropa",
    "url": "https://cineuropa.org/en/newsdetail/382667",
    "snippet": "Taking over from Polish director Agnieszka Holland who has chaired the EFA board for the past six years, Downey pointed out at Saturday’s European Film Awards that he wants his mandate to be marked by a continuation of the EFA’s “campaigning work in the service of filmmakers at risk; to make all aspects of sustainability not only of EFA itself but also the European film industry a priority; and last but not least to extend the idea of gender balance across the board in every department.” (Read our report on the awards here.)",
    "published": "November 12, 2019"
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) - IMDb",
    "url": "https://www.imdb.com/news/ni65127703/",
    "snippet": "Producer Mike Downey, who is <strong>chair of the European Film Academy and whose co-production “Girls on Wire” is in Berlin competition</strong>, has unveiled a diverse slate of films from his production company Downey Ink at the European Film Market.",
    "published": null
  },
  {
    "title": "European Film Academy Chair Mike Downey Honored With Prague Lifetime Achievement Award",
    "url": "https://variety.com/2021/film/global/mike-downey-european-film-academy-prague-lifetime-achievement-award-1235067101/",
    "snippet": "Producer and European Film Academy Chair Mike Downey is being honored with the Kristián Lifetime Achievement Award, at the Prague International Film Festival – Febiofest. The award will be p…",
    "published": "September 17, 2021"
  }
]