[
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "Every president of Ukraine except for Volodymyr Zelenskyy has been a People&#x27;s Deputy of the Verkhovna Rada prior to their election, with Kuchma, Yushchenko, and Yanukovych all previously serving as Prime Minister and Kravchuk as well as acting president Turchynov previously serving as Chairman of the Verkhovna Rada. Kravchuk was the first president to resign from the office, following a power struggle with Prime Minister Leonid Kuchma. After the 2014 Ukrainian revolution, Viktor Yanukovych abandoned the office and fled the country.",
    "published": "October 25, 2025"
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "In Berlin, President of Ukraine Volodymyr Zelenskyy, together with Federal Chancellor of Germany Friedrich Merz, took part in the closing of the eighth German–Ukrainian Economic Forum.",
    "published": "13 hours ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "Leonid Kuchma was the only president to have served two consecutive terms in office. <strong>Viktor Yushchenko, Petro Poroshenko, and Viktor Yanukovych</strong> served one term, with the latter being replaced by acting president Oleksandr Turchynov, who then also served as Chairman of the Ukrainian Parliament, ...",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine facts for kids",
    "url": "https://kids.kiddle.co/List_of_presidents_of_Ukraine",
    "snippet": "Most presidents of Ukraine, except for Volodymyr Zelenskyy, were already members of the Ukrainian parliament (called the Verkhovna Rada) before they became president. Some, like Leonid Kuchma, Viktor Yushchenko, and Viktor Yanukovych, had even served as Prime Minister before.",
    "published": "October 17, 2025"
  },
  {
    "title": "Presidents of Ukraine | World Presidents Database",
    "url": "https://www.worldpresidentsdb.com/list/countries/Ukraine/",
    "snippet": "List of Ukrainian presidents, leaders and heads of state. Both current and historical presidents of Ukraine are listed with biographies.",
    "published": null
  }
]