[
  {
    "title": "Slaviša Jokanović - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Slaviša_Jokanović",
    "snippet": "On 16 June 2019, Jokanović was appointed at Qatari club Al-Gharafa, on a <strong>two-year</strong> deal.",
    "published": "November 6, 2025"
  },
  {
    "title": "Former Watford boss Slavisa Jokanovic takes over Al Gharafa in Qatar | Watford Observer",
    "url": "https://www.watfordobserver.co.uk/sport/17711229.former-watford-boss-slavisa-jokanovic-takes-al-gharafa-qatar/",
    "snippet": "Jokanovic has been named as manager of Al Gharafa who play in the Qatari top flight, despite him recently being interviewed for the Middlesbrough vacancy, which has since been filled by Jonathan Woodgate.",
    "published": "June 17, 2019"
  },
  {
    "title": "Exjugador del Real Oviedo: Slavisa Jokanovic, al Al Gharafa de Catar",
    "url": "https://www.eldesmarque.com/futbol/real-oviedo/20190617/un-exoviedista-al-futbol-arabe_40154439.html",
    "snippet": "El que fuera jugador del Real Oviedo en los noventa ha dado un giro a su carrera al convertirse en el nuevo entrenador del Al Gharafa catarí con el que ha firmado por <strong>dos temporadas</strong>.",
    "published": "June 17, 2019"
  },
  {
    "title": "Jokanovic named new head coach of Qatar Super League side Al Gharafa",
    "url": "https://www.friendsoffulham.com/forum/index.php?topic=71609.0",
    "snippet": "Jokanovic named new head coach of Qatar Super League side Al Gharafa",
    "published": null
  },
  {
    "title": "Slavisa Jokanovic: Qatar will host an exceptional FIFA World Cup in 2022 - Read Qatar Tribune on the go for unrivalled news coverage",
    "url": "https://www.qatar-tribune.com/article/172932/SPORTS/Slavisa-Jokanovic-Qatar-will-host-an-exceptional-FIFA-World-Cup-in-2022",
    "snippet": "This means players can spend more time on training rather than travelling.” “Having participated in two major tournaments, I understand the struggle that comes with travelling from one place to the other and how that can affect a player’s mental and physical strength,” he added. In the meantime, Jokanovi? is committed to Al Gharafa and has overseen a strong start to his tenure with the Cheetahs, who currently sit joint top of the league on ten points.",
    "published": "September 23, 2019"
  }
]