[
  {
    "title": "Kyriakos Mitsotakis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kyriakos_Mitsotakis",
    "snippet": "<strong>Kyriakos Mitsotakis</strong> (Greek: Κυριάκος Μητσοτάκης, IPA: [cirˈʝakos mit͡soˈtacis]; born 4 March 1968) is a Greek politician currently serving as the prime minister of Greece since July 2019, except for a month between May and June 2023. Mitsotakis has been president of the ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Kyriakos Mitsotakis | Biography, Policies,& Facts | Britannica",
    "url": "https://www.britannica.com/biography/Kyriakos-Mitsotakis",
    "snippet": "<strong>Kyriakos Mitsotakis</strong> (born March 4, 1968, Athens, Greece) is a Greek politician and scion of one of Greece’s most prominent political families who became prime minister of Greece in July 2019 at the head of a New Democracy (ND) government.",
    "published": "July 17, 2019"
  },
  {
    "title": "Prime Minister of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Greece",
    "snippet": "The prime minister of the Hellenic Republic (Greek: Πρωθυπουργός της Ελληνικής Δημοκρατίας, romanized: Prothypourgós tis Ellinikís Dimokratías), usually referred to as the prime minister of Greece (Πρωθυπουργός της Ελλάδας, Prothypourgós tis Elládas), is the head of government of the Hellenic Republic and the leader of the Greek Cabinet.",
    "published": "2 weeks ago"
  },
  {
    "title": "The Prime Minister of the Hellenic Republic | Kyriakos Mitsotakis",
    "url": "https://www.primeminister.gr/en/home",
    "snippet": "Prime Minister <strong>Kyriakos Mitsotakis</strong> met today with the President of the European Parliament, Roberta Metsola, at Maximos Mansion.",
    "published": "1 month ago"
  },
  {
    "title": "Greece’s Mitsotakis reshuffles government as public opinion turns against him | Euractiv",
    "url": "https://www.euractiv.com/news/greeces-mitsotakis-reshuffles-government-as-public-opinion-turns-against-him/",
    "snippet": "Greek centre-right Prime Minister <strong>Kyriakos Mitsotakis</strong> decided today to reshuffle the cabinet as his New Democracy party’s free fall in polls continues. The government narrowly survived a no-confidence vote last week put forward by the opposition ...",
    "published": "March 17, 2025"
  }
]