[
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "On 1 December 2025, Marcelo Rebelo de Sousa was <strong>admitted to University Hospital of São João, in Porto, for urgent surgery due to an incarcerated hernia</strong>, after feeling unwell.",
    "published": "1 week ago"
  },
  {
    "title": "Marcelo Rebelo de Sousa já saiu do hospital: “Sinto-me francamente bem” | Presidência da República | PÚBLICO",
    "url": "https://www.publico.pt/2025/12/03/politica/noticia/marcelo-rebelo-sousa-ja-saiu-hospital-sintome-francamente-bem-2156867",
    "snippet": "Admitindo que em funções a sua saúde é &quot;um bem público&quot; enquanto for Presidente da República, <strong>Marcelo Rebelo de Sousa afirmou que até ao Natal terá a responsabilidade de se submeter a um período de &quot;maior repouso&quot;.</strong>",
    "published": "2 weeks ago"
  },
  {
    "title": "Portuguese President Rebelo de Sousa hospitalised following emergency surgery | Euronews",
    "url": "https://www.euronews.com/2025/12/02/portuguese-president-rebelo-de-sousa-hospitalised-following-emergency-surgery",
    "snippet": "<strong>Presidency doctors decided that, before returning to Lisbon, Rebelo de Sousa should undergo medical examinations</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "The President of Portugal awards the President of Nueva Economía Fórum",
    "url": "https://thediplomatinspain.com/en/2025/11/29/the-president-of-portugal-awards-the-president-of-new-economy-forum/",
    "snippet": "<strong>The Portuguese President will make his second state visit to Spain next December</strong>. In his speech, President Rebelo de Sousa highlighted José Luis Rodríguez’s professional and academic career, making special mention of the work carried out ...",
    "published": "3 weeks ago"
  },
  {
    "title": "2026 Portuguese presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2026_Portuguese_presidential_election",
    "snippet": "André Ventura, the leader of Chega, played with the idea of being a candidate, until committing in September 2025. Other personalities, like both MEPs João Cotrim Figueiredo (IL) and Catarina Martins (BE), also announced their candidacies, as well as former MP António Filipe (PCP) and MP Jorge Pinto (L). More than 40 candidates have, so far, expressed their intention to be on the presidential ballot. Marcelo Rebelo de Sousa was re-elected in January 2021, securing nearly 61 percent of the votes in the first round.",
    "published": "12 hours ago"
  }
]