[
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "Beginning in late 2018, Mélenchon and the leadership of La France Insoumise made a significant shift by abandoning their sovereigntist and ultra-secularist stances. This decision led to the expulsion of key members, marking a clear change in the party&#x27;s ideological direction. The 2022 L&#x27;Avenir en commun programme for the Popular Union includes a number of proposals, such as replacing capitalism. In August 2025, during the congress of France Insoumise, in Châteauneuf-sur-Isère, near Valence in the Drôme, the party called for a strike for 10 September 2025, to oppose the 2026 budget bill, presented by François Bayrou.",
    "published": "3 days ago"
  },
  {
    "title": "Jean-Luc Mélenchon - La France insoumise",
    "url": "https://lafranceinsoumise.fr/les-parlementaires-de-la-france-insoumise/jeanlucmelenchon/",
    "snippet": "Député de la 4e circonscription des Bouches-du-Rhône. <strong>Président du groupe parlementaire de La France insoumise</strong>.Membre de la commission des affaires",
    "published": "September 24, 2020"
  },
  {
    "title": "La France insoumise - Accueil - La France insoumise",
    "url": "https://lafranceinsoumise.fr/",
    "snippet": "JE REJOINS J&#x27;habite hors de France À LA UNE Le programme l&#x27;Avenir en commun édition 2025 Retrouvez le programme À LA UNE Signez la pétition pour la",
    "published": "September 16, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon (LFI et NFP) : actualités, biographie courte",
    "url": "https://www.la-croix.com/Actualite/France/Jean-Luc-Melenchon",
    "snippet": "Aucune synthèse n’a été possible entre la majorité d’Olivier Faure, réélu premier secrétaire du PS, et la minorité représentée par Nicolas Mayer-Rossignol lors du congrès réuni du 13 au 15 juin 2025, à Nancy. En cause : la place de La France insoumise au sein de l’union de la gauche. 15 juin Analyse · Jean-Luc Mélenchon et La France insoumise, les dérives d’une méthode mises au jour",
    "published": "February 7, 2012"
  },
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "Jean-Luc Antoine Pierre Mélenchon (French: [ʒɑ̃lyk melɑ̃ʃɔ̃] ⓘ; born 19 August 1951) is a French politician who has been the de facto leader of the movement La France Insoumise (LFI) since it was established in 2016. He was the deputy in the National Assembly for the 4th constituency of Bouches-du-Rhône from 2017 to 2022 and led the La France Insoumise group in the National Assembly from 2017 to 2021.",
    "published": "2 days ago"
  }
]