[
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "Ten people (nine men and one woman) have served as chancellor of the Federal Republic of Germany, the first being Konrad Adenauer from 1949 to 1963. (Another 26 men had served as &quot;Reich chancellors&quot; of the previous German Empire from 1871 to 1945.) The current officeholder is <strong>Friedrich Merz</strong> of the ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "The CDU/CSU won a plurality of the seats and subsequently reached an agreement to form a coalition with the SPD. Merz was elected chancellor on 6 May 2025, taking two rounds to clear, which was a first in German history.",
    "published": "1 week ago"
  },
  {
    "title": "As Germany selects a new conservative chancellor, a look at the challenges he inherits | PBS News",
    "url": "https://www.pbs.org/newshour/show/as-germany-selects-a-new-conservative-chancellor-a-look-at-the-challenges-he-inherits",
    "snippet": "In Berlin today, <strong>Friedrich Merz</strong> was elected Germany&#x27;s chancellor, but not without a surprising setback.",
    "published": "May 7, 2025"
  },
  {
    "title": "The Federal Chancellor of the Federal Republic of Germany | Home page",
    "url": "https://www.bundeskanzler.de/bk-en",
    "snippet": "The website of Federal Chancellor <strong>Olaf Scholz</strong>. Here you can find out more about the Federal Chancellor, his activities and the responsibilities of the Federal Chancellery.",
    "published": "2 weeks ago"
  },
  {
    "title": "Germany's new chancellor: Who is Friedrich Merz?",
    "url": "https://www.dw.com/en/germanys-new-chancellor-who-is-friedrich-merz/a-72314352",
    "snippet": "Now Merz&#x27;s center-right Christian Democratic Union (CDU) the regional Bavarian Christian Social Union (CSU) and the center-left Social Democrats (SPD) will be working together as Germany&#x27;s new government. For Merz, it is a big step in an unusual career. Merz, who is 69 years old, has never held a top governmental office with significant leadership responsibilities. He has never been a federal minister, or a state premier, or even mayor of a small town. He is the oldest chancellor to take office since Konrad Adenauer, the first post-war German head of government (1949–1963).",
    "published": "May 6, 2025"
  }
]