[
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "When he was less than a year old, Coe and his family moved to Warwickshire, where he later attended <strong>Bridgetown Primary School and Hugh Clopton Secondary School in Stratford-upon-Avon</strong>. The family then moved to Sheffield where he attended Tapton School, a secondary modern school, at Crosspool ...",
    "published": "November 18, 2025"
  },
  {
    "title": "Sebastian Coe Biography - Facts, Childhood, Family Life & Achievements",
    "url": "https://www.thefamouspeople.com/profiles/sebastian-coe-6674.php",
    "snippet": "He received his primary education from <strong>Bridgetown Primary School and Hugh Clopton Secondary School in Stratford-upon-Avon</strong>. His family then moved to Sheffield where he attended Tapton Secondary Modern School and Abbeydale Grange School.",
    "published": null
  },
  {
    "title": "Sebastian Coe | GreatestBritons",
    "url": "https://greatestbritons.com/sebastian-coe-biography/",
    "snippet": "When Sebastian was still very young the family moved to Warwickshire where he attended school in <strong>Stratford-Upon-Avon</strong>, before a further move saw Coe at a comprehensive school in Sheffield, South Yorkshire.",
    "published": "3 weeks ago"
  },
  {
    "title": "Sebastian Coe - Infogalactic: the planetary knowledge core",
    "url": "https://infogalactic.com/info/Sebastian_Coe",
    "snippet": "Coe moved to Warwickshire when he was less than a year old where he attended <strong>Bridgetown Primary School and Hugh Clopton Secondary School in Stratford-upon-Avon</strong>.[12] The family then moved to Sheffield where he attended Tapton Secondary Modern School, Crosspool which became a Comprehensive School ...",
    "published": null
  },
  {
    "title": "Sebastian Coe facts for kids",
    "url": "https://kids.kiddle.co/Sebastian_Coe",
    "snippet": "His father coached him. He also ran for <strong>Loughborough University</strong> and other clubs. At <strong>Loughborough University</strong>, Coe studied Economics and Social History. He won his first big race in 1977, an 800 metres event in Spain.",
    "published": null
  }
]