[
  {
    "title": "Federica Mogherini - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Federica_Mogherini",
    "snippet": "Federica Mogherini (Italian: [fedeˈriːka moɡeˈriːni]; born 16 June 1973) is an Italian politician who served as <strong>High Representative of the Union for Foreign Affairs and Security Policy</strong> and Vice-President of the European Commission from 2014 to 2019. She is a member of the Democratic Party ...",
    "published": "3 days ago"
  },
  {
    "title": "Federica Mogherini | European Leadership Network",
    "url": "https://europeanleadershipnetwork.org/person/federica-mogherini/",
    "snippet": "Federica Mogherini served as <strong>High Representative of the European Union for Foreign Affairs and Security Policy</strong>, and as Vice-President of the European Commission from 2014 to 2019. From February to...",
    "published": null
  },
  {
    "title": "Ms. Federica Mogherini | UN Secretary-General's High-Level Panel on Internal Displacement",
    "url": "https://www.un.org/internal-displacement-panel/content/ms-federica-mogherini",
    "snippet": "Federica Mogherini Ms Federica Mogherini was appointed as a member and Co-Chair of the United Nations Secretary-General’s High-Level Panel on Internal Displacement in December 2019. Ms Mogherini served as <strong>High Representative of the European Union for Foreign and Security Policy</strong> and Vice President ...",
    "published": null
  },
  {
    "title": "Federica Mogherini, EU High Representative for Foreign Affairs and Security Policy and Vice President of the European Commission | EEAS",
    "url": "https://www.eeas.europa.eu/node/318_en",
    "snippet": "Federica Mogherini <strong>succeeds Catherine Ashton as the European Union&#x27;s High Representative for Foreign Affairs and Security Policy</strong> and Vice President of the European Commission on 1 November. She is also head of the European External Action Service.",
    "published": null
  },
  {
    "title": "Statement by H.E. Federica Mogherini, High Representative of the Union for Foreign Affairs and Security Policy and Vice-President of the European Commission | Organization for Security and Co-operation in Europe",
    "url": "https://www.osce.org/cio/129491",
    "snippet": "Office of the Special Representative and Co-ordinator for Combating Trafficking in Human Beings · Office of the Co-ordinator of OSCE Economic and Environmental Activities · Gender Issues Programme · Opportunities for Youth · Department of Human Resources · Department of Management and Finance · Office of Internal Oversight · Documentation Centre in Prague · Institutions · Office for Democratic Institutions and Human Rights · High Commissioner on National Minorities ·",
    "published": null
  }
]