[
  {
    "title": "Gasperini: “Our best game at the Olimpico” - AS Roma",
    "url": "https://www.asroma.com/en/news/74491/gasperini-our-best-game-at-the-olimpico",
    "snippet": "Gian Piero Gasperini was interviewed by Sky Sport after the game against Como. ... Let&#x27;s start with Matias Soulé. I saw you and Cesc Fabregas having a friendly chat. He recognised that Roma deserved to win this game and was full of praise for Soule and the way he played.",
    "published": "17 hours ago"
  },
  {
    "title": "Gasperini’s pre-Como press conference - AS Roma",
    "url": "https://www.asroma.com/en/news/74480/gasperinis-pre-como-press-conference",
    "snippet": "I came with the intention and the hope of doing a good job, with the belief that this was the right atmosphere for me. Beyond what’s been said about the difficult environment at Roma and the fact my arrival here wasn’t welcomed by everyone, through hard work, performance, the behaviour of the team and players, and the support of the fans, we have made progress.",
    "published": "2 days ago"
  },
  {
    "title": "AS Roma appoint Gian Piero Gasperini as new Head Coach",
    "url": "https://www.asroma.com/en/news/73319/as-roma-appoint-gian-piero-gasperini-as-new-head-coach",
    "snippet": "AS Roma announces the appointment of Gian Piero Gasperini as the Club’s new Head Coach.",
    "published": "June 6, 2025"
  },
  {
    "title": "Gasperini: 'Roma won't settle for 4th, but we'd be happy with it'",
    "url": "https://football-italia.net/gasperini-roma-wont-settle-4th-but-happy-with/",
    "snippet": "Gian Piero Gasperini feels the 1-0 victory over Como was Roma’s ‘best home performance of the season’ and assures he wouldn’t ‘settle for fourth place, but I’d be very happy with it.’",
    "published": "18 hours ago"
  },
  {
    "title": "Gian Piero Gasperini Would Be Happy With Roma Finishing Fourth In Serie A This Season",
    "url": "https://www.mykhel.com/football/roma-fourth-place-finish-gasperini-happy-011-402124.html",
    "snippet": "This performance is their best start since the 2017-18 season when they achieved 11 wins. Head coach Gian Piero Gasperini <strong>expressed satisfaction with the team&#x27;s current standing but emphasised the importance of maintaining strong performances</strong>.",
    "published": "6 hours ago"
  }
]