[
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "Following Modi&#x27;s 2014 appointment as India&#x27;s PM, President Obama congratulated him over the telephone and invited Modi to visit the US. The Modi government enjoyed a positive relationship with the US during the presidencies of Barack Obama and his successor Donald Trump.",
    "published": "1 day ago"
  },
  {
    "title": "Who will be Narendra Modi's successor? Here is the Prime Minister's answer | Lok Sabha Elections News - Business Standard",
    "url": "https://www.business-standard.com/elections/lok-sabha-election/who-will-be-narendra-modi-s-successor-here-is-the-prime-minister-s-answer-124052100647_1.html",
    "snippet": "On PM Modi&#x27;s succession, Delhi Chief Minister Arvind Kejriwal alleged that the PM has decided to make Amit Shah the Prime Minister of the country",
    "published": "May 21, 2024"
  },
  {
    "title": "Modi: Modi in 2024, 2029, 2034...is there a succession plan? | India News - Times of India",
    "url": "https://timesofindia.indiatimes.com/india/modi-in-2024-2029-2034-is-there-a-succession-plan/articleshow/92743128.cms",
    "snippet": "Delhi chief minister Arvind Kejriwal has claimed Narendra Modi - if elected again- will resign at 75 and <strong>Amit Shah will become the PM</strong>. Modi has ensured that home minister Shah is seen as his second in command.",
    "published": "May 11, 2024"
  },
  {
    "title": "Who next after Modi? Amit Shah top choice as successor, reveals survey",
    "url": "https://www.moneycontrol.com/news/politics/who-next-after-modi-amit-shah-top-choice-as-successor-reveals-survey-12805155.html",
    "snippet": "Among other leaders seen as a likely successor to Modi as Prime Minister within the BJP are Union ministers <strong>Rajnath Singh and Shivraj Singh Chouhan</strong> with around 5 percent of the respondents polling in their favour.",
    "published": "August 23, 2024"
  },
  {
    "title": "Who could replace Narendra Modi?",
    "url": "https://www.economist.com/asia/2024/05/13/who-could-replace-narendra-modi",
    "snippet": "Mr Kejriwal also lobbed an unexpected political grenade, claiming that if the Bharatiya Janata Party (BJP) wins a third consecutive election victory as expected, Mr Modi would step down next year when he hits the party’s unofficial retirement age of 75. This article appeared in the Asia section of the print edition under the headline “Who could replace Narendra Modi?”",
    "published": "May 13, 2024"
  }
]