[
  {
    "title": "President of Chile - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Chile",
    "snippet": "<strong>Gabriel Boric</strong> is the current president, having won the 2021 Chilean general election and taken office on 11 March 2022. José Antonio Kast will take office on 11 March 2026, having won the 2025 Chilean general election. The origins of Chile as a nation can be traced to 1541, when it was separated ...",
    "published": "4 days ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "The ultra-conservative former congressman <strong>José Antonio Kast</strong> has been elected as Chile’s next president. With more than 99% of polling stations counted, Kast took 58.16% of the vote, against 41.84% for the leftist Jeannette Jara, a former ...",
    "published": "1 week ago"
  },
  {
    "title": "Gabriel Boric - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gabriel_Boric",
    "snippet": "<strong>Gabriel Borić Font</strong> (Spanish: [ɡaˈβɾjel ˈβoɾitʃ ˈfont]; born 11 February 1986) is a Chilean politician who has served as the 37th president of Chile since 2022. A socialist, he was previously a member of the Chamber of Deputies for two consecutive terms from 2014 to 2022.",
    "published": "13 hours ago"
  },
  {
    "title": "List of presidents of Chile - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Chile",
    "snippet": "^ On 21 March 1831 the Congress appointed <strong>José Joaquín Prieto</strong> as president and Fernando Errázuriz as vice president, but Prieto did not take office and instead resigned immediately, making Fernando Errázuriz president automatically.",
    "published": "1 day ago"
  },
  {
    "title": "Chile’s new far-right head is latest Latin American leader to ride hardline wave to power | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-chile-election-analysis",
    "snippet": "<strong>José Antonio Kast</strong>’s victory in Chile’s presidential election has been widely praised by leaders of the global right, with congratulations coming from the US secretary of state Marco Rubio, Hungary’s Viktor Orbán, Italy’s Giorgia Meloni, ...",
    "published": "1 week ago"
  }
]