[
  {
    "title": "VfL Wolfsburg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/VfL_Wolfsburg",
    "snippet": "Wolfsburg have won the Bundesliga once in their history, in the 2008–09 season, the DFB-Pokal in 2015 and the DFL-Supercup in 2015. Professional football is run by the spin-off organization <strong>VfL Wolfsburg-Fußball GmbH, a wholly owned subsidiary of the Volkswagen Group</strong>.",
    "published": "1 day ago"
  },
  {
    "title": "Workers, Their Clubs, and 50+1 Exception: VfL Wolfsburg and Bayer Leverkusen – Pace Intellectual Property, Sports & Entertainment Law Forum",
    "url": "https://pipself.blogs.pace.edu/2017/02/16/workers-their-clubs-and-501-exception-vfl-wolfsburg-and-bayer-leverkusen/",
    "snippet": "The club went on to win the Bundesliga in 2008-09 season, the DFB-Pokal in 2015, and the DFL-Supercup in 2015. Now, VfL Wolfsburg (“Wolfsburg”) is owned by <strong>VfL Wolfsburg-Fußball GmbH, a wholly owned subsidiary of Volkswagen Group</strong>.",
    "published": null
  },
  {
    "title": "Partners | VfL Wolfsburg",
    "url": "https://www.vfl-wolfsburg.de/en/vfl/business/partners",
    "snippet": "The corporation is based in Wolfsburg and operates as the <strong>parent company of the car brands Volkswagen, Audi, Seat and Škoda; the premium brands Bentley, Bugatti, Ducati, Lamborghini and Porsche; and the commercial vehicle companies MAN and Scania</strong>. The club is also supported by several other ...",
    "published": null
  },
  {
    "title": "VfL-Partners | VfL Wolfsburg",
    "url": "https://www.vfl-wolfsburg.de/en/vfl/business/partners/vfl-partners",
    "snippet": "<strong>Volkswagen AG</strong> is Europe&#x27;s largest car manufacturer as well as the primary sponsor and owner of VfL Wolfsburg Fußball-GmbH. The corporation is based in Wolfsburg and operates as the parent company of the car brands Volkswagen, Audi, Seat and Škoda; the premium brands Bentley, Ducati, Lamborghini ...",
    "published": null
  },
  {
    "title": "Explaining the Bundesliga's 50+1 rule | World Football FAQ | Bundesliga",
    "url": "https://www.bundesliga.com/en/faq/what-are-the-rules-and-regulations-of-soccer/50-1-fifty-plus-one-german-football-soccer-rule-explained-ownership-22832",
    "snippet": "Bayer Leverkusen and Wolfsburg are two special cases in the Bundesliga, based on the fact that investors who have had an interest in a club for more than 20 years can be granted an exemption from the 50+1 rule. Leverkusen was founded in 1904 by employees of German pharmaceutical company Bayer, which was based in the city. Affiliated with the local autoworks, meanwhile, VfL Wolfsburg was founded in 1945, just seven years after the city itself was created to house Volkswagen workers busy assembling the famous Beetle or “people’s car”. Those two clubs have always been owned by the respective companies, long before their arrivals in the Bundesliga, and are therefore exempt - not that all fan groups agree with that rule.",
    "published": "March 3, 2023"
  }
]