[
  {
    "title": "Governance Structure - IAU",
    "url": "https://www.iau-aiu.net/Governance-Structure",
    "snippet": "He/She chairs the Administrative Board and the Executive Committee. ... All the member of the Administrative Board are elected for a four-year term. In addition to the President, the Board comprises 20 members (18 heads of member institutions &amp; 2 heads of member organizations). It also comprises two ex-officio members (Immediate Past President &amp; the Secretary General).",
    "published": null
  },
  {
    "title": "Executive Committee | IAU",
    "url": "https://www.iau.org/administration/executive_bodies/past_committees/executive_committee/",
    "snippet": "IAU Executive Bodies · Past Committees ... · <strong>Debra Meloy Elmegreen · Willy Benz · Piero Benvenuti (Interim General Secretary) José Miguel Rodriguez Espinosa · Diana Mary Worrall · Laura Ferrarese Hyesung KANG Daniela Lazzaro Solomon Belay Tessema Ilya G.</strong>...",
    "published": null
  },
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Two subsidiaries of the IAU were also created at this assembly: the International Time Commission seated at the International Time Bureau in Paris, France, and the International Central Bureau of Astronomical Telegrams initially seated in Copenhagen, Denmark. The seven initial member states were Belgium, Canada, France, Great Britain, Greece, Japan, and the United States, soon to be followed by Italy and Mexico. The first executive committee consisted of Benjamin Baillaud (President, France), Alfred Fowler (General Secretary, UK), and four vice presidents: William Campbell (US), Frank Dyson (UK), Georges Lecointe (Belgium), and Annibale Riccò (Italy).",
    "published": "3 weeks ago"
  },
  {
    "title": "Executive Committee",
    "url": "https://www.iau.org/Iau/Iau/About/Governance-Overview/Executive-Committee.aspx",
    "snippet": "Welcome to the New IAU Environment! Thank you for your patience as we continue to build our site. The Executive Committee consists of the President of the Union, the President-Elect, six Vice-Presidents , the General Secretary, and the Assistant General Secretary elected by the General Assembly on the proposal of the Special Nominating Committee (SNC) . The Executive Committee is seconded by two Advisors, namely the past President and the past General Secretary.",
    "published": null
  },
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "He/She chairs the Administrative Board and the Executive Committee. ... All the member of the Administrative Board are elected for a four-year term. In addition to the President, the Board comprises 20 members (18 heads of member institutions &amp; 2 heads of member organizations). It also comprises two ex-officio members (Immediate Past President &amp; the Secretary General).",
    "published": null
  }
]