[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The term of office for Executive Board Members is four years. ... Chaired British Government Sports Honours Committee (2010-2018) and served within the Cabinet Office as Legacy Ambassador for the London 2012 Games (2012-2017) International Inspiration Chair (charity delivering London 2012 Bid pledge to use sport to enhance the lives of youth around the world) (2013-2015)",
    "published": null
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://site.uat.aws.worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The term of office for Executive Board Members is four years. ... Chaired British Government Sports Honours Committee (2010-2018) and served within the Cabinet Office as Legacy Ambassador for the London 2012 Games (2012-2017) International Inspiration Chairman (charity delivering London 2012 Bid pledge to use sport to enhance the lives of youth around the world) (2013-2015) ... Chairman, Organising Committee - Asian Athletics Championships (2013 - Pune, India) &amp; (2017 - Odisha, India), and Member, Organising Committee - IAAF Permit Meetings in India",
    "published": null
  },
  {
    "title": "World Athletics Executive Board re-appoints Arat, Hoffman and Sabharwal as members | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/world-athletics-executive-board-arat-hoffman-sabharwal",
    "snippet": "Along with the three re-appointed members, the Executive Board includes World Athletics President <strong>Sebastian Coe</strong>, Senior Vice President Ximena Restrepo, Vice Presidents Raul Chapado, Adille Sumariwalla and Jackson Tuwei, and CEO Jon Ridgeon ...",
    "published": null
  },
  {
    "title": "World Athletics | Intro",
    "url": "https://worldathletics.org/about-iaaf/structure/intro",
    "snippet": "The role of <strong>the President</strong> is to ... promote the strategy and plans of World Athletics in growing athletics throughout the world. The President is responsible for chairing Congress, Council and the Executive Board, including ensuring the decisions ...",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "The last election was held in October 2019 at the 2019 World Athletics Championships. Following doping and corruption issues, a Code of Ethics was agreed in 2013 and an Ethics Commission was appointed in 2014. The Council appoints the chairperson from the elected members, and in turn, the chairperson appoints a deputy chair. The Ethics Board&#x27;s scope was limited in 2017 with the creation of the independent Athletics Integrity Unit, headed by Australia&#x27;s Brett Clothier, to oversee ethical issues and complaints at arm&#x27;s length.",
    "published": "1 week ago"
  }
]