[
  {
    "title": "Paris-Sud University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris-Sud_University",
    "snippet": "Paris-Sud also comprised biology and chemistry laboratories, engineering and technology schools and had established partnerships with many of the surrounding technology centres and Grandes Ecoles. It also included Schools of Law, Economics and Management. In 2019, University Paris–Sud was replaced by the University of Paris-Saclay.",
    "published": "October 7, 2025"
  },
  {
    "title": "Paris-Saclay University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris-Saclay_University",
    "snippet": "Confronted with disagreements between its members (between the schools and universities, or between their supervisory ministries), the project stagnated, as the Cour des Comptes noted in its report of 8 February 2017, pointing in particular to a lack of housing and transport facilities, as well as a lack of strategic vision, despite the five billion euros planned (committed or envisaged). In 2017, the University of Paris-Sud proposed merging with the university system (ComUE) to create the Paris-Saclay University as a collegiate university, and integrating the schools into the future institution as component institutions.",
    "published": "3 weeks ago"
  },
  {
    "title": "University of Paris-Sud - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q1480643",
    "snippet": "M. <strong>JEAN-PIERRE KAHANE</strong> EST ÉLU PRÉSIDENT DE L&#x27;UNIVERSITÉ PARIS-SUD (French)",
    "published": null
  },
  {
    "title": "University of Paris-Sud, Orsay: tuition fees – UniPage",
    "url": "https://www.unipage.net/en/400/university_of_paris_sud",
    "snippet": "University of Paris-Sud (UPS 11) — public non-profit university. It is located in Paris, France. It is one of the youngest higher education institutions in the country.",
    "published": null
  },
  {
    "title": "Does Paris-Sud University still exist? - Quora",
    "url": "https://www.quora.com/Does-Paris-Sud-University-still-exist",
    "snippet": "Answer: <strong>Not as an administrative entity, it was renamed to / absorbed into what is now Université Paris-Saclay</strong>. Université Paris-Saclay is basically an administrative shell containing what was Paris Sud + a bunch of engineering schools like ...",
    "published": null
  }
]