[
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "It elects the President and members of the Administrative Board. ... Elected for a 4-year non-renewable term, the IAU President is elected from among members of the Administrative Board by the General Conference. He/She <strong>chairs the Administrative Board and the Executive Committee</strong>.",
    "published": null
  },
  {
    "title": "Governance Structure - IAU",
    "url": "https://www.iau-aiu.net/Governance-Structure",
    "snippet": "It elects the President and members of the Administrative Board. ... Elected for a 4-year non-renewable term, the IAU President is elected from among members of the Administrative Board by the General Conference. He/She <strong>chairs the Administrative Board and the Executive Committee</strong>.",
    "published": null
  },
  {
    "title": "Executive Committee",
    "url": "https://www.iau.org/Iau/Iau/About/Governance-Overview/Executive-Committee.aspx",
    "snippet": "The Executive Committee is seconded by two Advisors, namely the past President and the past General Secretary. The Officers of the Union are the President, the President-Elect, the General Secretary, and the Assistant General Secretary.",
    "published": null
  },
  {
    "title": "Presidency — International Association of Universities",
    "url": "https://iau.global/presidency",
    "snippet": "Elected for a 4-year non-renewable term, the IAU President is elected from among Members at the General Conference. She or he <strong>chairs the Administrative Board and the Executive Committee</strong>.",
    "published": null
  },
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "After a Polish request in 1967, and by a controversial decision of the then President of the IAU, an Extraordinary IAU General Assembly was held in September 1973 in Warsaw, Poland, to commemorate the 500th anniversary of the birth of Nicolaus Copernicus, soon after the regular 1973 GA had been held in Sydney. ... Commission 46 is a Committee of the Executive Committee of the IAU, playing a special role in the discussion of astronomy development with governments and scientific academies.",
    "published": "3 weeks ago"
  }
]