[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "After his father&#x27;s retirement in ... autumn, he began attending the private <strong>Collège Jean-de-Brébeuf</strong>, his father&#x27;s alma mater. The school had begun as a Jesuit school but was non-denominational by the time Justin matriculated. In 2008, Trudeau said that of all his early ...",
    "published": "4 days ago"
  },
  {
    "title": "What high school did Canadian Prime Minister Justin Trudeau attend or graduate from? - Quora",
    "url": "https://www.quora.com/What-high-school-did-Canadian-Prime-Minister-Justin-Trudeau-attend-or-graduate-from",
    "snippet": "Answer (1 of 4): Justin Trudeau graduated from <strong>Rockcliffe Park Public School</strong>",
    "published": null
  },
  {
    "title": "Justin Trudeau | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/justin-trudeau",
    "snippet": "As a result, Justin Trudeau and his two younger brothers were raised by a single father who also happened to be at the center of Canadian politics. Trudeau attended <strong>Collège Jean-de-Brébeuf in Montreal</strong>, the same Jesuit-founded, French-language ...",
    "published": null
  },
  {
    "title": "Justin Trudeau – Canadian History Ehx",
    "url": "https://canadaehx.com/2021/05/21/justin-trudeau/",
    "snippet": "He then returned to finish his degree, this time attending the <strong>University of British Columbia</strong>, where he graduated with a Bachelor of Education in 1998. His teaching career would begin with his work as a substitute teacher in Coquitlam, B.C., ...",
    "published": "September 11, 2023"
  },
  {
    "title": "Justin Trudeau - Students | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/students/article/Justin-Trudeau/625369",
    "snippet": "When Justin Trudeau was six years old, his parents divorced. Trudeau earned a bachelor’s degree in English from <strong>McGill University in Montreal, Quebec</strong>, in 1994. He received a degree in education from the University of British Columbia in 1998.",
    "published": null
  }
]