[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "Newsmax additionally said viewers should be aware of &quot;several facts&quot;, including that both companies have no relationship with George Soros, and that &quot;Smartmatic is a U.S. company and not owned by the Venezuelan government&quot; or any other foreign entity. Mediaite&#x27;s Rudy Takala wrote that conservatives disgruntled with Fox News could potentially be disappointed by Newsmax due to CEO Christopher Ruddy&#x27;s friendship with former Democratic president Bill Clinton and positive remarks about a Hillary Clinton presidential campaign.",
    "published": "1 week ago"
  },
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "<strong>Christopher Ruddy</strong> (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and majority owner of Newsmax Media.",
    "published": "5 days ago"
  },
  {
    "title": "Newsmax stock surges after its IPO | CNN Business",
    "url": "https://www.cnn.com/2025/04/01/media/newsmax-stock-surges-after-ipo",
    "snippet": "Anchors said things like “we want you to be a co-owner” and Newsmax wants you to join us in keeping America safe and strong.” Ruddy sometimes appeared on air for the ads. He recognized a pure-play TV brand would not normally generate Wall Street excitement, so he touted Newsmax’s streaming ventures and podcasts. And he likened his IPO plans to Trump’s media company stock.",
    "published": "April 1, 2025"
  },
  {
    "title": "Christopher Ruddy | Long Island University",
    "url": "https://liu.edu/roosevelt/~/link.aspx?_id=CBEEEDD71542408AA2E0F8E91B527511&_z=z",
    "snippet": "<strong>Christopher Ruddy</strong> is CEO and President of Newsmax Media Inc., a leading digital and television news media company. Ruddy, who grew up near Sagamore Hill, has been a long-time member of the Theodore Roosevelt Association and often reference Theodore Roosevelt in his commentaries on current U.S.",
    "published": null
  },
  {
    "title": "Who Owns Newsmax TV? Inside The Story Of Its Owner And Conservative Media Rise",
    "url": "https://richniches.com/who-owns-newsmax-tv/",
    "snippet": "By leveraging different mediums, Newsmax Media maximizes its revenue streams and audience engagement. Private ownership defines Newsmax TV, with <strong>Christopher Ruddy</strong> holding the majority stake in the company.",
    "published": "September 17, 2025"
  }
]