[
  {
    "title": "2025 Chilean general election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Chilean_general_election",
    "snippet": "General elections were held in Chile on 16 November 2025. Voters went to the polls to elect the <strong>38th president of Chile</strong>, renew all 155 seats in the Chamber of Deputies, and fill 23 of the 50 seats in the Senate.",
    "published": "2 days ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "During the campaign, he gave the roughly 330,000 undocumented migrants – most of them Venezuelan – an ultimatum to leave before the next president takes office on 11 March or be expelled “with only the clothes on their backs”. In his victory speech, in which he repeatedly said Chileans were living in “fear”, the president-elect said his administration would show “great firmness in confronting all those who harm us”.",
    "published": "1 week ago"
  },
  {
    "title": "President of Chile - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Chile",
    "snippet": "Michelle Bachelet was the first ... 2018. Gabriel Boric is the current president, having won the 2021 Chilean general election and taken office on 11 March 2022. <strong>José Antonio Kast</strong> will take office on 11 March 2026, having won the 2025 Chilean general election....",
    "published": "4 days ago"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "Chile has elected the far-right wing <strong>José Antonio Kast</strong> to be its next president, after an election campaign that was dominated by themes of security, immigration and crime.",
    "published": "1 week ago"
  },
  {
    "title": "Chile shifts sharply right as José Antonio Kast wins the presidency",
    "url": "https://www.npr.org/2025/12/14/nx-s1-5644074/chile-kast-right",
    "snippet": "&quot;We will work relentlessly to restore peace, order, growth, and hope,&quot; Kast declared after his victory. He pledged to be &quot;the president of all Chileans.&quot;",
    "published": "1 week ago"
  }
]