[
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "On 19 May 2023, Sven Mislintat took over as Ajax&#x27;s sports director. He succeeded <strong>Marc Overmars</strong>, who left in early 2022. Mislintat appointed Maurice Steijn as head coach. Mislintat spent approximately 111 million euros on transfers. Ajax had its worst start to the season in fifty-nine years.",
    "published": "2 weeks ago"
  },
  {
    "title": "AFC Ajax » Coaching Staff List",
    "url": "https://www.worldfootball.net/teams/afc-ajax/9/",
    "snippet": "Football - results, news, statistics and much more...",
    "published": null
  },
  {
    "title": "Ajax Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=80&teamTabs=managers",
    "snippet": "Ajax Football Club Managers, full history, past and present. Provided courtesy of Soccerbase.com, the Football Betting Site.",
    "published": null
  },
  {
    "title": "Francesco Farioli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Francesco_Farioli",
    "snippet": "On 23 May 2024, Farioli was appointed head coach of Dutch club Ajax, signing a three-year contract and becoming the club&#x27;s first Italian manager. His appointment also marked the first time Ajax had hired a foreign manager since <strong>Morten Olsen</strong> in the 1997–98 season.",
    "published": "20 hours ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "Keizer (Badhoevedorp, January 15, 1969) progressed through the Ajax academy as a youth player, just like Heitinga. After a professional playing career at Ajax, SC Cambuur, De Graafschap, and FC Emmen, Keizer began his coaching career in 2002. He has been head coach at Telstar, Emmen, SC Cambuur, Ajax U23, and Ajax 1, before moving abroad in 2018.",
    "published": null
  }
]