[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Commission 46 is a Committee of the Executive Committee of the IAU, playing a special role in the discussion of astronomy development with governments and scientific academies. The IAU is affiliated with the International Council of Scientific Unions (ICSU), a non-governmental organization representing a global membership that includes both national scientific bodies and international scientific unions.",
    "published": "3 weeks ago"
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "<strong>Catherine Cesarsky</strong>, as President for a three-year period (2006-2009). The IAU is a body of distinguished professional astronomers, founded in 1919 to promote and safeguard the science of astronomy in all its aspects through international cooperation.",
    "published": null
  },
  {
    "title": "International Astronomical Union (IAU) | Britannica",
    "url": "https://www.britannica.com/topic/International-Astronomical-Union",
    "snippet": "International Astronomical Union (IAU), senior body governing international professional astronomical activities worldwide, with headquarters in Paris. It was established in 1919 as the first of a series of international unions for the advancement of specific branches of science. Its professed",
    "published": "March 29, 2007"
  },
  {
    "title": "IAU HISTORY | IAU100:Under One Sky",
    "url": "https://www.iau-100.org/iau-history",
    "snippet": "In the late nineteenth century, several large-scale international surveys had been organised, most notably the great Carte du Ciel and the related Astrographical Catalogue. <strong>George Ellery Hale</strong>, one of the founders of modern astrophysics, had founded the International Union for Cooperation in ...",
    "published": null
  },
  {
    "title": "International Astronomical Union",
    "url": "https://www.iau.org/",
    "snippet": "The National Astronomical Observatory ... in Astronomy Communication&quot; from 2-6 November 2026 at the NAOJ Mitaka campus in Tokyo, Japan. Read more ... Don&#x27;t miss the dedicated panel discussion &quot;Science in Action: Grassroots Pathways to Development&quot; on 10 November! Read more ... Anne Thieme joins the IAU Secretariat as Membership Coordinator in November 2025. Read more · Become a part of the largest international union of professional ...",
    "published": null
  }
]