[
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "19, 2025, 9:08 PM ET (AP) Show less · <strong>Mohammed bin Salman</strong> (born August 31, 1985) is the de facto ruler of Saudi Arabia, known for his aggressive foreign policy, ambitious economic vision, and controversial social reforms.",
    "published": "July 17, 2019"
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Russia&#x27;s new foreign policy concept unveiled in 2023 has given priority to enhancing friendly relations with Saudi Arabia. In December 2023, Putin visited Saudi Arabia and met with Mohammed. Saudi Crown Prince <strong>Mohammed bin Salman</strong> hosted Ukrainian President Volodymyr Zelenskyy in Riyadh on 10 ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Saudi Arabia’s Prince Has Big Plans, but His Giant Fund Is Low on Cash - The New York Times",
    "url": "https://www.nytimes.com/2025/11/19/business/pif-saudi-arabia-fund-problems.html",
    "snippet": "After nearly a decade of expensive, hit-and-miss investments, <strong>Mohammed bin Salman</strong> is overseeing a behind-the-scenes restructuring of the kingdom’s all-important wealth fund.",
    "published": "1 month ago"
  },
  {
    "title": "Mohammed Bin Salman | The Visionary Leader Transforming Saudi Arabia",
    "url": "https://soulofsaudi.com/mohammed-bin-salman/",
    "snippet": "Who is the king of Saudi Arabia in 2025? As of 2025, <strong>King Salman bin Abdulaziz Al Saud</strong> remains monarch, ruling since 2015.",
    "published": "September 8, 2025"
  },
  {
    "title": "Saudi Arabia - United States Department of State",
    "url": "https://www.state.gov/reports/2025-investment-climate-statements/saudi-arabia",
    "snippet": "While the United States Trade Representative (USTR) removed Saudi Arabia from its Special 301 report in 2022, concerns remain regarding intellectual property enforcement and regulatory data protection. Insufficient oil revenues amid continued spending on Vision 2030 projects contributed to estimated deficits of $21.9 billion in 2023 and $32 billion in 2024. The 2025 budget projects a $27 billion deficit and future deficits as the Kingdom pursues economic diversification through government-led investment.",
    "published": null
  }
]