[
  {
    "title": "Carolina Panthers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Carolina_Panthers",
    "snippet": "The franchise is legally registered as Panther Football, LLC, and is controlled by <strong>David Tepper</strong>, whose purchase of the team from founder Jerry Richardson was unanimously approved by league owners on May 22, 2018. The club, which Forbes valued at approximately US$2.3 billion in 2018, is estimated ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Carolina Panthers",
    "url": "https://www.panthers.com/team/ownership_business/test-david-a-tepper",
    "snippet": "It&#x27;s <strong>David Tepper&#x27;s</strong> personal philosophy that has shaped his entire career and serves as the backbone of his approach as the owner of the Carolina Panthers. He firmly believes in developing a winning organization that is cons",
    "published": null
  },
  {
    "title": "David Tepper - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Tepper",
    "snippet": "<strong>David Alan Tepper</strong> (born September 11, 1957) is an American billionaire hedge fund manager, the founder and president of Appaloosa Management, a global hedge fund based in Miami Beach, Florida. He is also the owner of the Carolina Panthers of the National Football League (NFL) and Charlotte ...",
    "published": "1 day ago"
  },
  {
    "title": "Panthers Front Office Staff | Carolina Panthers - Panthers.com",
    "url": "https://www.panthers.com/team/ownership_business/",
    "snippet": "It’s <strong>David Tepper</strong>’s personal philosophy that has shaped his entire career and serves as the backbone of his approach as the owner of the Carolina Panthers.",
    "published": null
  },
  {
    "title": "Carolina Panthers Executives and Owners | Pro-Football-Reference.com",
    "url": "https://www.pro-football-reference.com/teams/car/executives.htm",
    "snippet": "&gt; Carolina Panthers Executives and Owners · Return to Top · Players · In the News: Tua Tagovailoa, Micah Parsons, Patrick Mahomes, Brock Purdy, J.J. McCarthy, Christian Watson ... Popular: Tom Brady, Cam Newton, Aaron Donald, Russell Wilson, Aaron Rodgers, Odell Beckham Jr., J.J. Watt, Peyton Manning, Patrick Mahomes, Julio Jones, Antonio Brown, Ben Roethlisberger, Drew Brees, Todd Gurley ... Hall of Famers, Pro Bowlers, MVPs, Player Linker Tool ...",
    "published": null
  }
]