[
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) - IMDb",
    "url": "https://www.imdb.com/news/ni65127703/",
    "snippet": "Producer Mike Downey, who is chair of the European Film Academy and whose co-production “Girls on Wire” is in Berlin competition, has <strong>unveiled a diverse slate of films from his production company Downey Ink at the European Film Market</strong>.",
    "published": null
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/mike-downey-downey-ink-berlin-slate-1236306279/",
    "snippet": "Producer Mike Downey, who is chair of the European Film Academy and whose co-production “Girls on Wire” is in Berlin competition, has <strong>unveiled a diverse slate of films from his production company Downey Ink at the European Film Market</strong>.",
    "published": "February 16, 2025"
  },
  {
    "title": "Mike Downey • Producer and chairman of the European Film Academy - Cineuropa",
    "url": "https://cineuropa.org/en/interview/440528/",
    "snippet": "Mike Downey OBE is a producer and the chairman of the European Film Academy, as well as being <strong>one of the founding board members of the International Coalition for Filmmakers at Risk (ICFR).</strong>",
    "published": null
  },
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "Mike first joined the board of the European Film Academy 15 years ago and has served alongside a broad range of European film makers including Istvan Szabo, Volker Schloendorff, Wim Wenders, Nikita Mikhalkov, Pawel Pawlikowski, Agnes Jaoui, Krzystof Zanussi, and David Mackenzie . In 2019 Mike took over the chairmanship and he was joined by Agnieszka Holland as President 2020 taking over from Wim Wenders.",
    "published": null
  },
  {
    "title": "Mike Downey elected new EFA chairman - Cineuropa",
    "url": "https://cineuropa.org/en/newsdetail/382667",
    "snippet": "The members of the European Film Academy (EFA) have elected Mike Downey, <strong>Irish producer and CEO of Film and Music Entertainment (F&amp;ME),</strong> as new chairman of the EFA board.",
    "published": "November 12, 2019"
  }
]