[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "At the beginning of the 2019–20 season, Juventus&#x27;s new manager <strong>Maurizio Sarri</strong> left Can and Mario Mandžukić out of the club&#x27;s Champions League squad for the group stage of the competition.",
    "published": "2 days ago"
  },
  {
    "title": "Former coach of Emre Can reveals what may have influenced decision to join Juventus | English News | Calciomercato.com",
    "url": "https://www.calciomercato.com/en/news/former-coach-of-emre-can-reveals-what-may-have-influenced-his-de-86752",
    "snippet": "2018-24-06 - 14:25 <strong>Toni Magliarisi</strong> smiles at the arrival of Emre Can at Juventus. This Italian immigrant in Germany was one of the first coaches of the German midfielder and now, on the pages of La Gazzetta dello Sport, tells the former Liverpool talent: &quot;I still have goosebumps, if I think ...",
    "published": null
  },
  {
    "title": "Emre Can left out of Champions League squad: Juventus outcast's disastrous decision to quit Liverpool | Goal.com US",
    "url": "https://www.goal.com/en-us/news/not-even-a-juventus-squad-player-emre-cans-disastrous-decision-to-quit-liverpool/1iwr9h9gh45gp10koxa410v2f1",
    "snippet": "&quot;But, yesterday, I got a call from the coach, in which he told me in less than a minute and without explanation that I was not in the squad. &quot;I cannot explain it, nobody has given me a reason until now. &quot;Me and my agent had talks with other clubs [during the summer], PSG included. But after discussions with Juventus, we decided to stay with the club.",
    "published": "September 19, 2023"
  },
  {
    "title": "Emre Can: Who is the Borussia Dortmund and Germany all-action midfielder? | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/emre-can-juventus-liverpool-bayern-munich-bayer-leverkusen-6141",
    "snippet": "- 2019 Getty Images · Deployed exclusively as a central midfielder at the Bianconeri, he found his opportunities limited under <strong>Maurizio Sarri</strong> in the first half of the 2019/20 season, partly due to the presence of compatriot Sami Khedira, but ...",
    "published": "June 1, 2024"
  },
  {
    "title": "Emre Can: Former Juventus Midfielder Departed Because Of Maurizio Sarri",
    "url": "https://www.forbes.com/sites/sammay/2020/03/12/emre-can-former-juventus-midfielder-departed-because-of-maurizio-sarri/",
    "snippet": "Borussia Dortmund midfielder Emre Can has revealed Juventus manager <strong>Maurizio Sarri</strong> was the reason behind why he departed the Turin-based club to return to his homeland and join Lucien Favre&#x27;s side.",
    "published": "March 12, 2020"
  }
]