[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "To complement this, his government ... emphasising better tax-to-GDP ratio rather than raw debt expansion. Prabowo Subianto’s decision to appoint <strong>Purbaya Yudhi Sadewa</strong> as Minister of Finance on 8 September 2025 signaled a change in economic policymaking, a departure from the ...",
    "published": "2 days ago"
  },
  {
    "title": "Life and Political Career of the Indonesian President, Prabowo Subianto",
    "url": "https://thediplomaticinsight.com/life-political-career-of-indonesian-pres-prabowo/",
    "snippet": "December 9, 2025 · Modified: 4 days ago · Twitter · Facebook · WhatsApp · Linkedin · Email · Print · In a country navigating rapid economic growth alongside social and political challenges, the question arises: can a leader with both discipline and pragmatism guide Indonesia toward stability and progress? The presidency of Prabowo Subianto in October 2024 sparked both anticipation and scrutiny as he assumed leadership of one of southeast Asia’s largest democracies.",
    "published": "1 week ago"
  },
  {
    "title": "The return of the smiling general to Indonesian politics | East Asia Forum",
    "url": "https://eastasiaforum.org/2025/11/26/the-return-of-the-smiling-general-to-indonesian-politics/",
    "snippet": "One year into his presidency, Indonesian President Prabowo Subianto has recast the tone of Indonesian politics. The Jakarta Post’s headline ‘Prabowo tightens grip, redraws political map’ captured his aim of transformative governance.",
    "published": "3 weeks ago"
  },
  {
    "title": "Full article: Prabowo’s First 100 Days and beyond as President: A Security-Focused Economic Agenda",
    "url": "https://www.tandfonline.com/doi/full/10.1080/00074918.2025.2483310",
    "snippet": "A few days after swearing in his unusually large cabinet, President Prabowo Subianto sent his <strong>48 ministers, along with their vice-ministers and ministerial-level state agency heads</strong>, to the grounds ...",
    "published": null
  },
  {
    "title": "Indonesia’s Gado-Gado Foreign Policy – A Look at Developments Under Prabowo Subianto’s Leadership | Heinrich Böll Stiftung",
    "url": "https://www.boell.de/en/2025/09/22/indonesias-gado-gado-foreign-policy-look-developments-under-prabowo-subiantos-leadership",
    "snippet": "Indonesia, the largest economy in Southeast Asia, should have assumed a leadership role in the region. However, under President Prabowo Subianto’s leadership, its policies and agreements with the United States and China lack of direction, impacting the ASEAN as a whole.",
    "published": null
  }
]