[
  {
    "title": "Nalini Anantharaman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nalini_Anantharaman",
    "snippet": "Nalini Anantharaman (born 26 February 1976) is a <strong>French mathematician known for her work in mathematical physics and analysis</strong>. She is currently a professor at the University of Strasbourg. She has won major prizes for her work, including the Henri Poincaré Prize in 2012.",
    "published": "August 7, 2025"
  },
  {
    "title": "Biography and publications | Nalini Anantharaman - Spectral Geometry | Collège de France",
    "url": "https://www.college-de-france.fr/en/chair/nalini-anantharaman-spectral-geometry-statutory-chair/biography",
    "snippet": "Nalini Anantharaman was <strong>born in 1976 and grew up in Orléans</strong>. She studied mathematics at the École normale supérieure (Paris) and the Université Paris-Sud.",
    "published": "October 3, 2024"
  },
  {
    "title": "Nalini Anantharaman - USIAS - University of Strasbourg",
    "url": "https://www.usias.fr/en/chairs/nalini-anantharaman/",
    "snippet": "Nalini Anantharaman is a <strong>French mathematician who has won major prizes, including the Henri Poincaré Prize in 2012.</strong> She attended the Ecole normale supérieure (ENS) and stayed in Paris to go on to complete her PhD at the Pierre and Marie Curie University in 2000, under the supervision of François ...",
    "published": null
  },
  {
    "title": "Nalini Anantharaman | Académie des sciences",
    "url": "https://www.academie-sciences.fr/en/nalini-anantharaman",
    "snippet": "Nalini Anantharaman is a <strong>professor at the IRMA Institute for Advanced Mathematical Research (CNRS/Université de Strasbourg).</strong> After a thesis in mathematics defended in 2000, Nalini Anantharaman became a lecturer at ENS Lyon, then a research fellow at CNRS and a professor at Université Paris-Sud.",
    "published": null
  },
  {
    "title": "Nalini Anantharaman – European Women in Mathematics",
    "url": "https://www.europeanwomeninmaths.org/nalini-anantharaman/",
    "snippet": "Photo Copyright: Noel Tovia Matoff, www.matoff.de · This is an EXCERPT of the interview from the catalogue “Women of Mathematics Throughout Europe, a Gallery of Portraits”, published in Verlag am Fluss 2016, [email protected], and featured among thirteen portraits in the corresponding ...",
    "published": null
  }
]