[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "On 5 July 2015, Kasyanov was elected ... re-establish the institution of co-chairmanship, adding, &quot;<strong>Neither Alexei Navalny nor Mikhail Khodorkovsky will enter our party today and be elected as co-chairmen</strong>....",
    "published": "2 days ago"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "The foreign policy plan called for introducing visas with Central Asia, stopping support for so-called rogue states and partnering up with Western countries. According to Navalny&#x27;s ally Lyubov Sobol, the goals of the party include &quot;real changes, real reforms&quot;, including increased property protections, a fair criminal-justice system and battling corruption, &quot;so that money from the budget does not flow into offshores and is not spent on yachts and palaces&quot;.",
    "published": "September 30, 2025"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. In 2000, while he was still a student, Navalny joined Yabloko, a political party that promoted liberal democracy and a market economy.",
    "published": "March 7, 2023"
  },
  {
    "title": "Russian Game Designer Launches Political Party - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2020/03/06/tankparty-a69546",
    "snippet": "The fact that anti-corruption activist and senior opposition figure <strong>Alexei Navalny is still barred from registering his party</strong> has fuelled speculation of a Kremlin ploy.",
    "published": "March 6, 2020"
  },
  {
    "title": "Kremlin Foe Navalny Launches New Political Party",
    "url": "https://www.rferl.org/a/russia-navalny-new-political-party/29237240.html",
    "snippet": "Russian opposition leader Aleksei Navalny has launched a new political party, though he missed its founding due to a jail sentence over nationwide protests he organized against President Vladimir Putin.",
    "published": "May 19, 2018"
  }
]