[
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "The ultra-conservative former congressman José Antonio Kast has been elected as Chile’s next president. With more than 99% of polling stations counted, Kast took 58.16% of the vote, against 41.84% for the leftist Jeannette Jara, a former labour minister under the current president, Gabriel Boric.",
    "published": "13 hours ago"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "<strong>Chile has elected the far-right wing José Antonio Kast to be its next president</strong>, after an election campaign that was dominated by themes of security, immigration and crime.",
    "published": "2 days ago"
  },
  {
    "title": "Far-right candidate Jose Antonio Kast wins Chile’s presidential election | Elections News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/12/14/far-right-candidate-jose-antonio-kast-wins-chiles-presidential-election",
    "snippet": "Far-right candidate Jose Antonio Kast has won a run-off election to become Chile’s <strong>38th president</strong>, ousting the centre-left government currently in power.",
    "published": "2 days ago"
  },
  {
    "title": "Far-right José Antonio Kast wins Chile's presidential vote | AP News",
    "url": "https://apnews.com/article/chile-elections-kast-jara-president-boric-trump-e9ef32b53359f3152ee80d62c106c5f6",
    "snippet": "SANTIAGO, Chile (AP) — Chile’s ultra-conservative former lawmaker José Antonio Kast <strong>secured a stunning victory in the presidential election Sunday</strong>, defeating the candidate of the center-left governing coalition and setting the stage for ...",
    "published": "2 days ago"
  },
  {
    "title": "José Antonio Kast - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jos%C3%A9_Antonio_Kast",
    "snippet": "José Antonio Kast Rist (born 18 January 1966), also known by his initials JAK, is a Chilean lawyer and politician. <strong>He is the President-elect of Chile, after winning the 2025 Chilean general election</strong>.",
    "published": "1 day ago"
  }
]