[
  {
    "title": "Politics of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Kyrgyzstan",
    "snippet": "<strong>Political insurgency in Kyrgyzstan amplified following controversy about the conduct of October 2020 Kyrgyz parliamentary election</strong>, where only four parties met the 7% threshold to achieve parliamentary representation, three of whom were closely aligned with the government.",
    "published": "3 weeks ago"
  },
  {
    "title": "Another revolution in Kyrgyzstan? - European Parliament",
    "url": "https://www.europarl.europa.eu/RegData/etudes/ATAG/2020/659300/EPRS_ATA(2020)659300_EN.pdf",
    "snippet": "<strong>Since becoming independent from the Soviet Union in 1991, it has been through two revolutions (in 2005 and 2010) and ethnic clashes (in 2010).</strong> The political landscape · remains highly volatile, with no fewer than 14 prime ministers since 2010, none holding power for longer · than two years.",
    "published": null
  },
  {
    "title": "BTI 2024 Kyrgyzstan Country Report: BTI 2024",
    "url": "https://bti-project.org/en/reports/country-report/KGZ",
    "snippet": "In October 2020, Kyrgyzstan experienced yet another political upheaval as <strong>the sitting president, the third since 2005, was ousted from office amidst post-election protests</strong>.",
    "published": null
  },
  {
    "title": "The 2020 Violent Change in Government in Kyrgyzstan Amid the Covid-19 Pandemic: Three Distinct Stories in One | SpringerLink",
    "url": "https://link.springer.com/chapter/10.1007/978-3-030-77489-9_8",
    "snippet": "This third violent change of government in Kyrgyzstan’s short history of independence conceals more stories than the surface suggests. In this chapter, I will provide three distinct accounts that can best explain both the unexpected eruption and the outcomes of the mass uprising in the fall of 2020. First, the economic crisis provoked by the Covid-19 pandemic on the one hand, and the dynamics of patronal politics in the dominant political machine on the other, have generated a negative public opinion towards the ruling elite, which was palpable prior to the parliamentary elections in October of that year.",
    "published": null
  },
  {
    "title": "Kyrgyzstan - Politics, Society, Culture | Britannica",
    "url": "https://www.britannica.com/place/Kyrgyzstan/Government-and-society",
    "snippet": "<strong>After Bakiyev was ousted in 2010, the Social Democratic Party of Kyrgystan (SDPK), formed in 1993, began to dominate the political realm</strong>. By the end of the 2010s, however, political infighting had fractured the party into multiple factions.",
    "published": "July 26, 1999"
  }
]