[
  {
    "title": "Marcelo Ebrard anuncia paquete arancelario para proteger más de 350 mil empleos y frenar el desbalance comercial",
    "url": "https://www.elimparcial.com/mexico/2025/12/15/marcelo-ebrard-anuncia-paquete-arancelario-para-proteger-mas-de-350-mil-empleos-y-frenar-el-desbalance-comercial/",
    "snippet": "<strong>El paquete arancelario aprobado exenta a países con los que tenemos tratado comercial y es para proteger 350 mil empleos en materia de calzado, textil, automotriz y de acero</strong>, explica el secretario de Economía Marcelo Ebrard. pic.twitter.c...",
    "published": "1 day ago"
  },
  {
    "title": "Marcelo Ebrard anuncia paquete arancelario para cuidar 350 mil empleos - Infobae",
    "url": "https://www.infobae.com/mexico/2025/12/15/marcelo-ebrard-anuncia-paquete-arancelario-para-cuidar-350-mil-empleos/",
    "snippet": "Tras la aprobación del Paquete Arancelario, Marcelo Ebrard Casaubón, secretario de Economía, explicó que su objetivo es “cuidar 350 mil empleados en México”. El funcionario detalló que se encuentra enfocado en cuatro industrias, que presentan mayor afectaciones en cuanto a empleabilidad, las cuales reportan un aumento a importaciones del 2022 al 2025...",
    "published": "1 day ago"
  },
  {
    "title": "Paquete arancelario protegerá 350 mil empleos en México: Marcelo Ebrard | El Dictamen",
    "url": "https://www.eldictamen.mx/paquete-arancelario-protegera-350-mil-empleos-en-mexico-marcelo-ebrard/",
    "snippet": "#Mañanera Marcelo Ebrard señaló que <strong>el paquete de aranceles busca proteger alrededor de 350 mil empleos y aclaró que no tiene un diseño geopolítico ni busca afectar a un país en específico, sino que es una medida comercial y económica</strong>.ht...",
    "published": "18 hours ago"
  },
  {
    "title": "Marcelo Ebrard | AP News",
    "url": "https://apnews.com/hub/marcelo-ebrard",
    "snippet": "Copyright 2025 The Associated Press. All Rights Reserved",
    "published": null
  },
  {
    "title": "Marcelo Ebrard - Sarkaritel.com Government News & Policy Updates",
    "url": "https://www.sarkaritel.com/tag/marcelo-ebrard/",
    "snippet": "December 11, 2025 · FacebookTwitterInstagramLinkedinYoutube · Primary Menu · Home · Marcelo Ebrard · InternationalNational NewsPhoto Gallery · News DeskSeptember 22, 2022 · September 22, 202211 · Mexico formally proposed on Thursday the creation of a peace committee with Prime Minister Narendra Modi to find an end to Russia’s invasion of Ukraine....",
    "published": null
  }
]