[
  {
    "title": "Tele2 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tele2",
    "snippet": "Tele2 AB is <strong>a provider of mobile and fixed connectivity, telephony, data network services, TV, streaming and global Internet of things services, to consumers and enterprises</strong>. It is headquartered in Kista Science City, Stockholm, Sweden. It is a major mobile network operator in Sweden, Estonia, ...",
    "published": "November 2, 2025"
  },
  {
    "title": "Home - Tele2",
    "url": "https://www.tele2.com/",
    "snippet": "Tele2’s vision is to be the smartest telco in the world, enabling a society of unlimited possibilities. We enable the transformation of businesses and the creation of tomorrow’s infrastructure. Connecting people and technology far and wide, as well as right here around us.",
    "published": null
  },
  {
    "title": "About - Tele2",
    "url": "https://www.tele2.com/about/",
    "snippet": "Tele2’s vision is to be the smartest telco in the world, enabling a society of unlimited possibilities. We enable the transformation of businesses and the creation of tomorrow’s infrastructure. Connecting people and technology far and wide, as well as right here around us.",
    "published": null
  },
  {
    "title": "Tele2 - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/tele2",
    "snippet": "Tele2 <strong>offers mobile services, fixed broadband and telephony, data network services, cable TV, and content services</strong>. Since Jan Stenbeck founded the company in 1993, it has been a formidable challenger to the former government",
    "published": null
  },
  {
    "title": "Tele2 AB Company Profile - Overview - GlobalData",
    "url": "https://www.globaldata.com/company-profile/tele2-ab/",
    "snippet": "It <strong>provides connectivity and entertainment services to residential consumers and tailored solutions for private and public organizations</strong>. Tele2 offers national and international wholesale services, carrier services, and SMS services. The company also offers base stations, handsets, sim cards, ...",
    "published": null
  }
]