[
  {
    "title": "Marc Grossman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marc_Grossman",
    "snippet": "Grossman served as Assistant Secretary of State for European Affairs from 1997 to 2000 and was <strong>responsible for over 4,000 State Department employees posted in 50 sites abroad with a program budget of $1.2 billion</strong>. He played a lead role in orchestrating NATO&#x27;s 1999 Washington summit, marking ...",
    "published": "August 4, 2025"
  },
  {
    "title": "Marc Isaiah Grossman - People - Department History - Office of the Historian",
    "url": "https://history.state.gov/departmenthistory/people/grossman-marc-isaiah",
    "snippet": "Under Secretary of State for Political Affairs Appointed: March 23, 2001 Entry on Duty: March 26, 2001 Termination of Appointment: February 25, 2005",
    "published": null
  },
  {
    "title": "Marc Grossman",
    "url": "https://grokipedia.com/page/Marc_Grossman",
    "snippet": "Marc Grossman is regarded as a seasoned and pragmatic career diplomat, known for his roles in high-level U.S. foreign policy formulation and execution, including as <strong>Under Secretary of State for Political Affairs from 2001 to 2005</strong>.[5] His public ...",
    "published": null
  },
  {
    "title": "Ambassador Marc Grossman | Leadership, Diplomacy and National Security Lab",
    "url": "https://ldns.asu.edu/about/ambassador-marc-grossman",
    "snippet": "Ambassador Marc Grossman served ... after 29 years in the US Foreign Service. As Under Secretary, he <strong>helped marshal diplomatic support for the international response to the attacks of September 11, 2001.</strong>...",
    "published": null
  },
  {
    "title": "Marc Grossman | The Cohen Group",
    "url": "https://www.cohengroup.net/who-we-are/team/marc-grossman",
    "snippet": "US Special Representative for Afghanistan and Pakistan (2011–2012) Under Secretary of State for Political Affairs (2001–2005) Assistant Secretary of State for European Affairs (1997–2000) US Ambassador to Turkey (1994–1997) Ambassador Grossman served as the Under Secretary of State for Political Affairs, the State Department&#x27;s third ranking official, until his retirement in 2005, after 29 years in the US Foreign Service.",
    "published": "January 29, 2025"
  }
]