[
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "On 19 May 2023, <strong>Sven Mislintat took over as Ajax&#x27;s sports director</strong>. He succeeded Marc Overmars, who left in early 2022. Mislintat appointed Maurice Steijn as head coach. Mislintat spent approximately 111 million euros on transfers. Ajax had its worst start to the season in fifty-nine years.",
    "published": "2 weeks ago"
  },
  {
    "title": "Francesco Farioli new Ajax head coach",
    "url": "https://english.ajax.nl/articles/francesco-farioli-new-ajax-head-coach/",
    "snippet": "He worked at OGC Nice, Fatih ... (youth) teams in Spain, Turkey, Qatar and Ecuador. <strong>Dave Vos will also be added to the first team&#x27;s staff as an assistant coach</strong>. Vos (Amstelveen, April 24, 1983) has been the head coach ...",
    "published": null
  },
  {
    "title": "Ajax appoint Francesco Farioli as new head coach - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/40202239/ajax-new-manager-francesco-farioli-head-coach-nice",
    "snippet": "Liverpool are on course to be worst-ever Premier League defending champions. Can Slot stop the rot? ... Ajax confirmed the appointment of <strong>Francesco Farioli</strong> as their new head coach on a three-year contract on Thursday.",
    "published": "May 23, 2024"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "Ajax has reached an agreement with Liverpool and John Heitinga regarding the coach’s move to Amsterdam. <strong>Marcel Keizer will be his assistant</strong>.",
    "published": null
  },
  {
    "title": "Ajax appoint Van't Schip as new manager | Reuters",
    "url": "https://www.reuters.com/sports/soccer/ajax-appoint-vant-schip-new-manager-2023-10-30/",
    "snippet": "Ajax Amsterdam have appointed <strong>John van&#x27;t Schip as interim head coach</strong>, a week after they parted ways with Maurice Steijn, the Eredivisie club announced on Monday.",
    "published": "October 30, 2023"
  }
]