[
  {
    "title": "Aníbal Fernández - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "Aníbal Domingo Fernández (born January 9, 1957) is an Argentine politician, public accountant and lawyer affiliated and militant of the Justicialist Party, <strong>Since 2021 to 2023, he has served as Argentina&#x27;s Minister of Security, in the cabinet of Alberto Fernández</strong>.",
    "published": "August 13, 2025"
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "He has been a close supporter of former Presidents Néstor Kirchner and Cristina Fernández de Kirchner. <strong>From 2021 to 2023, he served as Argentina&#x27;s Minister of Security under President Alberto Fernández</strong>.",
    "published": null
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "During Kirchner’s government he was named minister of interior in 2003 and in 2007, and during Cristina Fernandez’s government, he was assigned as minister of justice, security and human rights. Fernández received a degree in public accounting from Universidad Nacional de Lomas and later graduated as a lawyer from the same institution. Aníbal Fernández es candidato a gobernador de la Provincia de Buenos Aires y actualmente jefe de Gabinete de Ministros de la presidencia de la República Argentina.",
    "published": null
  },
  {
    "title": "Embassy to the European Union | The Minister Aníbal Fernández, along with a delegation from the Ministry of Security, visited Brussels to strengthen cooperation with the EU in the fight against organized crime",
    "url": "https://eceur.cancilleria.gob.ar/en/minister-an%C3%ADbal-fern%C3%A1ndez-along-delegation-ministry-security-visited-brussels-strengthen-cooperation",
    "snippet": "Brussels, 29th September 2023 - <strong>The Minister of Security of the Republic of Argentina</strong>, Aníbal Fernández, led a delegation composed of Mrs.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q2857937",
    "snippet": "Aníbal Fernández, <strong>nuevo abogado de Cristóbal López</strong>: lo defenderá en las causas civiles (Spanish) position held · Minister of Security · start time · 20 September 2021 · replaces · Sabina Frederic · end time · 10 December 2023 · ...",
    "published": null
  }
]