[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "At the 2023 FIFA Women&#x27;s World ... BBC Sports Personality of the Year Award. She previously played for WSL clubs <strong>Manchester United, Bristol Academy, Birmingham City, Doncaster Belles, and Reading</strong>, and in the Bundesliga with VfL Wolfsburg....",
    "published": "1 month ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "Before arriving at Manchester United, Earps spent time playing for hometown club <strong>Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg</strong>. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in ...",
    "published": null
  },
  {
    "title": "Who is Mary Earps? Everything you need to know about the England goalkeeper",
    "url": "https://www.fourfourtwo.com/features/mary-earps-everything-you-need-to-know",
    "snippet": "During Earps&#x27; youth career she played for <strong>West Bridgford Colts, Tottenham and Leicester City</strong>. She started playing regular first team football in the 2009/10 season with Leicester and she signed for Nottingham Forest the following season.",
    "published": "October 18, 2024"
  },
  {
    "title": "Mary Earps left Manchester United to become a better player at PSG, England goalkeeper tells Pitch to Pod | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13340388/mary-earps-left-manchester-united-to-become-a-better-player-at-psg-england-goalkeeper-tells-pitch-to-pod",
    "snippet": "England and Paris Saint-Germain goalkeeper Mary Earps has admitted it was a difficult decision to leave <strong>Manchester United</strong> but says she was determined to push herself out of her comfort zone in order to become a better player.",
    "published": "April 4, 2025"
  },
  {
    "title": "Mary Earps | Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/womens-team/squad/mary-earps",
    "snippet": "Born in Nottingham, England, the goalkeeper played first for <strong>West Bridgeford Colts</strong> before joining Leicester City FC’s youth academy. After reaching the first team squad, she then joined Nottingham Forest in 2010 aged just 17.",
    "published": null
  }
]