[
  {
    "title": "Scott Morrison swept away by political tide as Anthony Albanese fights to fireproof 2023 | Australian politics | The Guardian",
    "url": "https://www.theguardian.com/culture/2022/dec/19/scott-morrison-swept-away-by-political-tide-as-anthony-albanese-fights-to-fireproof-2023",
    "snippet": "Supported by the foreign affairs minister, Penny Wong, Albanese began to track towards a reset of the China relationship, which culminated in a face-to-face meeting with Xi Jinping in Bali in November. ... Opposition leader Peter Dutton addresses the joint party room in Parliament House in early August. Photograph: Mike Bowers/The Guardian · While Labor forged ahead, the Coalition regrouped, appointing Peter Dutton as leader, but Morrison cast a long shadow over the redux.",
    "published": "December 19, 2022"
  },
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "After Labor&#x27;s surprise defeat in the 2019 election, Shorten resigned as leader, with Albanese becoming the only person nominated in the leadership election to replace him; he was subsequently elected unopposed as leader of the Labor Party, becoming Leader of the Opposition. He led the party to the 2022 election, where it was victorious over Scott Morrison&#x27;s Liberal–National Coalition.",
    "published": "20 hours ago"
  },
  {
    "title": "Morrison government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Morrison_government",
    "snippet": "After the majority of votes had been counted on election night, it became clear that the Coalition had no path to forming government. Morrison conceded the election, also announcing he would step down as leader of the Liberal Party. <strong>Labor leader Anthony Albanese was sworn in as the 31st Prime</strong> ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Australian PM accuses predecessor Scott Morrison of \"trashing our democracy\" with secret roles",
    "url": "https://www.axios.com/2022/08/16/australia-scott-morrison-secret-roles-albanese",
    "snippet": "Australian Prime Minister Anthony Albanese accused predecessor Scott Morrison Tuesday of &quot;an extraordinary and unprecedented trashing of our democracy&quot; after it emerged <strong>the former leader quietly took on extra ministerial powers</strong>.",
    "published": "August 16, 2022"
  },
  {
    "title": "That was Scott Morrison, but this is Anthony Albanese: The ALP's curious history with transparency",
    "url": "https://www.crikey.com.au/2025/10/31/anthony-albanese-scott-morrison-labor-transparency-record/",
    "snippet": "Is Anthony Albanese any better than Scott Morrison when it comes to transparency? Crikey takes a look at Labor&#x27;s recent record.",
    "published": "October 31, 2025"
  }
]