[
  {
    "title": "Little Caesars Arena - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Little_Caesars_Arena",
    "snippet": "On November 22, 2016, the Pistons officially announced that they would move to <strong>Little Caesars Arena</strong> starting with the 2017–18 season. On June 20, 2017, Detroit City Council approved the Pistons&#x27; move to <strong>Little Caesars Arena</strong>. On August 3, 2017, the NBA Board of Governors unanimously approved ...",
    "published": "2 days ago"
  },
  {
    "title": "Detroit Pistons - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Detroit_Pistons",
    "snippet": "The Detroit Pistons are an American professional basketball team based in Detroit. The Pistons compete in the National Basketball Association (NBA) as a member of the Central Division of the Eastern Conference. The team plays its home games at <strong>Little Caesars Arena</strong>, located in Midtown Detroit.",
    "published": "2 weeks ago"
  },
  {
    "title": "Where Do The Detroit Pistons Play?",
    "url": "https://www.elitesportstours.ca/where-do-the-detroit-pistons-play-basketball",
    "snippet": "Where Do The Detroit Pistons Play? <strong>Little Caesars Arena</strong> is a multi-purpose arena in Midtown Detroit, MI.",
    "published": null
  },
  {
    "title": "Official Little Caesars Arena Tickets & Venue Information | 313 Presents",
    "url": "https://www.313presents.com/venue/little-caesars-arena",
    "snippet": "Experience the thrill of live events at <strong>Little Caesars Arena</strong> in The District Detroit. Home to the Detroit Red Wings and Detroit Pistons, <strong>Little Caesars Arena</strong> hosts an array of sporting events, concerts, comedians and family shows.",
    "published": null
  },
  {
    "title": "Little Caesars Arena - Facilities - Detroit Sports Commission",
    "url": "https://detroitsports.org/facilities/little-caesars-arena/56",
    "snippet": "2645 Woodward Ave, Detroit, MI 48201 313-471-7000 <strong>Little Caesars Arena</strong> was designed to be the flagship of the new sports and entertainment district, The District Detroit. <strong>Little Caesars Arena</strong> in The District Detroit serves as the home of the Detroit Red Wings, Detroit Pistons, and countless ...",
    "published": null
  }
]