[
  {
    "title": "The merger between Tele2 and Com Hem is completed - Tele2",
    "url": "https://www.tele2.com/media/news/2018/the-merger-between-tele2-and-com-hem-is-completed/",
    "snippet": "The merger between Tele2 and Com Hem Holding is thereby completed and <strong>Com Hem Holding has been dissolved</strong>. SCRO’s registration of the merger completes the merger process from a legal perspective and all of Com Hem Holding’s assets and liabilities ...",
    "published": null
  },
  {
    "title": "Tele2 and Com Hem combining to create leading integrated connectivity provider - Tele2",
    "url": "https://www.tele2.com/media/news/2018/tele2-and-com-hem-combining-to-create-leading-integrated-connectivity-provider/",
    "snippet": "The completion of the Merger is subject to, inter alia, approval by the shareholders of each of Tele2 and Com Hem at their respective Extraordinary General Meetings (each, an “EGM”), which are currently expected to be held in H2 2018 as well as approval from the relevant competition authorities · Tele2’s and Com Hem’s largest shareholder[3], Kinnevik AB (publ) (“Kinnevik”), has undertaken to vote in favor of the Merger at the respective EGMs and not to sell any shares in Tele2 or Com Hem (or in the Enlarged Tele2) up until six months after completion of the Merger, subject to customary conditions.",
    "published": null
  },
  {
    "title": "Tele2 and Com Hem merger - Tele2",
    "url": "https://www.tele2.com/investors/tele2-and-com-hem-merger",
    "snippet": "The merger between Tele2 and Com Hem was completed on 5 November 2018. <strong>Com Hem Holding was dissolved and all of its assets and liabilities were transferred to Tele2.</strong>",
    "published": null
  },
  {
    "title": "The European Commission has approved the merger of Tele2 and Com Hem - Tele2",
    "url": "https://www.tele2.com/media/news/2018/the-european-commission-has-approved-the-merger-of-tele2-and-com-hem",
    "snippet": "<strong>The merger between Tele2 and Com Hem will be completed when the Swedish Companies Registration Office registers the merger and Com Hem is dissolved</strong>. In practice, the integration of the two companies will then be realized in several steps, concerning both commercial offerings, internal organization ...",
    "published": null
  },
  {
    "title": "News in brief: Com Hem becomes Tele2 - CSI Magazine",
    "url": "https://www.csimagazine.com/csi/news-in-brief-27-04-21.php",
    "snippet": "• Swedish cable operator <strong>Com Hem will now be part of the Tele2 brand</strong> as the companies converge their brand. From today, the firm’s entire portfolio of mobile, fixed line and pay-TV services can be accessed under the Tele2 name.",
    "published": null
  }
]