[
  {
    "title": "How Lamine Diack's 16-year reign in charge of IAAF led to a jail term | Lamine Diack | The Guardian",
    "url": "https://www.theguardian.com/sport/2020/sep/16/how-lamine-diacks-16-year-reign-in-charge-of-iaaf-led-to-a-jail-term",
    "snippet": "Diack’s <strong>corruption, covering up Russian doping cases for bribes</strong>, was discovered after police raided a Paris hotel ... The unmasking of Lamine Diack as one of the great sinners in the history of sport began with a police raid on All Saints’ ...",
    "published": "September 17, 2020"
  },
  {
    "title": "Lamine Diack - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lamine_Diack",
    "snippet": "In 2016, the World Anti-Doping Agency reported that with his influence, Diack was able to install two of his sons and a friend into positions that exerted influence over the IAAF. The report says that Lamine Diack &quot;was responsible for organizing and enabling the conspiracy and corruption that took place in the IAAF.&quot;",
    "published": "October 18, 2025"
  },
  {
    "title": "Lamine Diack - latest news, breaking stories and comment - The Independent",
    "url": "https://www.the-independent.com/topic/lamine-diack",
    "snippet": "The latest breaking news, comment and features from The Independent.",
    "published": null
  },
  {
    "title": "Lamine Diack found guilty of corruption and sentenced to two years in prison | Lamine Diack | The Guardian",
    "url": "https://www.theguardian.com/sport/2020/sep/16/lamine-diack-former-world-athletics-president-found-guilty-of-corruption-and-sentenced-to-two-years-in-prison",
    "snippet": "The former IAAF president Lamine Diack and other senior athletics figures have been found guilty in France of corruption, including <strong>accepting bribes to help Russians cover up doping results</strong>",
    "published": "September 17, 2020"
  },
  {
    "title": "Lamine Diack: Disgraced athletics boss dies in Senegal - BBC Sport",
    "url": "https://www.bbc.com/sport/africa/59517712",
    "snippet": "Senegal&#x27;s former World Athletics president Lamine Diack during his corruption trial in France in 2020",
    "published": "December 3, 2021"
  }
]