[
  {
    "title": "Josh Harris Announces Acquisition of Washington Commanders",
    "url": "https://www.commanders.com/news/josh-harris-announces-acquisition-of-washington-commanders",
    "snippet": "A partnership led by <strong>Josh Harris</strong> announced the closing of their acquisition of the Washington Commanders on Friday, July 21st.",
    "published": null
  },
  {
    "title": "Controlling owner Josh Harris says Washington Commanders name is not changing",
    "url": "https://www.nfl.com/news/controlling-owner-josh-harris-says-washington-commanders-name-is-not-changing",
    "snippet": "2025 NFL Draft burning questions: Which position should <strong>Travis Hunter</strong> play? Ashton Jeanty&#x27;s value? The Commanders reached the NFC Championship Game in quarterback Jayden Daniels&#x27; rookie year, exceeding expectations in general manager Adam Peters ...",
    "published": null
  },
  {
    "title": "Who Is Josh Harris, the Washington Commanders’ Owner? - Yahoo Sports",
    "url": "https://sports.yahoo.com/josh-harris-washington-commanders-owner-140000514.html",
    "snippet": "<strong>Josh Harris</strong>—owner of the NBA’s Philadelphia 76ers, NHL’s New Jersey Devils and NFL’s Washington Commanders—entered 2025 with a bang. On Sunday, Jan. 12, news broke that the 76ers will partner with Comcast to build a venue in the South ...",
    "published": "January 15, 2025"
  },
  {
    "title": "Who Is Josh Harris, the Washington Commanders’ Owner?",
    "url": "https://www.sportico.com/feature/josh-harris-washington-commanders-owner-1234744099/",
    "snippet": "In purchasing the Commanders for an NFL record $6 billion, <strong>Harris teamed up with Blitzer, local billionaire Mitchell Rales and Los Angeles Lakers legend Magic Johnson</strong>. Harris’ ownership group also includes Washington Open chairman Mark Ein, ...",
    "published": "January 17, 2025"
  },
  {
    "title": "Washington Commanders Ownership Group",
    "url": "https://www.commanders.com/team/front-office-roster/ownership-group",
    "snippet": "Learn more about the Washington Commanders ownership group.",
    "published": null
  }
]