[
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "In 2021, he was appointed as <strong>Minister of Security</strong>. This happened as part of changes in the government after the 2021 legislative primary elections. He served in this role until December 2023.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "Following the infant malnutrition scandal in Tucumán in November 2002, Fernández famously stated that this was caused by &quot;a sick society and a ruling class that are sons of bitches, all of them.&quot; He was believed to be planning to run for Governor of Buenos Aires Province in the 2007 elections, but his party (Front for Victory) chose Daniel Scioli instead. Newly elected President Cristina Kirchner appointed him to her cabinet as Minister of Justice, Security and Human Rights following her inauguration in December 2007.",
    "published": "November 15, 2025"
  },
  {
    "title": "Buenos Aires Times | Aníbal Fernández: ‘I understand and share the president’s view on re-election’",
    "url": "https://www.batimes.com.ar/news/argentina/anibal-fernandez-there-will-be-a-guarantee-of-everybody-being-able-to-compete-so-that-there-are-no-complications.phtml",
    "snippet": "He did not do this driven by adversity ... what he believes and what he did. Now <strong>he must serve out his term until December 10 having resolved most things within the margin of his possibilities</strong>....",
    "published": "April 28, 2023"
  },
  {
    "title": "Aníbal Fernández (@anibaldomingofernandez) • Instagram photos and videos",
    "url": "https://www.instagram.com/anibaldomingofernandez/",
    "snippet": "233K Followers, 152 Following, 1,978 Posts - Aníbal Fernández (@anibaldomingofernandez) on Instagram: &quot;Peronista, abogado y contador. Ricotero, hincha de Quilmes. Presidente de la CAHockey s/césped. Trabajando para recuperar el peronismo&quot;",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/anibal-fernandez/profil/trainer/22238",
    "snippet": "This is the profile site of the manager Aníbal Fernández. The site lists all clubs he coached and all clubs he played for.",
    "published": null
  }
]