[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Many professional wrestling personalities have entered politics, but Ventura is among the few, including Jim Barnett and Antonio Inoki, to have remained active in wrestling while serving in a government role: he was simultaneously mayor and WCW&#x27;s color commentator through much of his mayoral tenure. Ventura ran for governor of Minnesota in 1998 as the Reform Party of Minnesota nominee (he later joined the Independence Party of Minnesota when the Reform Party broke from its association with the Reform Party of the United States of America).",
    "published": "3 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Ventura left office on January 6, 2003. Ventura (<strong>Green Party of Alaska, Unaffiliated</strong>) ran for election for President of the United States. Ventura (Green Party of Alaska) lost in the general election on November 3, 2020. ... Ventura ran for governor of Minnesota in 1998.",
    "published": null
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th Governor of Minnesota on November 3, 1998 defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He served as Governor for one term. Shocking the political establishment, Ventura became the only <strong>Reform Party</strong> candidate to ...",
    "published": null
  },
  {
    "title": "Jesse Ventura | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/jesse-ventura",
    "snippet": "During the 1990s, Ventura became increasingly involved in state politics. He joined the <strong>Minnesota Independence Party</strong> (later affiliated with H. Ross Perot as the Minnesota Reform Party) and supported MIP candidate Dean Barkley for the US Senate.",
    "published": null
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "His first foray into politics was as mayor of Brooklyn Park (1991–95). In the late 1990s he worked as a radio shock jock. ... In 1998 Ventura ran for governor of Minnesota as the <strong>Reform Party</strong> candidate.",
    "published": "January 14, 2009"
  }
]