[
  {
    "title": "Ca",
    "url": "https://nrm.dfg.ca.gov/FileHandler.ashx?DocumentID=35774",
    "snippet": "CALIFORNIA DEPARTMENT OF FISH AND WILDLIFE EXECUTIVE OVERVIEW 11/19/2025 · <strong>Admin: Administration, (A): Acting, Asst.: Assistant, Consrvtn: Conservation, Dep: Deputy, Dir: Director, Div: Division</strong>",
    "published": null
  },
  {
    "title": "Leadership and social cohesion: DFG approves new Centre for Advanced Studies in the Humanities and Social Sciences",
    "url": "https://idw-online.de/en/news863397",
    "snippet": "When it comes to strengthening cohesion, leaders play a special role: this is the fundamental thinking behind the interdisciplinary Centre for Advanced Studies in the Humanities and Social Sciences approved today by the DFG. The “Goethe Leadership Centre”, whose foundations lie in psychology and economics, will conduct research on this topic for an initial four years.",
    "published": null
  },
  {
    "title": "Leadership-Forum 2025 - Gemeinsam für Graubünden",
    "url": "https://www.gr.ch/DE/institutionen/verwaltung/dfg/pa/mitteilungen/Seiten/leadershipforum-2025_18062025.aspx",
    "snippet": "Nach der offiziellen Eröffnung durch Regierungspräsident Marcus Caduff eröffnete <strong>Marco Blumenthal, Leiter des Personalamts, den ersten Tag mit einer Einführung in die übergeordnete HR-Strategie und die Vision «Gemeinsam für Graubünden».</strong>",
    "published": "June 23, 2025"
  },
  {
    "title": "German Research Foundation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/German_Research_Foundation",
    "snippet": "The Heisenberg Programme of the DFG is aimed at young outstanding scientists who meet all the requirements for appointment to a permanent professorship. The programme was named after the German physicist Werner Heisenberg, who received the Nobel Prize in Physics at the age of 31. The funding programme aims to enable scientists to prepare for a scientific leadership position and to work on further research topics during this time.",
    "published": "October 2, 2025"
  },
  {
    "title": "September 2025 General Authority Chart | PDF | Latter Day Saint Movement | The Church Of Jesus Christ Of Latter Day Saints",
    "url": "https://www.scribd.com/document/930517283/September-2025-General-Authority-Chart",
    "snippet": "The document outlines the leadership structure of The Church of Jesus Christ of Latter-day Saints as of September 2025, following the death of President Russell M. Nelson, which led to the dissolution of the First Presidency. The current members of the Quorum of the Twelve Apostles and various general authorities, including the Presidency of the Seventy and the Presiding Bishopric, are listed.",
    "published": null
  }
]