[
  {
    "title": "German Research Foundation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/German_Research_Foundation",
    "snippet": "Even before the election of the National Socialist German Workers&#x27; Party (Nazi party) to power in 1933, projects funded by the NG had worked diligently on Nazi-aligned research, especially German ethnographic research in Eastern Europe that would lay the foundations for the Hitlerite &quot;Lebensraum&quot; and extermination policies; during the National Socialist period, the NG leadership showed itself ready and willing to adapt to the &quot;new era&quot; by gearing its funding practices towards issues related to German rearmament and autarky, essentially aligning its goals with those of the new regime.",
    "published": "October 2, 2025"
  },
  {
    "title": "DFG, German Research Foundation - What is the DFG?",
    "url": "https://www.dfg.de/en/about-us/about-the-dfg/what-is-the-dfg",
    "snippet": "relies on the voluntary work of thousands of researchers in Germany and abroad. This video introduces the DFG: its structure and membership, its philosophy, its tasks and objectives, and how it operates.",
    "published": null
  },
  {
    "title": "DFG - German Research Foundation",
    "url": "https://www.dfg.de/en",
    "snippet": "The political breakthrough achieved in the negotiations strengthens Europe as a research hub and opens up new pathways towards climate-resilient and resource-efficient agriculture, says DFG President <strong>Katja Becker</strong>.",
    "published": null
  },
  {
    "title": "KIT - KIT - People - German Research Foundation (DFG)",
    "url": "https://www.kit.edu/kit/english/10633.php",
    "snippet": "The German Research Foundation (Deutsche Forschungsgemeinschaft, DFG) is the self-governing organisation for the funding and promotion of science and research in Germany. The DFG receives the large majority of its funds from the federal government and the states.",
    "published": null
  },
  {
    "title": "German Research Foundation (DFG) | Strategic Partnership for Health Security and Emergency Preparedness (SPH) Portal",
    "url": "https://extranet.who.int/sph/german-research-foundation-dfg",
    "snippet": "Individuals or higher education institutions submit proposals in a particular field of curiosity-driven basic research that they themselves select. Interdisciplinary proposals are also considered. In a multi-layered decision-making process, the proposal is evaluated by voluntary reviewers exclusively according to scientific criteria; on the basis of this expert review, it is assessed by elected members of a review board, and the final decision is made by a grants committee. In this way, DFG funding guarantees quality-based differentiation in the German research system.",
    "published": null
  }
]