[
  {
    "title": "Jennifer Westacott - Public and Proud - Business Council of Australia",
    "url": "https://www.bca.com.au/jennifer_westacott_public_and_proud",
    "snippet": "Among the many important posts she has held Jennifer was the Director of Housing and the Secretary of Education in Victoria. Currently Jennifer is <strong>Chief Executive</strong> of the Business Council of Australia, the leading forum for the heads of Australia’s ...",
    "published": null
  },
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "Jennifer was <strong>Chief Executive</strong> of the Business Council of Australia, the leading forum for the heads of over 100 of Australia&#x27;s top companies to contribute to public policy debate, from February 2011 until October 2023. Prior to that, she was a board director and lead partner at KPMG, heading ...",
    "published": null
  },
  {
    "title": "Jennifer Westacott AC - Non-executive Member – Governance Board | RBA",
    "url": "https://www.rba.gov.au/about-rba/boards/governance-board/jennifer-westacott.html",
    "snippet": "Jennifer Westacott AC has more than three decades experience across the public and private sectors and was the <strong>Chief Executive of the Business Council of Australia for over a decade</strong>.",
    "published": null
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "Jennifer Westacott has been <strong>Chief Executive of the Business Council of Australia since 2011</strong>, bringing extensive policy experience in both the public and private sectors.",
    "published": null
  },
  {
    "title": "Statement on Jennifer Westacott’s recognition in today’s honours - Business Council of Australia",
    "url": "https://www.bca.com.au/statement_on_jennifer_westacott_s_recognition_in_today_s_honours",
    "snippet": "The Business Council of Australia, its board and members applaud the recognition of Jennifer Westacott in today’s Order of Australia honours.",
    "published": null
  }
]