[
  {
    "title": "President of Ethiopia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ethiopia",
    "snippet": "The president of Ethiopia is the head of state of Ethiopia. The position is largely ceremonial with executive power vested in the Council of Ministers chaired by the prime minister. The current president is <strong>Taye Atske Selassie</strong>, who took office on 7 October 2024.",
    "published": "3 weeks ago"
  },
  {
    "title": "List of presidents of Ethiopia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ethiopia",
    "snippet": "The current president is <strong>Taye Atske Selassie</strong>, elected on 7 October 2024 by members of the Federal Parliamentary Assembly. In the list, the chairmen of the Derg are considered to be heads of state – but are not considered to be president.",
    "published": "October 22, 2025"
  },
  {
    "title": "Chairperson Welcomes Appointment of New President of the Federal Democratic Republic of Ethiopia, Commends Tenure of Former President Zewde | African Union",
    "url": "https://au.int/en/pressreleases/20241007/chairperson-welcomes-appointment-new-president-ethiopia",
    "snippet": "The Chairperson of the African Union Commission, H.E Moussa Faki Mahamat warmly congratulates <strong>H.E Taye Atske-Selassie</strong> upon his appointment as President of the Federal Democratic Republic of Ethiopia during a joint sitting of the House of Peoples Representatives and the House of Federation today ...",
    "published": null
  },
  {
    "title": "Taye Atske Selassie sworn in as president of Ethiopia",
    "url": "https://www.aa.com.tr/en/africa/taye-atske-selassie-sworn-in-as-president-of-ethiopia/3354408",
    "snippet": "In a surprising move, Ethiopia&#x27;s two houses of parliament elected <strong>Taye Atske Selassie</strong> as president on Monday, succeeding the country&#x27;s first woman head of state, Sahle-Work Zewde, who hinted at his resignation in a social media post just two ...",
    "published": null
  },
  {
    "title": "Ethiopia chooses Taye Atske Selassie as new president",
    "url": "https://www.theafricareport.com/363993/ethiopia-chooses-taye-atske-selassie-as-new-president/",
    "snippet": "Ethiopian lawmakers select Foreign Minister <strong>Taye Atske Selassie</strong> as the country’s new president – a largely ceremonial role – leaving Africa with only one female head of state.",
    "published": "October 8, 2024"
  }
]