[
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "Juventus Football Club announces that it has today relieved Igor Tudor of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of <strong>Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci</strong>.",
    "published": null
  },
  {
    "title": "Breaking: Juventus Announce New Manager Until 2026 After Sacking Igor Tudor",
    "url": "https://www.si.com/soccer/juventus/onsi/breaking-juventus-announce-new-manager-2026-sacking-igor-tudor",
    "snippet": "Serie A Como 1907 - Juventus Fc Players pose for a team photo prior to the Serie A match at Stadio Giuseppe Sinigaglia / IMAGO / Marco Canoniero · After sacking Igor Tudor last Monday, Juventus had <strong>Massimo Brambilla</strong> serving as interim coach ...",
    "published": "October 29, 2025"
  },
  {
    "title": "Ex-Napoli, Italy manager Spalletti named new Juventus boss - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/46781628/ex-napoli-italy-manager-spalletti-juventus-deal",
    "snippet": "Former Napoli and Italy coach <strong>Luciano Spalletti</strong> was confirmed as Juventus&#x27; new head coach on Thursday, replacing the fired Igor Tudor.",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus appoint Luciano Spalletti as new head coach - The Athletic",
    "url": "https://www.nytimes.com/athletic/6753980/2025/10/29/spalletti-juventus-head-coach-new/",
    "snippet": "Juventus have appointed <strong>Luciano Spalletti</strong> as their new head coach. The Italian has signed an eight-month deal until the end of the season with an option to extend conditional on qualification for the Champions League.",
    "published": "October 30, 2025"
  },
  {
    "title": "Thiago Motta no longer First Team coach, Igor Tudor takes over - Juventus",
    "url": "https://www.juventus.com/en/news/articles/thiago-motta-no-longer-first-team-coach-igor-tudor-takes-over-as-first-team-coach",
    "snippet": "Juventus FC announce that <strong>Thiago Motta</strong> has been relieved of his duties as Men’s First Team coach. The club would like to thank <strong>Thiago Motta</strong> and all of his staff for their professionalism and for the work they have carried out in recent months ...",
    "published": null
  }
]