[
  {
    "title": "Lamine Diack becomes first president of the International Association of Athletics Federations | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/lamine-diack-becomes-first-president-of-the-i",
    "snippet": "<strong>1 August 2001 – Edmonton, Canada – An overwhelming majority of IAAF Congress delegates has elected Lamine Diack President of the International Association of Athletics Federations</strong>. 168 delegates voted for with just 1 delegate against.",
    "published": null
  },
  {
    "title": "Disgraced former world athletics chief Lamine Diack dies aged 88 | Lamine Diack | The Guardian",
    "url": "https://www.theguardian.com/sport/2021/dec/03/disgraced-world-athletics-chief-lamine-diack-dies-aged-88",
    "snippet": "How Lamine Diack&#x27;s 16-year reign in charge of IAAF led to a jail term ... The news of Diack’s demise was confirmed by his son, Papa Massata Diack, who said: “He died at home around 2am of a natural death.”",
    "published": "November 8, 2024"
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "Diack was <strong>elected to the IAAF Council at the 30th IAAF Congress in 1976</strong>, held in the Canadian city of Montreal, and became Senior Vice-President of the organisation in 1991. Upon the death of the fourth IAAF President Primo Nebiolo on November ...",
    "published": null
  },
  {
    "title": "Lamine Diack: Former World Athletics president sentenced to prison in France over corruption | The Independent",
    "url": "https://www.the-independent.com/sport/general/athletics/lamine-diack-former-world-athletics-president-sentenced-to-prison-in-france-over-corruption-b454424.html",
    "snippet": "As head of the International Association of Athletics Federation <strong>between 1999 and 2015,</strong> it is believed that Diack took payments of more than €3m to cover up cheating",
    "published": "September 16, 2020"
  },
  {
    "title": "Lamine Diack - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lamine_Diack",
    "snippet": "He was <strong>president of the International Association of Athletics Federations (IAAF) from 1999 to 2015.</strong> He was the subject of numerous investigations into corruption during his tenure ...",
    "published": "October 18, 2025"
  }
]