[
  {
    "title": "Brooklands Museum :: Brooklands Stories: Sir Thomas Sopwith",
    "url": "https://www.brooklandsmuseum.com/discover/our-history/brooklands-stories/brooklands-stories-sir-thomas-sopwith/",
    "snippet": "In 1941 the Group had developed ... against the enemy’s very fast V1 “Doodlebug” flying bombs. Thomas Sopwith was <strong>knighted for his services to British aviation in 1953</strong>....",
    "published": null
  },
  {
    "title": "Thomas Octave Murdoch Sopwith | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/thomas-octave-murdoch-sopwith",
    "snippet": "The Armistice brought a depression, and peacetime offered no compensating uses of aircraft. <strong>He paid off creditors and liquidated the Sopwith company</strong>. He started a new small company building motorcycles under the Hawker name, after pilot Harry G.",
    "published": null
  },
  {
    "title": "Sir Thomas Sopwith: exploring the life of the aviation pioneer | Great British Life",
    "url": "https://www.greatbritishlife.co.uk/magazines/hampshire/23259947.sir-thomas-sopwith-exploring-life-aviation-pioneer/",
    "snippet": "Sopwith was <strong>chairman of the Hawker Siddeley Manufacturing Group from 1935 and its president from 1963</strong> and had a hand in legendary planes of both world wars as it was on his watch that the Hurricane, one of the fighters that helped turn the tide ...",
    "published": "January 18, 2023"
  },
  {
    "title": "History – Sopwith Aviation",
    "url": "https://sopwithaviation.com/history/",
    "snippet": "Upon the liquidation of the Sopwith company, Tom Sopwith himself, together with Harry Hawker, Fred Sigrist and Bill Eyre, immediately formed H.G. Hawker Engineering, forerunner of the Hawker Aircraft and Hawker Siddeley lineage. Sopwith was <strong>Chairman of Hawker Siddeley until his retirement</strong>.",
    "published": null
  },
  {
    "title": "Hawker Siddeley Group Public Limited Company | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/books/politics-and-business-magazines/hawker-siddeley-group-public-limited-company",
    "snippet": "Hawker Siddeley is still associated with the romance of the early days of aviation. <strong>Its founder</strong>, Tommy Sopwith, produced the famous Sopwith Camel that shot down Germany’s World War I flying ace, the Red Baron. In World War II the company produced the Hawker Hurricane, which played a crucial ...",
    "published": null
  }
]