[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The paper was founded with the 1897 merger of the Summit Beacon, first published in 1839, and the Akron Evening Journal, founded in 1896. In 1903, the Beacon Journal was purchased by <strong>Charles Landon Knight</strong>. His son John S. Knight inherited the paper, in 1933, on Charles&#x27; death.",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "The Akron paper was owned by <strong>the Knight family</strong> for nearly seven decades starting in 1907, and then the Knight Ridder company beginning in 1974. That company sold the Beacon Journal to McClatchy Co. in 2006, which sold it that same year to Black ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Those were the days in Rubber City … but they had to end – Plain Dealing: Cleveland Journalists Tell Their Stories",
    "url": "https://pressbooks.ulib.csuohio.edu/plain-dealing/chapter/stuart-warner-on-the-glory-days-of-the-akron-beacon-journal/",
    "snippet": "But perhaps the good intentions of the newspaper’s patriarch, John S. Knight, had indirectly created the monster that was devouring the Beacon. Akron was the first of Knight’s newspapers. He inherited it from <strong>his father, and then he and his brother James</strong> transformed his family’s hometown ...",
    "published": "July 31, 2018"
  },
  {
    "title": "Akron Beacon Journal/Ohio.com - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/akron-beacon-journal-ohio-com",
    "snippet": "The oldest continuously operated business in Summit County, the Akron Beacon Journal, founded in 1839, is the major news-gathering force in our community, and Ohio.com is the leading online source for breaking news, sports and entertainment in",
    "published": null
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media | Crain's Cleveland Business",
    "url": "https://www.crainscleveland.com/article/20180411/news/157966/akron-beacon-journal-sold-gatehouse-media",
    "snippet": "<strong>Black Press Group Ltd.</strong> sold the newspaper and its website, Ohio.com, to GateHouse for $16 million. The paper, a longtime Knight Ridder property, was sold to Black Press in 2006. GateHouse also owns the Columbus Dispatch, the Canton Repository ...",
    "published": "April 11, 2018"
  }
]