[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "As minister, Morrison changed indexation changes to the Family Tax Benefits payment. In April 2015, he announced the introduction of the &quot;No Jab, No Pay&quot; policy, which withholds family and childcare benefits from parents who do not vaccinate their children. His time as minister was criticised by his opposition counterpart Jenny Macklin, who said that &quot;Scott ...",
    "published": "6 days ago"
  },
  {
    "title": "Scott Morrison (b. 1960s) | WikiTree FREE Family Tree",
    "url": "https://www.wikitree.com/wiki/Morrison-17589",
    "snippet": "Is this your ancestor? Explore genealogy for Scott Morrison born 1960s including ancestors + more in the free family tree community.",
    "published": null
  },
  {
    "title": "Who is Scott Morrison? The Australian Prime Minister shares a rare and candid look inside his personal life",
    "url": "https://www.nowtolove.com.au/news/local-news/who-is-scott-morrison-50827/",
    "snippet": "Scott Morrison grew up in Sydney’s now upmarket beachside suburb of Bronte, where his family, <strong>parents John and Marion, and older brother Alan</strong>, lived with an aunt who was widowed at a young age.",
    "published": "February 4, 2024"
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "Morrison grew up in a <strong>devout Christian family</strong> in the beachside eastern suburbs of Sydney. His father was a police chief inspector and independent politician who served 16 years on the local council as well as a tenure as the mayor of Waverley.",
    "published": "August 30, 2018"
  },
  {
    "title": "Scott Morrison's Wife, Kids And Career: Everything You Need To Know",
    "url": "https://www.marieclaire.com.au/latest-news/scott-morrison-wife-kids-career/",
    "snippet": "Here, we look at Morrison’s life away from politics—from his wife and children, to his early career. ... Scott Morrison married <strong>Jenny Morrison (nee Warren)</strong> in 1990. The pair met at the young age of 12 on a day trip to Luna Park in Sydney.",
    "published": "November 2, 2023"
  }
]