[
  {
    "title": "Luciano Spalletti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Luciano_Spalletti",
    "snippet": "Luciano Spalletti (Italian pronunciation: [luˈtʃaːno spalˈletti]; born 7 March 1959) is an Italian football manager and former player who is the manager of Juventus. He started his managerial career with Empoli in 1993 before coaching clubs in Italy, including two spells with Roma, where he won two consecutive Coppa Italia titles.",
    "published": "3 days ago"
  },
  {
    "title": "List of Juventus FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Juventus_FC_managers",
    "snippet": "Juventus Football Club is an Italian professional association football club based in Turin, Piedmont, who currently play in the Serie A. They have played at their current home ground, Juventus Stadium, since 2011. This chronological list comprises all those who have held the position of manager ...",
    "published": "November 2, 2025"
  },
  {
    "title": "Juventus » Manager history",
    "url": "https://www.worldfootball.net/teams/juventus/9/",
    "snippet": "Juventus were held to a 1-1 draw by Sporting Lisbon on Tuesday as Luciano Spalletti&#x27;s new team failed to claim a first win in this season&#x27;s Champions League.... more » ... Juventus on Monday sacked coach <strong>Igor Tudor</strong> after the Serie A club&#x27;s ...",
    "published": null
  },
  {
    "title": "Juventus close to appointing manager - but there's one AWKWARD problem",
    "url": "https://www.dailymail.co.uk/sport/football/article-15238875/Juventus-close-appointing-known-new-manager.html",
    "snippet": "The Old Lady are set to appoint former Italy and Napoli boss Luciano Spalletti as their new manager · But there&#x27;s one very awkward problem - he has a tattoo of Napoli&#x27;s crest on his forearm · And, in another blow to Juventus supporters, while out of work earlier this year Spalletti claimed he would &#x27;never&#x27; manage another Italian side due to his allegiance to Napoli. Speaking at a conference, he said: &#x27;I wanted to save Napoli for last, for specific reasons. Of course, I could never have coached another team in Italy.",
    "published": "October 29, 2025"
  },
  {
    "title": "Juventus appoint Luciano Spalletti as manager until end of season - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cy7epp72ek0o",
    "snippet": "Juventus appoint former Italy head coach Luciano Spalletti as their manager until the end of the season.",
    "published": "October 30, 2025"
  }
]