[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Marcia Carolyn Kaptur (/ˈkæptər/ KAP-tər; born June 17, 1946) is an American politician serving as the U.S. representative for Ohio&#x27;s 9th congressional district since 1983. A member of the Democratic Party, Kaptur is the longest-serving woman in congressional history and the dean of Ohio&#x27;s congressional delegation since 2009 when Representative Ralph Regula retired.",
    "published": "1 week ago"
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "Marcy Kaptur, the Representative from Ohio - in Congress from 1983 through Present",
    "published": null
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "In 1981, while pursuing a doctorate in urban planning and development finance at MIT, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the 1982 recession to stage a nationally-recognized upset.",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "At the start of the session, ... held the majority in the U.S. Senate (51-49). Joe Biden (D) was the president and Kamala Harris (D) was the vice president. We identified the key votes below using Congress&#x27; top-viewed bills list and through marquee coverage of certain votes on Ballotpedia. ... The Hill, &quot;Dem Reps. Kaptur and Kucinich face off in primary under presidential shadow,&quot; March 6, ...",
    "published": null
  },
  {
    "title": "Rep. Marcy Kaptur [D-OH9, 1983-2026], Representative for Ohio's 9th Congressional District - GovTrack.us",
    "url": "https://www.govtrack.us/congress/members/marcy_kaptur/400211",
    "snippet": "Legislative Preview Dec. 15, 2025: Congress&#x27;s Last Week of Work of the Year » ... Kaptur is the representative for Ohio’s 9th congressional district (view map) and is a Democrat. She has served since Jan. 3, 1983. Kaptur is next up for reelection in 2026 and serves until Jan.",
    "published": null
  }
]