[
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "After working for 15 years as a city and regional planner, primarily in Toledo and Chicago, she accepted an appointment as a domestic policy advisor to President Jimmy Carter. During his Administration, she <strong>helped maneuver 17 housing and neighborhood revitalization bills through Congress</strong>.",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Afterwards, she joined the Carter administration as a domestic policy advisor on urban affairs and <strong>helped advance several housing and neighborhood revitalization bills through Congress</strong>. Following her time in Washington D.C., Kaptur went to Massachusetts to do graduate work.",
    "published": "1 week ago"
  },
  {
    "title": "The Honorable Marcy Kaptur (D-OH) Biography",
    "url": "https://www.congress.gov/115/meeting/house/108368/witnesses/HHRG-115-VR03-Bio-K000009-20180613.pdf",
    "snippet": "an appointment as a domestic policy advisor to President Jimmy Carter. During his Administration, she · <strong>helped maneuver 17 housing and neighborhood revitalization bills through Congress</strong>. In 1981, while pursuing a doctorate in urban planning and development finance at MIT, she was recruited ...",
    "published": null
  },
  {
    "title": "Marcy Kaptur - BW Center for Women and Politics in Ohio | Baldwin Wallace University",
    "url": "https://www.bw.edu/centers/women-and-politics-of-ohio/bios/04-kaptur-marcy/",
    "snippet": "Prior Experience: Urban Planner for the Toledo-Lucas County Plan Commissions from 1969-1975; Director of Planning for the National Center for Urban Ethnic Affairs from 1975-1977; Domestic Policy Advisor for President Jimmy Carter from 1977-1979 · Age When First Elected to the U.S. House: 36 · Length of Service: 21 terms (as of September 2023) How She Entered the U.S. House: Defeated incumbent Representative Ed Weber in 1982 ... Representative Kaptur talks with a student at an event at Baldwin Wallace University, February 2013.",
    "published": null
  },
  {
    "title": "Marcy C Kaptur | Archives of Women's Political Communication",
    "url": "https://awpc.cattcenter.iastate.edu/directory/marcy-c-kaptur/",
    "snippet": "Prior to serving in Congress, Kaptur served on the Toledo-Luca County Plan Commission from 1969 to 1975, as director of planning for the National Center for Urban Ethnic Affairs from 1975 to 1977 and as a domestic policy advisor during President Jimmy Carter&#x27;s administration. For information on Kaptur&#x27;s policy subject areas, committee appointments and sponsored/co-sponsored legislation in the U.S. House of Representatives, please visit her profile on https://www.congress.gov. ... Ballotpedia (n.d.). “Marcy Kaptur” Ballotpedia.",
    "published": null
  }
]