[
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "Each member of the Council is elected for a four-year period by the World Athletics Congress, a biennial gathering of athletics officials that consists of the Council, Honorary Members, and up to three delegates from each of the national member federations. Chairpersons and members of Committees, ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The Executive Board has responsibility ... adopting and monitoring the annual plan and budget; appointing and monitoring the <strong>Chief Executive</strong>; financial planning and ......",
    "published": null
  },
  {
    "title": "New Athletes' Commission members announced | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/athletes-commission-members-2025-2029",
    "snippet": "The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December 2016. Since 2019, the Chairperson and one other member of the Athletes’ Commission – one man and one woman – have been full voting members of the World Athletics Council.",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Honorary President of the Association of the Balkan Athletics Federations (since 2021) Lecturer at the National Sports Academy in Sports Management since 1994 ... Served as Secretary for Uganda Sports Women Association, (1998-2000) an organisation whose functions were later mainstreamed in National Olympic Committee and National Federations for purposes of sustainability · Chef de Mission XXI Commonwealth Games, Gold Coast 2018, Australia ... Secretary LOC, IAAF World Cross Country Kampala 2017 for a period of three years (2014-2017) from bid process to implementation of the project;",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "He was the director of the Dutch Olympic Committee between 1965 and 1970 but retained an extensive involvement with athletics, becoming the European Athletics Association president upon its formation in 1970 until 1976, when he was elected as the third IAAF president. Curiously, at the age of 73, he was two years older than the man he was succeeding but Paulen was active in addressing many of the relevant issues of the changing times. The first IAAF World Cup in 1977 was contested during his brief presidency and he set in motion events that lead to the first IAAF World Championships in 1983.",
    "published": null
  }
]