[
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "At the same time Salman ordered the establishment of the Ministry of Culture, with responsibility for delivering Saudi Vision 2030&#x27;s cultural goals; and the Council of Royal Reserves, tasked with environmental protection. In <strong>September 2022</strong>, the King resigned from the post of prime minister, ...",
    "published": "November 3, 2025"
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "On 23 January 2015, King Abdullah died and Salman ascended the throne. Mohammed was appointed minister of defence and secretary general of the royal court. In addition, he retained his post as the minister of state. The political unrest in Yemen (which began escalating in 2011) rapidly became a major issue for the newly appointed minister of defence, with Houthis taking control of northern Yemen in late 2014, followed by the resignation ...",
    "published": "11 hours ago"
  },
  {
    "title": "As Arab leaders gather in Saudi Arabia King Salman’s absence looms large | King Salman | The Guardian",
    "url": "https://www.theguardian.com/world/2021/dec/15/as-middle-eastern-leaders-gather-in-saudi-arabia-king-salmans-absence-looms",
    "snippet": "Several influential former Saudi officials say they cannot recall a precedent of a Saudi head of state being in the country and not receiving counterparts such as Gulf leaders and Macron, particularly at such a critical juncture. For all intents and purposes, Salman is now king in absentia and seems barely to be performing his duties.",
    "published": "July 10, 2024"
  },
  {
    "title": "Salman bin Abdulaziz al-Saud | Today's latest from Al Jazeera",
    "url": "https://www.aljazeera.com/tag/salman-bin-abdulaziz-al-saud/",
    "snippet": "King Salman vows to continue predecessor’s policies as he makes key appointments hours after King Abdullah’s death.",
    "published": null
  },
  {
    "title": "King Salman of Saudi Arabia to step down, announce Crown Prince Salman as successor by next week - Asianet Newsable",
    "url": "https://newsable.asianetnews.com/life/king-salman-of-saudi-arabia-to-step-down-make-way-for-crown-prince-salman-by-next-week",
    "snippet": "King Salman of Saudi Arabia to step down, announce Crown Prince Salman as successor by next week",
    "published": null
  }
]