[
  {
    "title": "Rocket Arena - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Rocket_Arena",
    "snippet": "<strong>Rocket Arena</strong> is a multi-purpose arena in Cleveland, Ohio. The building is the home of the Cleveland Cavaliers of the National Basketball Association (NBA) and the Cleveland Monsters of the American Hockey League (AHL). It also serves as a secondary arena for Cleveland State Vikings men&#x27;s and ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Quicken Loans Arena",
    "url": "http://www.insidearenas.com/eastern/QuickenLoansArena.htm",
    "snippet": "Gund Arena was one of the premier basketball arenas when it opened and remains one of the best facilities more than a decade later. Today the Cavaliers home is known as <strong>Quicken Loans Arena</strong> or by its nickname, “the Q,” after Dan Gillbert, ...",
    "published": "1 day ago"
  },
  {
    "title": "Rocket Mortgage FieldHouse: Learn Arena Rules & Bag Policy, Food, Seating & Parking Options",
    "url": "https://blog.ticketmaster.com/step-inside-rocket-mortgage-fieldhouse-in-cleveland-ohio/",
    "snippet": "The <strong>Rocket Mortgage FieldHouse</strong> is located in the heart of downtown Cleveland, directly next to the Progressive Field baseball stadium, in a bar-and restaurant-heavy area known as the Gateway District.",
    "published": "October 30, 2025"
  },
  {
    "title": "Rocket Arena",
    "url": "https://www.rocketarena.com/",
    "snippet": "<strong>Rocket Arena</strong>, located in downtown Cleveland, is the premier sports and entertainment facility that is home to the Cavs, Monsters, and many other special events.",
    "published": null
  },
  {
    "title": "Cleveland Cavaliers | Things to Do in Cleveland Ohio",
    "url": "https://www.thisiscleveland.com/things-to-do/major-attractions/cleveland-cavaliers",
    "snippet": "When the Cleveland Cavaliers NBA team plays a home game, crowds pile into <strong>Quicken Loans Arena</strong>. This is Cleveland after all; passion and sports teams go together like pizza and beer.",
    "published": null
  }
]