[
  {
    "title": "BTI 2024 Kyrgyzstan Country Report: BTI 2024",
    "url": "https://bti-project.org/en/reports/country-report/KGZ",
    "snippet": "Following the adoption of a new constitution in 2021 and Kyrgyzstan’s <strong>transition from a mixed parliamentary-presidential model to a strongly presidential regime</strong>, the separation of powers has become ever more compromised.",
    "published": null
  },
  {
    "title": "The Evolution of Leadership in Kyrgyzstan",
    "url": "https://www.mexicohistorico.com/paginas/the-evolution-of-leadership-in-kyrgyzstan-46cf5632.html",
    "snippet": "This evolution reflects not only the resilience of its people but also the complex challenges that have shaped governance in the region. <strong>As the nation transitioned from Soviet rule to independence in 1991</strong>, it faced a myriad of leadership challenges that tested the limits of political authority ...",
    "published": null
  },
  {
    "title": "Kyrgyzstan Under Japarov: The Country’s Decline Into Dictatorship - Human Rights Foundation",
    "url": "https://hrf.org/latest/kyrgyzstan-under-japarov-the-countrys-decline-into-dictatorship/",
    "snippet": "Parallel to the presidential elections, <strong>Japarov held a referendum on the transition to a presidential form for the republic</strong>. Having given himself broad presidential powers, the right-wing populist president began a crusade against civil society ...",
    "published": "February 26, 2025"
  },
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "indicates an individual serving as an acting or provisional president of Kyrgyzstan ... ^ Kyrgyz: Кыргыз Республикасынын Президенти, romanized: Kyrgyz Respublikasynyn Prezidenti; Russian: Президент Кыргызской Республики, romanized: Prezident Kyrgyzskoj Respubliki · ^ Roza Otunbayeva was proclaimed president of the transitional period on 27 June 2010 after a new constitution had been adopted.",
    "published": "November 11, 2025"
  },
  {
    "title": "Kyrgyzstan is losing its status as Central Asia’s only democracy",
    "url": "https://www.economist.com/asia/2025/12/04/kyrgyzstan-is-losing-its-status-as-central-asias-only-democracy",
    "snippet": "KYRGYZSTAN USED to be an exception in Central Asia: the sole democracy in a region run by strongmen, albeit a flawed one. That is rapidly ceasing to be the case. It regressed a bit closer to the mean on November 30th, when a parliamentary election produced victory for candidates loyal to Sadyr Japarov, the increasingly authoritarian president.",
    "published": "2 weeks ago"
  }
]