[
  {
    "title": "Fiat Chrysler Automobiles - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_Chrysler_Automobiles",
    "snippet": "The corporation was established ... Toyota, General Motors, Volkswagen, Hyundai, Ford and Nissan). <strong>Its corporate headquarters were domiciled in Amsterdam and its financial headquarters were in London</strong>....",
    "published": "2 weeks ago"
  },
  {
    "title": "Where is Fiat Chrysler Automobiles Located? HQ, Global Offices & Company Insights",
    "url": "https://www.highperformr.ai/company/fca-group",
    "snippet": "Fiat Chrysler Automobiles established in 2014 and headquartered in <strong>Auburn Hills</strong>., Learn more about Fiat Chrysler Automobiles offices, leadership team, mission, and growth journey.",
    "published": null
  },
  {
    "title": "Chrysler Headquarters and Technology Center | The Center for Land Use Interpretation",
    "url": "https://clui.org/ludb/site/chrysler-headquarters-and-technology-center",
    "snippet": "The Chrysler Headquarters and Technology Center, in <strong>Auburn Hills, Michigan, north of Detroit</strong>, has 5,300,000 square feet, and a contiguous office complex with a central building that is half a mile long. Chrysler, (now Fiat Chrysler), sells around 2.2 million cars per year and has five assembly ...",
    "published": null
  },
  {
    "title": "Chrysler World Headquarters and Technology Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chrysler_World_Headquarters_and_Technology_Center",
    "snippet": "Before moving to the <strong>Auburn Hills</strong> headquarters, Chrysler was based at the Highland Park Chrysler Plant campus, which predated the formation of the company itself. It was located along I-75, roughly one mile (1.6 km) southeast of the Highland ...",
    "published": "1 week ago"
  },
  {
    "title": "FCA US LLC Company Profile - Overview - GlobalData",
    "url": "https://www.globaldata.com/company-profile/fca-us-llc/",
    "snippet": "In addition to this, the company ... Caribbean Islands. The company is a subsidiary of Fiat Chrysler Automobiles NV. FCA US is headquartered in <strong>Auburn Hills, Michigan</strong>, the US....",
    "published": null
  }
]