[
  {
    "title": "2015 FIFA corruption case - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2015_FIFA_corruption_case",
    "snippet": "On 2 June 2015 a letter was published, claiming that Jérôme Valcke was party to a potential bribe paid to former FIFA executive Jack Warner in relation to votes for the 2010 FIFA World Cup in South Africa. Despite his win just four days previously, Sepp Blatter announced his resignation as FIFA President.",
    "published": "October 14, 2025"
  },
  {
    "title": "Sepp Blatter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sepp_Blatter",
    "snippet": "FIFA president Sepp Blatter was <strong>cleared of any misconduct</strong>, but his predecessor, Brazilian João Havelange, resigned as FIFA&#x27;s honorary president over his part in the scandal, since Havelange along with former FIFA Executive Committee members Ricardo Teixeira and Dr.",
    "published": "February 28, 2002"
  },
  {
    "title": "Sepp Blatter resigns as FIFA president - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/37419455/sepp-blatter-resigns-fifa-president",
    "snippet": "Three days after winning a fifth term as FIFA president in the aftermath of the arrest of leading FIFA officials, Sepp Blatter has announced his resignation as president of football&#x27;s world governing body.",
    "published": "June 5, 2015"
  },
  {
    "title": "Sepp Blatter Reportedly Under FBI Investigation: Latest Details and Comments",
    "url": "https://syndication.bleacherreport.com/amp/2484591-sepp-blatter-reportedly-under-fbi-investigation-latest-details-and-comments.amp.html",
    "snippet": "Blatter&#x27;s initial indication that he would step down, reported by Eliott C.",
    "published": "November 30, 2016"
  },
  {
    "title": "Sepp Blatter | PBS News",
    "url": "https://www.pbs.org/newshour/tag/sepp-blatter",
    "snippet": "Less than a week after a corruption scandal rocked the soccer world, FIFA president Sepp Blatter, who maintained he was the man to lead soccer&#x27;s international governing body, has stepped down.",
    "published": null
  }
]