[
  {
    "title": "2024 LMS Election Results | London Mathematical Society",
    "url": "https://www.lms.ac.uk/node/2497",
    "snippet": "President-Elect: Mark Chaplain Vice-President: Iain Gordon Vice-President: Catherine Hobbs General Secretary: David Barnes Treasurer: Simon Salamon Publications Secretary: Niall MacKay International Secretary: Minhyong Kim Education Secretary: Mary McAlinden",
    "published": null
  },
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The International Mathematical Union is administered by an executive committee (EC) which conducts the business of the Union. The EC consists of the President, two vice-presidents, the Secretary, six Members-at-Large, all elected for a term of four years, and the Past President.",
    "published": "February 24, 2025"
  },
  {
    "title": "IMU Executive Committee | International Mathematical Union Leadership 2023-2026",
    "url": "https://www.mathunion.org/organization/imu-executive-committee",
    "snippet": "Meet the IMU Executive Committee members leading the International Mathematical Union for 2023-2026. Learn about their roles and bios.",
    "published": null
  },
  {
    "title": "General Assembly of the International Mathematical Union | IMU Meetings & Resolutions",
    "url": "https://www.mathunion.org/organization/general-assembly",
    "snippet": "The Chair of the 2026 Nominating Committee is <strong>Helge Holden</strong>. The full composition of the committee was announced in October 2024 following completion of the established selection procedures (see Circular Letter 8/2024). Calls will subsequently be sent out to Members to nominate candidates for ...",
    "published": null
  },
  {
    "title": "Institute of Mathematical Statistics | IMS Election results",
    "url": "https://imstat.org/2017/07/14/ims-election-results/",
    "snippet": "Mathias, Peter, Greg, Antonietta, Axel and Byeong will be joining Andreas Buja, Gerda Claeskens, Nancy Heckman, Kavita Ramanan and Ming Yuan (whose terms end August 2018); and Jean Bertoin, Song Xi Chen, Elizaveta Levina and Simon Tavaré (whose terms run through July 2019). Cun-Hui Zhang, who became Statistical Science Editor in January, still serves on Council (see below); his vacant position as an elected member is filled by Mathias Drton.",
    "published": null
  }
]