[
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "The loan was then disbursed very quickly, before the election, but would lead Argentina into a serious debt crisis, with the country unable to meet its debts. On 2 July 2019, Christine Lagarde was nominated by the European Council to succeed <strong>Mario Draghi</strong> as President of the European Central ...",
    "published": "2 weeks ago"
  },
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "<strong>Mario Draghi</strong> was chosen to become the next President of the ECB on 24 June 2011. Draghi was president from 1 November 2011 until 31 October 2019 (succeeded by Christine Lagarde). Pascal Canfin, Member of the European Parliament for France, asserted that Draghi had been involved in swaps for ...",
    "published": "September 25, 2025"
  },
  {
    "title": "European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Central_Bank",
    "snippet": "In 2016, the European Central Bank&#x27;s president has further adjusted its communication, by introducing the notion of &quot;symmetry&quot; in its definition of its target, thus making it clear that the ECB should respond both to inflationary pressures and to deflationary pressures. As Draghi once said &quot;symmetry meant not only that we would not accept persistently low inflation, but also that there was no cap on inflation at 2%.&quot; On 8 July 2021, as a result of the strategic review led by the new president Christine Lagarde, the ECB officially abandoned the &quot;below but close to two per cent&quot; definition and adopted instead a 2% symmetric inflation target over the medium term.",
    "published": "5 days ago"
  },
  {
    "title": "Christine Lagarde",
    "url": "https://www.ecb.europa.eu/ecb/decisions/html/cvlagarde.en.html",
    "snippet": "Christine Lagarde, President of the European Central Bank",
    "published": "November 22, 2023"
  },
  {
    "title": "Christine Lagarde | Biography, IMF, ECB, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Christine-Lagarde",
    "snippet": "<strong>Christine Lagarde</strong> (born January 1, 1956, Paris, France) is a French lawyer and politician who was the first woman to serve as France’s finance minister (2007–11), as the managing director of the International Monetary Fund (IMF; 2011–19), ...",
    "published": "January 30, 2009"
  }
]