[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "International Inspiration Chair (charity delivering London 2012 Bid pledge to use sport to enhance the lives of youth around the world) (2013-2015) ... Non-Executive Chair, CSM Sport &amp; Entertainment (2021-present / previously Executive Chair 2013-2021)",
    "published": null
  },
  {
    "title": "World Athletics Executive Board re-appoints Arat, Hoffman and Sabharwal as members | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/world-athletics-executive-board-arat-hoffman-sabharwal",
    "snippet": "Along with the three re-appointed members, the Executive Board includes World Athletics President <strong>Sebastian Coe</strong>, Senior Vice President Ximena Restrepo, Vice Presidents Raul Chapado, Adille Sumariwalla and Jackson Tuwei, and CEO Jon Ridgeon ...",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "The last election was held in October ... World Athletics Championships. Following doping and corruption issues, a Code of Ethics was agreed in 2013 and an Ethics Commission was appointed in 2014. The Council appoints the chairperson from the elected members, and in turn, the chairperson appoints a deputy chair. The Ethics Board&#x27;s scope was ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://site.uat.aws.worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The term of office for Executive Board Members is four years. ... Chaired British Government Sports Honours Committee (2010-2018) and served within the Cabinet Office as Legacy Ambassador for the London 2012 Games (2012-2017) International Inspiration Chairman (charity delivering London 2012 Bid pledge to use sport to enhance the lives of youth around the world) (2013-2015) ... Chairman, Organising Committee - Asian Athletics ...",
    "published": null
  },
  {
    "title": "‘Your column was very unfair’: what happened when I met World Athletics CEO | Athletics | The Guardian",
    "url": "https://www.theguardian.com/sport/2025/dec/02/athletics-joining-sports-goliaths-long-way-to-go",
    "snippet": "Midnight in Tokyo, Usain Bolt is DJing and the launch party for the World Athletics Ultimate Championships is in full swing. And then the World Athletics chief executive, <strong>Jon Ridgeon</strong>, walks up to me and says: “I read your recent Guardian column, ...",
    "published": "3 weeks ago"
  }
]