[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Subsequent history is recorded in the form of reminiscences of past IAU Presidents and General Secretaries. Twelve of the fourteen past General Secretaries in the period 1964–2006 contributed their recollections of the Union&#x27;s history in IAU Information Bulletin No.",
    "published": "3 weeks ago"
  },
  {
    "title": "2025 IAU Election Results and New Council Announcement - IAU - International Association of Ultrarunners",
    "url": "https://iau-ultramarathon.org/2025-iau-election-results-and-new-council-announcement.html",
    "snippet": "As the IAU embarks on this new term, President <strong>Nadeem Khan</strong> congratulates all council members on their new positions and expresses optimism for the future of the organization.",
    "published": "October 17, 2025"
  },
  {
    "title": "Governance Structure - IAU",
    "url": "https://www.iau-aiu.net/Governance-Structure",
    "snippet": "The Executive Committee is composed of the President and four Vice-Presidents (representing each region of the world). It meets twice a year. The vice-presidents are designated by the President from among the Administrative Board members and their nomination is approved by the Administrative Board.",
    "published": null
  },
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "Dr. Hilligje van’t Land serves the global higher education community as Secretary General of the International Association of Universities (IAU) - a global NGO with UNESCO Associate Status. The IAU will celebrate its 75th Anniversary in 2025.",
    "published": null
  },
  {
    "title": "IAU President's Message | IAU",
    "url": "https://iau.edu/about/president",
    "snippet": "Here is a message from our President <strong>Carl Jubran</strong>, thanking everyone who has been involved with IAU France&#x27;s study abroad program.",
    "published": null
  }
]