[
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "Every president of Ukraine except for Volodymyr Zelenskyy has been a People&#x27;s Deputy of the Verkhovna Rada prior to their election, with Kuchma, Yushchenko, and Yanukovych all previously serving as Prime Minister and Kravchuk as well as acting president Turchynov previously serving as Chairman of the Verkhovna Rada.",
    "published": "1 week ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "Viktor Yushchenko, Petro Poroshenko, and Viktor Yanukovych served one term, with the latter being replaced by acting president <strong>Oleksandr Turchynov</strong>, who then also served as Chairman of the Ukrainian Parliament, on 21 February 2014. <strong>Oleksandr Turchynov</strong> was the only acting president in Ukraine&#x27;s ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "In Warsaw, President of Ukraine <strong>Volodymyr Zelenskyy</strong> held a meeting with President of Poland Karol Nawrocki. This was the first official visit by a foreign leader to the incumbent Polish President since his inauguration in August this year.",
    "published": "4 days ago"
  },
  {
    "title": "Presidents of Ukraine | World Presidents Database",
    "url": "https://www.worldpresidentsdb.com/list/countries/Ukraine/",
    "snippet": "List of Ukrainian presidents, leaders and heads of state. Both current and historical presidents of Ukraine are listed with biographies.",
    "published": null
  },
  {
    "title": "List of Presidents of Ukraine (1991 - 2022)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-presidents-of-ukraine-1646021751-1",
    "snippet": "Presidents of Ukraine: The current President of Ukraine is <strong>Volodymyr Zelensky</strong>. He was elected President of Ukraine in 2019. Take a look at the list of Presidents of Ukraine since 1991.",
    "published": "February 28, 2022"
  }
]