[
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "<strong>In 1981, while pursuing a doctorate in urban planning and development finance at MIT</strong>, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the ...",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Kaptur won reelection by less than one percentage point at 48.3% to Merrin&#x27;s 47.6%, which marked the first time in her political career that she failed to secure a majority of the vote. Kaptur took office on January 3, 1983. At the time, she became the first woman to represent Ohio&#x27;s 9th congressional district and was one of 24 women serving in Congress.",
    "published": "1 week ago"
  },
  {
    "title": "The Honorable Marcy Kaptur (D-OH) Biography",
    "url": "https://www.congress.gov/115/meeting/house/108368/witnesses/HHRG-115-VR03-Bio-K000009-20180613.pdf",
    "snippet": "There, she is a strong advocate ... clean water programs that protect · our Great Lakes. Earlier in her congressional career, she <strong>served on the Appropriations Financial Services</strong>...",
    "published": null
  },
  {
    "title": "Marcy Kaptur's story",
    "url": "https://www.bgsu.edu/arts-and-sciences/political-science/trailblazing-women-in-ohio-politics/marcy-kaptur.html",
    "snippet": "When Marcy Kaptur <strong>first ran for Congress in 1982, she struggled to raise money</strong>. Her suggestion to hold a bake sale was criticized in Washington, yet the event raised $10,000 – a large sum for a campaign in the early 1980s.",
    "published": null
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "Marcy Kaptur, the Representative from Ohio - in Congress from 1983 through Present",
    "published": null
  }
]