[
  {
    "title": "Lamine Diack becomes first president of the International Association of Athletics Federations | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/lamine-diack-becomes-first-president-of-the-i",
    "snippet": "1 August 2001 – Edmonton, Canada – An overwhelming majority of IAAF Congress delegates has elected Lamine Diack <strong>President of the International Association of Athletics Federations</strong>. 168 delegates voted for with just 1 delegate against.",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "Diack was elected to the IAAF Council at the 30th IAAF Congress in 1976, held in the Canadian city of Montreal, and became <strong>Senior Vice-President of the organisation</strong> in 1991. Upon the death of the fourth IAAF President Primo Nebiolo on November ...",
    "published": null
  },
  {
    "title": "Olympedia – Lamine Diack",
    "url": "https://www.olympedia.org/athletes/899103",
    "snippet": "He became <strong>vice-president of the IAAF</strong> in 1979, serving in that role until 1999, when he became President of the IAAF, a position he held until 2015. He also served as President of the Senegalese Olympic Committee from 1985-2002 and as President of the African Athletics Confederation from 1973-2003.",
    "published": null
  },
  {
    "title": "Lamine Diack elected to International Olympic Committee | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/lamine-diack-elected-to-international-olympic",
    "snippet": "11 December 1999 - Following a ... admitted as a member of the IOC. Diack, of Senegal, was appointed as <strong>interim president of the world athletics body</strong> after the death last month of Italy&#x27;s Primo Nebiolo, who headed the IAAF ...",
    "published": null
  },
  {
    "title": "Lamine Diack hands over the leadership of the CAA | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/lamine-diack-hands-over-the-leadership-of-the",
    "snippet": "After 30 years of leading the African Athletics Confederation, <strong>IAAF President</strong> Lamine Diack has handed over the reigns to his successor, Cameroon’s Hamad Kalkaba Malboum.",
    "published": null
  }
]