[
  {
    "title": "Bart De Wever - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bart_De_Wever",
    "snippet": "Bart Albert Liliane De Wever (Dutch: [ˈbɑrt də ˈʋeːvər]; born 21 December 1970) is a Belgian author, historian and politician who has served as the <strong>Prime Minister of Belgium</strong> since February 2025. From 2004 to 2025, De Wever had been the leader of the New Flemish Alliance (N-VA), a political ...",
    "published": "1 day ago"
  },
  {
    "title": "PM meeting with Belgian Prime Minister Bart de Wever: 12 December 2025 - GOV.UK",
    "url": "https://www.gov.uk/government/news/pm-meeting-with-belgian-prime-minister-bart-de-wever-12-december-2025",
    "snippet": "The Prime Minister met Belgian Prime Minister Bart de Wever in Downing Street this afternoon. From: Prime Minister&#x27;s Office, 10 Downing Street and The Rt Hon Sir Keir Starmer KCB KC MP · Published · 12 December 2025 · The Prime Minister met Belgian Prime Minister Bart de Wever in Downing Street this afternoon.",
    "published": "4 days ago"
  },
  {
    "title": "Biography | Bart De Wever",
    "url": "https://premier.be/en/biography",
    "snippet": "Bart De Wever (b. 1970) has been <strong>Prime Minister of Belgium</strong> since 3 February 2025. He is the first Flemish nationalist to hold this position. He previously served as Mayor of Antwerp from January 2013 to February 2025, and is still titular mayor of the city.",
    "published": "July 7, 2025"
  },
  {
    "title": "De Wever government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Wever_Government",
    "snippet": "The De Wever government is the <strong>incumbent federal government of Belgium</strong> after the 2024 Belgian federal election. On 31 January 2025, a final agreement was reached between N-VA, CD&amp;V, Vooruit, MR and Les Engagés to form a so-called &quot;Arizona ...",
    "published": "2 weeks ago"
  },
  {
    "title": "EU plans to treat Belgium like Hungary if it doesn’t back Ukraine loan",
    "url": "https://www.politico.eu/article/europe-belgium-hungary-ukraine-loan-war-russia-funds-finances/",
    "snippet": "Bart De Wever is holding out over fears Belgium will be on the hook should the money need to be paid back, and has now asked for more safety nets. | Dirik Mag/Getty Images · December 10, 2025 10:38 pm CET · By Zoya Sheftalovich · BRUSSELS ― Europe’s strategy for convincing the Belgians to support its plan to fund Ukraine?",
    "published": "5 days ago"
  }
]