[
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "Lecornu was <strong>appointed Prime Minister on 9 September 2025 by President Emmanuel Macron</strong>. He succeeded François Bayrou, who was forced to resign on the same day following the failure of a vote of confidence in the National Assembly the day before. Shortly after his appointment, Le Figaro and ...",
    "published": "18 hours ago"
  },
  {
    "title": "French Prime Minister Sébastien Lecornu resigns after less than a month",
    "url": "https://www.bbc.com/news/articles/cewn9k0w9rxo",
    "snippet": "France is facing further political chaos after the country&#x27;s latest prime minister, Sébastien Lecornu, <strong>resigned after just 26 days in the role</strong>.",
    "published": "October 6, 2025"
  },
  {
    "title": "Colère agricole : Sébastien Lecornu convoque une réunion ce mardi à Matignon",
    "url": "https://www.lefigaro.fr/conjoncture/colere-agricole-sebastien-lecornu-convoque-une-reunion-ce-mardi-a-matignon-20251216",
    "snippet": "Le premier ministre <strong>Sébastien Lecornu</strong> réunira à 10h30 à Matignon plusieurs ministres et préfets pour faire le point sur la situation agricole, marquée par la crise de la dermatose et l’opposition à l’accord UE-Mercosur.",
    "published": "3 hours ago"
  },
  {
    "title": "French PM scores big win as social security budget clears major hurdle – POLITICO",
    "url": "https://www.politico.eu/article/france-social-security-budget-vote-sebastien-lecornu/",
    "snippet": "Lecornu will have little time to celebrate, however, as there still remains the matter of the state budget, a separate piece of legislation where compromise has proved arguably more contentious. | Alain Jocard/AFP via Getty Images ... French Prime Minister Sébastien Lecornu scored a key political victory Tuesday after lawmakers approved next year’s social security budget by just 13 votes.",
    "published": "1 week ago"
  },
  {
    "title": "Macron reappoints Lecornu as French PM after days of turmoil",
    "url": "https://www.bbc.com/news/articles/cy4j9zz54ypo",
    "snippet": "<strong>President Emmanuel Macron has asked Sébastien Lecornu to return as French prime minister</strong> only four days after he stood down from the post, sparking a week of high drama and political turmoil.",
    "published": "October 10, 2025"
  }
]