[
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman is a son of King Abdulaziz and Hassa bint Ahmed Al Sudairi, making him one of the Sudairi Seven. He was the deputy governor of Riyadh and later the governor of Riyadh for 48 years from 1963 to 2011. He was then appointed minister of defense. He was named crown prince in 2012.",
    "published": "November 3, 2025"
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed is the first child of King Salman bin Abdulaziz and his third wife, <strong>Fahda bint Falah Al Hithlain</strong>. After obtaining a law degree from King Saud University, he became an advisor to his father in 2009. He was appointed deputy crown prince and defense minister after his father became king ...",
    "published": "11 hours ago"
  },
  {
    "title": "How Many Wives Does King Salman Have? Truth Revealed! | History",
    "url": "https://vocal.media/history/how-many-wives-does-king-salman-have-truth-revealed",
    "snippet": "<strong>Sultana bint Turki Al Sudairi</strong> holds the distinction of being King Salman&#x27;s first wife. She was born in 1928, making her seven years older than King Salman, who was born in 1935. Sultana played a pivotal role in King Salman&#x27;s life, particularly ...",
    "published": null
  },
  {
    "title": "Princess Fahda, Wife of Saudi King Salman, Arrives in Tangier for Vacation",
    "url": "https://www.moroccoworldnews.com/2023/08/30853/princess-fahda-wife-of-saudi-king-salman-arrives-in-tangier-for-vacation/",
    "snippet": "<strong>Princess Fahda bint Falah Al Hithlain</strong>, wife of Saudi Arabia’s King Salman bin Abdulaziz and mother of Crown Prince Mohammed bin Salman, has chosen Morocco to spend her personal vacation.",
    "published": "August 4, 2023"
  },
  {
    "title": "1,611 Wife Of Saudi Stock Photos, High-Res Pictures, and Images - Getty Images",
    "url": "https://www.gettyimages.com/photos/wife-of-saudi",
    "snippet": "Japan&#x27; Prime Minister Shinzo Abe checks his position with his wife <strong>Akie Abe</strong> as Saudi Arabia&#x27;s Crown Prince Mohammed bin Salman speaks to U.S....",
    "published": null
  }
]