[
  {
    "title": "Jonathan Kodjia (Player) | National Football Teams",
    "url": "https://www.national-football-teams.com/player/64320/Jonathan_Kodjia.html",
    "snippet": "Jonathan Kodjia · You are using an old browser which is not compatible with our new design. Please update your browser or use our old website. Kindly provided by Jorge Mendoza · Kindly provided by SiebenW Add Picture · Position · Centre Forward (CF) Other positions: Secondary striker (SS) Age ·",
    "published": null
  },
  {
    "title": "Jonathan Kodjia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jonathan_Kodjia",
    "snippet": "In the first four seasons at the club, Kodjia rarely played and was never able to score for the Reims first team, his most productive campaign being when he made 13 appearances after the club had dropped into France&#x27;s third tier. Successful loan moves to Cherbourg, Caen and Amiens earned him a move to Angers. Kodjia moved to Angers in 2014 where he won the Ligue 2 Player of the Year 2015 and was also named in the Ligue 2 Team of the Season, after scoring 15 goals in 29 games during the 2014–15 Ligue 2 to help Angers gain promotion to the French top flight after finishing in 3rd place.",
    "published": "October 3, 2025"
  },
  {
    "title": "Jonathan Kodjia Stats, Goals, Records, Assists, Cups and more | FBref.com",
    "url": "https://fbref.com/en/players/ecf44e09/Jonathan-Kodjia",
    "snippet": "Check out the latest domestic and international stats, match logs, goals, height, weight and more for <strong>Côte d&#x27;Ivoire men&#x27;s national team, Aston Villa FC and Bristol City FC</strong> playing for Jonathan Kodjia in the Africa Cup of Nations, Premier League ...",
    "published": null
  },
  {
    "title": "Jonathan Kodjia's Ultimate Team History | FUTWIZ",
    "url": "https://www.futwiz.com/en/player/history/189099",
    "snippet": "Jonathan Kodjia has had 13 cards in Ultimate Team (so far), with the first one being 61 rated in FUT 14. The highest rated Jonathan Kodjia card is 75 rated. In total, Jonathan Kodjia has played for 4 different clubs in Ultimate Team.",
    "published": null
  },
  {
    "title": "Jonathan Kodjia",
    "url": "https://grokipedia.com/page/Jonathan_Kodjia",
    "snippet": "Kodjia was instrumental in Angers&#x27; promotion to Ligue 1 at the end of the 2014–15 season, where the team finished third in Ligue 2 with 64 points from 38 matches.[63] Angers secured the spot by defeating US Orléans 1–0 in the second leg of the promotion playoff on May 22, 2015, following a 0–0 first leg draw, marking their return to the top flight after 21 years.[64] At Aston Villa, Kodjia contributed to the club&#x27;s ascent to the Premier League through the 2018–19 EFL Championship play-offs, finishing fifth in the regular season with 76 points from 46 matches.[65] Villa clinched promot",
    "published": null
  }
]