[
  {
    "title": "Who Makes Alfa Romeo? | Ron Lewis Alfa Romeo",
    "url": "https://www.ronlewisalfaromeo.com/who-makes-alfa-romeo/",
    "snippet": "It’s a mix of modern making and time-honored craftsmanship. Stellantis ownership means faster work on electric cars. <strong>The company is spending over €30 billion on electric and software by 2025</strong>...",
    "published": "October 31, 2025"
  },
  {
    "title": "Stellantis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stellantis",
    "snippet": "Shareholders of both companies approved the deal on 4 January 2021, and the merger was completed on 16 January 2021. The combined entity was renamed Stellantis N.V. on 17 January, with shares beginning to trade under the symbol &quot;STLA&quot; on the Milan Stock Exchange and Euronext Paris on 18 January and on the New York Stock Exchange on 19 January.",
    "published": "1 day ago"
  },
  {
    "title": "Who Owns Alfa Romeo: Top Shareholders – Brands Owned By",
    "url": "https://brandsownedby.com/who-owns-alfa-romeo/",
    "snippet": "<strong>Santo Ficili</strong> is the Chief Executive Officer of Alfa Romeo as of 2025. He leads the brand under Stellantis N.V. and is responsible for shaping Alfa Romeo’s strategy, operational direction, and brand identity worldwide.",
    "published": "2 weeks ago"
  },
  {
    "title": "Is Alfa Romeo Part of Stellantis? | Benson Alfa Romeo",
    "url": "https://www.alfaromeousaofgreer.com/research/is-alfa-romeo-part-of-stellantis.htm",
    "snippet": "Stelantis was formed with a joint venture, a 50-50 merger of two well-known automotive empires: the Italian-American conglomerate Fiat Chrysler Automobiles and the French PSA Group, Peugeot S.A, creating the fourth largest automaker today. This makes <strong>Stellantis the current owner of Alfa Romeo</strong>.",
    "published": null
  },
  {
    "title": "Who Makes Alfa Romeo? | Alfa Romeo of Omaha",
    "url": "https://www.alfaromeoomaha.com/alfaromeo-research/who-owns-alfa-romeo/",
    "snippet": "Who owns Alfa Romeo, exactly? <strong>Alfa Romeo is currently owned by the Stellantis automotive company</strong>. Despite this, the origin of Italian precision shines through the top Alfa Romeo models like the Stelvio and Giulia models.",
    "published": "January 13, 2024"
  }
]