[
  {
    "title": "List of heads of state of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Greece",
    "snippet": "The Second Hellenic Republic was a parliamentary republic which was proclaimed on 25 March 1924 and a referendum was held to abolish the Monarchy. The Second Republic was abolished after the 1935 monarchy referendum. The President of the Republic had a symbolic role as head of the state.",
    "published": "October 11, 2025"
  },
  {
    "title": "Ioannis Kapodistrias, Modern Greece’s first head of state - Greek News Agenda",
    "url": "https://www.greeknewsagenda.gr/kapodistrias/",
    "snippet": "<strong>Ioannis Kapodistrias</strong> was the first head of state of Greece. Arguably the most illustrious Greek of his time, he became Governor of the newly-founded independent Greek state after a notable career in international diplomacy.",
    "published": "June 24, 2025"
  },
  {
    "title": "President - Aρχική",
    "url": "https://www.presidency.gr/en/president/",
    "snippet": "PRESIDENT of the Hellenic Republic The President Constantine An. Tassoulas Personal Info Place and Date οf Birth: He was born in Ioannina in 1959. Marital Status: He is married with lawyer Fani Stathopoulou and has two children Tasos and Magda. Profession: A member of the Athens Bar Association.",
    "published": "March 27, 2025"
  },
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "The current Third Hellenic Republic (Greek: Γʹ Ελληνική Δημοκρατία) was established in 1974 during the period of metapolitefsi, after the end of the Greek junta which had controlled Greece since the coup d&#x27;état of 21 April 1967.",
    "published": "2 weeks ago"
  },
  {
    "title": "Katerina Sakellaropoulou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Katerina_Sakellaropoulou",
    "snippet": "She was elected by the Hellenic Parliament to succeed <strong>Prokopis Pavlopoulos</strong> on 22 January 2020. Prior to her election as president, Sakellaropoulou served as president of the Council of State, the highest administrative court of Greece.",
    "published": "October 2, 2025"
  }
]