[
  {
    "title": "Friedrich Merz | The Guardian",
    "url": "https://www.theguardian.com/world/friedrich-merz",
    "snippet": "Newsletters · Sign in · Shada Islam · Aida Baghernejad · German chancellor is accused of taking a page from extremist parties with ‘dangerous’ rhetoric on immigration · About 235 results for Friedrich Merz · 1234... Explore more on these topics · Europe · Germany ·",
    "published": null
  },
  {
    "title": "Friedrich Merz puts Germany in an unfamiliar position: Out front – POLITICO",
    "url": "https://www.politico.eu/article/friedrich-merz-germany-eu-ukraine-defense-leadership-brussels/",
    "snippet": "If we do not succeed in this, the European Union’s ability to act will be severely damaged for years, if not for a longer period,” Merz said on Monday. “And we will show the world that, at such a crucial moment in our history, we are incapable of standing together and acting to defend our own political order on this European continent.” · Friedrich Merz’s predecessors, Olaf Scholz and Angela Merkel, were reluctant to put the country in such an outspoken lead role internationally or within the EU.",
    "published": "9 hours ago"
  },
  {
    "title": "Friedrich Merz: Wie der Kanzler bei den Ukraine-Verhandlungen Europa zurück ins Spiel bringt - DER SPIEGEL",
    "url": "https://www.spiegel.de/politik/deutschland/friedrich-merz-wie-der-kanzler-bei-den-ukraine-verhandlungen-europa-zurueck-ins-spiel-bringt-a-d82d5433-03e7-4a41-9806-3dcb79eed933",
    "snippet": "Bundeskanzler Merz, Präsident Selenskyj: »Ziele, über die wir uns zwischen Ukrainern, Europäern und Amerikanern einig sind« Foto: Michael Kappeler / dpa · Sie können den Artikel leider nicht mehr aufrufen. Der Link, der Ihnen geschickt wurde, ist entweder älter als 30 Tage oder der Artikel wurde bereits 10 Mal geöffnet. ... Wöchentlich die digitale Ausgabe des SPIEGEL inkl. E-Paper (PDF), Digital-Archiv und S+-Newsletter",
    "published": "16 hours ago"
  },
  {
    "title": "Friedrich Merz – DW",
    "url": "https://www.dw.com/en/friedrich-merz/t-60575802",
    "snippet": "In his first visit to Israel as chancellor, Merz affirms Germany&#x27;s support while addressing civilian suffering in Gaza ... <strong>German Chancellor Friedrich Merz is in Israel for talks with Prime Minister Benjamin Netanyahu</strong>.",
    "published": null
  },
  {
    "title": "Friedrich Merz | PBS News",
    "url": "https://www.pbs.org/newshour/tag/friedrich-merz",
    "snippet": "Germany’s center-left Social Democrats have approved a deal to join a new coalition government, paving the way for parliament to elect conservative leader Friedrich Merz as the country’s new chancellor. ... Subscribe to Here’s the Deal, our politics newsletter for analysis you won’t ...",
    "published": null
  }
]