[
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "Greta Conway Van Susteren (born June 11, 1954) is an American journalist, lawyer, and television news anchor for Newsmax TV. She was previously on CNN, Fox News, and MSNBC. She hosted Fox News&#x27;s On the Record w/ Greta Van Susteren for 14 years (<strong>2002–2016</strong>) before departing for MSNBC, where ...",
    "published": "August 20, 2025"
  },
  {
    "title": "Greta Van Susteren Leaving MSNBC After Less Than Six Months - The New York Times",
    "url": "https://www.nytimes.com/2017/06/29/business/media/greta-van-susteren-leaving-msnbc-after-only-six-months.html",
    "snippet": "Greta Van Susteren joined MSNBC in January after Fox News let her go last year.",
    "published": "June 30, 2017"
  },
  {
    "title": "For the Record with Greta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/For_the_Record_with_Greta",
    "snippet": "For the Record with Greta is an American news television program hosted by Greta Van Susteren, which began airing on MSNBC on <strong>January 9, 2017.</strong> It was created after she moved from Fox News to MSNBC amidst sexual allegations against Roger Ailes, although she defended him.",
    "published": "May 16, 2025"
  },
  {
    "title": "Greta Van Susteren out at MSNBC after six months - POLITICO",
    "url": "https://www.politico.com/blogs/on-media/2017/06/29/greta-van-susteren-out-msnbc-240111",
    "snippet": "&quot;MSNBC and Greta Van Susteren have decided to part ways. Greta is a well-regarded television veteran and one of only a few broadcasters who can say they’ve hosted shows at all three major cable news networks. We are grateful to her and wish her the best,” MSNBC President Phil Griffin said in a memo to staff on Thursday afternoon.",
    "published": null
  },
  {
    "title": "Greta Van Susteren out at MSNBC after six months",
    "url": "https://money.cnn.com/2017/06/29/media/greta-van-susteren-msnbc-out/index.html",
    "snippet": "A spokesman for MSNBC did not respond to a request for comment. A veteran news anchor, Van Susteren came to MSNBC after a 14-year run at Fox News. Her departure from Fox was also sudden. Last September, Coale said that a courier arrived at Van Susteren&#x27;s home in Washington, D.C.",
    "published": null
  }
]