[
  {
    "title": "Kevin Volland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kevin_Volland",
    "snippet": "After starting his football career with <strong>FC Thalhofen</strong>, Volland transferred to FC Memmingen&#x27;s C-Youth squad, playing in the Bavarian League, the top amateur division at that time. After relegation in 2006, he moved on to TSG Thannhausen, in order to remain in the higher division.",
    "published": "2 weeks ago"
  },
  {
    "title": "Kevin Volland to Return to TSV 1860 München | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/kevin-volland-to-return-to-tsv-1860-muenchen--lPiUbM",
    "snippet": "1. <strong>FC Union Berlin</strong> and Kevin Volland have agreed to end their partnership in the summer, with the 32-year-old attacking all-rounder to return to the club of his youth, TSV 1860 München.",
    "published": null
  },
  {
    "title": "Kevin Volland",
    "url": "https://grokipedia.com/page/Kevin_Volland",
    "snippet": "Born in Marktoberdorf, Bavaria, Volland began his youth career at local clubs <strong>FC Thalhofen and FC Memmingen</strong> before joining TSV 1860 Munich&#x27;s academy in 2007. He made his professional ...",
    "published": null
  },
  {
    "title": "Kevin Volland Latest News, Ratings, Official Player Stats",
    "url": "https://chucknorisk.com/players/kevin-volland/",
    "snippet": "His shortest spell with a club was five months in TSV 1860 Munich (Germany). Before joining <strong>Bayer Leverkusen</strong>, Kevin Volland impressed at TSV 1860 Munich, 1899 Hoffenheim and TSV 1860 Munich II.",
    "published": null
  },
  {
    "title": "Kevin Volland - Soccer News, Rumors, & Updates | FOX Sports",
    "url": "https://www.foxsports.com/soccer/kevin-volland-player",
    "snippet": "Impact Volland will leave Union Berlin after two years at the club and four goals scored across all competitions. He will return to his former club TSV 1860 Munich where his professional career began before moving on to <strong>Hoffenheim and Leverkusen</strong> and later spending time abroad with Monaco where ...",
    "published": null
  }
]