[
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Lieutenant-General Ahmed Awad Ibn ... Fattah al-Burhan. <strong>The Transitional Military Council was replaced with the Transitional Sovereignty Council on 21 August 2019, under the chairmanship of al-Burhan</strong>....",
    "published": "November 14, 2025"
  },
  {
    "title": "Power Relations in Sudan after the Fall of Bashir - Stiftung Wissenschaft und Politik",
    "url": "https://www.swp-berlin.org/10.18449/2024RP05/",
    "snippet": "Perhaps the most profound change in Sudan’s politi­cal system was the rise of the RSF to become one of the two most powerful armed forces in the country, whose leadership simultaneously controlled a large part of the economy and exercised significant politi­cal influence.",
    "published": null
  },
  {
    "title": "SUDAN’S LEADERSHIP RESHUFFLE: SOMETHING BETTER OR MORE OF THE SAME? - Sudan Democracy First Group",
    "url": "https://democracyfirstgroup.org/sudans-leadership-reshuffle-something-better-or-more-of-the-same/",
    "snippet": "The resignation of Ali Osman Taha and Nafi Ali Nafi from government, who were competing to succeed Bashir, opens the door for an even larger change. The departure of a large group of the leaders of the Islamist Movement from government – an almost synchronized departure – is alluding to a final divorce between the Movement and the party/regime, which was a demand of many of its own reformist cadres, such as the Sai’hoon. In conclusion, strategic concerns surrounding Sudan, whether internal or external, will remain unaffected by the leadership reshuffle.",
    "published": "December 12, 2013"
  },
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "Following the Sudanese Revolution in April 2019, he was handed control of the military junta, the Transitional Military Council, a day after it was formed, due to protesters&#x27; dissatisfaction with the establishment ties of initial leader Ahmed Awad Ibn Auf.",
    "published": "3 weeks ago"
  },
  {
    "title": "Putting Sudan’s Political Transition Back on Track | United States Institute of Peace",
    "url": "https://www.usip.org/publications/2021/12/putting-sudans-political-transition-back-track",
    "snippet": "On October 25, the military, in a familiar move, seized power throwing into question the political transition that would result in civilian rule. <strong>The civilian cabinet was dissolved, its leaders arrested and a state of emergency declared</strong>.",
    "published": "December 15, 2021"
  }
]