[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "In September 2024, he became the Union&#x27;s candidate for Chancellor of Germany ahead of the following year&#x27;s federal election. The CDU/CSU won a plurality of the seats and subsequently reached an agreement to form a coalition with the SPD. <strong>Merz was elected chancellor on 6 May 2025</strong>, taking two ...",
    "published": "2 days ago"
  },
  {
    "title": "Germany's Merz Is Doing Better as Chancellor Than Everyone Thinks",
    "url": "https://foreignpolicy.com/2025/12/12/friedrich-merz-germany-chancellor-economy-ukraine-trump-america/",
    "snippet": "He implicitly rebuked previous chancellors—particularly Angela Merkel—for ducking hard decisions. He conspicuously praised his coalition partners, the Social Democrats (SPD), even though they are the ones who have been forcing him to tone down his present government’s agenda. Merz was most impassioned when talking about Russia and the rapid transformation in firepower, soldiers, and mindset that Germany needs to undertake if it is to cope with the chills emanating from Russian President Vladimir Putin and U.S.",
    "published": "4 days ago"
  },
  {
    "title": "The Turbulent Times of Friedrich Merz - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/europe/friedrich-merz-germany.html",
    "snippet": "The plane ferrying Friedrich Merz to Berlin looked as if someone had spruced up Air Force One and then shrunk it in the wash. It was painted white, with the gold, red and black of the German flag blazed across the side like a racing stripe. The cabin was paneled in dark, laminated wood and fitted with wide leather seats. Mr. Merz, the German chancellor, nestled into one, newspapers stacked on his lap. As is customary with new chancellors, Mr. Merz had to give up driving when he took office in May.",
    "published": "1 day ago"
  },
  {
    "title": "Friedrich Merz is the next federal chancellor",
    "url": "https://www.deutschland.de/en/topic/politics/friedrich-merz-next-federal-chancellor",
    "snippet": "<strong>The snap election held on 23 February 2025 was won by the CDU/CSU, and he is their candidate</strong>. Aged 69, Merz has been chairman of the Christian Democratic Union of Germany (CDU) and chairman of the joint parliamentary group of the CDU and CSU ...",
    "published": "May 6, 2025"
  },
  {
    "title": "Germany's Merz becomes chancellor after surviving historic vote failure",
    "url": "https://www.bbc.com/news/articles/cvgp22zlrgko",
    "snippet": "The conservative leader is sworn in, having won a parliament vote to become chancellor at the second attempt.",
    "published": "May 6, 2025"
  }
]