[
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "In 2002, Van Susteren switched to the Fox News Channel after a highly publicized contract-bidding war. Before starting at Fox she also underwent cosmetic surgery that significantly changed her look. She hosted the current affairs show On the Record w/ Greta Van Susteren.",
    "published": "August 20, 2025"
  },
  {
    "title": "Greta Van Susteren: MSNBC Only Network That Ever Tried to Control My Show | Barrett Media",
    "url": "https://barrettmedia.com/2025/03/21/greta-van-susteren-msnbc-only-network-that-ever-tried-to-control-my-show/",
    "snippet": "Greta Van Susteren had previously worked at both <strong>CNN and Fox News</strong> before joining MSNBC.",
    "published": "March 24, 2025"
  },
  {
    "title": "Greta Van Susteren – USC Center on Communication Leadership and Policy",
    "url": "https://communicationleadership.usc.edu/greta-van-susteren-3/",
    "snippet": "Prior to Fox, Greta worked at CNN for 7 years where she started out as a legal analyst then became co-host of CNN’s daily legal program Burden of Proof. She went on to host the channel’s prime time news and analysis show The Point with Greta Van Susteren.",
    "published": null
  },
  {
    "title": "Greta van Susteren :: New Netherland Institute",
    "url": "https://www.newnetherlandinstitute.org/history-and-heritage/dutch_americans/greta-van-susteren",
    "snippet": "Greta Van Susteren is a journalist and well known television personality, currently on the Fox News Channel, and earlier, from 1991 to 2002, on the CNN Channel. Van Susteren started her journalistic career, on CNN, as a legal analyst, and first came into prominence with the <strong>William Kennedy</strong> ...",
    "published": null
  },
  {
    "title": "Greta Van Susteren Will Join Newsmax Early-Evening Lineup in June",
    "url": "https://variety.com/2022/tv/news/greta-van-susteren-newsmax-1235275722/",
    "snippet": "For the past few years, Van Susteren, one of the few anchors who can say they have been employed by <strong>CNN, MSNBC and Fox News Channel</strong>, has been working as a political analyst for Gray Television and doing a show for Voice of America.",
    "published": "May 24, 2022"
  }
]