[
  {
    "title": "Mikel Arteta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikel_Arteta",
    "snippet": "<strong>Mikel Arteta Amatriain</strong> (born 26 March 1982) is a Spanish professional football manager and former player who is the manager of Premier League club Arsenal. He is widely regarded as one of the best managers in the world. Arteta began his senior club career at Barcelona in 1999, but limited playing ...",
    "published": "13 hours ago"
  },
  {
    "title": "Arsenal Manager Information | Arsenal Insider",
    "url": "https://www.arsenalinsider.com/club/manager/",
    "snippet": "Arsenal appointed <strong>Mikel Arteta</strong> as the club’s latest manager in December 2019 with the title of head coach. He returned to the club to replace Unai Emery at the Emirates Stadium helm.",
    "published": "September 2, 2025"
  },
  {
    "title": "Arsenal F.C. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Arsenal_F.C.",
    "snippet": "Herbert Chapman won the club its first silverware, and his legacy enabled a trophy-laden period in the 1930s. He helped introduce the WM formation, floodlights, and shirt numbers; he also added the white sleeves and brighter red to the club&#x27;s jersey. <strong>Arsène Wenger</strong> was the club&#x27;s longest-serving ...",
    "published": "5 days ago"
  },
  {
    "title": "List of Arsenal F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Arsenal_F.C._managers",
    "snippet": "The most successful person to manage Arsenal is <strong>Arsène Wenger</strong>, who won three Premier League titles, seven FA Cups and seven Community Shields between 1996 and 2018. Wenger is the club&#x27;s longest-serving manager; he surpassed George Allison&#x27;s ...",
    "published": "6 days ago"
  },
  {
    "title": "Arsenal Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=142&teamTabs=managers",
    "snippet": "Our database is crammed with every football club you could possibly wish for ... A plethora of players ranging from Adebayor to Zamora. All you need to know to find out who is the best bet to score next ... From Allardyce to Zola, our massive manager database, with histories and win ratios, is sure to get your vote of confidence",
    "published": null
  }
]