[
  {
    "title": "Vincent Kompany Spotlight: News, Personal & more",
    "url": "https://fcbayern.com/en/teams/first-team/coaches-and-staff/vincent-kompany",
    "snippet": "<strong>Vincent Kompany has been head coach of FC Bayern since July 2024</strong>. The former defender was born in Ukkel, Belgium and played for Anderlecht, Hamburger SV and Manchester City. He returned to Belgium in 2019 and became player-coach at Anderlecht.",
    "published": null
  },
  {
    "title": "Vincent Kompany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Vincent_Kompany",
    "snippet": "On 21 October 2025, Bayern Munich announced that <strong>Kompany has signed a new contract extension that will keep him at the club until 30 June 2029</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Bayern Munich renew contracts of Vincent Kompany’s coaching team | Bavarian Football Works",
    "url": "https://www.bavarianfootballworks.com/bayern-munich-transfer-rumors-news/153962/official-bayern-munich-renew-contracts-of-vincent-kompanys-coaching-staff",
    "snippet": "Vincent Kompany’s recent contract extension at Bayern Munich, the first contract extension for a coach at Bayern since Louis Van Gaal, was a true bombshell. In the statements that followed, it was clear that Bayern and Kompany had managed to wrap the contract extension up extremely quickly, with the whole thing taking less than a week.",
    "published": "4 days ago"
  },
  {
    "title": "Vincent Kompany believes Nicolas Jackson is “developing further” at Bayern Munich because of Harry Kane | Bavarian Football Works",
    "url": "https://www.bavarianfootballworks.com/bayern-munich-coaches/154105/bayern-munich-harry-kane-nicolas-jackson-vincent-kompany-fc-mainz-05-bundesliga-dfb-pokal-champions-league",
    "snippet": "Daily Schmankerl: FC Bayern, FC Barcelona, Real Madrid battling for Nico Schlotterbeck?; Chelsea’s Enzo Fernandez to Bayern?; and MORE! ... Vincent Kompany hails Nicolas Jackson’s contribution at Bayern Munich, stresses importance of AFCON for African players",
    "published": "2 days ago"
  },
  {
    "title": "Kompany is self-critical: \"We made mistakes\" - FCBinside - Latest Bayern Munich news",
    "url": "https://fcbinside.com/2025/12/14/kompany-is-self-critical-we-made-mistakes/",
    "snippet": "<strong>Vincent Kompany only managed to secure a 2-2 draw with Bayern at home against Mainz</strong>. He is self-critical after the game.",
    "published": "2 days ago"
  }
]