[
  {
    "title": "Back on track after break-up, Seb Coe and his glamorous Los Angeles fiancee - as 68-year-old Olympian is set to wed for the third time | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/news/article-14878961/Back-track-break-Seb-Coe-glamorous-Los-Angeles-fiancee-68-year-old-Olympian-set-wed-time.html",
    "snippet": "Published: 20:15 EDT, 5 July 2025 | Updated: 20:42 EDT, 5 July 2025 · e-mail · 9 · View comments · <strong>Sebastian Coe is back on track to wed for the third time</strong>. The 68-year-old Olympian has ‘quietly reunited’ with glamorous Los Angeles PR ...",
    "published": "July 6, 2025"
  },
  {
    "title": "Olympic legend unveils romance to Lionel Richie’s ex-wife whose divorce cost singer £15m",
    "url": "https://www.gbnews.com/sport/olympics/olympic-legend-unveils-romance-lionel-richies-ex-wife",
    "snippet": "Alexander reportedly told a judge that they &quot;regularly spent in excess of $300,000 a month&quot; during their marriage. Olympic legend Sebastian Coe has unveiled his new romance with <strong>Diane Alexander</strong> |",
    "published": "1 week ago"
  },
  {
    "title": "Lord Sebastian Coe weds his long-term girlfriend",
    "url": "https://www.telegraph.co.uk/news/celebritynews/8617434/Lord-Sebastian-Coe-weds-his-long-term-girlfriend.html",
    "snippet": "Thank you for your interest. Unauthorised access is prohibited. To access this content, you must have prior permission and a valid contract. Please contact our team at licensing@telegraph.co.uk to discuss licensing options · If you are a Telegraph Subscriber, please contact customerservic...",
    "published": null
  },
  {
    "title": "Who is Sebastian Coe dating? Sebastian Coe girlfriend, wife",
    "url": "https://www.whosdatedwho.com/dating/sebastian-coe",
    "snippet": "6 July 2025... Sebastian Coe news, gossip, photos of Sebastian Coe, biography, Sebastian Coe girlfriend list 2025. Relationship history. Sebastian Coe relationship list. Sebastian Coe dating history, 2025, 2024, list of Sebastian Coe relationships.",
    "published": null
  },
  {
    "title": "Seb Coe splits from his wife after 13 years | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/tvshowbiz/article-149725/Seb-Coe-splits-wife-13-years.html",
    "snippet": "Olympic gold medallist Sebastian Coe, who received a life peerage for his services to William Hague, has <strong>parted from his wife Nicola after 13 years&#x27; marriage</strong>.",
    "published": "December 1, 2002"
  }
]