[
  {
    "title": "Unai Emery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Unai_Emery",
    "snippet": "After a career spent playing mostly in Spain&#x27;s Segunda División, Emery <strong>transitioned into coaching after retiring in 2004.</strong> He began at Lorca Deportiva, where he achieved promotion to the Segunda División in his first season. He then joined Almería, whom he led to promotion to La Liga for ...",
    "published": "2 days ago"
  },
  {
    "title": "Unai Emery - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/unaiemery/profil/trainer/5075",
    "snippet": "Avg. term as coach : 2.24 Years ... This is an overview of the career of a manager. ... Unai Emery is the grandson of Antonio Emery (---). Unai Emery is the nephew of Román Emery (---). Unai Emery is the son of Juan Emery (---). Unai Emery is the brother of Igor Emery (Chairman Real Unión Club).",
    "published": null
  },
  {
    "title": "Unai Emery Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/7247/unai-emery/overview",
    "snippet": "It is the second time he has taken charge of a Premier League club, having been <strong>head coach of Arsenal from May 2018 to November 2019.</strong> As a player, Emery spent much of his career in the lower leagues, however, he did appear five times in LaLiga for Real Sociedad during the 1995/96 season.",
    "published": null
  },
  {
    "title": "Unai Emery – Coach Notes",
    "url": "https://coachnotes.co.uk/blogs/blog/unai-emery",
    "snippet": "Born in Spain, Emery’s coaching journey <strong>began with Lorca and Almería before rising to prominence with Valencia</strong>, where he consistently overachieved in La Liga. He achieved continental success at Sevilla, winning three consecutive UEFA Europa ...",
    "published": "June 30, 2025"
  },
  {
    "title": "Unai Emery profile, stats and career history",
    "url": "https://www.sofascore.com/manager/unai-emery/53062",
    "snippet": "Unai Emery (54 years old) is current Aston Villa coach. Unai Emery manager profile is showing available manager’s data, such as average points per match, performance of his career results (win/draw/loss), career history and specific data like “time spent as manager” and “time spent ...",
    "published": null
  }
]