[
  {
    "title": "Hawker Siddeley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Siddeley",
    "snippet": "Hawker Siddeley Aircraft was <strong>formed in 1935</strong> as a result of the purchase by Hawker Aircraft of the companies of J. D. Siddeley, the automotive and engine builder Armstrong Siddeley and the aircraft manufacturer Armstrong Whitworth Aircraft. At this time, Hawker Siddeley also acquired A.V.",
    "published": "August 29, 2025"
  },
  {
    "title": "History of HAWKER SIDDELEY GROUP PUBLIC LIMITED COMPANY – FundingUniverse",
    "url": "https://www.fundinguniverse.com/company-histories/hawker-siddeley-group-public-limited-company-history/",
    "snippet": "<strong>In 1948 Sopwith renamed the firm the Hawker Siddeley Group</strong>, emphasizing that it would concentrate on two core business areas, industrial and aerospace production. In 1957 he began diversification outside aviation when Hawker Siddeley acquired ...",
    "published": null
  },
  {
    "title": "Hawker Siddeley",
    "url": "https://heritage.baesystems.com/page/hawker-siddeley",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "Hawker Siddeley Group PLC | Science Museum Group Collection",
    "url": "https://collection.sciencemuseumgroup.org.uk/people/ap17246/hawker-siddeley-group-plc",
    "snippet": "Hawker Siddeley Group PLC was initially formed as the Hawker Siddeley Aircraft Company on <strong>11th July 1935</strong>. The new company was established to acquire all of the shares of the Armstrong Siddeley Development Company and 50% of the shares of the ...",
    "published": null
  },
  {
    "title": "Hawker Aircraft - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Aircraft",
    "snippet": "In 1933, the company was renamed Hawker Aircraft Limited, and it took advantage of the Great Depression and a strong financial position to purchase the Gloster Aircraft Company in 1934. The next year, it merged with the engine and automotive company Armstrong Siddeley and its subsidiary, Armstrong Whitworth Aircraft, to form Hawker Siddeley Aircraft.",
    "published": "2 weeks ago"
  }
]