[
  {
    "title": "How does the political system function in Germany?",
    "url": "https://www.tatsachen-ueber-deutschland.de/en/politics-germany/political-system",
    "snippet": "Moreover it is the Chancellor who determines the number of ministries and their responsibilities… Read more › , federal ministers) <strong>the Federal President</strong> Federal President The Federal President is the head of state of the Federal Republic ...",
    "published": null
  },
  {
    "title": "Website of the Federal Government | Bundesregierung",
    "url": "https://www.bundesregierung.de/breg-en",
    "snippet": "The current Federal Government consists of <strong>Federal Chancellor Friedrich Merz</strong> and 17 Federal Ministers. Together, they constitute the Federal Cabinet. Here you can find their CVs and information about the respective ministries.",
    "published": null
  },
  {
    "title": "Politics of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Germany",
    "snippet": "The president does not have formal a veto, but the conditions for refusing to sign a law on the basis of unconstitutionality are the subject of debate. The office is currently held by <strong>Frank-Walter Steinmeier</strong> (since 2017). The federal president does have a role in the political system, especially ...",
    "published": "5 days ago"
  },
  {
    "title": "Germany - World Leaders",
    "url": "https://www.cia.gov/resources/world-leaders/foreign-governments/germany",
    "snippet": "Skip to main content · Go to CIA.gov · World Leaders · All Foreign Governments · Germany · Leaders and Cabinet Members · Last Updated: 5/9/2025 · Fed. Pres · <strong>Frank-Walter STEINMEIER</strong> · Chancellor",
    "published": null
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "Although the chancellor is theoretically free to choose any cabinet minister, in coalition governments the leadership of the second biggest coalition party usually designates one of their ministers for the position, whom the chancellor appoints accordingly. If the chancellor&#x27;s term in office ends or if they resign, the Bundestag has to elect a new chancellor. The president of Germany may ask the former chancellor to act as chancellor until a new office holder is elected, but if they are unwilling or unable to do so, the president may also appoint the vice chancellor as acting chancellor.",
    "published": "2 weeks ago"
  }
]