[
  {
    "title": "United States Department of State - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/United_States_Department_of_State",
    "snippet": "The department is headquartered in <strong>the Harry S Truman Building, a few blocks from the White House, in the Foggy Bottom neighborhood of Washington, D.C.</strong>; &quot;Foggy Bottom&quot; is thus sometimes used as a metonym. Established in 1789 as the first administrative arm of the U.S. executive branch, the ...",
    "published": "4 days ago"
  },
  {
    "title": "U.S. Department of State – Home",
    "url": "https://www.state.gov/",
    "snippet": "Joint Statement on the Seventh United States-Qatar Strategic Dialogue: An Enduring Strategic Partnership ... Secretary of State Marco Rubio and Paraguayan Foreign Minister Rubén Ramírez Lezcano at the United States-Paraguay Status of Forces Agreement Signing Ceremony",
    "published": "2 days ago"
  },
  {
    "title": "U.S. Department of State in Washington, DC United States - Apple Maps",
    "url": "https://maps.apple.com/place?auid=9883889907076538582",
    "snippet": "View details about U.S. Department of State in <strong>Washington, DC</strong> United States on Apple Maps. Address, driving directions, images, nearby attractions and more.",
    "published": null
  },
  {
    "title": "Harry S Truman Building - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Harry_S_Truman_Building",
    "snippet": "It is located in <strong>Washington, D.C.</strong>, and houses the office of the United States secretary of state. The Truman Building is located in the Foggy Bottom neighborhood at 2201 C Street NW, bounded by C Street ...",
    "published": "October 16, 2025"
  },
  {
    "title": "US Department of State, 2201 C Street Northwest, Ste 4, Washington, District of Columbia 20520, US - MapQuest",
    "url": "https://www.mapquest.com/us/district-of-columbia/us-department-of-state-350779135",
    "snippet": "The United States Department of State library, located in <strong>Washington, D.C.</strong>, serves as a vital resource for research and information related to international relations and diplomacy. It houses a vast collection of documents, books, and digital resources that support the work of government officials, ...",
    "published": null
  }
]