[
  {
    "title": "Paris Saint-Germain FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris_Saint-Germain_FC",
    "snippet": "Paris Saint-Germain are the most popular football club in France, accounting for 22% of the country&#x27;s fan base. With an estimated 35 million fans, PSG are also one of the most followed teams in the world. The <strong>Parc des Princes</strong> has been its home ground since July 1974.",
    "published": "20 hours ago"
  },
  {
    "title": "Parc des Princes (2025) - All You Need to Know BEFORE You Go (with Reviews)",
    "url": "https://www.tripadvisor.com/Attraction_Review-g187147-d2485740-Reviews-Parc_des_Princes-Paris_Ile_de_France.html",
    "snippet": "First time we visit the Paris Saint-Germain (PSG) football stadium, the tour takes place at the <strong>Parc des Princes</strong>, Paris’ iconic sports facility located in the Paris district of Paris.",
    "published": null
  },
  {
    "title": "Parc des Princes - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Parc_des_Princes",
    "snippet": "It is located in the southwest of the French capital, within the 16th arrondissement, directly opposite the <strong>Stade Jean-Bouin</strong>. The stadium, with a seating capacity of 47,929 spectators, has been the home of French football club Paris Saint-Germain FC (PSG) since July 1974.",
    "published": "November 21, 2025"
  },
  {
    "title": "Paris Saint-Germain exploring options for new stadium",
    "url": "https://www.sportsbusinessjournal.com/Articles/2025/12/12/paris-saint-germain-exploring-options-for-new-stadium/",
    "snippet": "Ligue 1 club Paris Saint-Germain said that it is more determined than ever to leave the <strong>Parc des Princes</strong>, which it feels it has outgrown, and it is exploring steps toward building a new stadium in the Paris area.",
    "published": "1 week ago"
  },
  {
    "title": "Paris Saint-Germain - Stadium - Parc des Princes | Transfermarkt",
    "url": "https://www.transfermarkt.com/paris-saint-germain/stadion/verein/583",
    "snippet": "In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights. The drop-down menu above the basic facts allows you to look at former stadiums (clubs) or other home grounds (national teams).",
    "published": null
  }
]