[
  {
    "title": "President's wife news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/wife",
    "snippet": "In the Kharkiv region, First Lady of Ukraine Olena Zelenska <strong>took part in the launch of a kitchen factory opened as part of the school nutrition reform</strong>. 5 December 2025 - 17:44 · Three more Ukrainian-language audio guides have been launched ...",
    "published": "1 day ago"
  },
  {
    "title": "Olena Zelenska Took Part in the Opening of a Kitchen Factory in the Kharkiv Region — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/na-harkivshini-olena-zelenska-vzyala-uchast-u-vidkritti-fabr-101925",
    "snippet": "News · President&#x27;s wife · 11 December 2025 - 20:18 · In the Kharkiv region, First Lady of Ukraine Olena Zelenska <strong>took part in the launch of a kitchen factory opened as part of the school nutrition reform</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "The Olena Zelenska Foundation Opened the First “12–21” Youth Space in Bila Tserkva — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/fundaciya-oleni-zelenskoyi-vidkrila-pershij-molodizhnij-pros-101965",
    "snippet": "News · President&#x27;s wife · 12 December 2025 - 21:09 · <strong>The first youth space of the “12–21” network, created by the Olena Zelenska Foundation, has opened in Bila Tserkva</strong>. This is a barrier-free center designed for leisure, peer-to-peer ...",
    "published": "1 week ago"
  },
  {
    "title": "Olena Zelenska Met with Youth Mental Health Centre Representatives in Ireland — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/olena-zelenska-v-irlandiyi-zustrilasya-z-predstavnikami-cent-101753",
    "snippet": "News · President&#x27;s wife · 2 December 2025 - 22:30 · <strong>During her visit to Ireland, First Lady of Ukraine Olena Zelenska met with representatives of JIGSAW, the National Centre for Youth Mental Health</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "First Lady of Ukraine Olena Zelenska is welcomed to Trinity - The School of English | Trinity College Dublin",
    "url": "https://www.tcd.ie/english/news/news-2024/first-lady-of-ukraine-olena-zelenska-is-welcomed-to-trinity/",
    "snippet": "The First Lady of Ukraine, Olena Zelenska, <strong>visited Trinity College on Tuesday 2nd December 2025</strong>. During her visit she viewed the Book of Kells and Long Room exhibits and gifted a set of Ukrainian books to the library collection. Trinity has many academic links with Ukraine, including an Erasmus+ ...",
    "published": null
  }
]