[
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "<strong>Born 27 March 1955 in Santiago de Compostela, in the Galician province of A Coruña, in Spain</strong>, Rajoy is the grandson of Enrique Rajoy Leloup, one of the architects of the Galician Statute of Autonomy (1936) (Estatuto de autonomía de Galicia), who was removed from university teaching by the ...",
    "published": "March 8, 2004"
  },
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "Mariano Rajoy, <strong>Spanish politician who served as prime minister of Spain from 2011 to 2018</strong>. He took office amid the European debt crisis and implemented harsh but effective austerity measures.",
    "published": "December 6, 2011"
  },
  {
    "title": "Mariano Rajoy - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1775577/bio/",
    "snippet": "Mariano Rajoy Brey is a Spanish politician who <strong>served as Prime Minister from 2011 to 2018</strong>. A member of the conservative People&#x27;s Party (PP), he previously held several ministerial roles and was party leader from 2004 to 2018.",
    "published": null
  },
  {
    "title": "La Moncloa. 26/09/2018. Mariano Rajoy Brey [Presidents since 1978]",
    "url": "https://www.lamoncloa.gob.es/lang/en/presidente/presidents/Paginas/marianorajoy_BIO.aspx",
    "snippet": "26 September 2018. Place of birth: Santiago de Compostela (A Coruña)<strong>Date of birth: 27 March 1955</strong>Education: Bachelor of Law from the University of Santiago de CompostelaMarried with two children",
    "published": null
  },
  {
    "title": "Mariano Rajoy | Historica Wiki | Fandom",
    "url": "https://historica.fandom.com/wiki/Mariano_Rajoy",
    "snippet": "Mariano Rajoy (born 27 March 1955) was <strong>Prime Minister of Spain from 20 December 2011 to 1 June 2018,</strong> succeeding Jose Luis Rodriguez Zapatero and preceding Pedro Sanchez. Leader of the People&#x27;s Party of Spain from 2004, he was forced to resign ...",
    "published": "October 29, 2024"
  }
]