[
  {
    "title": "Petro Poroshenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Petro_Poroshenko",
    "snippet": "In November 2014, he became a People&#x27;s Deputy of Ukraine with 64.04% of votes in constituency No.12. Poroshenko became a grandfather on the day of his presidential inauguration, 7 June 2014. His wife is actively involved in the activities of the Petro Poroshenko Charity Foundation.",
    "published": "1 week ago"
  },
  {
    "title": "Maryna Poroshenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Maryna_Poroshenko",
    "snippet": "<strong>Maryna Anatoliyvna Poroshenko</strong> (Ukrainian: Марина Анатоліївна Порошенко, née Perevedentseva; born 1 February 1962) is a Ukrainian cardiologist who served as First Lady of Ukraine from 2014 to 2019, as wife of President Petro Poroshenko.",
    "published": "November 9, 2025"
  },
  {
    "title": "Who Is Petro Poroshenko Wife Maryna Poroshenko? Four Kids, Net Worth And Instagram",
    "url": "https://pimiso.com/petro-poroshenko-wife-maryna-poroshenko-kids-net-worth-and-instagram",
    "snippet": "Petro Poroshenko Wife <strong>Maryna Poroshenko</strong> is the first lady of Ukraine who has been happily married to the former president for over thirty-seven years.",
    "published": null
  },
  {
    "title": "First Lady of Ukraine, wife of Poroshenko, who is she? - First Lady of Ukraine: Who is Maryna Poroshenko and what does she do - 112.international",
    "url": "https://112.international/article/first-lady-of-ukraine-who-is-maryna-poroshenko-and-what-does-she-do-38640.html",
    "snippet": "But only voters can decide whether Poroshenko is going to become the president for the second time. And we will talk about the First Lady, wife of Petro Poroshenko, <strong>Maryna Poroshenko</strong>.",
    "published": "April 19, 2019"
  },
  {
    "title": "What we learned from Ukrainian officials’ wealth disclosures",
    "url": "https://kyivindependent.com/what-we-learned-from-ukrainian-officials-wealth-disclosures/",
    "snippet": "Ukrainian President Petro Poroshenko and his wife, <strong>Maryna Poroshenko</strong>, pray during the Orthodox Christmas service at St. Sophia Cathedral in Kyiv, Ukraine, on Jan.",
    "published": "May 1, 2025"
  }
]