[
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: ... banned opposition political party in Russia founded on 15 December 2012 by Leonid Volkov and later refounded on <strong>19 May 2018</strong> by Alexei Navalny, who was also the founder of the non-profit organisation Anti-Corruption Foundation....",
    "published": "1 month ago"
  },
  {
    "title": "The founding father of a future Russia - Engelsberg ideas",
    "url": "https://engelsbergideas.com/notebook/the-founding-father-of-a-future-russia/",
    "snippet": "It understands Putin and Putinism is ultimately unsustainable. If and when Russia returns to democratisation, Navalny will be seen as – if not fully in the words of the writer Mikhail Zygar, who last week called Navalny ‘the founder of the future modern Russia’ – then certainly one of its founding fathers.",
    "published": "February 22, 2024"
  },
  {
    "title": "Russia of the Future",
    "url": "https://grokipedia.com/page/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: Россия Будущего) is an unregistered opposition political party in Russia, founded by Alexei Navalny on <strong>May 19, 2018,</strong> as a rebranding of the Progress Party to advance anti-corruption efforts and liberal ...",
    "published": null
  },
  {
    "title": "Alexei Navalny, Russia",
    "url": "https://www.europarl.europa.eu/cmsdata/240834/Profile%20of%20the%202021%20Sakharov%20Prize%20nominee,%20Alexei%20Navalny.pdf",
    "snippet": "Alexei Navalny is a Russian opposition ... Coordination Council and is the leader of the Russia of the Future party as · well as the <strong>founder of the Anti-Corruption Foundation (FBK).</strong>...",
    "published": null
  },
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Alexei Anatolyevich Navalny (Russian: ... leader, anti-corruption activist and political prisoner. He founded <strong>the Anti-Corruption Foundation (FBK) in 2011.</strong>...",
    "published": "1 week ago"
  }
]