[
  {
    "title": "Succession to the Saudi Arabian throne - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Succession_to_the_Saudi_Arabian_throne",
    "snippet": "The order of succession to the Saudi Arabian throne is determined by, and within, the House of Saud. <strong>Every King of Saudi Arabia, upon his death, has been succeeded by the crown prince</strong>, with a new crown prince then being appointed according to a loose form of agnatic seniority among the sons ...",
    "published": "September 24, 2025"
  },
  {
    "title": "House of Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/House_of_Saud",
    "snippet": "However, in June 2017, Salman elevated ... to the throne, and making the next succession from father to son, for the first time since 1953, when <strong>Saud bin Abdulaziz Al Saud</strong> succeeded his father, the founder of Saudi Arabia, Ibn Saud....",
    "published": "1 month ago"
  },
  {
    "title": "SUDDEN SUCCESSION Examining the Impact of Abrupt Change in the Middle East",
    "url": "https://www.washingtoninstitute.org/media/4172",
    "snippet": "Table 1. Saudi main line of succession · W W W . W A S H I N G T O N I N S T I T U T E . O R G \b ... King Khalid had been Faisal’s crown prince. Kha­ ... Fahd eventually died in 2005, at age eighty-four. ... King Abdullah died in 2015 at age ninety-two. ... Table 2. Effective years of leadership ...",
    "published": null
  },
  {
    "title": "Saudi Royal Transition: Why, What, and When? | The Washington Institute",
    "url": "https://www.washingtoninstitute.org/policy-analysis/saudi-royal-transition-why-what-and-when",
    "snippet": "Since Ibn Saud captured the holy cities of Mecca and Medina in 1925, successive rulers have taken responsibility for the Islamic shrines. King Fahd formalized this role in 1986, changing his title from &quot;majesty&quot; to &quot;Custodian of the Two Holy Places.&quot; Retaining the religious title but relinquishing political leadership would be consistent with the sense that the former is more important -- a key ingredient in Saudi Arabia&#x27;s claim to leadership of the wider Arab and Muslim worlds.",
    "published": null
  },
  {
    "title": "MEED | Government structure in Saudi Arabia",
    "url": "https://www.meed.com/government-structure-in-saudi-arabia/",
    "snippet": "<strong>The king nominates up to three candidates to be crown prince</strong>. The Allegiance Council then selects one, or it can nominate its own candidate. The issue of succession is one of the most contentious issues in Saudi politics due to the age and ill ...",
    "published": "October 9, 2012"
  }
]