[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "This agreement was signed on 5 May 2025, after internal party votes on a government coalition were approved in the three parties in the weeks before. On 6 May, when the first round of voting took place, Merz was not confirmed as the next chancellor when he unexpectedly failed to achieve an absolute majority in parliament with only 310 votes in favour of his leadership out of a required 316 out of 630 votes. It was the first time in German ...",
    "published": "2 days ago"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "Ten people (nine men and one woman) have served as chancellor of the Federal Republic of Germany, the first being <strong>Konrad Adenauer</strong> from 1949 to 1963. (Another 26 men had served as &quot;Reich chancellors&quot; of the previous German Empire from 1871 to 1945.) The current officeholder is Friedrich Merz ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Germany's Merz becomes chancellor after surviving historic vote failure",
    "url": "https://www.bbc.com/news/articles/cvgp22zlrgko",
    "snippet": "The result meant a total debacle had been averted, declared one German news website. Merz, 69, was then sworn in as chancellor by President Frank-Walter Steinmeier, and his team of 17 ministers were due to take office.",
    "published": "May 6, 2025"
  },
  {
    "title": "Olaf Scholz | Facts, Biography, Cabinet, & Chancellor of Germany | Britannica",
    "url": "https://www.britannica.com/biography/Olaf-Scholz",
    "snippet": "CDU leader <strong>Friedrich Merz</strong> was poised to become chancellor when, on May 6, 2025, he was voted down on the first ballot in parliament. Such an event had not taken place since the restoration of democracy to West Germany in 1949, and there was ...",
    "published": "March 31, 2022"
  },
  {
    "title": "The Federal Chancellor of the Federal Republic of Germany | Home page",
    "url": "https://www.bundeskanzler.de/bk-en",
    "snippet": "The website of Federal Chancellor <strong>Olaf Scholz</strong>. Here you can find out more about the Federal Chancellor, his activities and the responsibilities of the Federal Chancellery.",
    "published": null
  }
]