[
  {
    "title": "Europe ready to lead ‘multinational force’ in Ukraine as part of US peace plan | Ukraine | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/ukraine-talks-european-leaders-meet-berlin-starmer-macron-zelenskyy-merz-us-witkoff",
    "snippet": "Trump told reporters in the Oval Office on Monday he had “very long and very good” talks with Ukrainian counterpart Volodymyr Zelenskyy and European and Nato leaders, adding: “We had numerous conversations with President Putin of Russia, and I think we’re closer now than we have been ever, and we’ll see what we can do.”",
    "published": "6 hours ago"
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "15 December 2025 - 21:48 · <strong>The Ukrainian side is ready to continue working with maximum quality, constructively and honestly, so that the final agreement on establishing peace is strong</strong>.",
    "published": "13 hours ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "In December 2024, Zelenskyy resisted pressure from the Biden administration to lower the conscription age to 18 to replace Ukraine&#x27;s battlefield losses. In February 2025, he said that <strong>Ukraine would introduce special military contracts for volunteers aged 18 to 24.</strong>",
    "published": "1 day ago"
  },
  {
    "title": "Russia-Ukraine Live: Trump Gives Zelensky New Deadline On Peace Plan—Report - Newsweek",
    "url": "https://www.newsweek.com/russia-ukraine-live-updates-news-nato-zelensky-trump-putin-11178524",
    "snippet": "Donald Trump’s envoys have given Ukrainian President Volodymyr Zelensky a new deadline to respond to its proposed peace plan, unnamed officials told the Financial Times. Zelensky has just days to decide whether to accept the U.S.",
    "published": "1 week ago"
  },
  {
    "title": "Ukraine-Russia war latest: Moscow refuses to give up land | The ...",
    "url": "https://independent.co.uk/news/world/europe/ukraine-russia-war-putin-trump-zelensky-nato-live-b2883791.html",
    "snippet": "Ukrainian President Volodymyr Zelenskyy and about 30 other countries are expected to approve plans to create a compensation body for damages caused by the Russian invasion · James Reynolds16 December 2025 10:40 · Ukraine’s Zelensky told reporters that Ukrainian and US teams could look to build on their work in Berlin with more talks in the US this weekend.",
    "published": "9 minutes ago"
  }
]