[
  {
    "title": "BC Partners to acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/bc-partners-acquire-com-hem",
    "snippet": "I am convinced that we, with BC Partners as our new owner, will further develop our already strong position on the Swedish market”, says Tomas Franzén, CEO at Com Hem. Carlyle and Providence acquired Com Hem from EQT in 2006 and, in the same year, they acquired UPC, which was integrated with Com Hem.",
    "published": null
  },
  {
    "title": "BC Partners to acquire Com Hem — BC Partners",
    "url": "https://www.bcpartners.com/news/bc-partners-to-acquire-com-hem/",
    "snippet": "I am convinced that we, with BC Partners as our new owner, will further develop our already strong position on the Swedish market,*” says Tomas Franzén, CEO at Com Hem. Carlyle and Providence acquired Com Hem from EQT in 2006 and, in the same year, they acquired UPC, which was integrated with Com Hem.",
    "published": "April 28, 2025"
  },
  {
    "title": "BC Partners - 2025 Investor Profile, Portfolio, Team & Exits - Tracxn",
    "url": "https://tracxn.com/d/private-equity/bc-partners/__Qik_uYeUiUViOWrvdusErwMyiuQ6_f5AqPg9eQMI41k",
    "snippet": "<strong>As of Dec 2025, BC Partners has a portfolio of 146 companies, comprising 82 funding rounds and 68 acquisitions</strong>. In the last 12 months, it has participated in 2 acquisitions. The firm primarily invests in companies based in United States and ...",
    "published": "2 weeks ago"
  },
  {
    "title": "BC Partners agrees to sell remaining stake in Com Hem — BC Partners",
    "url": "https://www.bcpartners.com/news/bc-partners-agrees-to-sell-remaining-stake-in-com-hem/",
    "snippet": "During our ownership, BC Partners enjoyed working closely with the company’s strong management team in growing and future-proofing the business, cementing Com Hem’s position as the leading digital communications provider in Sweden, and enabling it to play a key role in the country’s converging communication landscape.",
    "published": "April 28, 2025"
  },
  {
    "title": "BC Partners - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/BC_Partners",
    "snippet": "In August 2025, the firm attracted international scrutiny after leaked recordings showed executives of its portfolio company United Group discussing cooperation with state-owned Telekom Srbija and Serbian President Aleksandar Vučić in ways that could weaken United Media, the country’s last major independent broadcaster.",
    "published": "October 22, 2025"
  }
]