[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: one to do business in the United States and legally named Regency Entertainment (USA), Inc., one to do business overseas and legally named Monarchy Enterprises S.á.r.l.",
    "published": "4 days ago"
  },
  {
    "title": "Arnon Milchan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Arnon_Milchan",
    "snippet": "Arnon Milchan (Hebrew: ארנון מילצ&#x27;ן; December 6, 1944) is an Israeli billionaire businessman, film producer and former spy. He has been involved in over 130 full-length motion pictures and is the <strong>founder of production company Regency Enterprises</strong>. Regency&#x27;s film credits include 12 ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Arnon Milchan",
    "url": "https://www.forbes.com/profile/arnon-milchan/",
    "snippet": "That may change soon, as she&#x27;s up for Best Actress in a Supporting Role at the 87th Academy Awards. Here’s a rundown on the data FORBES has collected on her in recent years. ... &amp;nbsp; Arnon Milchan&#x27;s New Regency Productions made the critically-acclaimed Birdman, which is currently the odds-on favorite to win Best Picture.",
    "published": null
  },
  {
    "title": "Arnon Milchan | Producer, Additional Crew, Actor",
    "url": "https://www.imdb.com/name/nm0586969/",
    "snippet": "After the incredible successes of his films &quot;Pretty Woman&quot; and &quot;The War of the Roses,&quot; Milchan founded New Regency Productions and went on to produce countless critical and box office successes including &quot;J.F.K,&quot; &quot;A Time to Kill,&quot; &quot;Free Willy,&quot; &quot;The Client,&quot; &quot;Tin Cup,&quot; &quot;Under Siege,&quot; &quot;The Devil&#x27;s Advocate,&quot; &quot;The Negotiator,&quot; &quot;City of Angels,&quot; &quot;Entrapment,&quot; &quot;Fight Club,&quot; &quot;Big Momma&#x27;s House,&quot; &quot;Don&#x27;t Say a Word,&quot; &quot;Daredevil,&quot; &quot;Man on Fire,&quot; &quot;Mr.",
    "published": null
  },
  {
    "title": "Regency Enterprises (Creator) - TV Tropes",
    "url": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/RegencyEnterprises",
    "snippet": "Arnon Milchan rebranded Regency International Pictures and renamed it to <strong>Regency Enterprises</strong>. In addition to signing a distribution deal with Warner Bros., a subsidiary company New Regency Productions was also created.",
    "published": "October 2, 2025"
  }
]