[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "LFI was confirmed as the largest party of the French left in the 2024 French legislative election, where the left-wing New Popular Front (NFP) achieved a plurality of seats and LFI was confirmed as the largest left-wing group in the National Assembly. Mélenchon was born in Tangier (Tangier International Zone), Morocco. His father, Georges, was a postmaster of Spanish descent, and his mother, Jeanine Bayona, was a primary school teacher of Spanish and Sicilian descent.",
    "published": "1 week ago"
  },
  {
    "title": "Jean-Luc Mélenchon Casts a Long Shadow Over the Stagnant French Left",
    "url": "https://foreignpolicy.com/2025/04/25/melenchon-french-left-politics-progressive-coalition-2027-election/",
    "snippet": "Founder of left-wing party <strong>La France Insoumise (LFI)</strong> Jean-Luc Melenchon following the first results of the second round of France&#x27;s legislative election in Paris on July 7, 2024.",
    "published": "May 13, 2025"
  },
  {
    "title": "Who Is Jean-Luc Melenchon? All About The New Popular Front Leader | Europe - Times Now",
    "url": "https://www.timesnownews.com/world/europe/who-is-jean-luc-melenchon-age-family-daughter-net-worth-controversies-new-popular-union-article-111560066",
    "snippet": "Jean-Luc Melenchon, born on August 19, 1951, in Tangier, Morocco, is the son of a postmaster and a primary school teacher.After working as a teacher for a while, Melenchon entered politics in September 1976 and joined the <strong>Socialist Party (PS).</strong>",
    "published": "July 7, 2024"
  },
  {
    "title": "French elections: Who is Mélenchon and what does his Nupes alliance want?",
    "url": "https://www.bbc.com/news/world-europe-61737537",
    "snippet": "A veteran firebrand of France&#x27;s far left, Jean-Luc Mélenchon has a strong chance of depriving President Emmanuel Macron of controlling the next government. He leads an alliance of <strong>far-left, left and green parties</strong> that took the president&#x27;s centrist ...",
    "published": "June 15, 2022"
  },
  {
    "title": "8th parliamentary term | Jean-Luc MÉLENCHON | MEPs | European Parliament",
    "url": "https://www.europarl.europa.eu/meps/en/96742/JEAN-LUC_MELENCHON/history/8",
    "snippet": "Jean-Luc MÉLENCHON · France · Date of birth : 19-08-1951, Tanger · 01-07-2014 / 18-06-2017 : <strong>Confederal Group of the European United Left - Nordic Green Left</strong> - Member · 01-07-2014 / 18-06-2017 : Front de Gauche (France) 01-07-2014 / 18-01-2017 ...",
    "published": null
  }
]