[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Singh was <strong>initially educated at a local gurdwara, where he began studying Urdu and Punjabi</strong>. On 17 April 1937, he was enrolled in the local Government Primary School, where he continued his Urdu-medium education until the age of 10 (Class 4), after which he and his family moved to Peshawar.",
    "published": "2 days ago"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "Manmohan Singh was born on September 26, 1932, in a village in the Punjab province of undivided India. He <strong>completed his Matriculation examinations from Punjab University in 1948</strong>. His illustrious academic journey took him from Punjab to the University of Cambridge, UK, where he earned a First ...",
    "published": null
  },
  {
    "title": "Manmohan Singh Education: Former PM Schooling, Colleges, Degrees and Academic Achievements",
    "url": "https://www.jagranjosh.com/articles/manmohan-singh-education-qualification-1735280163-1",
    "snippet": "Dr. Manmohan Singh began his educational journey in Gah, a small village in Punjab (now in Pakistan). <strong>He attended the local primary school in his village</strong>.",
    "published": "December 27, 2024"
  },
  {
    "title": "CURRICULUM VITAE DR. MANMOHAN SINGH PRIME MINISTER OF INDIA ACADEMIC RECORD",
    "url": "https://www.visvabharati.ac.in/files/6340200114_Manmohan.pdf",
    "snippet": "DR. MANMOHAN SINGH",
    "published": null
  },
  {
    "title": "Former Dr. Manmohan Singh Biography: Age, Education, Political Career, Awards and Honours",
    "url": "https://www.jagranjosh.com/general-knowledge/dr-manmohan-singh-biography-1727329371-1",
    "snippet": "Manmohan Singh <strong>started his education at Panjab University, receiving his Bachelor of Arts and Master of Arts degrees in Economics in 1952 and 1954, respectively</strong>. From here he came to the University of Cambridge and in 1957 received a First Class ...",
    "published": "December 27, 2024"
  }
]