[
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "Despite often scoring low approval ratings, <strong>his government was re-elected in a landslide victory in the 2025 election</strong>, resulting in one of the largest Labor governments in Australian history. In his second term, Albanese reduced university education fees, expanded programs to combat Australia&#x27;s ...",
    "published": "9 hours ago"
  },
  {
    "title": "Australian prime minister Albanese becomes first to wed in office",
    "url": "https://www.bbc.com/news/articles/ce865kpdzz8o",
    "snippet": "Albanese, 62, and <strong>Jodie Haydon</strong>, 47, first met at a business dinner in Melbourne in 2020, while he was leader of the opposition. ... She appeared during Albanese&#x27;s 2022 and 2025 election campaigns, and was seen alongside the PM at major events, ...",
    "published": "2 weeks ago"
  },
  {
    "title": "2025 Australian federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Australian_federal_election",
    "snippet": "Two lower house seats were made vacant prior to the election; Liberal National MP Keith Pitt, who sat in the Nationals party room, resigned as the member for Hinkler on 19 January 2025, and the following day Labor MP Bill Shorten resigned as the member for Maribyrnong. With their resignations occurring close to the federal election, by-elections were not held. Both major parties retained their leaders throughout the duration of the 47th Parliament, with Anthony Albanese having served one full term as prime minister and a second consecutive term as leader of the Labor Party, while Peter Dutton completed his first full term as Opposition Leader and leader of the Liberal Party.",
    "published": "1 day ago"
  },
  {
    "title": "Federal election 2025: Only a third of Australians think Anthony Albanese should be re-elected for second term | The Nightly",
    "url": "https://thenightly.com.au/politics/federal-election-2025/federal-election-2025-only-a-third-of-australians-think-anthony-albanese-should-be-re-elected-for-second-term-c-17742109",
    "snippet": "Just a third of Australians believe the Albanese Government should be re-elected for a second term, as Labor braces for a Federal election within months.",
    "published": "February 16, 2025"
  },
  {
    "title": "Australia Elections 2025: Albanese re-elected by a country under economic and environmental stress - The Hindu",
    "url": "https://www.thehindu.com/data/australia-elections-2025-albanese-re-elected-by-a-country-under-economic-and-environmental-stress/article69552912.ece",
    "snippet": "The Australian election is over, and <strong>the centre-left Labor Party has been re-elected</strong>. Prime Minister Anthony Albanese becomes the first Australian leader in over two decades to secure a second term.",
    "published": "May 10, 2025"
  }
]