[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "On 18 June 2015 Yanukovych was officially deprived of the title of President of Ukraine. The 2019 election took place on 31 March, with a run-off on 21 April. As a result of this election, Volodymyr Zelenskyy, a former actor and comedian with no prior political experience, became the sixth President of Ukraine, scoring a record 73.22% of the popular vote in the run-off against incumbent Poroshenko.",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "Every president of Ukraine except for Volodymyr Zelenskyy has been a People&#x27;s Deputy of the Verkhovna Rada prior to their election, with <strong>Kuchma, Yushchenko, and Yanukovych</strong> all previously serving as Prime Minister and Kravchuk as well as acting ...",
    "published": "6 days ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "Various foreign officials attended ... Šefčovič (EU), and Rick Perry (United States). Zelenskyy is the first Jewish president of Ukraine; with <strong>Volodymyr Groysman</strong> as prime minister, Ukraine became the first country other than Israel to simultaneously have a Jewish head of state ...",
    "published": "4 days ago"
  },
  {
    "title": "Tracking Ukraine's Former Presidents During The War: Stepping Up Or Ducking Out? - Worldcrunch",
    "url": "https://worldcrunch.com/focus/russia-ukraine-war/former-ukraine-president/",
    "snippet": "Others appear to be involved in the fight intermittently. Lastly, some consistently provide aid to the Ukrainian armed forces and remain active on the international scene. Before current President Volodymyr Zelensky, there were five presidents of Ukraine since the country gained independence in 1991.",
    "published": "May 21, 2025"
  },
  {
    "title": "List of Presidents of Ukraine (1991 - 2022)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-presidents-of-ukraine-1646021751-1",
    "snippet": "On 1 December 1991, the first election of the President of Ukraine took place and was won by <strong>Leonid Kravchuk</strong>.",
    "published": "February 28, 2022"
  }
]