[
  {
    "title": "Politics of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Kyrgyzstan",
    "snippet": "However, despite the backing of major Western donors, including the International Monetary Fund (IMF), Kyrgyzstan had consequential economic difficulties from the outset. These came mainly as a result of the breakup of the Soviet trade bloc, which impeded the Republic&#x27;s smooth transfer to a free-market economy. In 1993, allegations of corruption against Akayev&#x27;s closest political associates blossomed into a major scandal.",
    "published": "3 weeks ago"
  },
  {
    "title": "Kyrgyzstan - Politics, Society, Culture | Britannica",
    "url": "https://www.britannica.com/place/Kyrgyzstan/Government-and-society",
    "snippet": "6, 2025 •History ... <strong>Kyrgyzstan is a unitary multiparty republic with one legislative house</strong>. Its 1993 constitution, which replaced the Soviet-era constitution that had been in effect since 1978, recognized numerous rights and freedoms for citizens.",
    "published": "July 26, 1999"
  },
  {
    "title": "Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kyrgyzstan",
    "snippet": "<strong>After independence, Kyrgyzstan was officially a unitary presidential republic</strong>. Following the Tulip Revolution it became a unitary parliamentary republic; however, it gradually developed an executive president and was governed as a semi-presidential republic before reverting to a presidential ...",
    "published": "May 11, 2001"
  },
  {
    "title": "ALERT SERIES KYRGYZSTAN POLITICAL CONDITIONS IN THE POST-SOVIET ERA",
    "url": "https://hrlibrary.umn.edu/ins/kyrgyz93.pdf",
    "snippet": "Helsinki Commission notes that it was originally a coalition of several political parties. ... The Atameken [`Fatherland&#x27;] Party split off from Erkin Kyrgyzstan in 1992.",
    "published": null
  },
  {
    "title": "Kyrgyzstan (10/01)",
    "url": "https://2009-2017.state.gov/outofdate/bgn/kyrgyzstan/19356.htm",
    "snippet": "The following January, Akayev ... of younger, reform-oriented politicians. <strong>In December 1990 the Supreme Soviet voted to change the republic&#x27;s name to the Republic of Kyrgyzstan</strong>. (In 1993, it became the Kyrgyz Repub...",
    "published": null
  }
]