[
  {
    "title": "Alphabet Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
    "snippet": "<strong>Alphabet Inc.</strong> is an American multinational technology conglomerate holding company headquartered in Mountain View, California. Alphabet is the world&#x27;s third-largest technology company by revenue, after Amazon and Apple, the largest technology company by profit, and one of the world&#x27;s most valuable ...",
    "published": "1 week ago"
  },
  {
    "title": "Top Alphabet (Google) Shareholders",
    "url": "https://www.investopedia.com/articles/markets/011516/top-5-google-shareholders-goog.asp",
    "snippet": "Class C shares (GOOG) are held by investors and company employees. These shares do not offer investors any voting rights. <strong>Alphabet is a holding company</strong>. It owns the popular search engine Google.",
    "published": "July 10, 2024"
  },
  {
    "title": "Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Google",
    "snippet": "Together, they own about 14% of its publicly listed shares and control 56% of its stockholder voting power through super-voting stock. The company went public via an initial public offering (IPO) in 2004. In 2015, Google was reorganized as a wholly owned subsidiary of <strong>Alphabet Inc</strong>.",
    "published": "3 days ago"
  },
  {
    "title": "The REAL Power: Who Owns 51% of Google?",
    "url": "https://surgegraph.io/business/who-owns-51-of-google",
    "snippet": "... <strong>No single person or organization holds a controlling stake in Google</strong>. Ownership is spread across a wide range of shareholders, from its founders Larry Page and Sergey Brin to numerous individual and institutional investors.",
    "published": null
  },
  {
    "title": "Who Owns Google in 2025? Read about Alphabet Inc.!",
    "url": "https://www.jagranjosh.com/us/explainers/who-is-the-owner-of-google-1860000139",
    "snippet": "<strong>The Alphabet Inc.</strong> was created on October 2, 2015, as a holding company for Google and its various other ventures. The idea behind Alphabet was to make the diverse collection of businesses &quot;cleaner and more accountable&quot; for their operations.",
    "published": "September 20, 2025"
  }
]