[
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "During a second tenure as prime minister, he pledged to investigate the 1MDB scandal, combat corruption, and cut spending on large infrastructure projects. He also secured the pardon and release of Anwar Ibrahim. Mahathir resigned in 2020 amidst a political crisis. Despite losing his parliamentary seat in the 2022 general election, he remained active in politics and shifted party affiliation several times.",
    "published": "3 days ago"
  },
  {
    "title": "Malaysia’s ex-PM Mahathir quits Pejuang party he founded, picks GTA as new political platform | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/malaysia-ex-pm-mahathir-quits-the-pejuang-party-he-founded-chooses-gta-as-new-political-platform",
    "snippet": "KUALA LUMPUR - Malaysia’s former premier Mahathir Mohamad has quit <strong>Parti Pejuang Tanah Air</strong>, a Malay party he founded just over two years ago, indicating a split in political direction with his son Mukhriz Mahathir, who currently heads the party.",
    "published": "November 22, 2024"
  },
  {
    "title": "Former Malaysian PM Mahathir joins little-known party Putra | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/former-malaysian-pm-mahathir-joins-little-known-party-putra",
    "snippet": "Former Malaysian prime minister Mahathir Mohamad has joined little-known <strong>Parti Bumiputera Perkasa Malaysia (Putra).</strong>",
    "published": "November 25, 2024"
  },
  {
    "title": "Nearly 100, Malaysia’s Mahathir Mohamad Reflects on Trump and Today’s World | TIME",
    "url": "https://time.com/7282169/mahathir-mohamad-malaysia-prime-minister-hundred-years-trump-world-interview/",
    "snippet": "In clawing back power from Malaysia’s nine royal families, Mahathir consolidated power in the position of Prime Minister as well as the president of UMNO, its oldest national political party.",
    "published": "May 2, 2025"
  },
  {
    "title": "Mahathir Mohamad: Latest News and Updates | South China Morning Post",
    "url": "https://www.scmp.com/topics/mahathir-mohamad",
    "snippet": "A trained doctor, he had two stints in power - the first from 1981 to 2003 when he led the <strong>Barisan Nasional</strong> ruling coalition and the second from 2018 to February 24, 2020, when he was backed by the Pakatan Harapan ruling coalition.",
    "published": null
  }
]