[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "In September 2008 he retired from his professorship, announcing plans to &quot;write a book aimed at youngsters in which he will warn them against believing in &#x27;anti-scientific&#x27; fairytales&quot;. In 2011 Dawkins joined the professoriate of the New College of the Humanities, a private university in London established by the philosopher A.",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins heads lineup at private £18,000-a-year university | Higher education | The Guardian",
    "url": "https://www.theguardian.com/education/2011/jun/05/new-college-dawkins-grayling-ferguson",
    "snippet": "There is a starry lineup of professorial talent: <strong>Richard Dawkins will teach evolutionary biology and science literacy</strong>; Niall Ferguson will lecture on economics and economic history; and Steven Pinker will teach philosophy and psychology.",
    "published": "November 26, 2017"
  },
  {
    "title": "New College of the Humanities – The Disorder Of Things",
    "url": "https://thedisorderofthings.com/tag/new-college-of-the-humanities/",
    "snippet": "First, the complete removal of central funding to arts, humanities and social science degrees exposes the established provision to potential competition in a manner that gives the lie to Willetts’s claim that the cuts have been ‘scrupulously neutral’. (No new provider is currently planning to offer STEM degrees, which are expensive to run and require large overhead and start-up costs.)",
    "published": null
  },
  {
    "title": "Biography:Richard Dawkins - HandWiki",
    "url": "https://handwiki.org/wiki/Biography:Richard_Dawkins",
    "snippet": "He is an <strong>emeritus fellow of New College, Oxford</strong>, and was Professor for Public Understanding of Science in the University of Oxford from 1995 to 2008. His 1976 book The Selfish Gene popularised the gene-centred view...",
    "published": "March 9, 2024"
  },
  {
    "title": "Northeastern University – London - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_College_of_the_Humanities_at_Northeastern",
    "snippet": "A dozen protesters heckled Grayling ... people were evacuated from the store. Later in the week police removed protesters from a British Humanist Association talk by Richard Dawkins at the Institute of Education....",
    "published": "September 24, 2025"
  }
]