[
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "The 2020 Juba Agreement allowed al-Burhan to continue to lead the Sovereignty Council for another 20 months, rather than stepping down as planned in February 2021. Al-Burhan seized power in a coup d&#x27;état in October 2021, dissolved the Sovereignty Council, and reconstituted it the following month with new membership, keeping himself as chairman. He was formerly the General Inspector of the Sudanese Armed Forces (SAF).",
    "published": "3 days ago"
  },
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Al-Bashir served as head of state, under the title of Chairman of the Revolutionary Command Council for National Salvation from 1989 to 1993 and as president from 1993 to 2019 (and from 1996 as the leader of the National Congress Party). Al-Bashir was removed from power by the Sudanese Armed Forces on 11 April 2019, amid the Sudanese revolution after holding the office for nearly 30 years.",
    "published": "1 week ago"
  },
  {
    "title": "Sudan - Awad al-Karim Ahmad Muhammad Ibn Auf",
    "url": "https://www.globalsecurity.org/military/world/sudan/burhan.htm",
    "snippet": "The most prominent event on Thursday 11 April 2019 was the announcement of the removal of President <strong>Omar al-Bashir</strong> and the formation of a Transitional Council to run the country for two years. His name recently jumped to the forefront of events in Sudan, before he held the highest political ...",
    "published": null
  },
  {
    "title": "Abdel Fattah al-Burhan | Sudanese politician | Britannica",
    "url": "https://www.britannica.com/biography/Abdel-Fattah-al-Burhan",
    "snippet": "Other articles where Abdel Fattah al-Burhan is discussed: Sudan: Transition: Abdel Fattah al-Burhan, who had been leading the military-led transition council, was named president. <strong>Abdalla Hamdok</strong>, selected by the civilian groups’ alliance, ...",
    "published": null
  },
  {
    "title": "List of heads of state of Sudan facts for kids",
    "url": "https://kids.kiddle.co/List_of_heads_of_state_of_Sudan",
    "snippet": "This was because different groups couldn&#x27;t agree on one single leader. In November 1958, <strong>General Ibrahim Abboud</strong> took control in a military takeover. He became the head of state. He later became president in 1964 but resigned that same year.",
    "published": null
  }
]