[
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "As under secretary, he oversaw the bureaus responsible for U.S. policy in each region of the world and served in the senior career Foreign Service position at the department. He retired on April 30, 2008. He was a visiting scholar at the Woodrow Wilson Center in summer 2008. President Joe Biden nominated Burns to be ambassador to China in August 2021.",
    "published": "September 26, 2025"
  },
  {
    "title": "Nicholas Burns | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty/nicholas-burns",
    "snippet": "Ambassador Nicholas Burns is the Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations at Harvard University’s Kennedy School of Government. He is the Founder and Faculty Chair of the Future of Diplomacy Project. He is also a Faculty Affiliate at Harvard’s Fairbank Center for Chinese Studies. Burns served as the U.S. Ambassador to the People&#x27;s Republic of China from 2021-2025, leading public servants from forty-eight U.S.",
    "published": null
  },
  {
    "title": "Nicholas Burns | The Cohen Group",
    "url": "https://cohengroup.net/who-we-are/team/nicholas-burns",
    "snippet": "US Ambassador to China (2021–2025) Under <strong>Secretary of State for Political Affairs</strong> (2005–2008) US Ambassador to NATO (2001–2005) US Ambassador to Greece (1997–2001) Ambassador Nicholas Burns served as US Ambassador to China from 2021 ...",
    "published": "March 5, 2025"
  },
  {
    "title": "Nicholas Burns | The Belfer Center for Science and International Affairs",
    "url": "https://www.belfercenter.org/person/nicholas-burns",
    "snippet": "Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations, Harvard Kennedy School Former United States Ambassador to the People’s Republic of China Member of the Board, Belfer Center Faculty Affiliate, Fairbank Center for Chinese Studies",
    "published": null
  },
  {
    "title": "BIOGRAPHY: Nicholas Burns",
    "url": "https://2009-2017.state.gov/s/p/fapb/185577.htm",
    "snippet": "Information released online from January 20, 2009 to January 20, 2017. Note: Content in this archive site is not updated, and links may not function. External links to other Internet sites should not be construed as an endorsement of the views contained therein. ... Nicholas Burns is Professor of the Practice of Diplomacy and International Politics at the Harvard Kennedy School of Government.",
    "published": null
  }
]