[
  {
    "title": "Samy Bengio - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Samy_Bengio",
    "snippet": "Bengio is <strong>senior director of Artificial Intelligence and Machine Learning Research at Apple and an adjunct professor at École Polytechnique Fédérale de Lausanne</strong>. He was a longtime scientist at Google, where he led a large group of researchers working in machine learning, including adversarial ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Samy Bengio - Apple | LinkedIn",
    "url": "https://www.linkedin.com/in/bengio",
    "snippet": "Experience: Apple · Location: Mountain View · 500+ connections on LinkedIn. View Samy Bengio’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": null
  },
  {
    "title": "Samy Bengio",
    "url": "https://bengio.abracadoudou.com/",
    "snippet": "Senior Director, AI and Machine Learning Research Apple Machine Learning Research One Apple Park Way 95014 Cupertino California, USA · I am also an adjunct professor at EPFL",
    "published": null
  },
  {
    "title": "r/apple on Reddit: Apple has hired Samy Bengio, a former AI scientist who resigned in protest of Google's firing of two employees, to lead a new AI team under John Giannandrea.",
    "url": "https://www.reddit.com/r/apple/comments/n4iyzu/apple_has_hired_samy_bengio_a_former_ai_scientist/",
    "snippet": "Other than the amount of data they have to work with, all assistants are pretty much the same neural network ... Siri. Please fix it. I beg you. ... Damn, that’s Yoshua Bengio’s brother.",
    "published": "May 4, 2021"
  },
  {
    "title": "ICLR Social Samy Bengio",
    "url": "https://iclr.cc/virtual/2023/social/14648",
    "snippet": "He was on the editorial board of the Machine Learning Journal, has been <strong>program chair (2017) and general chair (2018) of NeurIPS, program chair of ICLR (2015, 2016), general chair of BayLearn (2012-2015), MLMI (2004-2006), as well as NNSP (2002)</strong>, and on the program committee of several ...",
    "published": null
  }
]