[
  {
    "title": "Bombardier Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bombardier_Inc.",
    "snippet": "(French: [bɔ̃baʁdje]) is a Canadian aerospace manufacturer which produces business jets. Headquartered in Montreal, the company was <strong>founded in 1942 in Valcourt by Joseph-Armand Bombardier to market his snowmobiles</strong>; it later became one of the world&#x27;s biggest producers of aircraft and trains.",
    "published": "October 20, 2025"
  },
  {
    "title": "Our history | Bombardier",
    "url": "https://bombardier.com/en/who-we-are/our-history",
    "snippet": "Celebrating 80 years of creativity, growth and a relentless desire to innovate, <strong>Bombardier has grown from its beginnings as a family business in rural Quebec, Canada</strong>, to becoming the maker of the world’s finest business jets.",
    "published": null
  },
  {
    "title": "Bombardier Inc. | Aerospace, Rail & Transportation Solutions | Britannica Money",
    "url": "https://www.britannica.com/money/Bombardier-Inc",
    "snippet": "<strong>After its purchase by the American Locomotive Company (Alco), the firm became known as Montreal Locomotive Works Limited (MLW) in 1908</strong>. In the late 1960s, with the acquisition of most of the assets of Alco by Worthington Corporation, MLW became ...",
    "published": null
  },
  {
    "title": "Bombardier Aviation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bombardier_Aviation",
    "snippet": "The company currently produces the Global and Challenger series of business jets. At its peak, Bombardier operated manufacturing plants in 27 countries and employed over 70,000 workers. However, under financial pressure, it significantly reduced its workforce and divested its entire commercial aircraft portfolio including the Q-Series regional turboprop, CRJ-Series of regional jets, and the C-Series narrowbody jet.",
    "published": "October 31, 2025"
  },
  {
    "title": "Bombardier Inc. - Company Profile, Information, Business Description, History, Background Information on Bombardier Inc.",
    "url": "https://www.referenceforbusiness.com/history2/56/Bombardier-Inc.html",
    "snippet": "<strong>After stumbling in the 1970s, Bombardier (pronounced bohn-BAR-dee-ay) reemerged as a force, particularly in the aircraft and rail equipment industries, in the final decades of the 20th century</strong>, enjoying healthy sales and profit gains into the new millennium. ... Bombardier Inc.",
    "published": null
  }
]