[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Two subsidiaries of the IAU were also created at this assembly: the International Time Commission seated at the International Time Bureau in Paris, France, and the International Central Bureau of Astronomical Telegrams initially seated in Copenhagen, Denmark. The seven initial member states were Belgium, Canada, France, Great Britain, Greece, Japan, and the United States, soon to be followed by Italy and Mexico. The first executive committee consisted of Benjamin Baillaud (President, France), Alfred Fowler (General Secretary, UK), and four vice presidents: William Campbell (US), Frank Dyson (UK), Georges Lecointe (Belgium), and Annibale Riccò (Italy).",
    "published": "5 days ago"
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "&quot;It is a great honour and a pleasure ... in which the IAU will play a leading role as a catalyst and a coordinator,&quot; said <strong>Catherine Cesarsky</strong>....",
    "published": null
  },
  {
    "title": "Home",
    "url": "https://www.iau.org/",
    "snippet": "The IAU is pleased to announce The Kavli Foundation has agreed to fund $82,000 in continuation of their support of a Global Coordination Workshop in 2026 and the Young Astronomers Lunch at the IAU General Assembly in Rome from 10-19 August 2027.",
    "published": null
  },
  {
    "title": "U.S. National Committee for the International Astronomical ...",
    "url": "https://www.nationalacademies.org/our-work/us-national-committee-for-the-international-astronomical-union-usnc-iau",
    "snippet": "This site requires JavaScript to be enabled",
    "published": null
  },
  {
    "title": "About",
    "url": "https://www.iau.org/Iau/Iau/About/About.aspx",
    "snippet": "The IAU has recently launched an international call to establish the Office of Astronomy for Education (OAE) in 2019. Regional nodes have been created in other countries as well. In 2015, the IAU actively participated in the International Year of Light. The IAU also carries out joint educational activities associated with COSPAR and UNESCO. This web site provides on-line information on the Union&#x27;s activities and links to the web sites of the IAU Divisions, Commissions and Working Groups.",
    "published": null
  }
]