[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "Jacques Brunel (born 14 January 1954) is a French rugby union coach and former player. He was <strong>most recently the French national team head coach</strong>, having previously been assistant coach for his nation and had led the Italian national team between 2011 and 2016. Brunel, who has spent most of his ...",
    "published": "January 1, 2025"
  },
  {
    "title": "Jacques Brunel, entraineur de rugby de l'équipe de France de rugby",
    "url": "https://www.equipe-france.fr/rugby/jacques-brunel",
    "snippet": "Toutes les informations sur la carrière de Jacques Brunel et les résultats, entraineur de rugby de l&#x27;équipe de France de rugby.",
    "published": null
  },
  {
    "title": "Cinq choses à savoir sur Jacques Brunel",
    "url": "https://www.lequipe.fr/Rugby/Actualites/Cinq-choses-a-savoir-sur-jacques-brunel/861417",
    "snippet": "<strong>Jacques Brunel est le nouveau sélectionneur du XV de France</strong>. Il a succédé à Guy Novès. D&#x27;Auch à l&#x27;équipe d&#x27;Italie, découvrez le parcours du nouveau patron des Bleus.",
    "published": null
  },
  {
    "title": "Rugby Database Coach: Jacques Brunelcoached France games",
    "url": "https://www.rugbydatabase.co.nz/team/coach.php?teamId=45&coachId=179",
    "snippet": "Rugby Database coaching statistics for Jacques Brunel while coaching France including a full list of games",
    "published": null
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Coaching his side to the quarterfinals of their home Rugby World Cup a year ago, there is a sense that there is more to come from France as this talented group of players continues to mature. This could no more be seen than when France beat New Zealand 30-29 to register their third-straight win over the All Blacks in enthralling fashion. ... France’s head coach Jacques Brunel (L) before the Japan 2019 Rugby World Cup quarter-final match against Wales.",
    "published": "May 30, 2025"
  }
]