[
  {
    "title": "Welcome to the website of the French Presidency",
    "url": "https://www.elysee.fr/en/",
    "snippet": "Find out all the news of the President <strong>Emmanuel Macron</strong> on the official website and discover our pages on the history of the French Republic.",
    "published": null
  },
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "If so, the president may serve as both the head of state and de facto head of government, while the prime minister serves as his deputy, acting as a link between the legislature and the executive. The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 ...",
    "published": "18 hours ago"
  },
  {
    "title": "Politics of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_France",
    "snippet": "The Council of Ministers is the ... powers have to be approved by the Council beforehand to be invoked. The current French prime minister is <strong>Sébastien Lecornu</strong> since 9 September 2025....",
    "published": "3 days ago"
  },
  {
    "title": "Government of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_France",
    "snippet": "<strong>The Prime Minister</strong> may designate ministers to be titled as ministers of state (ministres d&#x27;État), who are the most senior, followed in protocol order by ministers (ministres), ministers delegate (ministres délégués), whereas junior ministers ...",
    "published": "November 5, 2025"
  },
  {
    "title": "The institutions | Élysée",
    "url": "https://www.elysee.fr/en/french-presidency/the-institutions",
    "snippet": "<strong>Emmanuel Macron</strong> was elected eighth President of the French Republic on 7 May 2017. The President of the Republic appoints the Prime Minister, who proposes the members of government to the President, who then appoints them (Article 8 of the ...",
    "published": null
  }
]