[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "WBD would rebrand BT Sport as TNT Sports, deriving its name from its American cable network. In January 2025, it was announced that <strong>Eurosport would close in the United Kingdom and Ireland on 28 February 2025</strong>, in favour of carrying Eurosport content via TNT Sports channels and platforms.",
    "published": "5 days ago"
  },
  {
    "title": "Warner Bros. Discovery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Warner_Bros._Discovery",
    "snippet": "On May 8 CNBC&#x27;s David Faber reported ... known as Versant. <strong>Plans were officially announced on June 9, 2025</strong>. WBD announced on July 28 that the two companies would be known as Warner Bros. and Discovery Global respectively....",
    "published": "9 hours ago"
  },
  {
    "title": "Eurosport To Be Replaced By TNT In The UK As Warner Bros. Discovery Shakes Up Sports Portfolio",
    "url": "https://deadline.com/2025/01/eurosport-to-be-replaced-by-tnt-in-the-uk-in-warner-bros-discovery-sports-shakes-up-1236269088/",
    "snippet": "“Part of the timing was driven by distribution agreements, but most of it was just timed on firstly landing TNT Sports correctly and successfully. We have got ourselves a point where TNT Sports is in a good space and we’re now ready to migrate the content from Eurosport in this market.” · Warner Bros. Discovery Sports will continue to handle production after the rejig.",
    "published": "January 28, 2025"
  },
  {
    "title": "Warner Bros. Discovery Sports' Rights",
    "url": "https://wbdsports.com/page/sports-rights",
    "snippet": "... TNT Sports presents exclusive ... discovery+ is the streaming destination for TNT Sports in the UK. At the end of February 2025, <strong>Eurosport integrated with TNT Sports</strong> adding its full line-...",
    "published": null
  },
  {
    "title": "Eurosport To Be Replaced By TNT In The UK As Warner Bros. Discovery Shakes Up Sports Portfolio - Yahoo Sports",
    "url": "https://sports.yahoo.com/eurosport-replaced-tnt-uk-warner-000100708.html",
    "snippet": "Discovery rejigs its sports portfolio. <strong>Live sports and other programming from Eurosport will move to the TNT channels, which are operated as a joint venture between WBD and UK telco BT</strong>.",
    "published": "January 28, 2025"
  }
]