[
  {
    "title": "EQT completes the acquisition of Com Hem",
    "url": "https://eqtgroup.com/news/2003/EQT-completes-the-acquisition-of-Com-Hem-/",
    "snippet": "<strong>EQT Northern Europe private equity fund has today completed the acquisition of Com Hem</strong>. Closing of the deal had been conditioned upon e.g. approvals from Swedish regulatory authorities, which now have been received. The Board of Directors will include Bengt Halse, Kjell Hellberg, Håkan Johansson, ...",
    "published": null
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - <strong>The Carlyle Group and Providence Equity Partners today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT</strong>. Financial details were not disclosed. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  },
  {
    "title": "Com Hem AB - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn",
    "url": "https://tracxn.com/d/companies/com-hem-ab/__C72ILG9J1X0WjTdDonjKDs7MlEgXfBRoW-3D_-KNVmk",
    "snippet": "Com Hem AB got acquired by Tele2 on <strong>Jan 10, 2018</strong> at an acquisition amount of $4.24B.",
    "published": "November 11, 2025"
  },
  {
    "title": "Hem - 2025 Company Profile, Team, Funding & Competitors - Tracxn",
    "url": "https://tracxn.com/d/companies/hem/__RzsXUsLjn8V1NcFoMplSP3vCaJDKDiei-bGvoH9Lw_c",
    "snippet": "... <strong>Hem got acquired by Vitra on Feb 03, 2016.</strong> Click here to take a look at Hem&#x27;s acquisition in detail · Hem has raised a total funding of $5M over 1 round. Its latest funding round ...",
    "published": "September 15, 2025"
  },
  {
    "title": "Hemlo Mining Corp. Announces First Gold Pour and Updates to its Post-Consolidation Share Capital",
    "url": "https://www.prnewswire.com/news-releases/hemlo-mining-corp-announces-first-gold-pour-and-updates-to-its-post-consolidation-share-capital-302645537.html",
    "snippet": "The Company is providing a rectification of certain forward-looking information regarding the Company&#x27;s share capital upon completion of the Company&#x27;s acquisition of the Hemlo Gold Mine from Barrick Mining Corp. on <strong>November 26, 2025</strong>, and the ...",
    "published": "5 days ago"
  }
]