[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Two subsidiaries of the IAU were also created at this assembly: the International Time Commission seated at the International Time Bureau in Paris, France, and the International Central Bureau of Astronomical Telegrams initially seated in Copenhagen, Denmark. The seven initial member states were Belgium, Canada, France, Great Britain, Greece, Japan, and the United States, soon to be followed by Italy and Mexico. The first executive committee consisted of Benjamin Baillaud (President, France), Alfred Fowler (General Secretary, UK), and four vice presidents: William Campbell (US), Frank Dyson (UK), Georges Lecointe (Belgium), and Annibale Riccò (Italy).",
    "published": "3 weeks ago"
  },
  {
    "title": "AAS Announces 2025 Election Results | American Astronomical Society",
    "url": "https://aas.org/posts/news/2025/03/aas-announces-2025-election-results",
    "snippet": "The 2025 AAS Election began on 3 January 2025 and wrapped up on 18 February. In total, 2,078 members (out of the 7,634 eligible to vote) submitted votes. Many thanks to everyone who participated! The offices on the ballot included President-Elect, Vice President, Secretary, Treasurer, At-Large member of the Board of Trustees, Representative of the AAS membership to the US National Committee of the International Astronomical Union (USNC/IAU), and two members of the Nominating Committee.",
    "published": null
  },
  {
    "title": "International Astronomical Union – GKToday",
    "url": "https://www.gktoday.in/international-astronomical-union/",
    "snippet": "The IAU has been led by numerous distinguished astronomers since its inception. Early Presidents included Benjamin Baillaud (1919–1922), William Wallace Campbell (1922–1925), and Willem de Sitter (1925–1928). Later Presidents have included Jan Oort, Victor Ambartsumian, Otto Heckmann, Adriaan Blaauw, Vainu Bappu, Robert Hanbury Brown, Catherine Cesarsky, Norio Kaifu, and Silvia Torres, reflecting the Union’s global and disciplinary diversity. The International Astronomical Union remains central to the global astronomical community.",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://www.iau.org/administration/executive_bodies/past_committees/executive_committee/",
    "snippet": "Debra Meloy Elmegreen · Piero Benvenuti (Interim General Secretary) <strong>José Miguel Rodriguez Espinosa</strong>",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://iauarchive.eso.org/",
    "snippet": "It is expected to become visible to the public and our members from March 2025. This is a significant effort driven by a small team, and we appreciate your understanding during the transition. We thank ESO for its long-standing contractual partnership and tireless support related to the IAU&#x27;s digital functionality. The IAU&#x27;s mission is to promote and safeguard astronomy in all its aspects (including research, communication, education and development) through international cooperation.",
    "published": null
  }
]