[
  {
    "title": "Curtis Samuel - NFL News, Rumors, & Updates | FOX Sports",
    "url": "https://www.foxsports.com/nfl/curtis-samuel-player",
    "snippet": "<strong>Samuel will figure to handle a similar role on the road against Atlanta on Monday night, as long as he can gain clearance to suit up</strong>. ... Catches first TD of 2025 Samuel logged two catches on as many targets for 26 yards and one touchdown during Buffalo&#x27;s 23-20 loss to New England on Sunday.",
    "published": null
  },
  {
    "title": "Curtis Samuel Stats, Height, Weight, Position, Draft, College | Pro-Football-Reference.com",
    "url": "https://www.pro-football-reference.com/players/S/SamuCu00.htm",
    "snippet": "Select two rows to sum games. Advanced stats are updated the Wednesday following the week&#x27;s games. The advanced stats shown here are updated through week 14 of the 2025 season. ... Curtis Samuel is <strong>29 years old</strong>.",
    "published": null
  },
  {
    "title": "Curtis Samuel - Buffalo Bills Wide Receiver - ESPN",
    "url": "https://www.espn.com/nfl/player/_/id/3121427/curtis-samuel",
    "snippet": "View the profile of Buffalo Bills Wide Receiver Curtis Samuel on ESPN. Get the latest news, live stats and game highlights.",
    "published": null
  },
  {
    "title": "Curtis Samuel NFL Stats & News",
    "url": "https://www.rotowire.com/football/player/curtis-samuel-11710",
    "snippet": "The re-emergence of a turf toe issue that bothered Samuel earlier in his career may have been a factor in the lack of playing time, but it&#x27;s nonetheless <strong>unclear where he stands heading into 2025</strong>. He has a full guarantee for his $6.91 million salary this season, yet it won&#x27;t be surprising if ...",
    "published": null
  },
  {
    "title": "Curtis Samuel, Buffalo Bills, WR - News, Stats, Bio - CBS Sports",
    "url": "https://www.cbssports.com/nfl/players/2131252/curtis-samuel/",
    "snippet": "Rotowire Nov 28, 2025 · Samuel (elbow/knee) has been <strong>ruled out for Sunday&#x27;s game against the Steelers</strong>, Maddy Glab of the Bills&#x27; official site reports. Samuel, who was also inactive Week 12, will target a potential return to action Sunday, Dec.",
    "published": null
  }
]