[
  {
    "title": "Sudan: Freedom in the World 2025 Country Report | Freedom House",
    "url": "https://freedomhouse.org/country/sudan/freedom-world/2025",
    "snippet": "After military commanders and a ... Party (NCP) in 2019, <strong>Sudan was ruled by a transitional government in which military and civilian leaders agreed to share power until national elections could be held</strong>....",
    "published": null
  },
  {
    "title": "Sudanese civil war (2023–present) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudanese_civil_war_(2023–present)",
    "snippet": "<strong>In January 2025, the SAF made the first major military operation of 2025</strong>. The Sudanese Army was able to make large gains in Gezira and some gains in North Kordofan. On 8 January, the SAF had recaptured Haj-Abdallah after a tense battle that inflicted losses on the RSF.",
    "published": "3 hours ago"
  },
  {
    "title": "Civil War in Sudan | Global Conflict Tracker",
    "url": "https://www.cfr.org/global-conflict-tracker/conflict/power-struggle-sudan",
    "snippet": "<strong>In February 2025, RSF leadership and its allies gathered in Nairobi, Kenya, to advance their plan to create a parallel government</strong>. They signed a charter outlining key aspects of a post-war government, including secularism, democracy, a decentralized ...",
    "published": null
  },
  {
    "title": "Sudan - Politics, Governance, Conflict | Britannica",
    "url": "https://www.britannica.com/place/Sudan/Political-process",
    "snippet": "The National Congress Party (formerly the Islamic National Front; NIF), long the only legal party, continued to dominate the political scene in the years immediately following, until the April 2019 coup; it was disbanded later that year. Other political associations active in Sudan include the Ummah Party and the Democratic Unionist Party. UN estimates over 2,000 Sudanese pregnant women have fled el-Fasher to escape conflict • Nov. 18, 2025, 1:41 PM ET (AP) ...(Show more)",
    "published": "July 26, 1999"
  },
  {
    "title": "Sudan war: A simple guide to what is happening",
    "url": "https://www.bbc.com/news/articles/cjel2nn22z9o",
    "snippet": "It is disputed who fired the first shot but the fighting swiftly escalated, with <strong>the RSF seizing much of Khartoum until the army regained control of it almost two years later in March 2025</strong>.",
    "published": "October 25, 2021"
  }
]