[
  {
    "title": "Mahathir Mohamad: Latest News and Updates | South China Morning Post",
    "url": "https://www.scmp.com/topics/mahathir-mohamad",
    "snippet": "A trained doctor, he had two stints in power - the first from 1981 to 2003 when he led the Barisan Nasional ruling coalition and the second from 2018 to February 24, 2020, when he was backed by the <strong>Pakatan Harapan ruling coalition</strong>.",
    "published": null
  },
  {
    "title": "Mahathir Mohamad | The Guardian",
    "url": "https://www.theguardian.com/politics/mahathir-mohamad",
    "snippet": "Former Malaysian prime minister Mahathir Mohamad said the deal amounted to ‘handing over’ the country’s independence · Mahathir has offered to become prime minister for a third time, as campaigning in Malaysia’s general election gets under way · Despite his age and a health scare this year, Mahathir will defend his parliamentary seat in upcoming elections · Muhyiddin Yassin faces big challenges – and some say he may be bad news for minorities",
    "published": null
  },
  {
    "title": "Mahathir Mohamad - BBC News",
    "url": "https://www.bbc.com/news/topics/cxwgq3qqn02t",
    "snippet": "A political veteran who was jailed twice, Anwar waited for 25 years to become PM of Malaysia.",
    "published": null
  },
  {
    "title": "Mahathir Mohamad - The New York Times",
    "url": "https://www.nytimes.com/topic/person/mahathir-mohamad",
    "snippet": "Mr. Mahathir, 94, who has towered over the country’s politics for decades, was replaced by Muhyiddin Yassin, a onetime ally whom he accused of betrayal. ... The move appears to be an attempt to suddenly remake a government — possibly with Mr. Mahathir, 94, still at the helm.",
    "published": null
  },
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "Mahathir resigned in 2020 amidst a political crisis. Despite losing his parliamentary seat in the 2022 general election, he remained active in politics and <strong>shifted party affiliation several times</strong>.",
    "published": "3 days ago"
  }
]