[
  {
    "title": "Yabloko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yabloko",
    "snippet": "The party also advocates for the protection of the rights of LGBT people in Russia. The party dates back to the early 1990s. <strong>Originally established as a public organization in 1993, it transformed into a political party in 2001.</strong> From 1993 to 2003, the party had a small faction in the State ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Russian Democratic Party YABLOKO",
    "url": "https://eng.yabloko.ru/",
    "snippet": "At the same time, the international institutions created after World War II have proved incapable of preventing or resolving the acute crisis situations of recent years. ... Posted: December 10th, 2025 under Foreign policy, Governance, History, Human Rights, Political Committee Decisions, Russia-Eu relations, Russia-Ukraine relations, Без рубрики. Comments: none · On the Yabloko Party’s participation in elections to the State Duma of Russia in 2026",
    "published": null
  },
  {
    "title": "Russian Democratic Party YABLOKO » The Russian United Democratic Party YABLOKO",
    "url": "https://eng.yabloko.ru/the-russian-united-democratic-party-yabloko/",
    "snippet": "Would the West’s Billions Pay Off? Los Angeles Times By Grigory Yavlinsky and Graham Allison June 3, 1991 ... The Russian United Democratic Party YABLOKO is the oldest Russian democratic party, <strong>formed in 1993 first as an electoral bloc</strong>.",
    "published": null
  },
  {
    "title": "Yabloko | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/yabloko",
    "snippet": "YABLOKO Yabloko was one of the leading liberal opposition parties in the newly democratic Russia of the 1990s. <strong>Yabloko&#x27;s founder and leader was Grigory Yavlinsky, a liberal economist who had stayed aloof from the new democratic political movements being formed between 1989 and 1991</strong>. Source for ...",
    "published": null
  },
  {
    "title": "Yabloko-United Democrats - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yabloko-United_Democrats",
    "snippet": "The Yabloko — United Democrats ... Yabloko party and the Union of Right Forces. They were <strong>formed initially for the Moscow municipal elections on December 4, 2005.</strong>...",
    "published": "August 24, 2025"
  }
]