[
  {
    "title": "Sara bint Mashour Al Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sara_bint_Mashour_Al_Saud",
    "snippet": "<strong>Sara bint Mashour Al Saud</strong> (Arabic: سارة بنت مشهور آل سعود) is a member of the Saudi royal family and wife of Saudi Crown Prince Mohammed bin Salman, who is her first cousin. She is a granddaughter of King Abdulaziz.",
    "published": "1 week ago"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman is the third oldest living head of state, the oldest living monarch, and Saudi Arabia&#x27;s first head of state born after the unification of Saudi Arabia. He has a reported personal wealth of at least US$18 billion, which makes him the third wealthiest royal in the world. Salman is a son of King Abdulaziz and Hassa bint Ahmed Al Sudairi, making him one of the Sudairi Seven.",
    "published": "November 3, 2025"
  },
  {
    "title": "House of Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/House_of_Saud",
    "snippet": "Members of the cadet branches hold high and influential positions in government though they are not in the line of succession to the Saudi throne. Many cadet members intermarry within the Al Saud to re-establish their lineage and continue to wield influence in the government. All male members of the royal family have the title of Emir (Prince). However, the sons and patrilineal grandsons of Kings are referred to by the style &quot;His Royal Highness&quot; (HRH), differing from patrilineal great-grandsons and members of cadet branches who are called &quot;His Highness&quot; (HH), while the reigning king uses the additional title of Custodian of the Two Holy Mosques.",
    "published": "1 month ago"
  },
  {
    "title": "r/AskHistorians on Reddit: How was king Abdulaziz of Saudi Arabia able to have more than four wives?",
    "url": "https://www.reddit.com/r/AskHistorians/comments/2tpli6/how_was_king_abdulaziz_of_saudi_arabia_able_to/",
    "snippet": "Robert Lacey&#x27;s &quot;The Kingdom&quot; describes King Abdulaziz repeatedly divorcing women so that he can keep to the Islamic limit of four wives. He even remarried one of them, Hassa Al Sudairi (mother to the current Saudi king Salman and the late King Fahd), after he regretted divorcing her.",
    "published": "January 26, 2015"
  },
  {
    "title": "How Many Wives Does King Salman Have? Truth Revealed! | History",
    "url": "https://vocal.media/history/how-many-wives-does-king-salman-have-truth-revealed",
    "snippet": "His reign has been marked by efforts to strengthen Saudi Arabia&#x27;s global presence and partnerships. As Islam accepts polygamy marriage, King Salman has three wives who are read below. ... <strong>Sultana bint Turki Al Sudairi</strong> holds the distinction of ...",
    "published": null
  }
]