[
  {
    "title": "La Moncloa. 08/05/2019. Nadia Calviño to become chair of European Bank of Reconstruction and Development's board of governors [Government/News]",
    "url": "https://www.lamoncloa.gob.es/lang/en/gobierno/news/Paginas/2019/20190508chair-ebrd.aspx",
    "snippet": "08 May 2019. The board of governors of the European Bank for Reconstruction and Development (EBRD) has officially appointed the <strong>Acting Minister for Economy and Business of Spain</strong>, Nadia Calviño, as its new chair.",
    "published": null
  },
  {
    "title": "Nadia Calviño",
    "url": "https://www.eib.org/en/about/governance-and-structure/statutory-bodies/management-committee/members/nadia-calvino",
    "snippet": "Nadia Calviño is the <strong>President of the European Investment Bank</strong>. She was appointed on 1 January 2024. Follow the President on",
    "published": "1 month ago"
  },
  {
    "title": "EBRD Annual Meeting 2020 Governors’ and keynote statements",
    "url": "https://www.ebrd.com/annual-meeting-statements.html",
    "snippet": "Nadia Calviño, <strong>Chair of the EBRD Board of Governors</strong> · Documents will be added as they become available. Statement by Mr Rishi Sunak, Chancellor of the Exchequer, on behalf of the United Kingdom Government · Discours de M. Rishi Sunak, Chancelier ...",
    "published": null
  },
  {
    "title": "Spain’s Nadia Calviño wins fight to head EU Investment Bank | Euronews",
    "url": "https://www.euronews.com/my-europe/2023/12/08/spains-nadia-calvino-wins-fight-to-head-eu-investment-bank",
    "snippet": "Spain’s finance minister <strong>Nadia Calviño has been named next president of the European Investment Bank (EIB),</strong> resolving a fractious and long-running dispute among EU finance ministers.",
    "published": "December 13, 2023"
  },
  {
    "title": "Nadia Calviño named EIB chief – POLITICO",
    "url": "https://www.politico.eu/article/spain-nadia-calvino-named-european-investment-bank-chief/",
    "snippet": "BRUSSELS – <strong>Spain&#x27;s Finance Minister Nadia Calviño will become the next head of the European Investment Bank</strong> after EU countries agreed on Friday morning to her appointment.",
    "published": "December 8, 2023"
  }
]