[
  {
    "title": "President of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Austria",
    "snippet": "On 9 December 1920, the Federal Assembly elected <strong>Michael Hainisch as the first official president of Austria</strong>. The parliamentary system erected by the new Constitution was highly unpopular with the majority of the population. This led to surging support for the authoritarian and paramilitary ...",
    "published": "1 week ago"
  },
  {
    "title": "List of presidents of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Austria",
    "snippet": "This is a list of presidents of Austria since the establishment of that office in 1919. Austria was part of Nazi Germany from 12 March 1938 to 13 April 1945. ... This is a graphical lifespan timeline of the Presidents of Austria since 1945. They are listed in order of first assuming office.",
    "published": "November 1, 2025"
  },
  {
    "title": "Austria - Travels of the President - Travels - Department History - Office of the Historian",
    "url": "https://history.state.gov/departmenthistory/travels/president/austria",
    "snippet": "Austria - Travels of the President - Travels - Department History · Further updates to the Travels of the President database are suspended while we work to modernize the data collection and processing work required to maintain this publication. Please see the White House homepage’s briefing room resources for current presidential ...",
    "published": null
  },
  {
    "title": "List of presidents of Austria | Britannica",
    "url": "https://www.britannica.com/topic/list-of-presidents-of-Austria-2067025",
    "snippet": "This is a chronologically ordered list of the presidents of Austria.",
    "published": "June 1, 2016"
  },
  {
    "title": "Austrian Federal President Alexander Van der Bellen",
    "url": "https://www.bundespraesident.at/en/index",
    "snippet": "Many people associate Austria’s Federal Presidency with the seat of its political power: the Hofburg, the Vienna Imperial Palace. The Wiener Hofburg is the largest palace complex in Europe, extending from the Albertina Museum to the Leopoldine Wing, and from the Neue Burg wing to the MuseumsQuartier. It is a telling symbol of our country’s long and winding history, and home to the Office of the Federal President of the Republic of Austria.",
    "published": null
  }
]