[
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "Jennifer is a National Fellow of the Institute of Public Administration Australia and a Fellow of the Australian Institute of Company Directors, and since 2013 has been a <strong>Non-Executive Director of Wesfarmers Limited and Chair of the Mental Health Council of Australia</strong>.",
    "published": null
  },
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "Jennifer was Chief Executive of the Business Council of Australia, the leading forum for the heads of over 100 of Australia&#x27;s top companies to contribute to public policy debate, from February 2011 until October 2023. Prior to that, she was a <strong>board director and lead partner at KPMG</strong>, heading ...",
    "published": null
  },
  {
    "title": "Jennifer Westacott AC - KPMG Australia | LinkedIn",
    "url": "https://www.linkedin.com/in/jennifer-westacott-ac-9aa853146/",
    "snippet": "In 2018, Jennifer was made an <strong>Officer (AO) in the General Division of the Order of Australia</strong> for distinguished service to private and public-sector administration through executive roles, to policy development and reform, to cross sector ...",
    "published": "November 17, 2021"
  },
  {
    "title": "Jennifer Westacott AC - Non-executive Member – Governance Board | RBA",
    "url": "https://www.rba.gov.au/about-rba/boards/governance-board/jennifer-westacott.html",
    "snippet": "Jennifer Westacott AC has more than three decades experience across the public and private sectors and was the <strong>Chief Executive</strong> of the Business Council of Australia for over a decade.",
    "published": null
  },
  {
    "title": "Jennifer Westacott - Public and Proud - Business Council of Australia",
    "url": "https://www.bca.com.au/jennifer_westacott_public_and_proud",
    "snippet": "She grew up in public housing in NSW, and studied at the University of New South Wales and the London School of Economics. Among the many important posts she has held Jennifer was the <strong>Director of Housing and the Secretary of Education in Victoria</strong>.",
    "published": null
  }
]