[
  {
    "title": "Curtis Samuel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Curtis_Samuel",
    "snippet": "Curtis Samuel (born August 11, 1996) is an American professional football wide receiver and kickoff returner for the Buffalo Bills of the National Football League (NFL). He played college football for the Ohio State Buckeyes, winning the 2015 College Football Playoff National Championship and earning All-American honors in 2016. Samuel was selected by the Carolina Panthers in the second round of the 2017 NFL draft and played four seasons with them and three seasons with the Washington Commanders before joining the Bills in 2024.",
    "published": "2 weeks ago"
  },
  {
    "title": "Carolina Panthers - Owners - RetroSeasons.com",
    "url": "https://www.retroseasons.com/teams/carolina-panthers/history/owners/",
    "snippet": "The Carolina Panthers are legally registered as Panther Football, LLC. and are controlled by <strong>David Tepper</strong>, whose purchase of the team from founder Jerry Richardson was unanimously approved by league owners on May 22, 2018.",
    "published": "August 19, 2025"
  },
  {
    "title": "Curtis Samuel Stats, Height, Weight, Position, Draft, College | Pro-Football-Reference.com",
    "url": "https://www.pro-football-reference.com/players/S/SamuCu00.htm",
    "snippet": "Checkout the latest stats for Curtis Samuel. Get info about his position, age, height, weight, college, draft, and more on Pro-football-reference.com.",
    "published": null
  },
  {
    "title": "Curtis Samuel - Buffalo Bills Wide Receiver - ESPN",
    "url": "https://www.espn.com/nfl/player/_/id/3121427/curtis-samuel",
    "snippet": "View the profile of <strong>Buffalo Bills</strong> Wide Receiver Curtis Samuel on ESPN. Get the latest news, live stats and game highlights.",
    "published": null
  },
  {
    "title": "Bills are paying $24 million to learn what the Panthers already knew",
    "url": "https://catcrave.com/bills-are-paying-24-million-learn-what-panthers-already-knew",
    "snippet": "Another ex-Carolina connection surfaced for Samuel once his time in Washington ended. The <strong>Buffalo Bills</strong> saw something in the pass-catcher that could help. But not even two seasons into this agreement, it&#x27;s already starting to unravel.",
    "published": "September 19, 2025"
  }
]