[
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "In February 2025, he said that Ukraine would introduce special military contracts for volunteers aged 18 to 24. On 4 September 2024, most of the Shmyhal Government cabinet tendered their resignations while Zelenskyy considered his reshuffle. In February 2025, Zelenskyy met with U.S. President Trump at the White House to discuss a proposed agreement which would give the United States the right to extract rare minerals from Ukrainian soil.",
    "published": "4 days ago"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "In Warsaw, President of Ukraine <strong>Volodymyr Zelenskyy</strong> held a meeting with President of Poland Karol Nawrocki. This was the first official visit by a foreign leader to the incumbent Polish President since his inauguration in August this year.",
    "published": "3 days ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... nation&#x27;s head of government. The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "Volodymyr Zelensky’s biography — Official web site of the ...",
    "url": "https://www.president.gov.ua/en/president",
    "snippet": "20 December 2025 - 16:11 Go to all news · pgPhoto gallery · Meeting Between the President of Ukraine and the Prime Minister of Portugal · 20 December 2025 - 16:20 Go to all galleries · Home · President · <strong>Volodymyr Zelenskyy</strong> was elected ...",
    "published": "1 day ago"
  },
  {
    "title": "Next Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Ukrainian_presidential_election",
    "snippet": "On 15 December 2025, Zelenskyy said in an interview with ZDF that he would run if the next election was held during the war, but was unsure if he would run in peacetime. Article 19 of Ukraine&#x27;s &quot;On the Legal Regime of Martial Law&quot; bans presidential, parliamentary, and local elections under martial law, while Article 10 states that the powers of the president, parliament, and Cabinet of Ministers of Ukraine cannot be terminated under martial law.",
    "published": "1 week ago"
  }
]