[
  {
    "title": "Aníbal Fernández - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "He also held the positions of Secretary General of the Presidency, National Senator for the province of Buenos Aires during the period 2013-2015, <strong>Minister of the Interior and Minister of Justice, Security and Human Rights</strong> between 2002 and 2011, under the orders of three different presidents: ...",
    "published": "August 13, 2025"
  },
  {
    "title": "The disgraceful Aníbal Fernández was reelected as president of the CAH",
    "url": "https://derechadiario.com.ar/us/argentina/unpresentable-anibal-fernandez-was-reelected-as-president-cah",
    "snippet": "Previously, Fernández had been in charge of the confederation in a first stage between 2013 and 2016, when he was still <strong>president of Quilmes, National Senator, and General Secretary of the convicted Cristina Fernández de Kirchner</strong>.",
    "published": "April 27, 2025"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Fernández comenzó su carrera como <strong>asesor de la Comisión de Presupuesto</strong> de la Cámara de Senadores de la provincia de Buenos Aires en 1983. Entre 1985 y 1987 fue secretario administrativo del Movimiento Peronista de dicha Cámara y luego accedió ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "After the 2009 mid-term elections, Aníbal Fernández was chosen to become the President&#x27;s <strong>Cabinet Chief</strong>. He held this important position from July 8, 2009, until December 10, 2011.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Age, Family, Bio | Famous Birthdays",
    "url": "https://www.famousbirthdays.com/people/anibal-fernandez.html",
    "snippet": "In 1991, he was elected <strong>Mayor of Quilmes</strong> and then as a member of the Constitutional Convention of Buenos Aires in 1994. He was appointed to General Secretaty of the Presidency in 2002 which began his close ties with different Argentinean presidents.",
    "published": null
  }
]