[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "On 5 July 2015, Kasyanov was elected as the only leader of <strong>RPR-PARNAS</strong>, and the party was renamed to just PARNAS. He added he would like to eventually re-establish the institution of co-chairmanship, adding, &quot;Neither Alexei Navalny nor Mikhail Khodorkovsky will enter our party today and be elected ...",
    "published": "1 day ago"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "<strong>The People&#x27;s Alliance party</strong> was founded on 15 December 2012 at the party&#x27;s founding congress. Initially, Russian opposition figure Alexei Navalny declined to join the political party which was formed mostly by his followers.",
    "published": "September 30, 2025"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. In 2000, while he was still a student, Navalny joined <strong>Yabloko</strong>, ...",
    "published": "March 7, 2023"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "Despite his expulsion from the <strong>Yabloko party</strong>, Navalny continued being active in politics, protesting against corruption and fraud during the parliamentary elections, and against Vladimir Putin, who Navalny predicted would run.",
    "published": null
  },
  {
    "title": "Alexei Navalny, Russia's most outspoken Putin critic - BBC News",
    "url": "https://www.bbc.com/news/world-europe-16057045",
    "snippet": "Meanwhile, he and his anti-corruption ... that encouraged voters to back candidates who had a chance of defeating Mr Putin&#x27;s <strong>United Russia party</strong> in September 2021....",
    "published": "February 16, 2024"
  }
]