[
  {
    "title": "Al Hilal SFC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al_Hilal_SFC",
    "snippet": "Al Hilal receives a certain amount from the Saudi Arabia Football Federation as the federation sells the complete matches&#x27; right in one package and all the clubs in the Saudi Professional League share the revenue equally. The Saudi league broadcasting rights currently were sold to Saudi Broadcasting Authority&#x27;s SBC Channel, as well as Shahid streaming service.",
    "published": "3 weeks ago"
  },
  {
    "title": "Al-Hilal United FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al-Hilal_United_FC",
    "snippet": "Founded in 2019, the club competes in the UAE Second Division League. Al-Hilal United FC was founded in 2019 in Al Lisaili, Dubai, United Arab Emirates, and around February 2020, it was announced that <strong>Abdullah bin Musa&#x27;ad bin Abdulaziz Al Saud</strong> has ownership to the newly established club.",
    "published": "August 11, 2025"
  },
  {
    "title": "Saudi Prince Alwaleed in Talks with PIF to Acquire Al Hilal FC - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-09-02/saudi-prince-alwaleed-in-talks-with-pif-to-acquire-al-hilal-fc",
    "snippet": "Saudi billionaire <strong>Prince Alwaleed bin Talal</strong> is in talks with the Public Investment Fund to acquire a majority of Al Hilal Football Club, in what would mark one of the most high-profile privatization efforts in the kingdom’s football sector.",
    "published": "September 2, 2025"
  },
  {
    "title": "History - Al Hilal FC",
    "url": "https://alhilal.com/en/the-club/history",
    "snippet": "Following the announcement of the final report from the Saudi Football History Documentation Project team... Ninety Championships for the Leader of Saudi Football ... Chaired by Prince Nawaf bin Saad... Al-Hilal Appoints Club Company&#x27;s Board of Directors",
    "published": null
  },
  {
    "title": "Prince Alwaleed awards Al-Hilal Football Club | Arab News",
    "url": "https://www.arabnews.com/node/636911/amp",
    "snippet": "RIYADH: Prince Alwaleed bin Talal, Chairman of Kingdom Holding Company (KHC), received at his office in Riyadh on Sunday <strong>Prince Abdulrahman bin Mosaad</strong>, Chairman of Al-Hilal Football Club who was accompanied by Al-Hilal Head Coach Rigickamb from Romania and the team players.",
    "published": null
  }
]