[
  {
    "title": "François Bayrou ousted as French PM after losing confidence vote | France | The Guardian",
    "url": "https://www.theguardian.com/world/2025/sep/08/francois-bayrou-ousted-as-french-pm-after-losing-confidence-vote",
    "snippet": "François Bayrou has been ousted ... plunging France into a political crisis. <strong>Bayrou, 74, will hand his resignation to Emmanuel Macron, his longterm centrist ally, on Tuesday morning</strong>....",
    "published": "September 9, 2025"
  },
  {
    "title": "French Prime Minister Bayrou hands in resignation",
    "url": "https://www.lemonde.fr/en/politics/article/2025/09/09/french-prime-minister-bayrou-hands-in-resignation_6745201_5.html",
    "snippet": "French Prime Minister François Bayrou <strong>submitted his resignation to President Emmanuel Macron on Tuesday, September 9,</strong> after France&#x27;s parliament ousted the government in a confidence vote on Monday that Bayrou himself had called.",
    "published": "September 9, 2025"
  },
  {
    "title": "French Premier Bayrou submits resignation to Macron after confidence vote defeat",
    "url": "https://www.aa.com.tr/en/europe/french-premier-bayrou-submits-resignation-to-macron-after-confidence-vote-defeat/3682468",
    "snippet": "Bayrou, who had been in office since December 2024, <strong>tendered his resignation immediately after the National Assembly voted against his government in a confidence motion</strong>, making him the fourth French premier to be forced out since early 2024.",
    "published": null
  },
  {
    "title": "François Bayrou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fran%C3%A7ois_Bayrou",
    "snippet": "It was speculated that Bayrou would ... Édouard Philippe. On <strong>21 June 2017, he resigned from the government amid an investigation into the MoDem&#x27;s allegedly fraudulent employment of parliamentary assistants</strong>, initiated earlier that ...",
    "published": "1 week ago"
  },
  {
    "title": "France's prime minister is ousted as the nation drifts into turmoil | AP News",
    "url": "https://apnews.com/article/france-prime-minister-bayrou-macron-economy-crisis-e28574497723868f0be8b7973b84c05e",
    "snippet": "Prime Minister François Bayrou has resigned <strong>after losing a crushing confidence vote in parliament</strong>. The third toppling of a head of government in 14 months leaves President Emmanuel Macron scrambling for a successor and a nation caught in a ...",
    "published": "September 9, 2025"
  }
]