[
  {
    "title": "Trump Nominates Engineer Arvind Raman as Next NIST Director - AIP.ORG",
    "url": "https://www.aip.org/fyi/trump-nominates-engineer-arvind-raman-as-next-nist-director",
    "snippet": "<strong>President Donald Trump has selected Arvind Raman as his nominee to lead the National Institute of Standards and Technology</strong>. Congress received the nomination on Oct.",
    "published": "October 7, 2025"
  },
  {
    "title": "Trump Nominates Raman to Serve as NIST Director – MeriTalk",
    "url": "https://meritalk.com/articles/trump-nominates-raman-to-serve-as-nist-director/",
    "snippet": "<strong>The nominee will require confirmation by the Senate to begin his role</strong> and would join at a time when NIST is navigating the future of programs funded by the CHIPS and Science Act. Currently, Craig Burkhardt is serving as the acting director of NIST.",
    "published": null
  },
  {
    "title": "Trump selects Purdue engineering dean Raman to serve as next NIST director | InsideCyberSecurity.com",
    "url": "https://insidecybersecurity.com/daily-news/trump-selects-purdue-engineering-dean-raman-serve-next-nist-director",
    "snippet": "President Trump has nominated Arvind Raman, dean of Purdue University’s College of Engineering, to serve as the next director of the National Institute of Standards and Technology, filling a key role in carrying out the administration’s cybersecurity and artificial intelligence agenda.",
    "published": null
  },
  {
    "title": "Arvind Raman Nominated as Commerce Under Secretary",
    "url": "https://www.executivegov.com/articles/arvind-raman-commerce-under-sec-standards-tech-nomination",
    "snippet": "<strong>If confirmed, he would also serve as the director of the National Institute of Standards and Technology within the Department of Commerce</strong>. Laurie Locascio took on the position of president and CEO of the American National Standards Institute ...",
    "published": "October 7, 2025"
  },
  {
    "title": "Dean of Engineering nominated for undersecretary position | City & State | purdueexponent.org",
    "url": "https://www.purdueexponent.org/city_state/politics/armind-raman-dean-of-engineering-undersecretary-federal-position-trump/article_13067652-396c-4d5c-9ec4-4a74a2711d29.html",
    "snippet": "As part of that role Raman would also serve as the Director of the National Institute of Standards and Technology, which has been helmed by an <strong>acting director</strong> since the beginning of January.",
    "published": "October 8, 2025"
  }
]