[
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "<strong>Christopher Ruddy</strong> (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and majority owner of Newsmax Media.",
    "published": "5 days ago"
  },
  {
    "title": "Christopher Ruddy | Long Island University",
    "url": "https://liu.edu/roosevelt/~/link.aspx?_id=CBEEEDD71542408AA2E0F8E91B527511&_z=z",
    "snippet": "<strong>Christopher Ruddy</strong> is CEO and President of Newsmax Media Inc., a leading digital and television news media company. Ruddy, who grew up near Sagamore Hill, has been a long-time member of the Theodore Roosevelt Association and often reference Theodore Roosevelt in his commentaries on current U.S.",
    "published": null
  },
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "Later, Richard Mellon Scaife, Ruddy&#x27;s former employer at the Pittsburgh Tribune-Review, invested in the fledgling company. One of the initial board members was author James Dale Davidson, who edited a financial newsletter. Davidson&#x27;s co-editor, <strong>Lord Rees-Mogg</strong>, former editor of the Times of ...",
    "published": "1 week ago"
  },
  {
    "title": "Chris Ruddy - EarthX",
    "url": "https://earthx.org/speaker/chris-ruddy/",
    "snippet": "<strong>Christopher Ruddy</strong> founded Newsmax Media, Inc. in 1998 and serves as its CEO. Newsmax today is one of the nation’s leading broadcasting and digital media companies. The Company includes the Newsmax network, the 4th highestrated cable news channel ...",
    "published": "September 25, 2025"
  },
  {
    "title": "Chris Ruddy '87C | St. John's University",
    "url": "https://www.stjohns.edu/news-media/success-stories/chris-ruddy-87c",
    "snippet": "Ruddy today presides over the burgeoning success of the media company that includes the news website known as Newsmax.com. The site boasts an estimated 20–30 million monthly visitors and is the third-most viewed political website in the country. Newsmax Magazine has more than 400,000 monthly readers and the company’s cable news channel, Newsmax TV, launched in 2014.",
    "published": null
  }
]