[
  {
    "title": "Marcus Morris Sr. - New York Knicks Forward - ESPN",
    "url": "https://www.espn.com/nba/player/_/id/6462/marcus-morris-sr",
    "snippet": "View the profile of New York Knicks Forward Marcus Morris Sr. on ESPN. Get the latest news, live stats and game highlights.",
    "published": null
  },
  {
    "title": "Marcus Morris Sr. | New York Knicks | NBA.com",
    "url": "https://www.nba.com/player/202694/marcus-morris-sr",
    "snippet": "<strong>Morris will join the Knicks on a one-year deal</strong>, Shams Charania of The Athletic reports.",
    "published": null
  },
  {
    "title": "Marcus Morris Sr. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcus_Morris_Sr.",
    "snippet": "<strong>On September 15, 2024, Morris re-signed with the New York Knicks, but was waived on September 28.</strong> Morris is seven minutes younger than his identical twin brother, Markieff. He is a fan of his hometown Philadelphia Eagles while Markieff roots for the rival Dallas Cowboys.",
    "published": "November 11, 2025"
  },
  {
    "title": "Former KU Jayhawks forward Marcus Morris lands contract with NBA’s New York Knicks",
    "url": "https://www.kansascity.com/sports/college/big-12/university-of-kansas/article292538249.html",
    "snippet": "He <strong>played for the Knicks during the 2019-20 season</strong>. Boston Celtics forward Jayson Tatum (0) drivers the ball against Cleveland Cavaliers forward Marcus Morris Sr. (24) in the third quarter during Game 5 of the second round for the 2024 NBA playoffs ...",
    "published": "September 16, 2024"
  },
  {
    "title": "Marcus Morris Sr. News, Rumors, Updates - New York Knicks | FOX Sports",
    "url": "https://www.foxsports.com/nba/marcus-morris-player",
    "snippet": "Let go by New York <strong>The Knicks waived Morris on Saturday, Tim Bontemps of ESPN.com reports. Impact Morris signed with the Knicks earlier this offseason but was let go before playing a single game. The 35-year-old forward will now enter the 2024-25 season as a free agent</strong>. ... Marcus Morris Sr.",
    "published": null
  }
]