[
  {
    "title": "Hawker Siddeley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Siddeley",
    "snippet": "Hawker Siddeley also operated in other industrial markets, such as locomotive building (through its ownership of Brush Traction) and diesel engine manufacture (through its ownership of Lister Petter). The company was once a constituent of the FTSE 100 Index. Hawker Siddeley Aircraft was formed in 1935 as a result of the purchase by Hawker Aircraft of the companies of J.",
    "published": "August 29, 2025"
  },
  {
    "title": "Hawker Aircraft - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Aircraft",
    "snippet": "In 1933, the company was renamed Hawker Aircraft Limited, and it took advantage of the Great Depression and a strong financial position to purchase the Gloster Aircraft Company in 1934. The next year, it merged with the engine and automotive company <strong>Armstrong Siddeley</strong> and its subsidiary, Armstrong ...",
    "published": "2 weeks ago"
  },
  {
    "title": "History of HAWKER SIDDELEY GROUP PUBLIC LIMITED COMPANY – FundingUniverse",
    "url": "https://www.fundinguniverse.com/company-histories/hawker-siddeley-group-public-limited-company-history/",
    "snippet": "Its founder, <strong>Tommy Sopwith</strong>, produced the famous Sopwith Camel that shot down Germany&#x27;s World War I flying ace, the Red Baron. In World War II the company produced the Hawker Hurricane, which played a crucial role in the Battle of Britain in 1940.",
    "published": null
  },
  {
    "title": "Hawker Siddeley | BAE Systems | United Kingdom",
    "url": "https://www.baesystems.com/en-uk/heritage/hawker-siddeley",
    "snippet": "The Hawker Siddeley brand was known worldwide with interests in railways (both diesel and electric) and rapid transport systems and the name of its founder <strong>Harry Hawker</strong> still continued in aviation until 2012 as the Hawker Beechcraft Corporation.",
    "published": null
  },
  {
    "title": "Hawker Siddeley Group Public Limited Company | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/books/politics-and-business-magazines/hawker-siddeley-group-public-limited-company",
    "snippet": "Hawker Siddeley is still associated with the romance of the early days of aviation. Its founder, <strong>Tommy Sopwith</strong>, produced the famous Sopwith Camel that shot down Germany’s World War I flying ace, the Red Baron. In World War II the company produced the Hawker Hurricane, which played a crucial ...",
    "published": null
  }
]