[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The McClatchy Company bought Knight Ridder in June 2006 with intentions of selling 12 Knight Ridder newspapers. On August 2, 2006, McClatchy sold the Beacon Journal to Black Press. In 2018, <strong>GateHouse Media bought the newspaper</strong>. On November 11, 2013, the Akron Beacon Journal printed its last ...",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal Sold to GateHouse Media, Owner of Columbus Dispatch, Canton Repository",
    "url": "https://www.clevescene.com/news/akron-beacon-journal-sold-to-gatehouse-media-owner-of-columbus-dispatch-canton-repository-17221068/",
    "snippet": "<strong>The Akron Beacon Journal has been sold to Gatehouse Media</strong>, the largest publisher of daily newspapers in the United States and the owner of the Columbus Dispatch, the Canton Repository and a preponderance of smaller-town dailies.",
    "published": "June 2, 2025"
  },
  {
    "title": "Akron Beacon Journal 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/153167-50",
    "snippet": "Information on acquisition, funding, investors, and executives for Akron Beacon Journal. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Updated plan for former Beacon Journal building includes 120 affordable apartments",
    "url": "https://www.beaconjournal.com/story/business/2025/09/25/former-akron-beacon-journal-building-plans-apartments-offices-retail/86329463007/",
    "snippet": "The 44 E. Exchange St. building has been vacant since the Beacon Journal moved its offices to the AES Building in downtown Akron in 2019. Summit County Fiscal Office records show ABJ Building LLC purchased the property for $1.1 million from Beacon Journal Publishing Co. in August 2020. In December 2023, the Ohio Department of Development announced a more than $5 million tax credit for a previous proposal by Troppe to convert the building to a mixed-use concept with 197 apartment units at a total project cost of more than $54 million.",
    "published": "September 25, 2025"
  },
  {
    "title": "Akron Beacon Journal: Local News, Politics & Sports in Akron, OH",
    "url": "https://www.beaconjournal.com",
    "snippet": "Get the latest breaking news, sports, entertainment and obituaries in Akron, OH from Akron Beacon Journal.",
    "published": "2 days ago"
  }
]