[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and is on the advisory board of the University of Austin.",
    "published": "3 days ago"
  },
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "Teaching the Value of Science and Advancing Secularism Founded in 2006 by Richard Dawkins, the foundation’s mission is to realize Richard’s vision to remove ...",
    "published": "July 17, 2025"
  },
  {
    "title": "OPEN DISCUSSION MARCH 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/2025/03/open-discussion-march-2025/",
    "snippet": "I happen to think that government service is an honorable profession, based partially on a 30 year career and even longer dealing with government workers while I was at a private law firm. Government employees work very hard every day to provide the services their agencies were designed for.",
    "published": "April 1, 2025"
  },
  {
    "title": "Richard Dawkins on X: \"Cruise the blue Antarctic waters with me aboard @SwanHellenic's Vegas. This January 2025, witness dramatic icebergs, towering mountains, and observe wildlife in their pristine environment. Learn more: https://t.co/bQbdRqijGC https://t.co/8nqsSOz0CO\" / X",
    "url": "https://x.com/RichardDawkins/status/1824412095636447596",
    "snippet": "Richard Dawkins · @RichardDawkins · Cruise the blue Antarctic waters with me aboard · @SwanHellenic&#x27;s Vegas. This January 2025, witness dramatic icebergs, towering mountains, and observe wildlife in their pristine environment. Learn more: https://shorturl.at/KClIT ·",
    "published": null
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "Much of Dawkins’s work has generated debate for asserting the supremacy of science over religion in explaining the world. He also asserts that laws of probability preclude the existence of an omnipotent creator. After earning his master’s and doctorate degrees in zoology in 1966 at the University of Oxford under famed ethologist Nikolaas Tinbergen (who was best known for his work with both instinctive and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley.",
    "published": "July 15, 2009"
  }
]