[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "There, Singh was enrolled in the <strong>upper-primary Khalsa School</strong>. He sat for his matriculation examination in the summer of 1947.",
    "published": "2 days ago"
  },
  {
    "title": "From a village 600 km away in Pakistan, a last dua for ‘Mohna’, the boy who left during Partition | Chandigarh News - The Indian Express",
    "url": "https://indianexpress.com/article/cities/chandigarh/last-dua-mohna-village-pakistan-9747681/",
    "snippet": "However, during the end of his tenure as PM in 2014, he had expressed his wish to visit his birthplace in Pakistan, but only “when circumstances were appropriate”. That however, never happened. ... <strong>The Government Primary School at Gah</strong> has ...",
    "published": "December 29, 2024"
  },
  {
    "title": "Manmohan Singh Education: Former PM Schooling, Colleges, Degrees and Academic Achievements",
    "url": "https://www.jagranjosh.com/articles/manmohan-singh-education-qualification-1735280163-1",
    "snippet": "Manmohan Singh from the information provided below: Dr. Manmohan Singh began his educational journey in Gah, a small village in Punjab (now in Pakistan). <strong>He attended the local primary school in his village</strong>.",
    "published": "December 27, 2024"
  },
  {
    "title": "'A single meeting with staff of Dr Manmohan Singh ushered an era of development in our village' | Amritsar News - Times of India",
    "url": "https://timesofindia.indiatimes.com/city/amritsar/a-single-meeting-with-staff-of-dr-manmohan-singh-ushered-an-era-of-development-in-our-village/articleshow/116757243.cms",
    "snippet": "He said that the villagers had hoped that if a single meeting could usher in an era of development for their community and if Dr. Manmohan Singh himself visited his birthplace, it might have had a significant impact. He also pointed out that the Manmohan Singh Primary School still stands in Gah.When asked about the ancestral house of Dr.",
    "published": "December 29, 2024"
  },
  {
    "title": "CURRICULUM VITAE DR. MANMOHAN SINGH PRIME MINISTER OF INDIA ACADEMIC RECORD",
    "url": "https://www.visvabharati.ac.in/files/6340200114_Manmohan.pdf",
    "snippet": "DR. MANMOHAN SINGH",
    "published": null
  }
]