[
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "The current president of the European Central Bank is <strong>Christine Lagarde</strong>, previously the chair and managing director of the International Monetary Fund.",
    "published": "September 25, 2025"
  },
  {
    "title": "ECB's Lagarde determined to complete her term, spokesperson says | Reuters",
    "url": "https://www.reuters.com/world/europe/ecbs-lagarde-determined-complete-her-term-spokesperson-says-2025-05-28/",
    "snippet": "European Central Bank (ECB) President <strong>Christine Lagarde</strong> addresses the media, following the Governing Council&#x27;s monetary policy meeting at the ECB headquarters, in Frankfurt, Germany, January 30, 2025.",
    "published": "May 28, 2025"
  },
  {
    "title": "European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Central_Bank",
    "snippet": "In May 2025, the European Central Bank launched a platform involving around 70 market participants to test digital euro payment functionalities and use cases. The initiative includes banks, fintechs, and merchants, aiming to simulate a digital euro ecosystem and support the development of future payment solutions. As of August 2025, enabling legislation has not been passed by European lawmakers to enable the digital euro to become operational. Bank president Lagarde has urged lawmakers to &quot;seize the &#x27;euro moment&#x27;&quot; and rapidly put in place a legislative framework to &quot;pave the way for the potential introduction of a digital euro,&quot; in order to address the considerable risk posed by U.S.",
    "published": "4 days ago"
  },
  {
    "title": "ECB says digital euro is ready, urges EU to act",
    "url": "https://www.coindesk.com/policy/2025/12/18/ecb-s-christine-lagarde-shifts-focus-to-digital-euro-rollout-after-holding-rates",
    "snippet": "The European Central Bank has completed its preparatory work on the digital euro, awaiting action from political institutions. ECB President <strong>Christine Lagarde</strong> emphasized a data-driven approach to interest rate decisions, with inflation projected ...",
    "published": "4 days ago"
  },
  {
    "title": "'Europe's existential crisis': ECB's Lagarde calls for urgent reforms | Euronews",
    "url": "https://www.euronews.com/business/2025/12/10/europes-existential-crisis-ecbs-lagarde-calls-for-urgent-reforms",
    "snippet": "FILE. European Central Bank President <strong>Christine Lagarde</strong> speaks during the press conference following the Governing Council meeting in Florence, Italy. 30 Oct. 2025.",
    "published": "2 weeks ago"
  }
]