[
  {
    "title": "Hawker Siddeley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Siddeley",
    "snippet": "Hawker Siddeley combined the legacies of several British aircraft manufacturers, emerging through a series of mergers and acquisitions as one of only two such major British companies in the 1960s. In <strong>1977</strong>, Hawker Siddeley became a founding component of the nationalised British Aerospace (BAe).",
    "published": "August 29, 2025"
  },
  {
    "title": "History of HAWKER SIDDELEY GROUP PUBLIC LIMITED COMPANY – FundingUniverse",
    "url": "https://www.fundinguniverse.com/company-histories/hawker-siddeley-group-public-limited-company-history/",
    "snippet": "Its founder, <strong>Tommy Sopwith</strong>, produced the famous Sopwith Camel that shot down Germany&#x27;s World War I flying ace, the Red Baron. In World War II the company produced the Hawker Hurricane, which played a crucial role in the Battle of Britain in 1940.",
    "published": null
  },
  {
    "title": "Hawker Siddeley | BAE Systems | United Kingdom",
    "url": "https://www.baesystems.com/en-uk/heritage/hawker-siddeley",
    "snippet": "The Hawker Siddeley brand was known worldwide with interests in railways (both diesel and electric) and rapid transport systems and the name of its founder <strong>Harry Hawker</strong> still continued in aviation until 2012 as the Hawker Beechcraft Corporation.",
    "published": null
  },
  {
    "title": "Hawker Siddeley Group Public Limited Company | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/books/politics-and-business-magazines/hawker-siddeley-group-public-limited-company",
    "snippet": "Hawker Siddeley is still associated with the romance of the early days of aviation. Its founder, <strong>Tommy Sopwith</strong>, produced the famous Sopwith Camel that shot down Germany’s World War I flying ace, the Red Baron. In World War II the company produced the Hawker Hurricane, which played a crucial ...",
    "published": null
  },
  {
    "title": "Hawker Siddeley Group PLC | Science Museum Group Collection",
    "url": "https://collection.sciencemuseumgroup.org.uk/people/ap17246/hawker-siddeley-group-plc",
    "snippet": "Hawker Siddeley Group PLC was initially formed as the Hawker Siddeley Aircraft Company on <strong>11th July 1935</strong>. The new company was established to acquire all of the shares of the Armstrong Siddeley Development Company and 50% of the shares of the ...",
    "published": null
  }
]