[
  {
    "title": "A Successful Model? Die Linke (the Left Party — Germany) | SpringerLink",
    "url": "https://link.springer.com/chapter/10.1057/9781137265111_5",
    "snippet": "Under the leadership of <strong>Gregor Gysi and Lothar Bisky</strong> it established itself as a significant political force in the eastern states of Germany, often in coalition with the Social Democratic Party (SPD) in regional government.",
    "published": null
  },
  {
    "title": "Oskar Lafontaine and the troubled German Left",
    "url": "https://peoplesworld.org/article/oskar-lafontaine-and-the-troubled-german-left/",
    "snippet": "Die Linke was formed when <strong>the Party of Democratic Socialism, a reformed child of the old ruling party in the German Democratic Republic, known best for its witty, mercurial leader Gregor Gysi</strong>, joined three years ago with a new West German party, ...",
    "published": "January 28, 2010"
  },
  {
    "title": "A Better Europe is Possible",
    "url": "https://jacobin.com/2015/03/oskar-lafontaine-interview-die-linke",
    "snippet": "Die Linke&#x27;s Oskar Lafontaine and Gregor Gysi on a 2009 campaign poster.",
    "published": null
  },
  {
    "title": "Oskar Lafontaine leaves the Left Party - World Socialist Web Site",
    "url": "https://www.wsws.org/en/articles/2022/03/22/lafo-m22.html",
    "snippet": "On March 17, the 78-year-old declared his resignation from Die Linke (Left Party), which he <strong>jointly founded in 2007 with Gregor Gysi</strong>.",
    "published": null
  },
  {
    "title": "Great and severe tasks lie ahead of us: DIE LINKE. English pages",
    "url": "https://en.die-linke.de/news/selected-news/detail/great-and-severe-tasks-lie-ahead-of-us-1-1/",
    "snippet": "We are a party of 73,500 members, that’s not a question. Naturally, a party also needs leadership figures. We are not just one leadership figure; we are a team. We are also the party of Lothar Bisky and, on this day, we are especially the party of Gregor Gysi.",
    "published": null
  }
]