[
  {
    "title": "Presidency of Alberto Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Presidency_of_Alberto_Fern%C3%A1ndez",
    "snippet": "On 20 July 2021, Fernández signed ... legally recognize non-binary gender on all official documentation. Fernández first appointed anthropologist <strong>Sabina Frederic</strong> as security minister....",
    "published": "November 7, 2025"
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "In 2021, he was appointed as Minister of Security in replacement of <strong>Sabina Frederic</strong>, as part of a cabinet reshuffle following the government&#x27;s poor showings in the 2021 legislative primary elections. In 2006, Anibal Fernández, who was serving as the Interior Minister at the time, referred ...",
    "published": "November 15, 2025"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "During Kirchner’s government he was named minister of interior in 2003 and in 2007, and during Cristina Fernandez’s government, he was assigned as minister of justice, security and human rights. Fernández received a degree in public accounting from Universidad Nacional de Lomas and later graduated as a lawyer from the same institution. Aníbal Fernández es candidato a gobernador de la Provincia de Buenos Aires y actualmente jefe de Gabinete de Ministros de la presidencia de la República Argentina.",
    "published": null
  },
  {
    "title": "The Berni Headlock and the Cristina Shake | Buenos Aires Times",
    "url": "https://www.batimes.com.ar/news/amp/opinion-and-analysis/the-berni-headlock-and-the-cristina-shake.phtml",
    "snippet": "And Berni was always part of a specific communication strategy where the continued criticism of former national security minister <strong>Sabrina Frederic</strong> coupled with a hands-on tough guy approach on crime helped a sector the ruling coalition portray ...",
    "published": null
  },
  {
    "title": "Argentina - Politics",
    "url": "https://www.globalsecurity.org/military/world/argentina/president-fernandez-a.htm",
    "snippet": "<strong>Alberto Fernandez</strong> is not to be confused with former Justice Minister Anibal Fernandez (AF), whom Argentine President Cristina Fernandez de Kirchner&#x27;s (CFK) promoted to Cabinet Chief in September 2009.",
    "published": null
  }
]