[
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Initially, Russian opposition figure Alexei Navalny declined to join the political party which was formed mostly by his followers. During the founding congress of 15 December 2012, Navalny said: &quot;People&#x27;s Alliance is my party, but I don&#x27;t think that right now People&#x27;s Alliance needs another member who spends his time torn between the Investigative Committee and some court hearing involving Rosneft.",
    "published": "September 30, 2025"
  },
  {
    "title": "Russia of the Future - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q54553317",
    "snippet": "political party in Russia",
    "published": null
  },
  {
    "title": "The political opposition in Russia - European Parliament",
    "url": "https://www.europarl.europa.eu/meetdocs/2014_2019/plmrep/COMMITTEES/AFET/DV/2020/11-27/Russian_opposition_background_note_2020_final_EN.pdf",
    "snippet": "The Anti-Corruption Foundation (FBK). Russia of the Future. Smart Vote ... Open Russia. Solidarnost ... The Russian opposition operates in an increasingly hostile environment. The landscape of · opposition in Russia is marked by two types of opposition, on the one hand political parties that",
    "published": null
  },
  {
    "title": "Russian opposition party that wants Ukraine ceasefire vows to keep campaigning despite crackdown | Reuters",
    "url": "https://www.reuters.com/business/media-telecom/russian-opposition-party-that-wants-ukraine-ceasefire-vows-keep-campaigning-2025-12-15/",
    "snippet": "MOSCOW, Dec 15 (Reuters) - The founder of Russia&#x27;s opposition Yabloko party, which wants a ceasefire in Ukraine, has said <strong>his party will keep campaigning despite the arrest of two senior figures</strong>, a move he said was meant to derail it before ...",
    "published": "1 day ago"
  },
  {
    "title": "The Russian economy in 2025: Between stagnation and militarization - Atlantic Council",
    "url": "https://www.atlanticcouncil.org/content-series/russia-tomorrow/the-russian-economy-in-2025-between-stagnation-and-militarization/",
    "snippet": "The Eurasia Center’s new “Russia Tomorrow” series seeks to reevaluate conceptions of Russia today and better prepare for its future tomorrow. ... In the three and a half years since Russia launched its full-scale invasion of Ukraine, its economy has continued to grow, supported by increased militarization. This resilience is a far cry from Western governments’ prognosis in the early days of the war that sanctions would crash the Russian economy. Sky-high energy prices and hesitation on the part of Western leaders to push for stronger enforcement of sanctions kept the Russian economy afloat in 2022.",
    "published": "4 days ago"
  }
]