[
  {
    "title": "European Bank for Reconstruction and Development - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Bank_for_Reconstruction_and_Development",
    "snippet": "Consequently, the two divisions ... from each member state compose this board, they have authority power. Currently (2024-2025) <strong>Slovenia is the Chair of Board of Governors</strong>, while Iceland and Turkey are the Vice Chairs....",
    "published": "1 week ago"
  },
  {
    "title": "Odile Renaud-Basso | World Bank Live",
    "url": "https://live.worldbank.org/en/experts/o/odile-renaud-basso",
    "snippet": "The EBRD’s Board of Governors elected Ms Renaud-Basso as the Bank’s seventh President in October 2020 during its 29th Annual Meeting. She took up the role in November 2020, replacing <strong>Sir Suma Chakrabarti</strong>, who had stepped down in July 2020 ...",
    "published": null
  },
  {
    "title": "Odile Renaud-Basso - European Commission",
    "url": "https://commission.europa.eu/persons/odile-renaud-basso_en",
    "snippet": "<strong>Odile Renaud-Basso</strong> was elected the 7th President of EBRD on 2 November 2020 by the EBRD&#x27;s Board of Governors and is the first ever female head of a multilateral development bank.",
    "published": null
  },
  {
    "title": "Directors of the EBRD",
    "url": "https://www.ebrd.com/directors-of-the-ebrd.html",
    "snippet": "He has overall responsibility for the effective delivery of EBRD investments and advisory activities in the Bank’s countries of operation, in addition to contributing to the delivery of EBRD policy engagement activities. <strong>Mr Patrone</strong> previously ...",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development (EBRD) | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/crs-product/IF11419",
    "snippet": "At the EBRD&#x27;s May 2022 annual meeting, ... now and for reconstruction.&quot; In August 2022, the Biden Administration nominated <strong>Richard L. A. Weiner</strong>, a lawyer at Sidley Austin, to be the U.S executive director at the Bank....",
    "published": null
  }
]