[
  {
    "title": "Golden State Warriors - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Golden_State_Warriors",
    "snippet": "For the full season-by-season history, see List of Golden State Warriors seasons. Note: GP = Games played, W = Wins, L = Losses, W–L% = Winning percentage ... Like all NBA teams, the Warriors retain the draft rights to players they draft but do not sign and who choose to play outside the NBA. The rights expire one year after the player&#x27;s contract with the non-NBA team ends. Draft rights may also be acquired through trades with other teams. As of 2025, the Warrior retain the draft rights of:",
    "published": "3 days ago"
  },
  {
    "title": "Warriors | Golden State Warriors",
    "url": "https://www.nba.com/warriors/gsw-sports-llc",
    "snippet": "Golden State Warriors",
    "published": null
  },
  {
    "title": "Joe Lacob - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Joe_Lacob",
    "snippet": "<strong>Joseph Steven Lacob</strong> (born January 10, 1956) is an American business executive who was a partner at Kleiner Perkins and is the principal owner of the Golden State Warriors of the National Basketball Association (NBA) and the Golden State Valkyries of the Women&#x27;s National Basketball Association ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Warriors, Valkyries Launch Corporate Rebrand as Golden State",
    "url": "https://www.sportico.com/leagues/basketball/2025/warriors-valkyries-rebrand-golden-state-1234851130/",
    "snippet": "Photo by Getty Images · <strong>Joe Lacob and Peter Guber</strong> bought the Golden State Warriors in 2010 for $450 million when the team was a tenant in Oracle Arena, the NBA’s oldest building.",
    "published": "May 5, 2025"
  },
  {
    "title": "Golden State Warriors - Owners - RetroSeasons.com",
    "url": "https://www.retroseasons.com/teams/golden-state-warriors/history/owners/",
    "snippet": "Golden State Warriors Media Guide · 79 issues 1947-2025 · This media guide is a comprehensive resource created by the team to provide detailed information about its players, coaches, history,... / This media guide is a comprehensive resource created by the team to provide detailed information about its players, coaches, history, and season schedule.",
    "published": "March 21, 2023"
  }
]