[
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "<strong>Almazbek Atambayev</strong> was peacefully succeeded by Sooronbay Jeenbekov in 2017. However, Jeenbekov resigned from office due to the 2020 Kyrgyzstani protests and was succeeded by Sadyr Japarov. indicates an individual serving as an acting or provisional president of Kyrgyzstan",
    "published": "November 11, 2025"
  },
  {
    "title": "Sadyr Japarov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sadyr_Japarov",
    "snippet": "<strong>Sadyr Nurgojo uulu Japarov</strong> (born 6 December 1968) is a Kyrgyz politician who has been serving as the sixth president of Kyrgyzstan since 28 January 2021. He previously served as the 22nd prime minister in the 2020 interim government, following the resignation of President Sooronbay Jeenbekov.",
    "published": "2 weeks ago"
  },
  {
    "title": "Biography",
    "url": "https://president.kg/en/president/biography",
    "snippet": "Biography, education and work experience of the President of the Kyrgyz Republic",
    "published": null
  },
  {
    "title": "Kurmanbek Bakiyev | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Kurmanbek-Bakiyev",
    "snippet": "<strong>Kurmanbek Bakiyev</strong>, Kyrgyz politician who served as prime minister (2000–02) and president (2005–10) of Kyrgyzstan. His increasingly authoritarian policies and accusations of corruption both played a role in the violent unrest that ultimately ...",
    "published": "March 3, 2009"
  },
  {
    "title": "Sooronbay Jeenbekov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sooronbay_Jeenbekov",
    "snippet": "Jeenbekov&#x27;s election marks the first democratic transfer of power in a Kyrgyz election in which Azay Guliyev confirmed the election to be one of the few peaceful elections in Kyrgyzstan&#x27;s history. Jeenbekov was inaugurated as president on 24 November 2017 in a ceremony that took place in the Enesay reception house of the Ala Archa State Residence.",
    "published": "October 3, 2025"
  }
]