[
  {
    "title": "New Athletes' Commission members announced | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/athletes-commission-members-2025-2029",
    "snippet": "The six seats that were available for election in 2025 include the Deputy Chair position, which will be voted on by the Athletes’ Commission now the elections have been held. The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December 2016. Since 2019, the Chairperson ...",
    "published": null
  },
  {
    "title": "Candidates announced for 2025 Athletes' Commission elections | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/candidates-2025-athletes-commission-elections",
    "snippet": "The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December 2016. Since 2019, the Chairperson and one other member of the Athletes’ Commission – one man and one woman – have been full voting members of the World Athletics Council.",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "Included in its charge is the ... of athletics competitions, including the World Athletics Championships. The organisation&#x27;s current president is <strong>Sebastian Coe</strong> of the United Kingdom, who was elected to the four-year position in 2015, and re-elected twice in 2019 and 2023 for ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "<strong>Sebastian Coe</strong> is Chancellor of Loughborough University, Executive Chairman of CSM Sport and Entertainment and a member of the IOC Tokyo 2020 Coordination Committee and council member of the Association of Summer Olympic International Federations ...",
    "published": null
  },
  {
    "title": "2025 World Athletics Championships - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_World_Athletics_Championships",
    "snippet": "In August 2024, World Athletics released the timetable for the championships. ... On 5 September 2025, World Athletics officially published the final entry lists to the championships.",
    "published": "1 week ago"
  }
]