[
  {
    "title": "Current Shareholding - Juventus Football Club",
    "url": "https://www.juventus.com/en/club/investor-relations/shareholding-title/current-shareholding",
    "snippet": "As of 7 November 2025 the shareholding structure of Juventus Football Club S.p.A.",
    "published": null
  },
  {
    "title": "Board of Directors and Control Bodies - Juventus",
    "url": "https://www.juventus.com/en/club/corporate-governance/board/",
    "snippet": "Board of Directors and Control Bodies of Juventus Football Club S.p.A.: Board of Directors, Honorary Presidents, Board of Auditors.",
    "published": null
  },
  {
    "title": "Juventus Owners: Past & Present Ownership Details",
    "url": "https://www.sportsdunia.com/football-teams/juventus-owners",
    "snippet": "<strong>The Agnelli Family</strong> is the current owners of Juventus through their company, Exor N.V.",
    "published": "June 27, 2025"
  },
  {
    "title": "About Juventus | Juventus.com",
    "url": "https://www.juventus.com/en/about-us-app",
    "snippet": "Juventus is the most successful Italian team and one of the most decorated in European football. In 1985 was the first ever club to win all the available international trophies. All club’s records have been achieved under the ownership of the Agnelli&#x27;s family, a record itself as, with 96 and counting years, it is the longest active ownership of a professional sport entities in the world.",
    "published": null
  },
  {
    "title": "Andrea Agnelli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Andrea_Agnelli",
    "snippet": "In May 2010, Agnelli was appointed chairman of the club&#x27;s board of directors after the stakeholders assembly, and became the fourth member of the Agnelli family to run the football club after his father, his uncle, and his grandfather. Elkann and the previous Juventus management led by Giovanni Cobolli Gigli and Blanc, had come under criticism from club&#x27;s fans for the team&#x27;s poor results during the 2009–10 Serie A, and many Juventus ultras saw Agnelli as the rightful heir due to his family&#x27;s long-time association with the club.",
    "published": "3 weeks ago"
  }
]