[
  {
    "title": "slaughtr | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/faculty/slaughtr",
    "snippet": "She served as <strong>dean of the Princeton School of Public and International Affairs from 2002 to 2009.</strong>For more information, visit website.Please contact Denise Barksdale (New America) ...",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anne-Marie_Slaughter",
    "snippet": "Slaughter attended the Princeton School of Public and International Affairs, where she <strong>graduated magna cum laude with an B.A. from in 1980</strong>. Mentored by Richard H. Ullman, She received her M.Phil. in international affairs from Worcester College, Oxford, in 1982 and her J.D.",
    "published": "October 1, 2025"
  },
  {
    "title": "Anne-Marie Slaughter",
    "url": "https://slaughter.scholar.princeton.edu/",
    "snippet": "From 2002 to 2009 she was Bert G. Kerstetter ‘66 University Professor of Politics and International Affairs and <strong>Dean of the School of Public and International Affairs at Princeton University</strong>. In 2009 Secretary of State Hillary Clinton appointed her as the first woman Director of Policy Planning ...",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter | Princeton Politics",
    "url": "https://politics.princeton.edu/people/anne-marie-slaughter",
    "snippet": "Upon leaving the State Department she received the Secretary’s Distinguished Service Award for her work leading the Quadrennial Diplomacy and Development Review, as well as meritorious service awards from USAID and the Supreme Allied Commander for Europe. Prior to her government service, Dr. Slaughter was the Dean of Princeton’s Woodrow Wilson School of Public and International Affairs from 2002–2009 and the J.",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter | Office of the Dean of the Faculty",
    "url": "https://dof.princeton.edu/people/anne-marie-slaughter",
    "snippet": "It is hard to leave such extraordinary ... said Anne-Marie Slaughter, the Bert G. Kerstetter ’<strong>66 University Professor of Politics and International Affairs at the Woodrow Wilson School in Public and International Affairs</strong>, in announcing that in September she will become a professor ...",
    "published": null
  }
]