[
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "This and other abilities imply ... instead as a sort of &quot;moderating power&quot; among the traditional three. The current president of Portugal is <strong>Marcelo Rebelo de Sousa</strong>, who took office on 9 March 2016....",
    "published": "1 week ago"
  },
  {
    "title": "2026 Portuguese presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2026_Portuguese_presidential_election",
    "snippet": "Despite the attempt from Seguro&#x27;s opponents to draft the runner-up of the 2016 presidential election, António Sampaio da Nóvoa, and a final failed effort from Santos Silva to gain support to run, <strong>António José Seguro</strong> ended up announcing his candidacy in June 2025, receiving an almost unanimous ...",
    "published": "5 hours ago"
  },
  {
    "title": "Luís Montenegro - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lu%C3%ADs_Montenegro",
    "snippet": "Under Montenegro’s leadership, ... in the 2024 Portuguese legislative election. He was appointed prime minister by President <strong>Marcelo Rebelo de Sousa</strong>, leading the XXIV Constitutional Government, a coalition minority government. His government fell in March 2025 after losing ...",
    "published": "5 days ago"
  },
  {
    "title": "Portugal's president invites caretaker PM to lead new government | Reuters",
    "url": "https://www.reuters.com/world/europe/portugals-president-invites-caretaker-pm-lead-new-government-2025-05-29/",
    "snippet": "Luis Montenegro, Social Democratic Party (PSD) and Democratic Alliance (AD) leader, meets with Portugal President <strong>Marcelo Rebelo de Sousa</strong> at Belem Palace, following the final results of the general elections in Lisbon, Portugal, May 29, 2025.",
    "published": "May 29, 2025"
  },
  {
    "title": "General Elections 2025 Portugal",
    "url": "https://www.robert-schuman.eu/en/monitor/6520-the-social-democratic-party-of-outgoing-prime-minister-luis-montenegro-favourite-in-the-general-election-in-portugal-on-18-may",
    "snippet": "... On 13 March 2025, the President of the Portuguese Republic, <strong>Marcelo Rebelo de Sousa</strong>, announced the dissolution of the Assembly of the Republic, the sole chamber of parliament, and called on his fellow citizens to go to the polls on 18 May.",
    "published": null
  }
]