[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "It was first located at De Lesseps Field in Toronto, before moving to Downsview in 1929. The company was <strong>founded to build Moth aircraft for the training of Canadian airmen</strong>. Following the Second World War, de Havilland Canada began to build its own designs uniquely suited to the harsh Canadian ...",
    "published": "3 days ago"
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "The de Havilland company <strong>became a member of the Hawker Siddeley group in 1960, but lost its separate identity in 1963</strong>. Later, Hawker Siddeley merged into what is eventually known today as BAE Systems, the British aerospace and defence business. The de Havilland name lives on in De Havilland ...",
    "published": "November 1, 2025"
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "De Havilland Canada&#x27;s history includes <strong>being a UK subsidiary and producing iconic aircraft like the Chipmunk and Beaver</strong>. The company transitioned from British ownership to Canadian to American, ultimately landing under Longview&#x27;s umbrella.",
    "published": "February 21, 2024"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "De Havilland Aircraft of Canada was founded as a subsidiary of England’s de Havilland Aircraft Company in 1928. During the Second World War, de Havilland produced the multi-purpose Mosquito and training airplane Tiger Moth at its Downsview facility in Toronto.",
    "published": null
  },
  {
    "title": "About - De Havilland Canada",
    "url": "https://dehavilland.com/about/",
    "snippet": "Over generations, the company evolved to lead Canadian aerospace innovation by designing and delivering over 5,000 aircraft that access remote communities, deliver aid and cargo, save lives, and safeguard communities the world over. From our aviation roots with legendary aircraft like the Beaver, Buffalo, Caribou and Otter; to today’s fleet of Dash 8s, Twin Otters and Aerial Firefighters, including the new De Havilland Canadair 515, that help protect and move people around the world, De Havilland Canada is dedicated to advancing our near-100-year reputation of excellence in innovation, production, and customer support, while manufacturing aircraft that get the job done.",
    "published": "March 15, 2023"
  }
]