[
  {
    "title": "Christophe Galtier - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christophe_Galtier",
    "snippet": "On 5 July 2022, Galtier agreed a two-year deal to become the manager of Ligue 1 champions Paris Saint-Germain, replacing <strong>Mauricio Pochettino</strong>. In his first transfer window, he oversaw the arrivals of Hugo Ekitike, Nordi Mukiele, Fabián Ruiz, Renato Sanches, Carlos Soler, and Vitinha.",
    "published": "3 weeks ago"
  },
  {
    "title": "PSG sack Galtier despite winning Ligue 1, appoint Luis Enrique as new coach | Reuters",
    "url": "https://www.reuters.com/sports/soccer/psg-sack-galtier-despite-ligue-1-title-win-2023-07-05/",
    "snippet": "Ligue 1 champions <strong>Paris St Germain sacked manager Christophe Galtier on Wednesday, bringing the curtain down on a tumultuous campaign under the Frenchman and replaced him with former Barcelona and Spain coach Luis Enrique</strong>.",
    "published": "July 5, 2023"
  },
  {
    "title": "PSG fires coach Christophe Galtier and replaces him with Luis Enrique | FOX Sports",
    "url": "https://www.foxsports.com/stories/soccer/psg-fires-coach-christophe-galtier-and-replaces-him-with-luis-enrique",
    "snippet": "<strong>Paris Saint-Germain has fired Christophe Galtier after a disappointing season and hired former Spain and Barcelona manager Luis Enrique</strong>.",
    "published": "July 5, 2023"
  },
  {
    "title": "Christophe Galtier leaves Paris Saint-Germain ahead of Luis Enrique appointment - The Athletic",
    "url": "https://www.nytimes.com/athletic/4290834/2023/07/05/christophe-galtier-psg-luis-enrique/",
    "snippet": "<strong>Christophe Galtier has left his role as head coach of Paris Saint-Germain after one year in charge</strong>. Luis Enrique is set to be appointed later today to replace him. PSG announced Galtier’s departure on Wednesday, saying they had “decided” ...",
    "published": "July 5, 2023"
  },
  {
    "title": "PSG appoint Enrique as new coach to replace Galtier | Reuters",
    "url": "https://www.reuters.com/sports/soccer/psg-appoint-enrique-new-coach-replace-galtier-2023-07-05/",
    "snippet": "<strong>Paris St Germain have appointed former Barcelona and Spain coach Luis Enrique</strong> as their new manager on a two-year contract after the Ligue 1 champions parted ways with Christophe Galtier earlier on Wednesday.",
    "published": "July 5, 2023"
  }
]