[
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "Mike first joined the board of the European Film Academy 15 years ago and has served alongside a broad range of European film makers including Istvan Szabo, Volker Schloendorff, Wim Wenders, Nikita Mikhalkov, Pawel Pawlikowski, Agnes Jaoui, Krzystof Zanussi, and David Mackenzie . In 2019 Mike took over the chairmanship and he was joined by Agnieszka Holland as President 2020 taking over from Wim Wenders.",
    "published": null
  },
  {
    "title": "Biography — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/biography/",
    "snippet": "An EFA member for almost a quarter of a century and board member of the European Film Academy for nearly two decades years Mike served three 2 year terms as deputy Chairman alongside chair Agnieszka Holland, president Wim Wenders and co-deputy Antonio Saura. In 2020 he was elected to become Chairman of the European Film Academy.",
    "published": null
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) - IMDb",
    "url": "https://www.imdb.com/news/ni65127703/",
    "snippet": "Producer Mike Downey, who is chair of the European Film Academy and whose co-production “Girls on Wire” is in Berlin competition, has unveiled a diverse slate of films from his production company Downey Ink at the European Film Market. “My taste for a diverse range of world cinema projects remains,” Downey said.",
    "published": null
  },
  {
    "title": "Mike Downey • Producer and chairman of the European Film Academy - Cineuropa",
    "url": "https://cineuropa.org/en/interview/440528/",
    "snippet": "Mike Downey OBE is a producer and the chairman of the European Film Academy, as well as being one of the founding board members of the International Coalition for Filmmakers at Risk (ICFR).",
    "published": null
  },
  {
    "title": "Nominees Welcome Guide 2026 - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/activities/nominees-welcome-guide-2026/",
    "snippet": "The European Film Academy was finally founded in 1989 as the European Cinema Society by its first president Ingmar Bergman and 40 filmmakers to advance the interests of the European film industry. Wim Wenders (1996-2020) Agnieszka Holland (2020-2024) and Juliette Binoche (2024- ) followed in Bergman’s footsteps as Presidents of the Academy. The current chair of the Board is Mike Downey.",
    "published": "October 29, 2024"
  }
]