[
  {
    "title": "Controlling owner Josh Harris says Washington Commanders name is not changing",
    "url": "https://www.nfl.com/news/controlling-owner-josh-harris-says-washington-commanders-name-is-not-changing",
    "snippet": "Washington Commanders controlling owner <strong>Josh Harris</strong> said Monday the team name is not changing. Harris said the name is here to stay after inheriting it when he and his group bought the team from longtime owner Dan Snyder in 2023.",
    "published": null
  },
  {
    "title": "Washington Commanders Ownership Group",
    "url": "https://www.commanders.com/team/front-office-roster/ownership-group",
    "snippet": "Learn more about the Washington Commanders ownership group.",
    "published": null
  },
  {
    "title": "Washington Commanders - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Washington_Commanders",
    "snippet": "From their 1991 Super Bowl victory through 2024, the team notched just four NFC East division titles and three playoff wins. The city of Boston was awarded a National Football League (NFL) franchise on July 9, 1932, under the ownership of American businessman <strong>George Preston Marshall</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Who owns the Commanders? Full list of Washington's owernship group, from Josh Harris to Magic Johnson | Sporting News",
    "url": "https://www.sportingnews.com/us/nfl/washington-commanders/news/who-owns-commanders-washington-josh-harris-magic-johnson/b56f31c1092974179eda6b6a",
    "snippet": "Washington only made it as far as the divisional round twice in his 24 years as owner of the team. <strong>In 2023, NFL owners unanimously approved the sale of the Commanders to an ownership group led by private equity investor Josh Harris</strong>, shoving ...",
    "published": "January 26, 2025"
  },
  {
    "title": "Josh Harris Announces Acquisition of Washington Commanders",
    "url": "https://www.commanders.com/news/josh-harris-announces-acquisition-of-washington-commanders",
    "snippet": "WASHINGTON - A partnership led by <strong>Josh Harris</strong> announced the closing of their acquisition of the Washington Commanders on Friday, July 21st. The Harris group&#x27;s ownership was approved by the NFL at a league meeting on Thursday, July 20th.",
    "published": null
  }
]