[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Despite its strong brand image and relatively sizeable share of the high-performance auto market in Europe, by the 1970s, the company was operating at a loss, prompting IRI to sell it to <strong>Fiat Group</strong> in 1986. Alfa Romeo has since maintained its distinct identity and brand through several ownership ...",
    "published": "5 days ago"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "When you see the stylish Giulia or Stelvio cruising on the streets around Grosse Pointe, you may start to wonder, “who owns Alfa Romeo?” Alfa Romeo has been owned by <strong>Fiat-Chrysler Automobiles (FCA)</strong> since 2007.",
    "published": "April 26, 2021"
  },
  {
    "title": "Is Alfa Romeo Part of Stellantis? | Benson Alfa Romeo",
    "url": "https://www.alfaromeousaofgreer.com/research/is-alfa-romeo-part-of-stellantis.htm",
    "snippet": "Since 2007, <strong>Fiat Chrysler Automobiles (FCA)</strong> owned Alfa Romeo. But in 2021, a new player came onto the board in the form of a new car conglomerate called Stelantis. Stelantis was formed with a joint venture, a 50-50 merger of two well-known automotive empires: the Italian-American conglomerate ...",
    "published": null
  },
  {
    "title": "Who Makes Alfa Romeo? | Ron Lewis Alfa Romeo",
    "url": "https://www.ronlewisalfaromeo.com/who-makes-alfa-romeo/",
    "snippet": "Who Makes Alfa Romeo: Stellantis currently oversees the production and development of Alfa Romeo vehicles. This multinational corporation was established in 2021 through the merger of <strong>Fiat Chrysler Automobiles (FCA) and PSA Group</strong>.",
    "published": "October 31, 2025"
  },
  {
    "title": "Who Owns Alfa Romeo? | Alfa Romeo of Plano",
    "url": "https://www.alfaofplano.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "However, on January 16, 2021, FCA merged its operations with the French PSA Group, <strong>Peugeot S.A.</strong>, to form Stellantis, now recognized as the fourth largest automaker globally. As a result, Stellantis is now who makes Alfa Romeo.",
    "published": "August 25, 2025"
  }
]