[
  {
    "title": "Ministry of Health, Population and Hospital Reform - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health,_Population_and_Hospital_Reform",
    "snippet": "In 2020, there were according to the Ministry 586 public health establishments in Algeria. There are <strong>69,948 beds in CHU, EHU, EH, EHS, and EPH establishments and 6,584 beds in community hospitals (EPSP).</strong>",
    "published": "April 15, 2025"
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform (Algeria) | GHDx",
    "url": "https://ghdx.healthdata.org/organizations/ministry-health-population-and-hospital-reform-algeria",
    "snippet": "Formerly named the Ministry of Health and Population (Ministère de la Santé et de la Population). Alternative name · Ministère de la Santé, de la Population et de la Réforme Hospitalière · City · Alger · Country · Algeria · Related organizations ·",
    "published": null
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform - Algeria - Health Research Web (HRWeb)",
    "url": "https://healthresearchwebafrica.org.za/en/algeria/regulation_4574",
    "snippet": "Algeria · Regulation Organisations · Contact Info. Organisation Info. Resources · Publications · Supplementary Info. Directorate of Pharmacy and Medicine · Ministry of Health, Population and Hospital Reform · Country Algeria · Institution website address http://www.ands.dz/pharmacie...",
    "published": null
  },
  {
    "title": "Division of Powers - Algeria Public health",
    "url": "https://portal.cor.europa.eu/divisionpowers/Pages/Algeria-Public-health.aspx",
    "snippet": "Algeria&#x27;s country profile drawn up by United Cities and Local Governments (UCLG), Global Observatory on Local Democracy and Decentralisation (GOLD) Ministry of Health, Population and Hospital Reforms (FR)",
    "published": null
  },
  {
    "title": "Department of Health, Population, and Hospital Reform (Algeria) | Devex",
    "url": "https://www.devex.com/organizations/department-of-health-population-and-hospital-reform-algeria-52456",
    "snippet": "Learn more about Department of Health, Population, and Hospital Reform (Algeria)&#x27;s jobs, projects, latest news, contact information and geographical presence. The Department of Health and Hospital Reform is the government agency responsible for Health in Alge",
    "published": null
  }
]