[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the <strong>secretary of the Democratic Party (PD)</strong> since 12 March 2023. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "1 week ago"
  },
  {
    "title": "Elly Schlein – POLITICO",
    "url": "https://www.politico.eu/person/elly-schlein/",
    "snippet": "Schlein, <strong>secretary of the center-left Democratic Party</strong>, has railed against the prime minister for her politics. ... Fading Italian firebrand pins his election chances on a 3km crossing that’s been mooted since Roman times.",
    "published": null
  },
  {
    "title": "Elly Schlein a Catania: \"Schifani si dimetta\"",
    "url": "https://www.strettoweb.com/2025/12/elly-schlein-a-catania-schifani-si-dimetta/2013065/",
    "snippet": "“Il presidente della Regione Schifani <strong>non è nelle condizioni politiche per segnare una discontinuità e un cambiamento rispetto al grave sistema di potere emerso nelle tante inchieste che purtroppo coinvolgono la Regione</strong>.",
    "published": "14 hours ago"
  },
  {
    "title": "Meet the anti-Renzi: Elly Schlein becomes first woman leader of Italy’s center left",
    "url": "https://www.politico.eu/article/elly-schlein-first-woman-leader-italy-social-democratic-party/",
    "snippet": "Radical candidate Elly Schlein is the new leader of Italy’s traditionally <strong>center-left Democratic Party</strong> (PD), after winning a primary vote Sunday.",
    "published": "February 27, 2023"
  },
  {
    "title": "Elly Schlein: The first woman and LGBTIQ+ leader of Italy’s left | openDemocracy",
    "url": "https://www.opendemocracy.net/en/5050/italy-left-elly-schlein-woman-lgbtiq-democratic-party/",
    "snippet": "Another woman has shaken up Italy’s male-dominated political scene – but this time, she’s a feminist, openly queer and left-wing. Say hello to Elly Schlein, 37, the <strong>new head of the progressive Democratic Party (PD).</strong>",
    "published": "March 9, 2023"
  }
]