[
  {
    "title": "New Athletes' Commission members announced | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/athletes-commission-members-2025-2029",
    "snippet": "The six seats that were available for election in 2025 include the Deputy Chair position, which will be voted on by the Athletes’ Commission now the elections have been held. The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December 2016. Since 2019, the Chairperson and one other member of the Athletes’ Commission – one man and one woman – have been full voting members of the World Athletics Council.",
    "published": null
  },
  {
    "title": "Candidates announced for 2025 Athletes' Commission elections | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/candidates-2025-athletes-commission-elections",
    "snippet": "Les résultats des élections seront annoncés le dernier jour des Championnats du monde, le 21 septembre 2025. Les réformes de gouvernance et d’intégrité de World Athletics, approuvées en décembre 2016, ont reconnu l’importance de faire entendre la voix des athlètes dans le processus décisionnel et l’ont pleinement intégrée dans les structures de l’organisation. Depuis 2019, le président de la Commission des athlètes ainsi qu’un autre membre, une femme et un homme, siègent en tant que membres votants à part entière au sein du Conseil de World Athletics.",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "<strong>Olivier Gers</strong> was the first person to officially hold the position in 2016, succeeding the interim CEO/General Secretary Jean Gracia. In order to give active athletes a voice in the governance of the sport, World Athletics created the Athletes&#x27; Commission. Athletes are elected to the commission ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Council consists of 26 elected members, including the President, four Vice-Presidents, six Area Presidents (elected by each Area Association), the Chair of the Athletes‘ Commission and one other member of the Athletes’ Commission (elected by members of the Athletes’ Commission) and thirteen Individual Council Members.",
    "published": null
  },
  {
    "title": "Spikes ATHLETES' COMMISSION | World Athletics",
    "url": "https://worldathletics.org/spikes/athletes-commission",
    "snippet": "The World Athletics Athletes&#x27; Commission has elected New Zealand’s four-time world shot put champion <strong>Valerie Adams</strong> as chair and Canadian 3000m steeplechase record-holder Matthew Hughes as deputy chair following the first meeting of its new ...",
    "published": null
  }
]