[
  {
    "title": "Old Trafford - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Old_Trafford",
    "snippet": "Old Trafford (/ˈtræfərd/) is <strong>a football stadium in Old Trafford, Greater Manchester, England, and is the home of Manchester United</strong>. With a capacity of 74,197, it is the largest club football stadium (and second-largest football stadium overall after Wembley Stadium) in the United Kingdom, ...",
    "published": "1 day ago"
  },
  {
    "title": "Visit Old Trafford | Man Utd Museum, Stadium Tour, Red Cafe, Conferences, Business and Corporate Events | Manchester United",
    "url": "https://www.manutd.com/en/visit-old-trafford",
    "snippet": "Old Trafford is <strong>one of the world&#x27;s most famous sports venues</strong> and boasts excellent facilities for all occasions, including an award-winning Museum, our Stadium Tour experience, and a wide range of Conference and Events facilities",
    "published": null
  },
  {
    "title": "FAQs – Visiting Old Trafford | Manchester United",
    "url": "https://www.manutd.com/en/help/faqs/visiting-old-trafford",
    "snippet": "You can view maps and directions to <strong>Old Trafford</strong> in our Getting Here section, which contains essential information and links on getting to and from the stadium by car, train, tram or bus.",
    "published": null
  },
  {
    "title": "Manchester United’s ‘Theatre of Dreams’: A history of Old Trafford - The Athletic",
    "url": "https://www.nytimes.com/athletic/6194339/2025/03/15/old-trafford-manchester-united-history/",
    "snippet": "<strong>Old Trafford has stood on its site for 115 years</strong>. But now, in 2025, United have decided that the ground must make way. A new stadium, with a 100,000-capacity, will rise on adjoining land.",
    "published": "March 15, 2025"
  },
  {
    "title": "Man United want new Old Trafford ready for 2035 World Cup - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/47126318/man-united-want-new-old-trafford-ready-2035-world-cup",
    "snippet": "In March, United announced their plan to leave <strong>Old Trafford</strong>, their home for more than 100 years, and move into a new 100,000-seater stadium.",
    "published": "4 weeks ago"
  }
]