[
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "The president of Portugal, officially the president of the Portuguese Republic (Portuguese: Presidente da República Portuguesa, pronounced [pɾɨziˈðẽtɨ ðɐ ʁɛˈpuβlikɐ puɾtuˈɣezɐ]), is the head of state and highest office of Portugal.",
    "published": "3 days ago"
  },
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "<strong>Marcelo Rebelo de Sousa</strong> was born in Lisbon, on 12 December 1948. He is a Catholic and has 2 children and 5 grandchildren. A Law Graduate, he received a Doctorate in Legal and Political Science in 1984.",
    "published": null
  },
  {
    "title": "The Portuguese Government in 2025: What Expats Should Know",
    "url": "https://www.portugalresidencyadvisors.com/the-political-system-in-portugal-an-expat-guide/",
    "snippet": "The current President of Portugal is <strong>Marcelo Rebelo de Sousa</strong>. The President primarily serves as the head of state, with responsibilities such as appointing the Prime Minister, dissolving Parliament, and overseeing the Constitution’s implementation.",
    "published": "September 29, 2025"
  },
  {
    "title": "2026 Portuguese presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2026_Portuguese_presidential_election",
    "snippet": "Since the Carnation Revolution, there has only ever been a single runoff election, in the 1986 Portuguese presidential election, when Diogo Freitas do Amaral (46.3% of votes in the first round and 48.8% in the second) lost to Mário Soares (25.4% in the first round and 51.2% in the second). Candidates who formalized their candidacy and claim to have already submitted enough signatures to the Constitutional Court. The deadline to submit candidacies to the Court is 18 December 2025.",
    "published": "19 hours ago"
  },
  {
    "title": "Luís Montenegro - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lu%C3%ADs_Montenegro",
    "snippet": "Under Montenegro’s leadership, the PSD and CDS-PP formed the centre-right Democratic Alliance and won a plurality of seats in the 2024 Portuguese legislative election. He was appointed prime minister by President Marcelo Rebelo de Sousa, leading the XXIV Constitutional Government, a coalition minority government. His government fell in March 2025 after losing a vote of confidence amid an alleged conflict of interest affair, but the Democratic Alliance increased its plurality of seats in the subsequent snap election and formed the XXV Constitutional Government.",
    "published": "3 days ago"
  }
]