[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Alexei Anatolyevich Navalny (Russian: Алексей Анатольевич Навальный, IPA: [ɐlʲɪkˈsʲej ɐnɐˈtolʲjɪvʲɪtɕ nɐˈvalʲnɨj]; <strong>4 June 1976 – 16 February 2024</strong>) was a Russian opposition leader, anti-corruption activist and political prisoner.",
    "published": "1 week ago"
  },
  {
    "title": "Timeline of Alexei Navalny’s life and activism - Good Morning America",
    "url": "https://www.goodmorningamerica.com/news/story/timeline-alexei-navalnys-life-activism-107380308",
    "snippet": "Here’s a look at how Navalny ... earned two degrees in economics and law and was a practicing lawyer, <strong>joined the Russian liberal Yabloko party in 2000.</strong>...",
    "published": "February 20, 2024"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: ... Прогресса, Partiya Progressa), is a banned opposition political party in Russia <strong>founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018</strong> by Alexei Navalny, who was also the founder of the non-profit organisation ...",
    "published": "1 month ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. <strong>In 2000, while he was still a student, Navalny joined Yabloko</strong>, ...",
    "published": "March 7, 2023"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "(Template courtesy of Olivia Wilson) (Photo Credit Top Left: Mitya Aleshkovskiy, CC BY-SA 4.0 ... His career in politics <strong>began in 2000</strong>, after a new law had been announced, raising the electoral threshold for political parties, essentially making ...",
    "published": null
  }
]