[
  {
    "title": "John Garamendi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Garamendi",
    "snippet": "In 1990, Garamendi became the first elected California <strong>insurance commissioner</strong>, serving from 1991 to 1995. He ran for governor in the 1994 election, losing in the Democratic primary. He left elective office and served as President Bill Clinton&#x27;s deputy secretary of the interior from 1995 to ...",
    "published": "2 weeks ago"
  },
  {
    "title": "About John Garamendi | Congressman John Garamendi",
    "url": "https://garamendi.house.gov/about",
    "snippet": "From 1991 to 1995, and again from 2003 to 2006, Garamendi served as the <strong>California Insurance Commissioner</strong>, earning a reputation as the most effective protector of consumer interests in the nation. He successfully forced insurance companies to pay claims to policyholders and significantly curtailed ...",
    "published": "August 22, 2023"
  },
  {
    "title": "John Garamendi | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/john-garamendi/G000559",
    "snippet": "John Garamendi, the <strong>Representative</strong> from California - in Congress from 2009 through Present",
    "published": null
  },
  {
    "title": "John Garamendi (listed in Progressive Voters Guide)",
    "url": "https://progressivevotersguide.com/california/2024/general/john-garamendi",
    "snippet": "He served in the state legislature for over 20 years, was appointed deputy secretary of the Interior during the Clinton administration, was elected state insurance commissioner, and was <strong>lieutenant governor of California</strong> before running for Congress.",
    "published": null
  },
  {
    "title": "John Garamendi - Ballotpedia",
    "url": "https://ballotpedia.org/John_Garamendi",
    "snippet": "Garamendi (Democratic Party) is running for re-election to the U.S. House to represent California&#x27;s 8th Congressional District. He declared candidacy for the 2026 election.[source] ... John Garamendi was born in Camp Blanding, Florida. Garamendi earned a B.A.",
    "published": null
  }
]