[
  {
    "title": "Omar al-Bashir - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Omar_al-Bashir",
    "snippet": "When he returned to Sudan as a colonel in the Sudanese Army, al-Bashir led a group of army officers in ousting the unstable coalition government of Prime Minister Sadiq al-Mahdi in a bloodless military coup on 30 June 1989. Under al-Bashir&#x27;s leadership, the new military government suspended political parties and introduced an Islamic legal code on the national level.",
    "published": "3 days ago"
  },
  {
    "title": "Sudan after Omar al-Bashir’s overthrow | The Political Studies ...",
    "url": "https://www.psa.ac.uk/psa/news/sudan-after-omar-al-bashir’s-overthrow",
    "snippet": "For the first time in 30 years <strong>Sudan is no longer governed by Omar Al-Bashir</strong>. He faces instead a war crimes tribunal for crimes against humanity, either in the Sudan itself, or in The Hague at the International Criminal Court.",
    "published": null
  },
  {
    "title": "Sudan’s Uprising: The Fall of a Dictator | Journal of Democracy",
    "url": "https://www.journalofdemocracy.org/articles/sudans-uprising-the-fall-of-a-dictator/",
    "snippet": "Amid mass protests, the personalist autocracy of longtime Sudanese president Omar al-Bashir fell to an April 2019 coup. With the country now being governed by <strong>a council composed of both opposition leaders and powerful security- service coupmakers</strong>, ...",
    "published": "May 7, 2024"
  },
  {
    "title": "Omar al-Bashir brutalised Sudan – how his 30-year legacy is playing out today",
    "url": "https://theconversation.com/omar-al-bashir-brutalised-sudan-how-his-30-year-legacy-is-playing-out-today-204391",
    "snippet": "Burhan made the political calculation in 2021 that National Congress Party-era security bosses and bureaucrats were his best allies in the battle to both prevent civilians challenging the military’s grip on the economy, and Hemedti’s Rapid Support Forces emerging as an alternative power centre. After taking over power, he co-opted these former security bosses into government. The Islamism of the Bashir-era stooges Burhan has been returning to government is defined by three elements. These are socially conservative authoritarian politics, including the return of morality policing; a hostility to the Sudanese left; and corruption.",
    "published": "November 7, 2025"
  },
  {
    "title": "Omar al-Bashir | Alive, Now, Overthrown, Trial, Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Omar-Hassan-Ahmad-al-Bashir",
    "snippet": "Omar al-Bashir, Sudanese military leader who led a revolt that overthrew the elected government of Sudan in 1989. He served as president from 1993 until he was overthrown in 2019. The International Criminal Court issued an arrest warrant for him, charging him with various crimes related to the crisis in Darfur.",
    "published": "December 9, 2008"
  }
]