[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The Executive Board has responsibility for all decisions related to the business of World Athletics including developing and reviewing the World Athletics Strategic Plan; adopting and monitoring the annual plan and budget; appointing and monitoring the Chief Executive; financial planning and controlling income and expenditure; identifying and managing risks; and developing internal controls, organisational policies, procedures and systems (e.g., human resources, IT).",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "There are <strong>four committees: the Cross Country Committee, the Race Walking Committee, the Technical Committee, and the Women&#x27;s Committee</strong>. A further three committees were launched in 2019: Development, Governance and Competitions. The governance structure is outlined in the World Athletics ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Intro",
    "url": "https://worldathletics.org/about-iaaf/structure/intro",
    "snippet": "The Executive Board has responsibility for all decisions related to the business of World Athletics including the annual plan and budget, risks and compliance, and organisational policies, procedures and systems.",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Of the total <strong>26 members</strong>, there must be a minimum of: ... 13 of each gender for the elections in 2027 and thereafter (ie 50%). This target has been met four years earlier than the Constitution prescribed.",
    "published": null
  },
  {
    "title": "Track and Field: World Athletics (formerly the IAAF)",
    "url": "https://www.ducksters.com/sports/track_and_field/iaaf.php",
    "snippet": "As of 2021, the organization is governed under the leadership of <strong>President Sebastian Coe</strong>. He is a member of the World Athletics council which also consists of four vice presidents, the treasurer, a representative from each area association, and fifteen other members.",
    "published": null
  }
]