[
  {
    "title": "Carlo Ancelotti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Carlo_Ancelotti",
    "snippet": "With his team&#x27;s 2–1 victory over Real Sociedad on 17 September 2023, Ancelotti got his 173rd Madrid win, overtaking Zinedine Zidane to become the coach with the second most wins in the club&#x27;s history. On 29 December, although he had previously been linked with the position of head coach for the Brazil national football team, Real Madrid announced that Ancelotti had agreed to a contract extension until 30 June 2026.",
    "published": "1 week ago"
  },
  {
    "title": "List of Real Madrid CF managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Real_Madrid_CF_managers",
    "snippet": "The most successful coach with Real Madrid is Carlo Ancelotti, as won 15 titles with the team.",
    "published": "September 27, 2025"
  },
  {
    "title": "Former Real Madrid Coach Carlo Ancelotti Reveals Only One Club He Would Coach After the Brazil Job",
    "url": "https://www.si.com/onsi/soccer/real-madrid/news/former-real-madrid-coach-carlo-ancelotti-reveals-only-one-club-he-would-coach-after-the-brazil-job",
    "snippet": "Former Real Madrid head coach Carlo Ancelotti has revealed which team he would consider coaching again after his time with the Brazil national team.",
    "published": "September 14, 2025"
  },
  {
    "title": "Former Real Madrid Assistant Davide Ancelotti Gets Off To Flying Start in Debut Head Coaching Job",
    "url": "https://www.si.com/onsi/soccer/real-madrid/news/former-real-madrid-assistant-davide-ancelotti-gets-off-to-flying-start-in-debut-head-coaching-job",
    "snippet": "<strong>Davide Ancelotti</strong> has been a face recognizable to many as the assistant to former Real Madrid head coach Carlo Ancelotti. The father-and-son duo have been togeth",
    "published": "July 13, 2025"
  },
  {
    "title": "Real Madrid managers since Florentino Perez first became president in 2000 | FourFourTwo",
    "url": "https://www.fourfourtwo.com/features/real-madrid-managers-since-florentino-perez-first-became-president-in-2000",
    "snippet": "Coaches &amp; Managers Next Liverpool manager is one of five household names as Arne Slot successor gamble assessed ... With <strong>Xabi Alonso</strong> taking over from Carlo Ancelotti at Real Madrid, a look at all of Los Blancos&#x27; coaches since Florentino Perez ...",
    "published": "June 8, 2025"
  }
]