[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an <strong>American scientist and academic administrator serving as the chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Siendo la undécima rectora de la Universidad de California en Santa Cruz, <strong>Cynthia Larive</strong> encabeza una institución mundialmente reconocida por sus investigaciones de alto impacto, en pos de soluciones interdisciplinarias a los mayores retos mundiales, y por su compromiso con la justicia social ...",
    "published": null
  },
  {
    "title": "Meet the New Chancellor - City on a Hill Press",
    "url": "https://cityonahillpress.com/2019/05/23/meet-the-new-chancellor/",
    "snippet": "Cynthia Larive <strong>got her doctorate from UC Riverside in 1992</strong>. This year she will replace George Blumenthal as UCSC chancellor. Photo by Yvonne Gonzalez.When she was 9 years old, Cynthia, or Cindy,",
    "published": "May 23, 2019"
  },
  {
    "title": "Cynthia K. Larive - DART",
    "url": "https://mbdart.org/person/cynthia-k-larive/",
    "snippet": "<strong>An accomplished bioanalytical chemist, Larive came to UC Santa Cruz from UC Riverside, where she was provost and executive vice chancellor</strong>. As provost, she was responsible for the academic enterprise, managing large-scale initiatives as well ...",
    "published": "December 17, 2024"
  },
  {
    "title": "Cynthia K. Larive - Chancellor at UC Santa Cruz | The Org",
    "url": "https://theorg.com/org/uc-santa-cruz/org-chart/cynthia-k-larive",
    "snippet": "<strong>Before arriving at UCR, Larive was a professor of chemistry at the University of Kansas</strong>, where she began what has become a productive and successful research career. She has over 155 publications, has mentored 30 Ph.D and M.S. students, and ...",
    "published": null
  }
]