[
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "The prime minister of India (ISO: Bhārat kē Pradhānamantrī) is the head of government of the Republic of India. Executive authority is vested in the prime minister and his chosen Council of Ministers, despite the president of India being the nominal head of the executive.",
    "published": "2 days ago"
  },
  {
    "title": "Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/",
    "snippet": "<strong>Shri Narendra Modi</strong> was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership.",
    "published": "20 hours ago"
  },
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "The prime minister of India is the chief executive of the Government of India and chair of the Union Council of Ministers. Although the president of India is the constitutional, nominal, and ceremonial head of state, in practice and ordinarily, the executive authority is vested in the prime ...",
    "published": "1 week ago"
  },
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "<strong>Narendra Damodardas Modi</strong> (born 17 September 1950) is an Indian politician who has served as the prime minister of India since 2014. Modi was the chief minister of Gujarat from 2001 to 2014 and is the member of parliament (MP) for Varanasi.",
    "published": "20 hours ago"
  },
  {
    "title": "Prime Minister| National Portal of India",
    "url": "https://www.india.gov.in/my-government/whos-who/prime-minister",
    "snippet": "Prime Minister · Council of Ministers · Governors · Lt. Governors &amp; Administrators · Chief Ministers · Judges of Supreme Court · Chiefs of Armed Forces · Members of Parliament · MLAs/MLCs · <strong>Shri Narendra Modi</strong> · To know more about the Prime Minister click here ·",
    "published": null
  }
]