[
  {
    "title": "Senators | California State Senate",
    "url": "https://www.senate.ca.gov/senators",
    "snippet": "On each Senator&#x27;s Home Page you will find his/her contact information, Capitol and District addresses and phone numbers, a map of the district, the Member&#x27;s biography, a list of all the legislation authored by that Senator, his/her committee memberships, press releases and other publications, district links, and more.",
    "published": null
  },
  {
    "title": "U.S. Senate: States in the Senate | California Senators",
    "url": "https://www.senate.gov/states/CA/senators.htm",
    "snippet": "6. <strong>Seat vacant between Mar.</strong> 3, 1855 and Jan.",
    "published": null
  },
  {
    "title": "California State Senate - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/California_State_Senate",
    "snippet": "<strong>The California State Senate has never been expanded since the enactment of the 1879 constitution</strong>. In 1962, voters were asked via initiative California Proposition 23 whether to expand the state senate by 10 seats, thereby increasing the size of the body to 50 seats, and to abandon the little ...",
    "published": "November 18, 2025"
  },
  {
    "title": "California State Senate - Ballotpedia",
    "url": "https://ballotpedia.org/California_State_Senate",
    "snippet": "All data from 2006 or earlier comes ... by Ballotpedia staff. California State Senate election results: 1992-2024* *<strong>The total number of seats does not always equal 40 due to vacancies in the chamber</strong>....",
    "published": null
  },
  {
    "title": "List of United States senators from California - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_United_States_senators_from_California",
    "snippet": "California elects United States senators to class 1 and class 3. The state has been represented by <strong>48 people in the Senate since it was admitted to the Union on September 9, 1850</strong>. Its U.S. senators are Democrats Alex Padilla and Adam Schiff.",
    "published": "2 weeks ago"
  }
]