[
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "7 December 2025 - 14:00 · On Local Self-Government Day, President of Ukraine <strong>Volodymyr Zelenskyy</strong> signed a decree awarding state honors to heads and employees of local authorities. 7 December 2025 - 13:53 ·",
    "published": "1 week ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... nation&#x27;s head of government. The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "15 December 2025 - 16:31 · The Head of State thanked <strong>Julia Klöckner</strong> and the entire Bundestag for allocating €11.5 billion in defense assistance to Ukraine for next year. 15 December 2025 - 16:08 ·",
    "published": "13 hours ago"
  },
  {
    "title": "Politics 2024 Election",
    "url": "https://www.globalsecurity.org/military/world/ukraine/election-2025.htm",
    "snippet": "Ukrainian President <strong>Volodymyr Zelenskyy</strong> declared his readiness to hold elections within three months if the United States and Kyivs other allies can ensure the security of the voting process. Zelenskyy made this statement on 09 December 2025 in response to US President Donald Trump, who suggested ...",
    "published": null
  },
  {
    "title": "Russian Offensive Campaign Assessment, December 6, 2025",
    "url": "https://understandingwar.org/research/russia-ukraine/russian-offensive-campaign-assessment-december-6-2025/",
    "snippet": "Ukrainian officials reported that ... of December 6, leading to energy restrictions and rolling blackouts across the country. Ukrainian State Inspectorate for Energy Supervision Deputy Head Anatoliy Zamulko reported that Russian forces struck facilities that redistribute electricity between Ukrainian regions, forcing Ukrainian nuclear power plants (NPPs) to reduce their electricity generation capacity.[4] Ukrainian President Volodymyr ...",
    "published": "1 week ago"
  }
]