[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "He was elected CDU leader in December 2021, assuming the office in January 2022. He had failed to win the position in two previous leadership elections in 2018, and January 2021. In September 2024, he became the Union&#x27;s candidate for Chancellor of Germany ahead of the following year&#x27;s federal election. The CDU/CSU won a plurality of the seats and subsequently reached an agreement to form a coalition with the SPD. Merz was elected chancellor on 6 May 2025, taking two rounds to clear, which was a first in German history.",
    "published": "2 days ago"
  },
  {
    "title": "2025 German federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_German_federal_election",
    "snippet": "On the same day, <strong>Chancellor Scholz</strong> announced he would submit a motion of confidence to hold a snap election; this was initially planned for January 2025 for a late March election but was brought forward after pressure from the opposition. Scholz submitted a motion of confidence to the Bundestag ...",
    "published": "4 days ago"
  },
  {
    "title": "Germany's Merz Is Doing Better as Chancellor Than Everyone Thinks",
    "url": "https://foreignpolicy.com/2025/12/12/friedrich-merz-germany-chancellor-economy-ukraine-trump-america/",
    "snippet": "Watching Keir Starmer, Emmanuel Macron, and <strong>Friedrich Merz</strong> in London on another mercy mission to shore up Ukraine from the pincer attack of Moscow and Washington, it was intriguing to watch their body language for answers to the following question: ...",
    "published": "4 days ago"
  },
  {
    "title": "Germany's Merz secures pensions bill, but row highlights leadership weakness | Reuters",
    "url": "https://www.reuters.com/world/europe/german-parliament-vote-pensions-tests-merzs-authority-2025-12-05/",
    "snippet": "Item 1 of 5 German Chancellor <strong>Friedrich Merz</strong> and Christian Democratic Union&#x27;s Jens Spahn, the CDU/CSU parliamentary group leader, ahead of a session of the lower house of parliament, the Bundestag, on the day of a vote on a contentious pensions ...",
    "published": "1 week ago"
  },
  {
    "title": "Website of the Federal Government | Bundesregierung",
    "url": "https://www.bundesregierung.de/breg-en",
    "snippet": "Germany will strengthen the European pillar of NATO in order to preserve freedom, security and prosperity in Europe, said Federal Chancellor Merz after talks with NATO Secretary General Rutte.",
    "published": null
  }
]