[
  {
    "title": "Unai Emery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Unai_Emery",
    "snippet": "There, he won a Ligue 1 title, two Coupe de France titles, two Coupe de la Ligues, and two Trophée des Champions, including a domestic quadruple in his second season. <strong>After the expiry of his contract, Emery was appointed as head coach of English club Arsenal in 2018,</strong> succeeding Arsène Wenger.",
    "published": "2 days ago"
  },
  {
    "title": "Unai Emery - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/unaiemery/profil/trainer/5075",
    "snippet": "Avg. term as coach : <strong>2.24 Years</strong> ... This is an overview of the career of a manager. ... Unai Emery is the grandson of Antonio Emery (---). Unai Emery is the nephew of Román Emery (---). Unai Emery is the son of Juan Emery (---). Unai Emery ...",
    "published": null
  },
  {
    "title": "Welcome Unai | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/welcome-unai",
    "snippet": "Unai, 46, previously spent <strong>three seasons</strong> with Sevilla, leading them to an unprecedented three consecutive Europa League titles, establishing the club as a major force in the Spanish league.",
    "published": null
  },
  {
    "title": "Unai Emery announced as new Arsenal head coach | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11670/11382525/arsenal-confirm-appointment-of-unai-emery-as-new-head-coach",
    "snippet": "Arsenal have confirmed the appointment of Unai Emery as their new head coach, replacing Arsene Wenger at the Emirates. The 46-year-old Spaniard arrives at the club following a two-year spell at PSG.",
    "published": "May 23, 2018"
  },
  {
    "title": "Unai Emery at Arsenal: a failure or a victim of circumstance? - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/39048034/unai-emery-arsenal-failure-victim-circumstance",
    "snippet": "Unai Emery is enjoying so much ... the departing Wenger, who had fallen from legend to lamented in a tenure spanning <strong>almost 22 years</strong>....",
    "published": "December 8, 2023"
  }
]