[
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "The standard of coach who has been at the helm of the men’s team has mostly been impressive, including the latest Fabien Galthie. Since 2019, the former France captain has been the man charged with leading the nation and has established the team as one of the world’s best. ... A country flush with rugby talent, the nation is yet to win a Rugby World Cup, but has all the potential to lift the Webb Ellis Cup, not least thanks to current start player Antoine Dupont.",
    "published": "May 30, 2025"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "Although coached by <strong>Jean Desclaux between 1973 and 1980</strong>, the French team&#x27;s main influence during the late 1970 was captain Jacques Fouroux. Fouroux played scrum-half and captained France to their 1977 Five Nations Grand Slam, during which France played a very forward-oriented style of rugby.",
    "published": "1 week ago"
  },
  {
    "title": "France national rugby union team coaches - FamousFix.com list",
    "url": "https://m.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "The list France national rugby union team coaches includes <strong>Marc Lièvremont, Fabien Galthié, Daniel Dubroca, Bernard Laporte and Jacques Fouroux</strong>. The list consists of 13 members.",
    "published": null
  },
  {
    "title": "France rugby union team: Fixtures, squad and head coach",
    "url": "https://news.bet365.com/en-gb/article/france-rugby-union-team-profile/2025012409221201023",
    "snippet": "The top tryscorer in the Six Nations ... A distinguished former player himself, receiving 64 international caps for Les Bleus as a scrum-half between <strong>1991 and 2003</strong>, Fabien Galthie became France head coach in ......",
    "published": null
  },
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Galthié was a crucial member of the French team that upset New Zealand in the semifinal of the 1999 Rugby World Cup at Twickenham. In 2000, Colomiers reached the French championship final, but Galthié had to watch from the stands due to a knee injury. The club lost 28–23 to Stade Français, whom he joined the following season. In 2001 Galthié was appointed captain of France. A successful year in 2002, including a Six Nations Grand Slam, saw France dominate the 2002 IRB Awards, with Galthié named Player of the Year, as well as French coach Bernard Laporte being named Coach of the Year.",
    "published": "3 weeks ago"
  }
]