[
  {
    "title": "Anne-Marie Slaughter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anne-Marie_Slaughter",
    "snippet": "Anne-Marie Slaughter (born September 27, 1958) is an American lawyer and political scientist, and author. She is the current president and CEO of New America (formerly the New America Foundation). Previously, Slaughter served as the dean of Princeton School of Public and International Affairs from 2002 to 2009.",
    "published": "October 1, 2025"
  },
  {
    "title": "BIOGRAPHY: Anne-Marie Slaughter",
    "url": "https://2009-2017.state.gov/s/p/fapb/185598.htm",
    "snippet": "Anne-Marie Slaughter is the President and CEO of New America and the Bert G. Kerstetter ’66 University Professor Emerita of Politics and International Affairs at Princeton University. From 2009-2011 she served as the director of Policy Planning for the United States Department of State, the first woman to hold that position.",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter | Penguin Random House",
    "url": "https://www.penguinrandomhouse.com/authors/169047/anne-marie-slaughter/",
    "snippet": "In 2009 Secretary of State Hillary Clinton appointed Slaughter director of policy planning for the U.S. State Department, the first woman to hold that job. A foreign policy analyst, legal and international relations scholar, and public commentator, Slaughter was a professor at the University of Chicago Law School and Harvard Law School and is a former president of the American Society of International Law.",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter | Wilson Center",
    "url": "https://www.wilsoncenter.org/person/anne-marie-slaughter",
    "snippet": "Anne-Marie Slaughter is the President ... at Princeton University. From 2009 to 2011 she served as <strong>Director of Policy Planning for the U.S. Department of State</strong>, the first woman to hold that position....",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter",
    "url": "https://www.aspenideas.org/speakers/anne-marie-slaughter",
    "snippet": "Anne-Marie Slaughter is president and CEO of New America and Bert G. Kerstetter ’66 University Professor Emerita of Politics and International Affairs at Princeton University. From 2009 to 2011, she was the first woman policy planning director at the US State Department. Previously, she was dean of Princeton’s School of Public and International Affairs and an international law professor at Harvard Law School.",
    "published": null
  }
]