[
  {
    "title": "Mario Mutsch - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mario_Mutsch",
    "snippet": "Mario Mutsch (born 3 September 1984) is a former professional footballer who played as a defensive midfielder. Born in Belgium, he played for the Luxembourg national team. Born in St. Vith, Mutsch started his career at Belgian lower leagues sides Spa and Kelmis (La Calamine) before heading ...",
    "published": "November 12, 2025"
  },
  {
    "title": "Mario Mutsch - National team | Transfermarkt",
    "url": "https://www.transfermarkt.com/mario-mutsch/nationalmannschaft/spieler/40878/verein_id/3580/nurEinsatz/2/sort/einsatzzeit",
    "snippet": "This overview shows all of a player&#x27;s call-ups for the national team selected under &quot;Stats&quot;. You can use a filter to limit the selection to major competitions (e.g. world cups), individual competitions (e.g. WC 2014) and to specific time periods. Under &quot;Matches&quot;, you can also filter by actual number of matches played or by all matches with goals scored.",
    "published": null
  },
  {
    "title": "Mario Mutsch - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/mario-mutsch/profil/trainer/69243",
    "snippet": "This is the profile site of the manager Mario Mutsch. The site lists all clubs he coached and all clubs he played for.",
    "published": null
  },
  {
    "title": "Mario Mutsch",
    "url": "https://grokipedia.com/page/Mario_Mutsch",
    "snippet": "Mutsch&#x27;s role at St. Gallen emphasized team stability, where he formed part of the defensive midfield structure that supported the club&#x27;s mid-table consistency in the Super League during those years. Across his Swiss clubs from 2011 to 2017, he accumulated approximately 174 appearances, underscoring his longevity in the league.[18] After six years abroad, primarily in Switzerland, Mario Mutsch returned to Luxembourgish football by signing a free transfer with Progrès Niederkorn on 1 July 2017, following his departure from FC St.",
    "published": null
  },
  {
    "title": "Mario Mutsch (Player) | National Football Teams",
    "url": "https://www.national-football-teams.com/player/12487/Mario_Mutsch.html",
    "snippet": "Mario Mutsch · You are using an old browser which is not compatible with our new design. Please update your browser or use our old website. provided by Tony Hollner Add Picture · Position · Right Midfielder (RM) Other positions: Left Midfielder (LM), Left Back (LB), Right Back (RB) Age ·",
    "published": null
  }
]