[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Alexei Anatolyevich Navalny (Russian: Алексей Анатольевич Навальный, IPA: [ɐlʲɪkˈsʲej ɐnɐˈtolʲjɪvʲɪtɕ nɐˈvalʲnɨj]; 4 June 1976 – 16 February 2024) was a <strong>Russian opposition leader, anti-corruption activist and political prisoner</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Alexei Navalny | Alternative History | Fandom",
    "url": "https://althistory.fandom.com/wiki/Alexei_Navalny",
    "snippet": "Throughout his career, he had <strong>organised anti-government demonstrations and run for office to advocate reforms against corruption in Russia, and against president Vladimir Putin and his government</strong>, who avoided referring directly to Navalny by name.",
    "published": null
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "Aleksey Navalny (born June 4, 1976, Butyn, Russia—died February 16, 2024, Yamalo-Nenets region, northwestern Siberia, Russia) was a <strong>Russian lawyer, anti-corruption activist, and politician</strong> who achieved international recognition as one of the ...",
    "published": "March 7, 2023"
  },
  {
    "title": "Navalny's Campaign 2018. How it was",
    "url": "https://2018.navalny.com/en/biography/",
    "snippet": "Alexey Navalny is a <strong>Russian politician, lawyer and founder of the Anti-Corruption Foundation</strong>. In 2017, he held a campaign to be admitted to the presidential elections, which became the most important political event in Russia&#x27;s modern history.",
    "published": null
  },
  {
    "title": "The Two Layers of Alexei Navalny | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/two-layers-alexei-navalny",
    "snippet": "“The fact that I am a religious person is the subject of constant ridicule in the Anti-Corruption Foundation [FBK in the Russian acronym, Navalny’s organization] and among those around me. Most of them are atheists, and I used to be one myself,” he said during one of his many “last words” in the politically motivated trials he was subjected to throughout his career. The merging of the two sets of ideals—a pursuit of freedom and a deeply held faith—in one larger-than-life figure is not entirely unique in Russian history, but it remains a rarity in the country’s political landscape.",
    "published": null
  }
]