[
  {
    "title": "Lamine Diack - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lamine_Diack",
    "snippet": "Lamine Diack (7 June 1933 – 3 December 2021) was a Senegalese businessman, sports administrator, and athlete. He was <strong>president of the International Association of Athletics Federations (IAAF) from 1999 to 2015.</strong> He was the subject of numerous investigations into corruption during his tenure ...",
    "published": "October 18, 2025"
  },
  {
    "title": "Lamine Diack hands over the leadership of the CAA | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/lamine-diack-hands-over-the-leadership-of-the",
    "snippet": "After <strong>30 years of leading the African Athletics Confederation</strong>, IAAF President Lamine Diack has handed over the reigns to his successor, Cameroon’s Hamad Kalkaba Malboum.",
    "published": null
  },
  {
    "title": "Lamine Diack becomes first president of the International Association of Athletics Federations | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/lamine-diack-becomes-first-president-of-the-i",
    "snippet": "<strong>1 August 2001 – Edmonton, Canada – An overwhelming majority of IAAF Congress delegates has elected Lamine Diack President of the International Association of Athletics Federations</strong>. 168 delegates voted for with just 1 delegate against.",
    "published": null
  },
  {
    "title": "Lamine Diack - Prices, Stats & Evolutions | FC25 | FUTBIN",
    "url": "https://www.futbin.com/25/player/62101/lamine-diack",
    "snippet": "Lamine Diack&#x27;s Silver Rare card is rated 67, he is a 186cm | 6&#x27;1&quot; tall, right-footed Senegal midfielder (CDM) that plays for FC Nantes in Ligue 1 Uber Eats. He has 3-star weak foot and 2-star skill moves. He does not have a real face in-game. Lamine Diack has 2 special cards with ratings between 67 and 67.",
    "published": "August 13, 2025"
  },
  {
    "title": "President Lamine Diack passed away at the age of 88",
    "url": "https://www.caaweb.org/en/index.php/blog/top-info/president-lamine-diack-passed-away-at-the-age-of-88",
    "snippet": "As the <strong>first president of the Confederation of African Athletics (CAA) from 1973 to 2003</strong>, he contributed to the influence of African athletics by developing a policy of training technical and administrative executives which led to the emergence ...",
    "published": null
  }
]