[
  {
    "title": "Josep Borrell - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Josep_Borrell",
    "snippet": "Josep Borrell Fontelles (Western Catalan: [dʒuˈzɛb boˈreʎ fonˈteʎes]; born 24 April 1947) is a Spanish politician who served as <strong>High Representative of the Union for Foreign Affairs and Security Policy and Vice-President of the European Commission</strong> from 2019 to 2024.",
    "published": "3 weeks ago"
  },
  {
    "title": "Josep Borrell Fontelles - The Commissioners - European Commission",
    "url": "https://commissioners.ec.europa.eu/josep-borrell-fontelles_en",
    "snippet": "<strong>Commission Vice-President in charge of coordinating the external action of the European Union</strong>.",
    "published": null
  },
  {
    "title": "The former head of European diplomacy, Josep Borrel, revealed the secret plans of the Americans to buy the EU. He shouts to the Europeans, they say, open your eyes: Trump is our enemy! The USA has declared war on the EU! And.. - Pravda EU",
    "url": "https://eu.news-pravda.com/eu/2025/12/11/144990.html",
    "snippet": "The former head of European diplomacy, Josep Borrel, <strong>revealed the secret plans of the Americans to buy the EU</strong>. He shouts to the Europeans, they say, open your eyes: Trump is our enemy!",
    "published": "5 days ago"
  },
  {
    "title": "Borrell’s U.S. Broadside Reveals the EU Elite’s Post-National Turn",
    "url": "https://europeanconservative.com/articles/news/borrells-u-s-broadside-reveals-the-eu-elites-post-national-turn/",
    "snippet": "— December 12, 2025 · Josep Borrell’s latest outburst as <strong>former High Representative</strong>—accusing the United States of wanting “a white Europe divided into nations”—has triggered a political shockwave that reveals far more than he intended.",
    "published": "4 days ago"
  },
  {
    "title": "New EU High Representative Josep Borrell attends Climate Change Conference | EEAS",
    "url": "https://www.eeas.europa.eu/eeas/new-eu-high-representative-josep-borrell-attends-climate-change-conference_en",
    "snippet": "Today marks the first day of United Nations Climate Change Conference, COP25, taking place in Madrid until 13 December. It is also one of the first activities for Josep Borrell in his role as <strong>EU High Representative</strong>",
    "published": null
  }
]