[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "In the 2020 Emilia-Romagna regional ... Ecologist and Progressive. She was <strong>elected with over 22,000 votes, the highest vote tally for a councillor in regional history, and was subsequently appointed by Stefano Bonaccini as his vice-president</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "8th parliamentary term | Elly SCHLEIN | MEPs | European Parliament",
    "url": "https://www.europarl.europa.eu/meps/en/124804/ELLY_SCHLEIN/history/8",
    "snippet": "Profile page - Elly SCHLEIN - Profile page of a current Member of the European Parliament - History of parliamentary service during the 8th legislative term including memberships in political groups, national parties, parliamentary committees and delegations as well as parliamentary activities and the declaration of financial interests.",
    "published": null
  },
  {
    "title": "Elena Ethel \"Elly\" Schlein - UJE - Ukrainian Jewish Encounter",
    "url": "https://ukrainianjewishencounter.org/en/elena-ethel-elly-schlein/",
    "snippet": "<strong>Schlein&#x27;s maternal grandfather, Agostino Viviani, was an Italian Socialist Party politician, a senator from 1972 to 1979, and a High Council of the Judiciary member</strong>. Schlein&#x27;s family roots on her father&#x27;s side go back to Zhovkva, a town in the ...",
    "published": "April 8, 2025"
  },
  {
    "title": "4 Things to Know About Elly Schlein, Face of Italy's Largest Opposition Party | ITALY Magazine",
    "url": "https://www.italymagazine.com/featured-story/4-things-know-about-elly-schlein-face-italys-largest-opposition-party",
    "snippet": "<strong>On March 12, 37-year-old Elly Schlein will officially take the helm of Italy&#x27;s struggling Partito Democratico (Democratic Party or PD).</strong> Here&#x27;s a rundown of her biography and basic stats.",
    "published": "March 9, 2023"
  },
  {
    "title": "Italy's left picks 'anti-Meloni' politician Elly Schlein to lead the party | Euronews",
    "url": "https://www.euronews.com/my-europe/2023/02/27/the-anti-meloni-meet-elly-schlein-italys-breakout-left-wing-star",
    "snippet": "After cutting her political teeth across the Atlantic, Schlein <strong>became an impassioned youth activist for the Democratic Party and was elected as a member of the European Parliament in 2014.</strong>",
    "published": "March 1, 2023"
  }
]