[
  {
    "title": "Utkarsh",
    "url": "https://utkarsh.com/current-affairs/international/person-in-news-updates/ex-footballer-mikheil-kavelashvili-elected-georgias-president",
    "snippet": "Former footballer Mikheil Kavelashvili was elected as the new President of Georgia on <strong>14 December, 2024</strong>.",
    "published": "1 month ago"
  },
  {
    "title": "Kavelashvili is inaugurated as Georgia's president, complicating its path toward EU | AP News",
    "url": "https://apnews.com/article/georgia-president-zourabichvili-russia-kavelashvili-215020983cefb6ce1eb2ecad184a9c1e",
    "snippet": "Demonstrators hold red cards outside of the Georgian parliament where the President-elect Mikheil Kavelashvili, a former soccer player, takes his oath at the swearing-in ceremony, in Tbilisi, Georgia, Sunday, Dec.",
    "published": "December 30, 2024"
  },
  {
    "title": "New Georgian President Sworn In Amid Political Standoff",
    "url": "https://www.rferl.org/a/georgia-tbilisi-kavelashvili-zourabichvili/33256787.html",
    "snippet": "Georgian President-elect Mikheil Kavelashvili <strong>speaks at his swearing-in ceremony at the Georgian Parliament in Tbilisi on December 29.</strong>",
    "published": "December 29, 2024"
  },
  {
    "title": "Georgia: Ex-footballer Mikheil Kavelashvili named president",
    "url": "https://www.bbc.com/news/articles/c5ygejxej28o",
    "snippet": "Georgia&#x27;s outgoing pro-Western president, Salome Zourabichvili, has condemned Kavelashvili&#x27;s election as a travesty, insisting she holds Georgia&#x27;s only remaining legitimate institution. ... Prime Minister Irakli Kobakhidze has accused Zourabichvili of trying to harm Georgia&#x27;s interests, emphasising that when her term of office ends on 29 December, she will have to retire.",
    "published": "December 14, 2024"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "TBILISI, Goergia (AP) — <strong>Former soccer player Mikheil Kavelashvili was formally inaugurated as president of Georgia on Sunday</strong>, cementing the ruling party’s grip in what the opposition calls a blow to the country’s EU aspirations and a victory ...",
    "published": "December 29, 2024"
  }
]