[
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "<strong>Draghi was president from 1 November 2011 until 31 October 2019</strong> (succeeded by Christine Lagarde). Pascal Canfin, Member of the European Parliament for France, asserted that Draghi had been involved in swaps for European governments, namely Greece, trying to disguise their countries&#x27; economic status.",
    "published": "September 25, 2025"
  },
  {
    "title": "Category:Presidents of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Category:Presidents_of_the_European_Central_Bank",
    "snippet": "This category contains current and former presidents of the European Central Bank.",
    "published": null
  },
  {
    "title": "European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Central_Bank",
    "snippet": "The bank was the final institution needed for EMU, as outlined by the EMU reports of Pierre Werner and President Jacques Delors. It was established on 1 June 1998 The first President of the Bank was <strong>Wim Duisenberg</strong>, the former president of the Dutch central bank and the European Monetary Institute.",
    "published": "2 days ago"
  },
  {
    "title": "Executive Board members – terms of office",
    "url": "https://www.ecb.europa.eu/ecb/decisions/eb/html/ebtimeline.en.html",
    "snippet": "Our monetary policy strategy, the tools we use and the impact they have · Insights into our work on financial stability and payments and market infrastructures",
    "published": "September 12, 2024"
  },
  {
    "title": "The European Central Bank (1998-present)",
    "url": "https://www.ecb.europa.eu/ecb/history-arts-culture/archives/european/html/index.en.html",
    "snippet": "The EMI’s preparatory work helped establish the ECB and paved the way for significant milestones, such as the introduction of the euro as a single currency on 1 January 1999 and the launch of euro banknotes and coins on 1 January 2002. 25 years of the ECB · The ECB historical archives include files related to meetings of the ECB’s decision-making bodies and of committees of the European System of Central Banks, legal acts and instruments, and other documents of an operational or administrative nature.",
    "published": "March 8, 2024"
  }
]