[
  {
    "title": "Longtime Harvard Kennedy School faculty member Nicholas Burns to return to HKS after serving as U.S. envoy to China | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/announcements/nicholas-burns-returns-to-hks",
    "snippet": "— Nicholas Burns, who until recently served as the United States ambassador to the People’s Republic of China, <strong>will rejoin the Harvard Kennedy School faculty in April</strong>, Dean Jeremy M. Weinstein announced today.",
    "published": null
  },
  {
    "title": "Rise to the enormous challenges before you, Ambassador Nicholas Burns urges HKS Class of 2024 | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty-research/policy-topics/public-leadership-management/rise-enormous-challenges-you-ambassador",
    "snippet": "Burns, who taught at the Kennedy School for 13 years before <strong>returning to public service in 2021</strong>, spoke to an audience of 659 graduating students from 35 U.S. states and 87 countries, calling them “our planet in microcosm.” The student body ...",
    "published": null
  },
  {
    "title": "Nicholas Burns | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty/nicholas-burns",
    "snippet": "Burns <strong>served as the U.S. Ambassador to the People&#x27;s Republic of China from 2021-2025</strong>, leading public servants from forty-eight U.S. government agencies at the U.S. mission to China in overseeing one of America&#x27;s most important and challenging ...",
    "published": null
  },
  {
    "title": "Former U.S. Ambassador to China To Return to Kennedy School Professorship | News | The Harvard Crimson",
    "url": "https://www.thecrimson.com/article/2025/1/27/burns-hks-return/",
    "snippet": "Former U.S. Ambassador to China R. Nicholas Burns <strong>will return to the Harvard Kennedy School as a professor this April</strong>, joining the Fairbank Center for Chinese Studies, the University announced earlier this week.",
    "published": null
  },
  {
    "title": "U.S. Ambassador to China Nicholas Burns to deliver 2024 Harvard Kennedy School graduation address | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/announcements/us-ambassador-china-nicholas-burns-deliver-2024-harvard-kennedy-school-graduation",
    "snippet": "Nicholas Burns, the ambassador of the United States to the People’s Republic of China, <strong>will give the 2024 graduation address at Harvard Kennedy School</strong>, Dean Douglas Elmendorf announced today. After a distinguished career as a senior U.S.",
    "published": null
  }
]