[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Manmohan Singh (26 September 1932 – 26 December 2024) was an Indian economist and statesman who served as the prime minister of India from 2004 to 2014. He was the fourth longest-serving prime minister after Jawaharlal Nehru, Indira Gandhi, and Narendra Modi.",
    "published": "2 weeks ago"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "Singh received numerous awards and honours during his lifetime. Among the most prominent are India’s second-highest civilian honour, the Padma Vibhushan (1987), the Jawaharlal Nehru Birth Centenary Award of the Indian Science Congress (1995), the Asia Money Award for Finance Minister of the Year (1993 and 1994), the Euro Money Award for Finance Minister of the Year (1993), the Adam Smith Prize of the University of Cambridge (1956), and the Wright’s Prize for Distinguished Performance at St.",
    "published": null
  },
  {
    "title": "Manmohan Singh | Biography, Reforms, Political Career, & Death | Britannica",
    "url": "https://www.britannica.com/biography/Manmohan-Singh",
    "snippet": "Manmohan SinghAn economist by education, Manmohan Singh brought significant reforms to India as the country&#x27;s finance minister during the 1990s, at a time when India was near economic collapse. He became prime minister in 2004 and was the first prime minister after Jawaharlal Nehru to return to the office after completing a full five-year term.",
    "published": "February 24, 2005"
  },
  {
    "title": "List of awards and honours received by Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_awards_and_honours_received_by_Manmohan_Singh",
    "snippet": "As the finance minister in the P. V. Narasimha Rao government in the 1990s, he <strong>carried out several structural reforms that liberalised India&#x27;s economy</strong>. Singh was re-elected as the prime minister in 2009.",
    "published": "July 11, 2025"
  },
  {
    "title": "DR. MANMOHAN SINGH",
    "url": "https://inc.in/our-inspiration/dr-manmohan-singh",
    "snippet": "Dr Manmohan Singh, India’s 14th ... Under Dr Singh’s stewardship, <strong>India witnessed the highest growth rate in its history, averaging at 7.7% to become a nearly two trillion-dollar economy</strong>....",
    "published": null
  }
]