[
  {
    "title": "2024–2025 French political crisis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–2025_French_political_crisis",
    "snippet": "The vote, held on 8 September, resulted in a heavy defeat for Bayrou, with 194 votes in favor of the government and 364 against. The National Rally and the New Popular Front voted against alongside other minor parties. Macron appointed Sébastien Lecornu as prime minister on 9 September 2025. Lecornu presented his cabinet on 5 October, but resigned the next day, making him the shortest-serving prime minister in the history of the French Fifth Republic.",
    "published": "3 days ago"
  },
  {
    "title": "Opinion | France Needs a New France - The New York Times",
    "url": "https://www.nytimes.com/2025/12/22/opinion/france-macron-sixth-republic.html",
    "snippet": "But he is not out of the woods yet. <strong>Without a clear majority in the National Assembly, the government remains vulnerable to a motion of no confidence</strong>. That could force Mr. Macron to name yet another prime minister — the sixth of his second ...",
    "published": "1 day ago"
  },
  {
    "title": "France’s Endless Nightmare: A Nation Incapable of Reform - American Thinker",
    "url": "https://www.americanthinker.com/articles/2025/12/france_s_endless_nightmare_a_nation_incapable_of_reform.html",
    "snippet": "<strong>The bill now moves to the Senate, where the governing coalition holds a majority</strong>. It will likely pass without major obstruction. On December 23rd, the Senate begins negotiations for the 2026 budget.",
    "published": "2 weeks ago"
  },
  {
    "title": "A Hitchhiker’s Guide to French Politics - EFG International",
    "url": "https://www.efginternational.com/us/insights/2025/a_hitchhiker_guide_to_french_politics.html",
    "snippet": "Michel Barnier, a veteran conservative ... budget triggered no-confidence votes from both left and right, and <strong>on 4 December the Assembly ousted his government</strong>.1...",
    "published": null
  },
  {
    "title": "France to miss 2026 budget deadline as lawmakers fail to reach deal | Euronews",
    "url": "https://www.euronews.com/2025/12/19/france-to-miss-2026-budget-deadline-as-lawmakers-fail-to-reach-deal",
    "snippet": "His cabinet noted &quot;the failure ... for a solution. <strong>The government is now expected to seek a special law that would temporarily roll over the 2025 budget into the new year while debates continue</strong>....",
    "published": "4 days ago"
  }
]