[
  {
    "title": "History of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Saudi_Arabia",
    "snippet": "Abdul-Aziz, however, refused to ... defeated in the Battle of Sabilla in 1929, and the Ikhwan leadership were massacred. In 1932, the two kingdoms of the Hejaz and Najd were united as the &quot;Kingdom of Saudi Arabia&quot;....",
    "published": "October 21, 2025"
  },
  {
    "title": "KSA History",
    "url": "https://www.mofa.gov.sa/en/ksa/Pages/history.aspx",
    "snippet": "During King Khaled’s years the Kingdom had accomplished major improvements in various areas of development through the use of the urban culture while maintaining the Saudi principles and the Islamic distinguished system. The Kingdom held its high position in Arabic and Islamic politics; due to Saudi Arabia firm leadership and principles, and the embracing of the Muslims beloved two Holy mosques.",
    "published": null
  },
  {
    "title": "Saudi Arabia profile - Timeline - BBC News",
    "url": "https://www.bbc.com/news/world-middle-east-14703523",
    "snippet": "<strong>King Salman</strong> names his son Mohammed bin Salman first in line to the throne. 2017 September - Ban on women driving formally lifted. 2017 November - Purge of the kingdom&#x27;s political and business leadership in move by Prince Mohammed to consolidate ...",
    "published": "October 4, 2019"
  },
  {
    "title": "King of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/King_of_Saudi_Arabia",
    "snippet": "<strong>King Abdulaziz Al Saud, known in the West as Ibn Saud, regained his patrimony, which is known as today&#x27;s Saudi Arabia, in 1902</strong>. Restoring his family as emirs of the Emirate of Riyadh, he then established the Sultanate of Nejd as his headquarters ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Rulers of Saudi Arabia (1932-Present)",
    "url": "https://www.jewishvirtuallibrary.org/rulers-of-saudi-arabia-1932-present",
    "snippet": "Memo for President Nixon from the Secretary of Defense Regarding Sale of F-4s to Saudi Arabia (5/18/73) ... Saudis Warn European Community to Pressure U.S. to Change its Policies Regarding Israel or Face Oil Restrictions (10/16/73) President Kennedy&#x27;s conversation with Crown Prince Faysal (October 5, 1962) ... U.S. Ambassadors to Saudi Arabia",
    "published": null
  }
]