[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the secretary of the Democratic Party (PD) since <strong>12 March 2023</strong>. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "1 week ago"
  },
  {
    "title": "Meet the anti-Renzi: Elly Schlein becomes first woman leader of Italy’s center left",
    "url": "https://www.politico.eu/article/elly-schlein-first-woman-leader-italy-social-democratic-party/",
    "snippet": "Primary winner is a left-wing radical who once abandoned the party under centrist Prime Minister Matteo Renzi’s leadership. ... Elly Schlein has become the youngest leader and first woman at the helm of the PD | Fabio Frustaci/EPA-EFE ... Radical candidate Elly Schlein is the new leader of Italy’s traditionally center-left Democratic Party (PD), after winning a primary vote Sunday.",
    "published": "February 27, 2023"
  },
  {
    "title": "Italy's left picks 'anti-Meloni' politician Elly Schlein to lead the party | Euronews",
    "url": "https://www.euronews.com/my-europe/2023/02/27/the-anti-meloni-meet-elly-schlein-italys-breakout-left-wing-star",
    "snippet": "Come the following year, and increasingly opposed to the labour reforms of the then-PM and party leader, Renzi, she ultimately parted ways with the PD and joined a splinter party, <strong>Possible (Possibile).</strong>",
    "published": "March 1, 2023"
  },
  {
    "title": "Elly Schlein voted leader of Italy’s most important leftwing party in surprise win | Italy | The Guardian",
    "url": "https://www.theguardian.com/world/2023/feb/27/elly-schlein-voted-leader-of-italy-democratic-party-surprise-win",
    "snippet": "Vocal on social justice issues, ... She <strong>rejoined the Democratic party after leaving in 2015 out of frustration over the direction the party was taking under its then leader and former prime minister, Matteo Renzi</strong>...",
    "published": "February 27, 2023"
  },
  {
    "title": "4 Things to Know About Elly Schlein, Face of Italy's Largest Opposition Party | ITALY Magazine",
    "url": "https://www.italymagazine.com/featured-story/4-things-know-about-elly-schlein-face-italys-largest-opposition-party",
    "snippet": "<strong>Sign up for a Premium Membership for unlimited access to articles and our quarterly Bellissimo Magazine</strong>. ... 37-year-old Elly Schlein took home a surprise victory at last month’s primary for the new leadership of the struggling Partito Democratico ...",
    "published": "March 9, 2023"
  }
]