[
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "Solomon is no newcomer to the Academy board, since she served for 6 years as deputy chair herself alongside outgoing chair <strong>Mike Downey</strong>, and was a regular board member before. Leontine Petit has been a regular board member since 2021.",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "Solomon has served on the Academy board for six years as deputy chair herself alongside outgoing chair <strong>Mike Downey</strong>, and was a regular board member before.",
    "published": "2 weeks ago"
  },
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Dutch producer <strong>Leontine Petit and French producer Matthieu Darras</strong> were elected deputy chairs, and the new two-year leadership term will begin on January 1, 2026. The president of the Academy remains Juliette Binoche.",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/european-film-academy-announces-new-board-appointments/",
    "snippet": "From left to right: Ada Solomon ... board, since she served for 6 years as deputy chair herself alongside outgoing chair <strong>Mike Downey</strong>, and was a regular board member before....",
    "published": "2 weeks ago"
  },
  {
    "title": "Romania: Romanian producer Ada Solomon elected chair of the European Film (…)",
    "url": "https://www.romaniapress.com/news=189317",
    "snippet": "Producer Ada Solomon has been elected chair of the board of the (…). Romanian producer Ada Solomon elected chair of the European Film Academy board. Romanian News by Romaniapress.com",
    "published": null
  }
]