[
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "27 October 2025 · SHARE · <strong>Igor Tudor</strong> is no longer Juventus&#x27; head coach · <strong>Igor Tudor</strong> is no longer Juventus&#x27; head coach · <strong>Igor Tudor</strong> is no longer Juventus&#x27; head coach ·",
    "published": null
  },
  {
    "title": "Comolli confirms Tudor will be Juventus’ manager for the 2025-26 season | Black & White & Read All Over",
    "url": "https://www.blackwhitereadallover.com/2025/6/10/24446769/juventus-damien-comolli-igor-tudor-2025-serie-a-team-management-team-news",
    "snippet": "The biggest one, though, was for the immediate future and what <strong>Igor Tudor</strong>’s status for the 2025-26 season was going to be. We didn’t have to wait long to get an answer. Comolli was quick to confirm Tudor — who took over for Thiago Motta ...",
    "published": "June 10, 2025"
  },
  {
    "title": "List of Juventus FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Juventus_FC_managers",
    "snippet": "The most successful person to manage Juventus is <strong>Giovanni Trapattoni</strong>, who won six Football League titles (Scudetto), two Coppa Italias, one European Champions Clubs&#x27; Cup, one UEFA Cup Winners&#x27; Cup, two UEFA Cups, one UEFA Super Cup and one Intercontinental Cup in two periods from 1976 and 1986 ...",
    "published": "November 2, 2025"
  },
  {
    "title": "Thiago Motta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Thiago_Motta",
    "snippet": "In October 2019, he returned to Genoa as their manager, before he was fired in December following a poor run of results. In July 2021, Motta was appointed manager of Spezia, where he remained for one season, before taking over as manager of Bologna in September 2022, leading them to qualify for the Champions League in his second season. In June 2024, Motta was appointed head coach of Juventus. In March 2025, after being eliminated from the Champions League and general poor results, he was sacked.",
    "published": "3 weeks ago"
  },
  {
    "title": "Luciano Spalletti on the Verge of Becoming Juventus’ New Head Coach | beIN SPORTS",
    "url": "https://www.beinsports.com/en-us/soccer/serie-a/articles/luciano-spalletti-on-the-verge-of-becoming-juventus-new-head-coach-2025-10-29",
    "snippet": "The former Italy manager is close to taking charge of Juventus after <strong>Igor Tudor</strong>’s departure, with a deal expected in the next 48 hours.",
    "published": null
  }
]