[
  {
    "title": "Stanford HAI: Home",
    "url": "https://hai.stanford.edu/",
    "snippet": "The Stanford Institute for Human-Centered AI strives to foster a culture of interdisciplinary AI research in which technological advancements are inextricably linked to research about their potential societal impacts. HAI builds on the strength of Stanford research by offering many grant programs.",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/company/stanfordhai",
    "snippet": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | 91,795 followers on LinkedIn. Advancing AI research, education, policy, and practice to improve humanity. | At Stanford HAI, our vision for the future is led by our commitment to studying, guiding and developing human-centered ...",
    "published": null
  },
  {
    "title": "Overview | Stanford HAI",
    "url": "https://hai.stanford.edu/overview-0",
    "snippet": "Stanford HAI",
    "published": null
  },
  {
    "title": "About - Stanford HAI",
    "url": "https://hai.stanford.edu/about",
    "snippet": "We partner with Wu Tsai Center to fund research in AI and neuroscience, develop our Tech Ethics &amp; Policy fellowships, launch the RAISE-Health initiative with Stanford Medicine, create an AI training series for federal employees, and team with the Asia Foundation for an education program in Asia. HAI leaders Fei-Fei Li and Rob Reich also meet with Pres.",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | Stanford Online",
    "url": "https://online.stanford.edu/schools-centers/stanford-institute-human-centered-artificial-intelligence-hai",
    "snippet": "Stanford founded the Institute for Human-Centered AI in 2019 to guide and build the future of AI.HAI advances AI research, education, policy and practice to improve the human condition. Led by faculty from multiple departments across Stanford, research focuses on developing AI technologies ...",
    "published": "October 17, 2024"
  }
]