[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She and Paris Saint-Germain lost 5–2 on aggregate to Juventus in the 2024–25 UEFA Women&#x27;s Champions League qualifying rounds. On 12 November 2025, Earps returned to <strong>Manchester United</strong> in the Champions League for the first time since her move, where they lost 2-1.",
    "published": "3 days ago"
  },
  {
    "title": "Mary Earps’ Manchester United return: Jeers, cheers, selfies and a painful defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6802703/2025/11/13/mary-earps-manchester-united-psg/",
    "snippet": "13, 2025 ... Sporting a bright yellow <strong>Paris Saint-Germain</strong> goalkeeping kit, hips swaying from side to side, Mary Earps looked up towards Old Trafford’s Sir Bobby Charlton Stand. Game mode was activated for the return of the ‘Mearps’ in ...",
    "published": "November 13, 2025"
  },
  {
    "title": "Local Legends: Mary Earps MBE - From Nottingham To National Icon - Impact Magazine",
    "url": "https://impactnottingham.com/2025/12/local-legends-mary-earps-mbe-from-nottingham-to-national-icon/",
    "snippet": "At the end of the 2023/24 season, Earps left <strong>Manchester United</strong> and English football behind in order to pursue a new challenge and sign for French side PSG, where she established herself as the No.",
    "published": "3 weeks ago"
  },
  {
    "title": "Mary Earps on life at PSG: ‘There was a lot of noise so it’s been nice to escape’ | Sport | The Guardian",
    "url": "https://www.theguardian.com/football/2025/apr/03/mary-earps-psg-england-interview-moving-the-goalposts",
    "snippet": "Mary Earps is relishing in playing in a new environment at <strong>Paris Saint-Germain</strong>. Photograph: Eurasia Sport Images/Getty Images · The 32-year-old former Manchester United goalkeeper had played abroad before, for the German club Wolfsburg in 2018-19, ...",
    "published": "April 4, 2025"
  },
  {
    "title": "England goalkeeper Mary Earps retires ahead of 2025 Euros in shock announcement",
    "url": "https://www.thepinknews.com/2025/05/27/england-footballer-mary-earps-retired/",
    "snippet": "Although she is retiring from international football, Mary Earps will still play club football, after joining <strong>Paris Saint-Germain</strong> from Manchester United last year. The UEFA Women’s Euro 2025 tournament will be played in Switzerland from 2 ...",
    "published": "May 27, 2025"
  }
]