[
  {
    "title": "Politics of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Kyrgyzstan",
    "snippet": "Unlike one of its neighbors – Turkmenistan – Kyrgyzstan has had a more pluralistic political system since the collapse of the Soviet Union. <strong>Kyrgyzstan has swung between authoritarian and democratic forms of government</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Political Transition in Kyrgyzstan: Problems and Prospects | ...",
    "url": "https://crisisgroup.org/europe-central-asia/central-asia/kyrgyzstan/political-transition-kyrgyzstan-problems-and-prospects",
    "snippet": "Kyrgyzstan&#x27;s society has become more mature since independence but its government more authoritarian. <strong>Parliamentary and presidential elections in 2005 offer the chance of a democratic transfer of power</strong> that would be an example for all Central Asia.",
    "published": "September 27, 2016"
  },
  {
    "title": "BTI 2024 Kyrgyzstan Country Report: BTI 2024",
    "url": "https://bti-project.org/en/reports/country-report/KGZ",
    "snippet": "Following the adoption of a new constitution in 2021 and Kyrgyzstan’s <strong>transition from a mixed parliamentary-presidential model to a strongly presidential regime</strong>, the separation of powers has become ever more compromised.",
    "published": null
  },
  {
    "title": "Kyrgyzstan Political Process Program | IFES - The International Foundation for Electoral Systems",
    "url": "https://www.ifes.org/programs-initiatives/kyrgyzstan-political-process-program",
    "snippet": "Following a period of transition in <strong>April 2010</strong>, when a series of protests led to the ouster of an increasingly authoritarian government, Kyrgyzstan entered a period of significant electoral and political reform.",
    "published": null
  },
  {
    "title": "Chairman Kerry On Kyrgyzstan’s Democratic Transition | United States Senate Committee on Foreign Relations",
    "url": "https://www.foreign.senate.gov/press/rep/release/chairman-kerry-on-kyrgyzstans-democratic-transition",
    "snippet": "Over the past year, we have witnessed some progress toward that goal, with <strong>credible parliamentary elections in October, the formation of a government in December and a more vibrant media and political debate</strong>.",
    "published": null
  }
]