[
  {
    "title": "Seb Coe splits from his wife after 13 years | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/tvshowbiz/article-149725/Seb-Coe-splits-wife-13-years.html",
    "snippet": "Olympic gold medallist Sebastian Coe, who received a life peerage for his services to William Hague, has <strong>parted from his wife Nicola</strong> after 13 years&#x27; marriage.",
    "published": "December 1, 2002"
  },
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "In 1990, when resident in Surrey, Coe married Nicky McIrvine, a former Badminton three-day-event champion, with whom he has two sons and two daughters. <strong>The marriage ended in divorce in 2002 after twelve years</strong>.",
    "published": "November 18, 2025"
  },
  {
    "title": "Lord Sebastian Coe weds his long-term girlfriend",
    "url": "https://www.telegraph.co.uk/news/celebritynews/8617434/Lord-Sebastian-Coe-weds-his-long-term-girlfriend.html",
    "snippet": "Thank you for your interest. Unauthorised access is prohibited. To access this content, you must have prior permission and a valid contract. Please contact our team at licensing@telegraph.co.uk to discuss licensing options · If you are a Telegraph Subscriber, please contact customerservic...",
    "published": null
  },
  {
    "title": "Seb Coe set to be named in divorce; HUSBAND ACCUSES HIM. - Free Online Library",
    "url": "https://www.thefreelibrary.com/Seb+Coe+set+to+be+named+in+divorce;+HUSBAND+ACCUSES+HIM.-a0117026998",
    "snippet": "&quot;He began an affair with my wife almost a year ago and she moved out in December purely because of their relationship. I&#x27;m very angry. They have been together for much longer than they claim. We&#x27;ve got children. He ruined my marriage.&quot; Mr Annett refused to comment on his divorce plans, but a family friend said: &quot;There is a strong possibility that he will be identified as the co-respondent when Mr Annett files for divorce. It will be highly embarrassing for Lord Coe - particularly given his new, high-profile role as head of London&#x27;s Olympics bid.&quot;&quot; Earlier this year Lord Coe invited blonde Carole, 38, to accompany him to an Athens resort where he was on a working holiday to see Greece&#x27;s preparations for this summer&#x27;s Olympics.",
    "published": null
  },
  {
    "title": "Seb Coe is dating Lionel Richie's glamorous ex-wife: Twice-married World Athletics boss, 69, has found love again with US model and fashion designer Diane Richie, 58 | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/tvshowbiz/article-15375063/Seb-Coe-dating-Lionel-Richie-ex-wife-Diane-Richie.html?ito=1490&ns_campaign=1490",
    "snippet": "Lord Coe, who has been <strong>married twice before himself</strong>, is very serious about Ms Richie, taking her as his plus-one to arguably his most important work event of 2025.",
    "published": "1 week ago"
  }
]