[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Two subsidiaries of the IAU were also created at this assembly: the International Time Commission seated at the International Time Bureau in Paris, France, and the International Central Bureau of Astronomical Telegrams initially seated in Copenhagen, Denmark. The seven initial member states were Belgium, Canada, France, Great Britain, Greece, Japan, and the United States, soon to be followed by Italy and Mexico. The first executive committee consisted of Benjamin Baillaud (President, France), Alfred Fowler (General Secretary, UK), and four vice presidents: William Campbell (US), Frank Dyson (UK), Georges Lecointe (Belgium), and Annibale Riccò (Italy).",
    "published": "3 weeks ago"
  },
  {
    "title": "Vote in the 2025 AAS Election! | American Astronomical Society",
    "url": "https://aas.org/posts/news/2025/01/vote-2025-aas-election",
    "snippet": "Current President: <strong>Dara Norman</strong> (June 2024-June 2026); Past President: Kelsey Johnson (June 2024-June 2025).",
    "published": null
  },
  {
    "title": "Executive Committee",
    "url": "https://www.iau.org/Iau/Iau/About/Governance-Overview/Executive-Committee.aspx",
    "snippet": "The Executive Committee consists of the President of the Union, the President-Elect, six Vice-Presidents , the General Secretary, and the Assistant General Secretary elected by the General Assembly on the proposal of the Special Nominating Committee (SNC) .",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://www.iau.org/administration/executive_bodies/past_committees/executive_committee/",
    "snippet": "Debra Meloy Elmegreen · Piero Benvenuti (Interim General Secretary) <strong>José Miguel Rodriguez Espinosa</strong>",
    "published": null
  },
  {
    "title": "AAS Announces 2025 Election Results | American Astronomical Society",
    "url": "https://aas.org/posts/news/2025/03/aas-announces-2025-election-results",
    "snippet": "Most will take office this summer (with the President-Elect position replacing the Past President), while the USNC/IAU representative will join the committee in September. The newly elected members of the Nominating Committee will begin their terms immediately! If you would like to help drive the Society&#x27;s strategic direction and are willing to devote a fair amount of time and energy to it, please consider running for a position on the Board of Trustees. Members can indicate their interest in their online accounts. ... The 2025 AAS Election is underway, with more than 1,600 ballots already cast.",
    "published": null
  }
]