[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to <strong>ABC News</strong> pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight. On March 5, 2025, 538 was shut down by <strong>ABC News</strong> and its staff were laid off.",
    "published": "1 month ago"
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "In April 2023, amid widespread layoffs at Disney and ABC affecting FiveThirtyEight, Silver announced that his contract with ABC would not be extended. After Silver&#x27;s departure in May, a smaller FiveThirtyEight continued to operate under the data analytics division of <strong>ABC News</strong>, until being shut ...",
    "published": "1 day ago"
  },
  {
    "title": "FiveThirtyEight 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/224397-82",
    "snippet": "Information on acquisition, funding, investors, and executives for FiveThirtyEight. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "FiveThirtyEight is shutting down completely – FlowingData",
    "url": "https://flowingdata.com/2025/03/05/fivethirtyeight-is-shutting-down-completely",
    "snippet": "March 5, 2025 · News / data journalism, FiveThirtyEight · Disney is cutting news jobs, and FiveThirtyEight, which was absorbed by <strong>ABC News</strong> and owned by Disney, is going with them.",
    "published": "March 5, 2025"
  },
  {
    "title": "Daring Fireball: ABC Shuts Down FiveThirtyEight, and Pulls the Plug on Its Website",
    "url": "https://daringfireball.net/2025/03/abc_shuts_down_fivethirtyeight",
    "snippet": "I’m told he appeared to be reading from a script as he delivered the devastating news. He offered no explanation for why the Disney-owned network had decided to shutter FiveThirtyEight, which it acquired in 2018 along with data whiz and then-editor Nate Silver.",
    "published": null
  }
]