[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "Scott John Morrison (born 13 May 1968) is an <strong>Australian former politician who served as the 30th prime minister of Australia from 2018 to 2022</strong>. He held office as the leader of the Liberal Party and was the member of parliament (MP) for the New South Wales division of Cook from 2007 until his ...",
    "published": "6 days ago"
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "Scott Morrison (born May 13, 1968, Bronte, New South Wales, Australia) is an <strong>Australian conservative politician who served as leader of the Liberal Party and prime minister of Australia (2018–22)</strong>.",
    "published": "August 30, 2018"
  },
  {
    "title": "Scott Morrison | CNAS",
    "url": "https://www.cnas.org/people/scott-morrison",
    "snippet": "Scott Morrison <strong>served as Prime Minister of Australia from 2018 to 2022</strong>, leading his nation through the most significant challenges Australia had faced since the Great Depression and the Second World War.",
    "published": "May 4, 2023"
  },
  {
    "title": "Scott Morrison Biography - Facts, Childhood, Family Life, Achievements",
    "url": "https://www.thefamouspeople.com/profiles/scott-morrison-22176.php",
    "snippet": "Scott John Morrison was <strong>born on 13 May 1968 in Waverley, Sydney, New South Wales</strong>. His father, John Morrison, initially a police commissioner, later became an independent politician, who served on the Waverley Municipal Council for sixteen years.",
    "published": null
  },
  {
    "title": "Scott Morrison - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1701992/bio/",
    "snippet": "Scott Morrison. Self: Telethon. Scott Morrison was <strong>born on 13 May 1968 in Sydney, New South Wales, Australia</strong>. He has been married to Jenny Morrison since 13 January 1990. They have two children.",
    "published": null
  }
]