[
  {
    "title": "Ames Research Center Leadership and Organizations - NASA",
    "url": "https://www.nasa.gov/ames/ames-leadership-organizations/",
    "snippet": "+ Visit website NASA Human Resources Portal (hr.nasa.gov)",
    "published": "February 27, 2025"
  },
  {
    "title": "Ames Research Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ames_Research_Center",
    "snippet": "The center&#x27;s current director is <strong>Eugene Tu</strong>. The site was mission center for several key missions (Kepler, the Stratospheric Observatory for Infrared Astronomy (SOFIA), Interface Region Imaging Spectrograph) and a major contributor to the &quot;new exploration focus&quot; as a participant in the Orion ...",
    "published": "November 5, 2025"
  },
  {
    "title": "About the Ames Office of the Chief Scientist - NASA",
    "url": "https://www.nasa.gov/ames-ocs/about-ames-ocs/",
    "snippet": "The OCS also facilitates and develops international, inter-Agency, academic and commercial collaborations to sustain new research initiatives. Dr. <strong>Jacob Cohen</strong> is currently the Chief Scientist at NASA Ames Research Center.",
    "published": "September 29, 2025"
  },
  {
    "title": "Information for NASA Employees - NASA",
    "url": "https://www.nasa.gov/ames-ocs/nasalinks/",
    "snippet": "The ARTC consists of the three Chiefs and 11 technical members that are active researchers or technologists and do not hold a position higher than deputy division chief. The members are: Co-Chair: <strong>Jacob Cohen</strong>, Ames Chief Scientist Co-Chair: ...",
    "published": "March 27, 2024"
  },
  {
    "title": "List of 1511 NASA Ames Research Center Employees - Find Emails & Phones - SignalHire",
    "url": "https://www.signalhire.com/companies/nasa-ames-research-center/employees",
    "snippet": "NASA Ames Research Center United States employs 1511 employees. Reveal contacts of top NASA Ames Research Center managers and employees.",
    "published": null
  }
]