[
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - <strong>The Carlyle Group and Providence Equity Partners today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT</strong>. Financial details were not disclosed. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners, the Owners of Com Hem, Agree to Acquire UPC Sweden | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-owners-com-hem-agree",
    "snippet": "London - Private equity firms <strong>The Carlyle Group and Providence Equity Partners have signed an agreement with Liberty Global to acquire UPC Sverige AB</strong>. Carlyle and Providence recently acquired Com Hem, Sweden’s leading cable operator. UPC Sverige AB is a supplier of TV and broadband services ...",
    "published": null
  },
  {
    "title": "Com Hem - Products, Competitors, Financials, Employees, Headquarters Locations",
    "url": "https://www.cbinsights.com/company/com-hem",
    "snippet": "It offers a range of services including mobile subscriptions, mobile broadband, fixed broadband, and TV &amp; streaming services. Its primary customer base includes individuals, businesses, and property owners. The company was founded in 1983 and is based in Harnosand, Sweden. In <strong>November 2018,</strong> Com ...",
    "published": null
  },
  {
    "title": "2007-011 The Carlyle Group and Providence Equity Partners Complete Acquisition of Open Solutions Inc.; Open Solutions Stockholders Receive $38.00 Per Share | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/2007-011-carlyle-group-and-providence-equity-partners-complete",
    "snippet": "The principals of Providence Equity manage funds with over $20 billion in equity commitments and have invested in more than 100 companies operating in over 20 countries since the firm&#x27;s inception in 1990. Significant investments include SunGard Data Systems Inc., Bresnan Broadband Holdings, LLC , Casema N.V., Com Hem Group, Education Management Corporation, eircom Group plc, Kabel Deutschland GmbH, Metro-Goldwyn-Mayer Inc., Grupo Corporativo ONO, PanAmSat Corporation, ProSieben-Sat.1 Media AG, Recoletos Grupo de Comunicaci&#x27; on S.A., VoiceStream Wireless Corp., Warner Music Group Corp., Western Wireless Corporation and TDC A/S.",
    "published": null
  },
  {
    "title": "Open Solutions Stockholders Approve Proposed Acquisition of the Company by The Carlyle Group and Providence Equity Partners | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/open-solutions-stockholders-approve-proposed-acquisition-company",
    "snippet": "The principals of Providence Equity manage funds with over $20 billion in equity commitments and have invested in more than 100 companies operating in over 20 countries since the firm&#x27;s inception in 1990. Significant investments include SunGard Data Systems Inc., Bresnan Broadband Holdings, LLC , Casema N.V., Com Hem Group, Education Management Corporation, eircom Group plc, Kabel Deutschland GmbH, Metro-Goldwyn-Mayer Inc., Grupo Corporativo ONO, PanAmSat Corporation, ProSieben-Sat.1 Media AG, Recoletos Grupo de Comunicaci&#x27; on S.A., VoiceStream Wireless Corp., Warner Music Group Corp., Western Wireless Corporation and TDC A/S.",
    "published": null
  }
]