[
  {
    "title": "Alphabet Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
    "snippet": "At the same time, it was announced that Google would be reorganized as a limited liability company, Google LLC. <strong>Eric Schmidt</strong> said at an Internet Association event in 2015 that there may eventually be more than 26 Alphabet subsidiaries. He also said that he was currently meeting with the CEOs ...",
    "published": "1 week ago"
  },
  {
    "title": "Who Currently Owns Alphabet? A Deep Dive Investigation",
    "url": "https://surgegraph.io/business/who-currently-owns-alphabet",
    "snippet": "For example, <strong>Larry Page and Sergey Brin</strong>, the co-founders of Google now known as Alphabet, control enormous shares, a function of their creation of the company and ongoing control.",
    "published": null
  },
  {
    "title": "Alphabet Investor Relations - Home",
    "url": "https://abc.xyz/",
    "snippet": "As Sergey and I wrote in the original founders letter 11 years ago, “Google is not a conventional company. We do not intend to become one” · As part of that, we also said that you could expect us to make “smaller bets in areas that might seem very speculative or even strange when compared ...",
    "published": null
  },
  {
    "title": "Top Alphabet (Google) Shareholders",
    "url": "https://www.investopedia.com/articles/markets/011516/top-5-google-shareholders-goog.asp",
    "snippet": "Class C shares (GOOG) are held by investors and company employees. These shares do not offer investors any voting rights. Alphabet is a holding company. It owns the popular search engine Google. As a public company, it must disclose financial details, including quarterly and annual earnings, as well as beneficial ownership.",
    "published": "July 10, 2024"
  },
  {
    "title": "Alphabet Inc.: Shareholders Board Members Managers and Company Profile | US02079K3059 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/ALPHABET-INC-24203373/company/",
    "snippet": "Alphabet Inc. is a holding company organized around 6 areas of activities: - operation of a web-based search engine (Google).",
    "published": null
  }
]