[
  {
    "title": "Real Madrid firing Alonso would be easy. Replacing him? Much harder - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/47312994/real-madrid-firing-alonso-easy-replacing-much-harder",
    "snippet": "Alonso has been learning this in-post, and it has been brutal. The evidence is there: <strong>Rafa Benítez</strong> and Julen Lopetegui are two coaches renowned for their interventionist, infinite-detail, micromanaging tactical approach.",
    "published": "1 week ago"
  },
  {
    "title": "List of Real Madrid CF managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Real_Madrid_CF_managers",
    "snippet": "The most successful coach with Real Madrid is <strong>Carlo Ancelotti</strong>, as won 15 titles with the team.",
    "published": "September 27, 2025"
  },
  {
    "title": "Xabi Alonso Discovering Real Madrid Is the Impossible Job for All But Two People",
    "url": "https://www.si.com/soccer/xabi-alonso-real-madrid-impossible-job-two-people",
    "snippet": "In their most recent spells in charge, Zidane oversaw 114 games and Ancelotti 234. That hints at patience. Between Zidane’s two stretches, Julen Lopetegui lasted 14 games and <strong>Santiago Solari</strong> 32.",
    "published": "2 weeks ago"
  },
  {
    "title": "Next Real Madrid manager: Jurgen Klopp, Zinedine Zidane & the seven candidates to replace doomed Xabi Alonso after Man City humbling | Goal.com India",
    "url": "https://www.goal.com/en-in/lists/next-real-madrid-manager-candidates-replace-xabi-alonso/blt3905b704d8cc77a4",
    "snippet": "The Yellow Submarine have really struggled in Europe&#x27;s elite competition, which would be a concern for Madrid if they do seriously consider Marcelino, but only Alonso, <strong>Hansi Flick, Diego Simeone and Manuel Pellegrini</strong> have stronger CVs among ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Real Madrid Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=2165&teamTabs=managers",
    "snippet": "Real Madrid Football Club Managers, full history, past and present. Provided courtesy of Soccerbase.com, the Football Betting Site.",
    "published": null
  }
]