[
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "Lecornu was appointed Prime Minister on 9 September 2025 by President Emmanuel Macron. He succeeded <strong>François Bayrou</strong>, who was forced to resign on the same day following the failure of a vote of confidence in the National Assembly the day before. Shortly after his appointment, Le Figaro and ...",
    "published": "1 week ago"
  },
  {
    "title": "Opinion | France Needs a New France - The New York Times",
    "url": "https://www.nytimes.com/2025/12/22/opinion/france-macron-sixth-republic.html",
    "snippet": "Designed for <strong>Charles de Gaulle</strong> in 1958, in the midst of the Algerian War, it broke with previous parliamentary setups to endow presidents with stunning constitutional prerogatives: the ability to dissolve the National Assembly, the authority ...",
    "published": "20 hours ago"
  },
  {
    "title": "Lecornu lives to fight another day, but the outlook for France remains bleak – POLITICO",
    "url": "https://www.politico.eu/article/sebastien-lecornu-france-budget/",
    "snippet": "While Prime Minister Sébastien Lecornu was working toward a deal with the Socialists in his country’s fractured National Assembly, the 34 centrist lawmakers of Philippe’s Horizons party unceremoniously announced they would abstain or oppose the government in a key vote on the social security budget set to be held Tuesday evening.",
    "published": "2 weeks ago"
  },
  {
    "title": "Macron names ally Sébastien Lecornu as new French PM",
    "url": "https://www.bbc.com/news/articles/crmenp1k0mjo",
    "snippet": "President Emmanuel Macron has named close ally Sébastien Lecornu as the new French prime minister, 24 hours after a vote of confidence ousted <strong>François Bayrou</strong> as head of government.",
    "published": "September 9, 2025"
  },
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "The current prime minister of France is Sébastien Lecornu who was appointed on 9 September 2025 and resigned on 6 October 2025, but was re-appointed on 10 October.",
    "published": "1 week ago"
  }
]