[
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "He was in office as a <strong>caretaker prime minister</strong> until he was reappointed by President Macron on 10 October 2025. Lecornu was born on 11 June 1986 in Eaubonne, Val-d&#x27;Oise Department, to Jean-Pierre Lecornu, an aeronautical technician at the Safran Aircraft Engines factory in Vernon, and Martine ...",
    "published": "18 hours ago"
  },
  {
    "title": "France's Macron tasks his outgoing PM with holding last-ditch talks to end crisis | Reuters",
    "url": "https://www.reuters.com/world/europe/french-socialist-leader-will-vote-against-pm-lecornu-things-stand-2025-10-06/",
    "snippet": "&quot;The president has entrusted Mr Sebastien Lecornu, the <strong>outgoing Prime Minister</strong> in charge of day-to-day affairs, with the responsibility of conducting final negotiations by Wednesday evening to define a platform for action and stability for the ...",
    "published": "October 7, 2025"
  },
  {
    "title": "French Prime Minister Sébastien Lecornu Resigns - The New York Times",
    "url": "https://www.nytimes.com/2025/10/06/world/europe/france-lecornu-resigns-macron.html",
    "snippet": "Sébastien Lecornu resigned as France’s prime minister after serving for less than a month, the shortest tenure in the history of the Fifth Republic. The resignation also came amid growing concern that he would not be able to get a budget passed.CreditCredit...Pool photo by Alain Jocard ... Oct. 6, 2025",
    "published": "October 6, 2025"
  },
  {
    "title": "Sébastien Lecornu steps down after 27 days in office",
    "url": "https://www.eunews.it/en/2025/10/06/sebastien-lecornu-steps-down-as-frances-shortest-serving-prime-minister-in-history/",
    "snippet": "Outgoing French Prime Minister Sebastien Lecornu, who <strong>submitted his government&#x27;s resignation to the French President this morning, reacts after delivering a statement at the Hotel Matignon in Paris, on October 6, 2025. France&#x27;s President Emmanuel Macron on October 6, 2025 accepted Prime Minister</strong> ...",
    "published": "October 6, 2025"
  },
  {
    "title": "French Prime Minister Sébastien Lecornu resigns after less than a month",
    "url": "https://www.bbc.com/news/articles/cewn9k0w9rxo",
    "snippet": "Lecornu&#x27;s shock resignation on Monday morning came the day after he unveiled his cabinet, and made him the <strong>third French PM to leave office since last December</strong>. His ministerial line-up had been fiercely criticised across the board by parties ...",
    "published": "October 6, 2025"
  }
]