[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "Boeing discontinued several popular product lines including the DHC-6 Twin Otter and the DHC-7 Dash 7, before putting the company up for sale. <strong>DHC was eventually acquired by Montreal-based Bombardier Aerospace in 1992</strong> and incorporated into the Bombardier group of companies.",
    "published": "1 month ago"
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "<strong>In 1992, it was acquired by Bombardier Aerospace after Boeing declared losses of $636 million over five years</strong>. In later years, various aircraft programs and type certificates were acquired by other companies.",
    "published": "February 21, 2024"
  },
  {
    "title": "1/31/1986: Boeing Finalizes Purchase of De Havilland Canada",
    "url": "https://www.airwaysmag.com/legacy-posts/boeing-purchase-de-havilland",
    "snippet": "DALLAS — Today, <strong>in 1986, the Boeing Company completed the purchase of Canadian aircraft manufacturer De Havilland Canada (DHC).</strong> The Canadian manufacturer was established in 1928 as a subsidiary of the then-eight-year-old British manufacturer ...",
    "published": null
  },
  {
    "title": "de Havilland Canada (1928–1986) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada_(1928%E2%80%931986)",
    "snippet": "Bombardier also had the option ... and was eventually succeeded by Boeing Canada in 2005. <strong>In 1997, Bombardier acquired the 49% stake owned by the Government of Ontario, and in 1998, the new de Havilland Inc.</strong>...",
    "published": "November 1, 2025"
  },
  {
    "title": "Bombardier Aviation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bombardier_Aviation",
    "snippet": "<strong>The Q400 deal closed on 3 June 2019</strong>; the new holding company, De Havilland Aircraft of Canada Limited, inherited an order book of 51 Q400s. Also in late 2018, Bombardier sold its business jet training program to CAE Inc.",
    "published": "October 31, 2025"
  }
]