[
  {
    "title": "David Hurley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley",
    "snippet": "Hurley retired from the army in June 2014 and succeeded Marie Bashir as <strong>governor of New South Wales</strong> in October 2014 on the nomination of Premier Mike Baird. His term concluded in May 2019 and he was subsequently appointed by Queen Elizabeth II as governor-general on the nomination of Prime ...",
    "published": "October 31, 2025"
  },
  {
    "title": "David Hurley facts for kids",
    "url": "https://kids.kiddle.co/David_Hurley",
    "snippet": "He took on new important roles like <strong>Chief of Capability Development Group and Chief of Joint Operations</strong>. In July 2008, he became Vice Chief of the Defence Force. On 4 July 2011, David Hurley was promoted to general.",
    "published": null
  },
  {
    "title": "David Hurley - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/David_Hurley",
    "snippet": "He served as the <strong>Chief of Capability Development Group (2003–2007), the Chief of Joint Operations (2007–2008).</strong> He later served as the AF&#x27;s Vice Chief (2008–2011), and as Chief (2011–2014), in succession to Air Chief Marshal Angus Houston.",
    "published": "May 3, 2025"
  },
  {
    "title": "David Hurley | Military Wiki | Fandom",
    "url": "https://military-history.fandom.com/wiki/David_Hurley",
    "snippet": "His initial posting was to the 1st Battalion, Royal Australian Regiment (1RAR). Promoted to captain, he was appointed Adjutant of the Sydney University Regiment before becoming <strong>Regimental Adjutant of the Royal Australian Regiment</strong>.",
    "published": null
  },
  {
    "title": "David Hurley (footballer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley_(footballer)",
    "snippet": "David Hurley (born 21 October 1998) is an Irish professional footballer who plays as a midfielder for League of Ireland Premier Division club Galway United. He previously played for <strong>Cobh Ramblers</strong>. Cork native Hurley began playing schoolboy football with local club Tramore Athletic, before moving ...",
    "published": "1 month ago"
  }
]