[
  {
    "title": "Ukraine PM Denys Shmyhal resigns as Zelensky backs Yulia Svyrydenko as successor",
    "url": "https://www.moneycontrol.com/world/ukraine-pm-denys-shmyhal-resigns-as-zelensky-backs-yulia-svyrydenko-as-successor-article-13281661.html/amp",
    "snippet": "<strong>Ukrainian Prime Minister Denys Shmyhal handed in his resignation on Tuesday after the country&#x27;s President Volodymyr Zelensky decided to nominate First Deputy Prime Minister Yuliia Svyrydenko to succeed him in the role.</strong>",
    "published": "July 15, 2025"
  },
  {
    "title": "Ukraine's new PM takes charge of narrower cabinet of Zelensky loyalists",
    "url": "https://www.lemonde.fr/en/international/article/2025/07/17/ukraine-s-new-pm-takes-charge-of-narrower-cabinet-of-zelensky-loyalists_6743455_4.html",
    "snippet": "<strong>Yulia Svyrydenko, 39, who succeeds Denys Shmyhal and previously served as economy minister</strong>, is well regarded by the US administration, with whom she negotiated the critical minerals agreement.",
    "published": "July 17, 2025"
  },
  {
    "title": "Ukraine government reshuffle: PM Shmyhal resigns; economy minister named Svyrydenko successor - Times of India",
    "url": "https://timesofindia.indiatimes.com/world/europe/ukraine-government-reshuffle-pm-shmyhal-resigns-economy-minister-named-svyrydenko-successor/articleshow/122512867.cms",
    "snippet": "Ukraine&#x27;s Prime Minister Denys ... and defence minister for his country. <strong>Zelenskyy appointed Economy Minister Yulia Svyrydenko as the successor to Prime Minister Denys Shmygal</strong>, who will now lead the defence minis...",
    "published": "July 15, 2025"
  },
  {
    "title": "‘Yulia’s not in it for the money’ Who is Ukraine’s new prime minister? And how was she appointed despite the wartime ban on cabinet dismissals? — Meduza",
    "url": "https://meduza.io/en/feature/2025/07/21/yulia-s-not-in-it-for-the-money",
    "snippet": "Under Ukraine’s martial law, ... for this shakeup. Under the arrangement, Denys Shmyhal is moving into the role of <strong>defense minister</strong>, vacating the prime minister’s post for his first deputy....",
    "published": "July 21, 2025"
  },
  {
    "title": "Ukrainian PM Resigns Amid Major Government Reshuffle",
    "url": "https://www.rferl.org/a/ukraine-politics-shuffle-prime-minister-shmyhal-svyrydenko/33474906.html",
    "snippet": "<strong>Yulia Svyrydenko, currently the first deputy prime minister, is expected to take over from Denys Shmyhal</strong>, who tendered his resignation as prime minister on July 15, 2025 as part of a major government reshuffle.",
    "published": "July 16, 2025"
  }
]