[
  {
    "title": "Tiger Aspect - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tiger_Aspect",
    "snippet": "The present-day company was founded in 1993 from the merger of <strong>Bennett-Jones&#x27; Tiger Television and Paul Sommers&#x27; Aspect Film &amp; Television</strong>. It has also produced television dramas such as Murphy&#x27;s Law and Sherlock Holmes and the Case of the Silk Stocking, and in October 2006, its drama series ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Tiger Aspect Productions - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Tiger_Aspect_Productions",
    "snippet": "Tiger Aspect Productions is a British film and television production company of Peter Bennett-Jones, founded in 1993 from the merger between Tiger Television and Aspect Film &amp; Television. In June 2006, the company was purchased by <strong>IMG Media</strong>, but ...",
    "published": "November 12, 2025"
  },
  {
    "title": "Tiger Aspect Productions - BlackBook Companies - BCG Pro",
    "url": "https://www.comedy.co.uk/pro/blackbook/companies/tiger_aspect_productions/",
    "snippet": "Originally known as Tiger Television, Tiger Aspect is one of the UK&#x27;s most successful production companies, prolific across a broad range of programme genres. Originally an independent company, Tiger Aspect was bought by <strong>IMG Media</strong> in 2006 and ...",
    "published": null
  },
  {
    "title": "Tiger Aspect - Banijay",
    "url": "https://www.banijay.com/company/tiger-aspect/",
    "snippet": "Tiger Aspect Productions is internationally recognised as one of the UK’s most successful and prolific independent television producers. The company portfolio includes Children’s/Animation, Comedy, Drama, Entertainment and Factual/Features genres. The company creates a wide range of critically ...",
    "published": "April 20, 2021"
  },
  {
    "title": "Tiger Aspect Kids & Family - Banijay Kids",
    "url": "https://www.banijaykidsandfamily.com/companies/tiger-aspect-kids-and-family/",
    "snippet": "<strong>Banijay Kids and Family</strong>, the dedicated production, distribution and sales division for children’s programming at Banijay. Under the leadership of MD Tom Beattie, the multi-BAFTA-winning Tiger Aspect Kids &amp; Family, creates bold, funny and iconic ...",
    "published": "September 9, 2024"
  }
]