[
  {
    "title": "Meet Sarah Robarts, La PR Boss and Sebastian Coe New Girlfriend - 44Bars.com",
    "url": "https://44bars.com/meet-sarah-robarts-la-pr-boss-and-sebastian-coe-new-girlfriend/",
    "snippet": "However, the 65-year-old double Olympic gold medalist is back on track in his love life as he flaunts his new lover. Coe is <strong>happily married</strong> to Sarah Robarts, a 52-year-old public relations executive in Los Angeles.",
    "published": "March 14, 2022"
  },
  {
    "title": "Meet Sarah Robarts, La PR Boss and Sebastian Coe New Girlfriend | TG Time - Sleek Gist",
    "url": "https://sleekgist.com/meet-sarah-robarts-la-pr-boss-and-sebastian-coe-new-girlfriend-tg-time/",
    "snippet": "Nonetheless, the 65-year-old twofold Olympic gold medalist is in the groove again in his adoration life as he parades his new sweetheart. <strong>Coe is cheerfully hitched to Sarah Robarts</strong>, a 52-year-old advertising chief in Los Angeles.",
    "published": "February 20, 2022"
  },
  {
    "title": "Sarah Robarts Wiki, Biography, Age, Spouse, Net Worth, Fast Facts Wikibious",
    "url": "https://wikibious.com/sarah-robarts/",
    "snippet": "However, the 65-year-old two-time Olympic gold medalist is in the groove again in his love life as he parades his new girlfriend. Coe is <strong>happily married</strong> to Sarah Robarts, a 52-year-old advertising chief from Los Angeles.",
    "published": "May 19, 2023"
  },
  {
    "title": "Olympic legend unveils romance to Lionel Richie’s ex-wife whose divorce cost singer £15m",
    "url": "https://www.gbnews.com/sport/olympics/olympic-legend-unveils-romance-lionel-richies-ex-wife",
    "snippet": "<strong>The pair are now understood to remain friends</strong>. The couple were introduced through mutual friends and have been seeing each other for several months, according to reports. Sebastian Coe claimed 1500m gold at both the 1980 Moscow and 1984 Los ...",
    "published": "1 week ago"
  },
  {
    "title": "Get set, go! Double Olympic gold winner Sebastian Coe, 65, steps out with new love, 52 | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/tvshowbiz/article-10531723/Get-set-Double-Olympic-gold-winner-Sebastian-Coe-65-steps-new-love-52.html",
    "snippet": "But the double Olympic gold winner, 65, is clearly back on track with his love life as he shows off his new girlfriend. <strong>Coe has found happiness with Los Angeles PR boss Sarah Robarts, 52.</strong>",
    "published": "February 20, 2022"
  }
]