[
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: ... political party in Russia founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018 by <strong>Alexei Navalny</strong>, who was also the founder of the non-profit organisation Anti-Corruption Foundation....",
    "published": "1 month ago"
  },
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Navalny declared merging parties would invoke bureaucratic difficulties and question the legitimacy of party&#x27;s right to participate in federal elections without signatures collecting. However, Nemtsov&#x27;s murder accelerated the work, and on 17 April, Navalny declared a wide discussion had taken place among Progress Party, RPR-PARNAS, and other closely aligned parties, which resulted in an agreement of formation of a new electoral bloc between the two leaders.",
    "published": "1 week ago"
  },
  {
    "title": "Russian Opposition Leader Navalny To Create New Party",
    "url": "https://www.rferl.org/a/russia-navalny-to-create-new-political-party/29142446.html",
    "snippet": "The Justice Ministry said last month that Navalny&#x27;s former supporter, <strong>Vitaly Serukanov</strong>, had registered a new party, called Party of Progress.",
    "published": "April 4, 2018"
  },
  {
    "title": "The opposition man captivating Russia's youth",
    "url": "https://www.dw.com/en/alexei-navalny-the-opposition-leader-captivating-russias-youth/a-42359515",
    "snippet": "Many people see this as a disadvantage, for he has not yet been able to reach the broad public. Navalny also does not have a strong party behind him. His Party of Progress, <strong>founded in 2012</strong>, was not even registered by Russian authorities.",
    "published": "January 30, 2018"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "In the November 2016 legislative election, United Russia claimed victory, but election observers again documented numerous irregularities, including instances of ballot stuffing and repeat voting. Navalny’s Progress Party was barred from contesting the election after the Russian justice ministry ...",
    "published": "March 7, 2023"
  }
]