[
  {
    "title": "Apple announces executive transitions - Apple",
    "url": "https://www.apple.com/newsroom/2025/12/apple-announces-executive-transitions/",
    "snippet": "December 4, 2025 · PRESS RELEASE · Apple announces executive transitions · <strong>Jennifer Newstead</strong> to join Apple as senior vice president, will become general counsel in March 2026 Kate Adams to retire late next year Lisa Jackson to retire ·",
    "published": "4 days ago"
  },
  {
    "title": "Apple won’t be the same in 2026 as these rising stars follow its biggest executive exodus in years | Fortune",
    "url": "https://fortune.com/2025/12/08/apple-executive-exodus-2026-new-leadership-team-rising-stars-tim-cook-successor/",
    "snippet": "Her experience in government affairs at Meta, where she managed relations with policymakers globally, makes her well-suited to handle Apple’s expanding regulatory obligations. <strong>Kevan Parekh</strong> assumed the chief financial officer role on Jan. 1, ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Apple's executive shake-up continues with departures of general counsel and policy head | TechCrunch",
    "url": "https://techcrunch.com/2025/12/04/apples-executive-shakeup-continues-with-departures-of-general-counsel-and-policy-head/",
    "snippet": "Before Giannandrea’s exit, Apple had replaced him as head of the Siri team with Mike Rockwell, who had been VP of the Vision Products Group. The company also lost Ke Yang, the executive leading Apple’s work on AI-driven web search, to Meta; and it saw the departure of Ruoming Pang, Apple’s former head of AI models, who left for Meta earlier this year.",
    "published": "3 weeks ago"
  },
  {
    "title": "Apple C-Suite Executive Leadership Team [2025] - DigitalDefynd",
    "url": "https://digitaldefynd.com/IQ/c-suite-team-of-apple/",
    "snippet": "As of 2025, Apple is not only a leader in consumer electronics but also a dominant force in services, chips, AI, wearables, and sustainability. At the helm of Apple’s success is a meticulously structured executive leadership team led by CEO Tim Cook, whose operational excellence has helped Apple achieve record-breaking revenue and margin expansion, even in a challenging macroeconomic environment.",
    "published": "June 9, 2025"
  },
  {
    "title": "Apple is experiencing its biggest leadership shake-up since Steve Jobs died, with over half a dozen key executives headed for the exits | Fortune",
    "url": "https://fortune.com/2025/12/05/apple-executive-leadership-exodus-biggest-shakeup-since-steve-jobs-death/",
    "snippet": "Adams has been Apple’s chief legal officer since 2017, and Jackson joined Apple in 2013. Adams will step down late next year, while Jackson will leave next month. Jackson and Adams join a growing list of top executives who have either left or announced their exits this year.",
    "published": "2 weeks ago"
  }
]