[
  {
    "title": "Carlo Ancelotti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Carlo_Ancelotti",
    "snippet": "<strong>He was replaced by former player Xabi Alonso, whom he had managed at Madrid and Bayern Munich</strong>. On 12 May 2025, the Brazilian Football Confederation appointed Ancelotti as the new manager of the Brazil national team. Ancelotti is to receive a salary of 10 million euros and a 5 million euro bonus ...",
    "published": "1 week ago"
  },
  {
    "title": "List of Real Madrid CF managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Real_Madrid_CF_managers",
    "snippet": "The most successful coach with Real Madrid is Carlo Ancelotti, as <strong>won 15 titles with the team</strong>.",
    "published": "September 27, 2025"
  },
  {
    "title": "What we’re hearing about Carlo Ancelotti’s Real Madrid future and Xabi Alonso interest - The Athletic",
    "url": "https://www.nytimes.com/athletic/6181232/2025/03/07/carlo-ancelotti-xabi-alonso-real-madrid/",
    "snippet": "<strong>He has led Madrid to 10 titles, including two Champions Leagues</strong>, since his return for a second spell in charge in 2021 and is the coach with the most trophies (15) in the club’s history.",
    "published": "March 25, 2025"
  },
  {
    "title": "Real Madrid name Xabi Alonso as Carlo Ancelotti's successor - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/44929786/real-madrid-name-xabi-alonso-carlo-ancelotti-successor",
    "snippet": "<strong>After retiring as a player in 2017, he began coaching at Madrid&#x27;s academy, and then took a job with hometown club Real Sociedad&#x27;s B-team, before joining Leverkusen</strong>. ... Alonso will be tasked with rebuilding a Madrid team packed with star players ...",
    "published": "May 25, 2025"
  },
  {
    "title": "Real Madrid's most successful manager - Carlo Ancelotti confirmed as next Brazil head coach",
    "url": "https://www.transfermarkt.us/real-madrids-most-successful-manager-carlo-ancelotti-confirmed-as-next-brazil-head-coach/view/news/453180",
    "snippet": "Alonso previously played 236 games for Madrid before hanging up his boots and he has been entrusted with taking Madrid into a new era. To date, <strong>Ancelotti has managed Madrid in 348 games across two spells at the Santiago Bernabeu</strong>.",
    "published": "May 13, 2025"
  }
]