[
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "<strong>Teaching the Value of Science and Advancing Secularism</strong> Founded in 2006 by Richard Dawkins, the foundation’s mission is to realize Richard’s vision to remove ...",
    "published": "July 17, 2025"
  },
  {
    "title": "Homepage | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/home/",
    "snippet": "The Richard Dawkins Foundation for Reason &amp; Science’s mission is <strong>to promote scientific literacy and a secular worldview</strong>. For some, the connection is not obvious; they may seem like different objectives at first glance, but if you’ve ever doubted just how inextricably linked they are, all you …",
    "published": "November 8, 2023"
  },
  {
    "title": "Aug 16, 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/2025/",
    "snippet": "From the Richard Dawkins Foundation Newsletter. Subscribe here. Hello! As you know, <strong>2025 marks the 100th anniversary of the Scopes Monkey Trial</strong>. It’s also the twenty-year anniversary of the landmark Kitzmiller v. Dover trial.",
    "published": null
  },
  {
    "title": "Richard Dawkins Foundation for Reason and Science - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins_Foundation_for_Reason_and_Science",
    "snippet": "The Richard Dawkins Foundation for Reason and Science (RDFRS or RDF) is <strong>a division of Center for Inquiry (CFI) founded by British biologist Richard Dawkins in 2006 to promote scientific literacy and secularism</strong>.",
    "published": "September 22, 2025"
  },
  {
    "title": "Richard Dawkins Foundation for Reason & Science | Facebook",
    "url": "https://www.facebook.com/RichardDawkinsFoundation/",
    "snippet": "Richard Dawkins Foundation for Reason &amp; Science. 1,289,364 likes · 1,162 talking about this. The mission of the Richard Dawkins Foundation is <strong>to promote scientific literacy and a secular worldview</strong>.",
    "published": null
  }
]