[
  {
    "title": "TF1 Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1_Group",
    "snippet": "The group was formed after TF1 was privatized in April 1987 in which the channel was launched back on 6 January 1975 twelve years prior. It is controlled with a <strong>43% stake by industrial group Bouygues</strong>, and is quoted on Euronext Paris. The history of TF1 traces back to 1975, when the Office de ...",
    "published": "2 weeks ago"
  },
  {
    "title": "TF1 Group",
    "url": "https://corporate-executives.com/companies/tf1-group/",
    "snippet": "<strong>Founded in 1975 by the French Government and privatized in 1987</strong>, the TF1 group is the owner of TF1, Europe’s largest private TV channel. ... TF1 (La Une) was originally established under government ownership in 1947.",
    "published": "October 14, 2020"
  },
  {
    "title": "TF1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1",
    "snippet": "<strong>On 16 April, its president, Francis Bouygues, presented a check of three billion francs to the government, completing the privatisation of TF1.</strong> TF1&#x27;s current logo was unveiled on February 2nd, 1990. It launched a news network, La Chaîne Info (LCI), in 1994. The channel was available in Italy ...",
    "published": "1 week ago"
  },
  {
    "title": "Télévision Française 1 (TFIPA): history, ownership, mission, how it works & makes money – DCFmodeling.com",
    "url": "https://dcfmodeling.com/blogs/history/tfipa-history-mission-ownership",
    "snippet": "By the 1990s, TF1 had established itself as a leading television network in France, boasting an average audience share of approximately 30% during prime time. <strong>In 2000, the Bouygues Group acquired a majority stake in TF1</strong>, further solidifying ...",
    "published": "February 21, 2025"
  },
  {
    "title": "TF1 Group",
    "url": "https://grokipedia.com/page/TF1_Group",
    "snippet": "TF1 Group (French: Groupe TF1) ... channel by audience share.[1][2] The group <strong>originated from the privatization of the state-owned TF1 channel in 1987 under the Chirac government</strong>, transitioning from public to private ownership ...",
    "published": null
  }
]