[
  {
    "title": "Al-Shabab Club Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al-Shabab_Club_Stadium",
    "snippet": "<strong>Al-Shabab Club Stadium</strong> (Arabic: ملعب نادي الشباب) branded as SHG Arena for sponsorship reasons is a football stadium in Riyadh, Saudi Arabia. It is the home ground of Al-Shabab Club. The stadium was built and opened in 1984, and was mostly used by Al-Shabab as a training ground ...",
    "published": "1 week ago"
  },
  {
    "title": "Al-Shabab Club Stadium | Saudi Arabia ABC",
    "url": "https://www.saudiarabiaabc.com/place/al-shabab-club-stadium?category=sports_stadiums",
    "snippet": "Al-Shabab Club Stadium, formerly known as <strong>Prince Khalid bin Sultan Stadium</strong>, is a multi-purpose stadium in Riyadh, Saudi Arabia.",
    "published": null
  },
  {
    "title": "Al-Shabab FC - Stadium - SHG Arena | Transfermarkt",
    "url": "https://www.transfermarkt.com/al-shabab-riad/stadion/verein/9840",
    "snippet": "Al-Shabab FC U19 · This page provides you with information about the stadium of the selected club. In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights. The drop-down menu above the basic facts allows you to look at former stadiums (clubs) or other home grounds (national teams).",
    "published": null
  },
  {
    "title": "Al Shabab Club - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al_Shabab_Club",
    "snippet": "Al-Shabab Saudi Football Club also known as Al-Shabab (Arabic: نادي الشباب لكرة القدم, romanized: nādī al-shabaab li-kurat al-qadam, lit. &#x27;The Youth Football Club&#x27;) is a Saudi Arabian professional football club based in Riyadh that competes in the Saudi Pro League.",
    "published": "2 days ago"
  },
  {
    "title": "Al-Shabab Club Stadium – StadiumDB.com",
    "url": "https://stadiumdb.com/stadiums/ksa/al_shabab_club_stadium",
    "snippet": "Stadium: <strong>Al-Shabab Club Stadium, Riyadh, Saudi Arabia</strong>, capacity: 15000, club: Al-Shabab FC.",
    "published": null
  }
]