[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "It sponsors nine annual symposia and holds a triannual General Assembly that sets policy and includes various scientific meetings. The Union is best known for being the leading authority in assigning official names and designations to astronomical objects, and for setting uniform definitions for astronomical principles.",
    "published": "3 weeks ago"
  },
  {
    "title": "International Astronomical Union",
    "url": "https://www.iau.org/",
    "snippet": "Don&#x27;t miss the dedicated panel discussion &quot;Science in Action: Grassroots Pathways to Development&quot; on 10 November! Read more ... <strong>Anne Thieme</strong> joins the IAU Secretariat as Membership Coordinator in November 2025. Read more · Become a part of the largest international union of professional ...",
    "published": null
  },
  {
    "title": "U.S. National Committee for the International Astronomical Union (IAU)",
    "url": "https://www.nationalacademies.org/units/PGA-BISO-18-P-52",
    "snippet": "This U.S. National Committee represents the International Astronomical Union (IAU) at the national level.",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://iauarchive.eso.org/",
    "snippet": "A key UN body on which IAU and SKAO are represented included on its agenda discussions of the impact of satellite constellations on astronomy for the first time ... The IAU will change its digital interface in 2025.",
    "published": null
  },
  {
    "title": "ICHA business meeting, 1 July 2025",
    "url": "http://www.mail-archive.com/sundial@uni-koeln.de/msg21494.html",
    "snippet": "Details are here: https://www.ichst2025.org/ Sincerely, <strong>Sara Schechner</strong> [email protected] President, IAU-IUHPST Inter-Union Commission for History of Astronomy (ICHA) President, IAU Commission C3 (History of Astronomy) --------------------------------------------------- https://lists.uni-ko...",
    "published": null
  }
]