[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "From 2002 to 2004, he <strong>studied engineering at the École Polytechnique de Montréal, affiliated with Université de Montréal, but did not graduate</strong>. He started a master&#x27;s degree in environmental geography at McGill but withdrew from the program to seek public office.",
    "published": "4 days ago"
  },
  {
    "title": "Justin Trudeau educational qualifications: From Literature Buff to Canada’s PM - Times of India",
    "url": "https://timesofindia.indiatimes.com/education/news/justin-trudeau-educational-qualifications-from-literature-buff-to-canadas-pm/articleshow/117020437.cms",
    "snippet": "Justin Trudeau’s educational ... Minister of Canada. With a <strong>Bachelor of Arts in English Literature from McGill University and a Bachelor of Education from the University of British Columbia</strong>, Trudeau’s academic path ...",
    "published": "January 7, 2025"
  },
  {
    "title": "Justin Trudeau - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Trudeau earned a <strong>Bachelor of Arts degree in literature from McGill University and a Bachelor of Education degree from the University of British Columbia</strong>. After he graduated, Trudeau worked as a social studies, drama, math and French elementary and high school teacher.",
    "published": "November 4, 2025"
  },
  {
    "title": "Justin Trudeau’s Education and Political Journey: From Bachelor’s in English Literature to Canada’s Leadership | Education - Times Now",
    "url": "https://www.timesnownews.com/education/justin-trudeaus-education-and-political-journey-from-bachelors-in-english-literature-to-canadas-leadership-article-117038766",
    "snippet": "However, Justin didn’t immediately follow in his father’s footsteps. Instead, he pursued his own academic interests, <strong>first earning a Bachelor of Arts in English Literature from McGill University in 1994</strong>.",
    "published": "January 8, 2025"
  },
  {
    "title": "Justin Trudeau | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/justin-trudeau",
    "snippet": "Justin Pierre James Trudeau, 23rd prime minister of Canada, 2015–25, leader of the Liberal Party of Canada, educator, public policy advocate (born 25 December...",
    "published": null
  }
]