[
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "Under Kast’s leadership, “we are confident Chile will advance shared priorities to include <strong>strengthening public security, ending illegal immigration, and revitalising our commercial relationship</strong>,” Rubio said in a statement.",
    "published": "13 hours ago"
  },
  {
    "title": "Conservative José Kast wins Chile presidency with 58% on security platform | Fox News",
    "url": "https://www.foxnews.com/world/trump-style-law-and-order-conservative-clinches-chiles-presidency-violent-crime-crisis-reshapes-nation",
    "snippet": "José Antonio Kast wins Chile&#x27;s presidency with 58% of the vote on a hard-right platform promising <strong>mass deportations, expanded policing and military deployment against crime</strong>.",
    "published": "1 day ago"
  },
  {
    "title": "Kast’s Victory in Chile Is Another Win for Global Right-Wing Movement - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/americas/chile-kast-right-wing-movement.html",
    "snippet": "Kast was elected as Chile’s president on his third try, scoring a resounding victory against his leftist opponent and <strong>pushing the country decidedly to the right as Chileans sought iron-fisted solutions to increased violence and illegal immigration</strong>.",
    "published": "19 hours ago"
  },
  {
    "title": "REACTION: What José Antonio Kast's Victory Means for Chile",
    "url": "https://www.americasquarterly.org/article/reaction-what-jose-antonio-kasts-victory-means-for-chile/",
    "snippet": "With a call to demonstrate civility ... open-market economic model, Kast also <strong>drew a clear contrast with the more protectionist approach of other radical-right governments</strong>....",
    "published": "1 day ago"
  },
  {
    "title": "Chile elects Kast as president in sharp rightward shift | Reuters",
    "url": "https://www.reuters.com/world/americas/chile-votes-presidential-race-expected-lurch-country-right-2025-12-14/",
    "snippet": "SANTIAGO, Dec 14 (Reuters) - Jose ... on Sunday, <strong>leveraging voter fears over rising crime and migration to steer the country in its sharpest rightward shift since the end of the military dictatorship in 1990</strong>....",
    "published": "1 day ago"
  }
]