[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "He was elected CDU leader in December 2021, assuming the office in January 2022. He had failed to win the position in two previous leadership elections in 2018, and January 2021. In September 2024, he became the Union&#x27;s candidate for Chancellor of Germany ahead of the following year&#x27;s federal election. The CDU/CSU won a plurality of the seats and subsequently reached an agreement to form a coalition with the SPD. Merz was elected chancellor on 6 May 2025, taking two rounds to clear, which was a first in German history.",
    "published": "2 days ago"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "Ten people (nine men and one woman) have served as chancellor of the Federal Republic of Germany, the first being Konrad Adenauer from 1949 to 1963. (Another 26 men had served as &quot;Reich chancellors&quot; of the previous German Empire from 1871 to 1945.) The current officeholder is <strong>Friedrich Merz</strong> of the ...",
    "published": "2 weeks ago"
  },
  {
    "title": "2025 German federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_German_federal_election",
    "snippet": "The South Schleswig Voters&#x27; Association ... On 9 April 2025, the CDU/CSU and SPD secured a ruling coalition agreement. The German parliament elected <strong>Friedrich Merz</strong> as chancellor on 6 May 2025....",
    "published": "4 days ago"
  },
  {
    "title": "Friedrich Merz is the next federal chancellor",
    "url": "https://www.deutschland.de/en/topic/politics/friedrich-merz-next-federal-chancellor",
    "snippet": "On 6 May 2025, <strong>Friedrich Merz</strong> was elected chancellor by the German parliament, the Bundestag.",
    "published": "May 6, 2025"
  },
  {
    "title": "Website of the Federal Government | Bundesregierung",
    "url": "https://www.bundesregierung.de/breg-en",
    "snippet": "Ukraine’s fate is Europe’s fate. We’re here to see how we can step up our efforts. No one should have any doubt: our support will not falter. Bundeskanzler <strong>Friedrich Merz</strong>/Federal Chancellor of Germany @Bundeskanzler",
    "published": null
  }
]