[
  {
    "title": "Anke Domscheit-Berg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anke_Domscheit-Berg",
    "snippet": "<strong>Domscheit-Berg will not run again in the 2025 federal election</strong>. Anke Domscheit-Berg is committed to gender equality in all areas of society. In lectures, workshops and publications, she campaigns against sexism, violence against girls and women and unequal treatment in the workplace and politics.",
    "published": "August 13, 2025"
  },
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://grokipedia.com/page/Anke_Domscheit-Berg",
    "snippet": "Following the end of her Bundestag mandate on March 25, 2025, after choosing not to seek re-election following two terms, Anke Domscheit-Berg <strong>returned to freelance work as a publicist specializing in digital policy</strong>.[57] She has expressed intentions ...",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg - Aktivistin, Publizistin, Mitglied des Deutschen Bundestages",
    "url": "https://mdb.anke.domscheit-berg.de/",
    "snippet": "Mitglied des Deutschen Bundestages Oktober 2017 – März 2025 Mein BlogMedienecho ... Highlights aus den aktuellen Presseberichten. ... „Wir haben kein Geldmangelproblem und mehr Geld hilft nicht“, sagt auch Anke Domscheit-Berg, (Linksfraktion). Es brauche eher ein zentralgesteuertes ...",
    "published": "March 24, 2025"
  },
  {
    "title": "Anke Domscheit-Berg - Profil bei abgeordnetenwatch.de",
    "url": "https://www.abgeordnetenwatch.de/profile/anke-domscheit-berg",
    "snippet": "<strong>Anke Domscheit-Berg war Abgeordnete Bundestag 2021 - 2025</strong> (Fraktion: Die Linke. (Gruppe)) - ihre Antworten auf Ihre Fragen, Abstimmungsverhalten und Nebentätigkeiten finden Sie in diesem Profil.",
    "published": null
  },
  {
    "title": "Abschied mit einem Dankeschön für Ehrenamtliche: Meine letzte Besuchergruppe im politischen Berlin - Anke Domscheit-Berg",
    "url": "https://mdb.anke.domscheit-berg.de/2025/01/abschied-mit-einem-dankeschoen-fuer-ehrenamtliche-meine-letzte-besuchergruppe-im-politischen-berlin/",
    "snippet": "Mit der vorgezogenen Neuwahl endet mein Bundestagsmandat früher als erwartet. Da ich nicht erneut für den Bundestag kandidiere, hatte ich am 16. und 17. Januar <strong>2025</strong> zum letzten Mal die Freude, eine Besuchergruppe im Rahmen einer Bundespresseamtsfahrt aus meinem Wahlkreis in Berlin zu empfangen.",
    "published": "January 23, 2025"
  }
]