[
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "Greta Conway Van Susteren (born June 11, 1954) is an American journalist, lawyer, and television news anchor for Newsmax TV. She was previously on CNN, Fox News, and MSNBC. She hosted Fox News&#x27;s On the Record w/ Greta Van Susteren for 14 years (2002–2016) before departing for MSNBC, where she hosted For the Record with Greta for roughly six months in 2017.",
    "published": "August 20, 2025"
  },
  {
    "title": "Greta Van Susteren",
    "url": "https://communicationleadership.usc.edu/greta-van-susteren-3/",
    "snippet": "She was and adjunct professor at Georgetown from 1984-1999 and taught classes in Trial Practice, Advanced Civil Procedure, Evidence, and Media &amp; The Law. She lives in Washington, D.C. with her husband, <strong>John Coale</strong>, and 6 pets. Contact Van Susteren at commlead@usc.edu.",
    "published": null
  },
  {
    "title": "Greta Van Susteren News - UPI.com",
    "url": "https://www.upi.com/topic/Greta_Van_Susteren/",
    "snippet": "Fox News host Greta Van Susteren has left the cable news channel, effective immediately. ... After days of speculation about his future with the network, Fox News Channel chairman and CEO <strong>Roger Ailes</strong> has resigned his position effective immediately.",
    "published": null
  },
  {
    "title": "Greta Van Susteren - News - IMDb",
    "url": "https://m.imdb.com/name/nm1336063/news/",
    "snippet": "Van Susteren’s firm but tough approach with elected and other leaders to bolster the trusted, quality news our viewers already depend upon,” Gray chairman and CEO <strong>Hilton Howell Jr</strong>.",
    "published": null
  },
  {
    "title": "Greta Van Susteren - The New York Times",
    "url": "https://www.nytimes.com/topic/person/greta-van-susteren",
    "snippet": "Lawyers for the ousted <strong>Fox News</strong> chairman say he paid no money in a $20 million sexual harassment settlement with Gretchen Carlson. ... The settlement with the former <strong>Fox News</strong> anchor Gretchen Carlson is another example of the perils of letting ...",
    "published": null
  }
]