[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the secretary of the Democratic Party (PD) since <strong>12 March 2023</strong>. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Elly Schlein: The first woman and LGBTIQ+ leader of Italy’s left | openDemocracy",
    "url": "https://www.opendemocracy.net/en/5050/italy-left-elly-schlein-woman-lgbtiq-democratic-party/",
    "snippet": "<strong>Schlein even quit the party in 2015,</strong> while serving as a member of the European Parliament, when PD leader and then prime minister Matteo Renzi tried to push through economically liberal reforms.",
    "published": "March 9, 2023"
  },
  {
    "title": "Biography - Elly Schlein",
    "url": "https://www.ellyschlein.it/en/biography",
    "snippet": "On <strong>6 May 2015,</strong> after the approval of the “Italicum”, education and school reforms, the Jobs Act, and due to irremediable fractures between Elly’s political views and the policies taken by Renzi’s government, she decides to leave the Democratic Party together with Pippo Civati and many ...",
    "published": "February 16, 2022"
  },
  {
    "title": "Why Elly Schlein is freaking out Italy’s ‘soft’ socialists",
    "url": "https://www.politico.eu/article/elly-schlein-italy-soft-socialist-democratic-party-leader/",
    "snippet": "“My PD is no longer there, this is another party — it no longer belongs to the center left, but to the hard left,” he said. As a youth leader in 2013, Schlein became the figurehead of Occupy PD, a protest movement set up by disaffected progressives angered over 101 center-left parliamentarians who voted against their own social democrat grandee Romano Prodi’s bid to become the president of Italy. “With Elly Schlein, the PD has occupied itself,” quipped Allegranti.",
    "published": "March 2, 2023"
  },
  {
    "title": "Elly Schlein",
    "url": "https://en.wikipedia-on-ipfs.org/wiki/Elly_Schlein",
    "snippet": "In <strong>May 2015,</strong> she announced, through a post on Facebook, that she was leaving the Democratic Party, being in deep disagreement with the new political line of the party impressed by Secretary Matteo Renzi, and joined Possible, the party founded by Giuseppe Civati.[5] In April 2019, Schlein announced ...",
    "published": null
  }
]