[
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "During his tenure, the country retained the economic momentum gained during <strong>Prime Minister Vajpayee&#x27;s</strong> tenure. Apart from this, the government succeeded in getting the National Rural Employment Guarantee Act, 2005, and the Right to Information Act, 2005 passed in the parliament.",
    "published": "2 days ago"
  },
  {
    "title": "Why Nehru became the first Prime Minister of India instead of Patel? | Revisiting India",
    "url": "https://revisitingindia.com/2024/09/06/why-nehru-became-the-first-prime-minister-of-india-instead-of-patel/",
    "snippet": "By Sandeep Bhardwaj One of the pernicious myths of Indian politics that refuses to die is the claim that <strong>Jawaharlal Nehru</strong> somehow “stole” India’s premiership from Vallabhbhai Patel.",
    "published": "September 12, 2024"
  },
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "Earlier, Nehru had served as prime minister of the Interim Government of India during the British Raj from 2 September 1946 until 14 August 1947, his party, the Indian National Congress having won the 1946 Indian provincial elections. Nehru was succeeded by <strong>Lal Bahadur Shastri</strong>, whose 1 year ...",
    "published": "1 week ago"
  },
  {
    "title": "President of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_India",
    "snippet": "Arunachal Pradesh governor Jyoti Prasad Rajkhowa, who was earlier appointed by the ruling party at the centre, was sacked by <strong>President Pranab Mukherjee</strong> after the Supreme Court struck down his unconstitutional acts.",
    "published": "2 days ago"
  },
  {
    "title": "Government of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_India",
    "snippet": "Between midnight on 15 August 1947 ... Minister and a Governor-General as the viceregal representative of the head of state, <strong>George VI</strong>....",
    "published": "1 week ago"
  }
]