[
  {
    "title": "R. Nicholas Burns - Former Under Secretary of State for Political Affairs",
    "url": "https://georgewbush-whitehouse.archives.gov/government/nburns-bio.html",
    "snippet": "Ambassador R. Nicholas Burns was the Under Secretary of State for Political Affairs, the Department of State’s third ranking official. Appointed by President Bush, he was confirmed by the U.S. Senate on March 17, 2005 and was sworn into office by Secretary of State <strong>Condoleezza Rice</strong>.",
    "published": null
  },
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "Burns has had a 25-year career in the State Department and has served as under secretary of state for political affairs. Appointed by President George W. Bush, he was confirmed by the United States Senate on March 17, 2005, and was sworn into office by Secretary of State <strong>Condoleezza Rice</strong>.",
    "published": "September 26, 2025"
  },
  {
    "title": "Biography: Amb. R. Nicholas Burns",
    "url": "https://1997-2001.state.gov/about_state/biography/burns.html",
    "snippet": "R. Nicholas Burns is United States Ambassador to Greece. Appointed by President Clinton, he was sworn into office by Secretary of State <strong>Madeleine Albright</strong> on November 10, 1997. As Ambassador, he oversees all U.S. government programs at the U.S.",
    "published": null
  },
  {
    "title": "R. Nicholas Burns - Under Secretary of State for Political Affairs (Text Only)",
    "url": "https://georgewbush-whitehouse.archives.gov/government/text/nburns-bio.html",
    "snippet": "Appointed by President Bush, he was confirmed by the U.S. Senate on March 17, 2005 and was sworn into office by Secretary of State <strong>Condoleezza Rice</strong>. As Under Secretary, he oversees U.S. policy in each region of the world and serves in the senior career Foreign Service position at the Department.",
    "published": null
  },
  {
    "title": "R. Nicholas Burns | Brookings",
    "url": "https://www.brookings.edu/people/r-nicholas-burns/",
    "snippet": "R. Nicholas Burns is Professor in the Practice of Diplomacy and International Politics at the Harvard Kennedy School. He is a former under secretary of state for political affairs (2005–08), ambassador to NATO (2001–05), and ambassador to Greece (1997–2001) · Get the latest from Brookings",
    "published": "June 4, 2023"
  }
]