[
  {
    "title": "Luis Enrique - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Luis_Enrique",
    "snippet": "PSG renewed their domestic supremacy in 2024–25, losing no matches in the first 28 and winning the league with six to spare. Enrique also led them to retain the Coupe de France and to the final of the Champions League, where they beat Inter Milan 5–0 to complete a continental treble, the first by a French club, while he became the second manager to achieve this twice. He also guided the side to the final of the 2025 ...",
    "published": "3 days ago"
  },
  {
    "title": "List of Paris Saint-Germain FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Paris_Saint-Germain_FC_managers",
    "snippet": "In his three seasons in charge, PSG won three Ligue 1 titles, two Coupe de France, three Coupe de la Ligue, and three Trophée des Champions. <strong>Luis Enrique</strong> is in second place, with eight trophies, including the UEFA Champions League in 2025 and ...",
    "published": "4 days ago"
  },
  {
    "title": "Paris Saint-Germain - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/paris-saint-germain/mitarbeiterhistorie/verein/583",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  },
  {
    "title": "PSG head coach Luis Enrique wins the 2025 Men’s Johann Cruyff Trophy - Yahoo Sports",
    "url": "https://sports.yahoo.com/article/psg-head-coach-luis-enrique-193800045.html",
    "snippet": "PSG head coach <strong>Luis Enrique</strong> has scooped the first award of the evening for Les Parisiens at the 2025 Ballon d’Or ceremony. The Spaniard has won the Men’s Johann Cruyff Trophy, which is awarded to the best head coach of the previous season.",
    "published": "September 22, 2025"
  },
  {
    "title": "Luis Enrique: The manager behind PSG’s run to UEFA Champions League final | Football News | Al Jazeera",
    "url": "https://www.aljazeera.com/sports/2025/5/28/luis-enrique-the-manager-behind-psgs-run-to-uefa-champions-league-final",
    "snippet": "Paris Saint-Germain’s head coach <strong>Luis Enrique</strong>, centre-right, celebrates PSG’s French League One title after the League One football match between Paris Saint-Germain and Auxerre at the Parc des Princes stadium in Paris, on May 17, 2025 [Franck ...",
    "published": "May 31, 2025"
  }
]