[
  {
    "title": "Juventus have a smart new coach in Luciano Spalletti – now the club needs to get its act together - The Athletic",
    "url": "https://www.nytimes.com/athletic/6759612/2025/10/30/juventus-spalletti-coach/",
    "snippet": "<strong>Cristiano Giuntoli</strong> was appointed to run recruitment, having assembled the Napoli team Spalletti guided to their first league title in 33 years. Giuntoli, people forget, had been considered best-in-class in his role and, to put his stamp on Juventus, ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus appoint Luciano Spalletti as manager until end of season - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cy7epp72ek0o",
    "snippet": "Juventus appoint former Italy head coach Luciano Spalletti as their manager until the end of the season.",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus appoint ex-Napoli, Italy coach Spalletti",
    "url": "https://www.espn.com/soccer/story/_/id/46781628/ex-napoli-italy-manager-spalletti-juventus-deal",
    "snippet": "Former Napoli and Italy boss Luciano Spalletti was confirmed as Juventus&#x27; new head coach on Thursday, replacing the fired <strong>Igor Tudor</strong>.",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_FC",
    "snippet": "<strong>Comolli</strong> had joined Juventus in June 2025 after holding executive positions at several European clubs, including Liverpool and Toulouse. On 30 October 2025, the club confirmed that Luciano Spalletti had been appointed as their new head coach ...",
    "published": "3 days ago"
  },
  {
    "title": "Luciano Spalletti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Luciano_Spalletti",
    "snippet": "Luciano Spalletti (Italian pronunciation: [luˈtʃaːno spalˈletti]; born 7 March 1959) is an Italian football manager and former player who is the manager of Juventus. He started his managerial career with Empoli in 1993 before coaching clubs in Italy, including two spells with Roma, where he won two consecutive Coppa Italia titles.",
    "published": "2 days ago"
  }
]