[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "Organisational Delegate World Athletics Championships Daegu 2011, World Athletics U20 Championships Oregon 2014; World Athletics Indoor Championships Portland 2016 · Canadian Olympic Committee Board Member (representing athletics) and elected Executive Board Member · Led successful campaigns in Canada to secure athlete representation and financing · Chair of the Jury of Appeal for all World Athletics Championships and Olympic Games since 2009",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "The last election was held in October 2019 at the 2019 World Athletics Championships. Following doping and corruption issues, a Code of Ethics was agreed in 2013 and an Ethics Commission was appointed in 2014. The Council appoints the chairperson from the elected members, and in turn, the chairperson appoints a deputy chair.",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Council has the powers and ... Groups and make recommendations to Congress on membership of various independent panels and bodies of World Athletics. ... Chaired British Government Sports Honours Committee (2010-2018) and served within the Cabinet Office as Legacy Ambassador ...",
    "published": null
  },
  {
    "title": "World Stadia Championships Results & History - World Masters Athletics",
    "url": "https://world-masters-athletics.org/world-championships-stadia-history/",
    "snippet": "Continental Rep’s: Asia-Hari Chandra (SIN), Europe-Hans Axmann(GER), No. &amp; Central America-David Pain (USA), South-America-Jose Figueras (URU), Oceania -JimBlair (NZL). Special mention: IAAF Veteran Committe chair Hans Skaset applauded the meet. 1st Russian athletes to compete. More spectators than in the past.",
    "published": "March 6, 2023"
  },
  {
    "title": "‘Your column was very unfair’: what happened when I met World Athletics CEO | Athletics | The Guardian",
    "url": "https://www.theguardian.com/sport/2025/dec/02/athletics-joining-sports-goliaths-long-way-to-go",
    "snippet": "So we begin to tease out the arguments and find common ground. At one point Ridgeon graciously admits that some of his friends agree with me more than him. I respond by saying I should have acknowledged World Athletics’ achievements, including the Athletics Integrity Unit to tackle doping.",
    "published": "2 weeks ago"
  }
]