[
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "<strong>Olivier Gers</strong> was the first person to officially hold the position in 2016, succeeding the interim CEO/General Secretary Jean Gracia. In order to give active athletes a voice in the governance of the sport, World Athletics created the Athletes&#x27; Commission. Athletes are elected to the commission ...",
    "published": "1 week ago"
  },
  {
    "title": "‘Your column was very unfair’: what happened when I met World Athletics CEO | Athletics | The Guardian",
    "url": "https://www.theguardian.com/sport/2025/dec/02/athletics-joining-sports-goliaths-long-way-to-go",
    "snippet": "And the biggest sporting event in the world in 2025 was our event in Tokyo. I don’t say this complacently, but it says growth, right?” · He’s not finished. “And we’re not just sitting passively back going: ‘Gen Z is tough – let’s rely on our middle-aged audience!’” · But there is a glint in his eye when Ridgeon talks and explains that World Athletics had 700 million video views on its social media channels at the world championships in September – double that of Budapest two years ago.",
    "published": "2 weeks ago"
  },
  {
    "title": "New Athletes' Commission members announced | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/athletes-commission-members-2025-2029",
    "snippet": "The six seats that were available for election in 2025 include the Deputy Chair position, which will be voted on by the Athletes’ Commission now the elections have been held. The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December ...",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "World Athletics Council Member – as Athletes’ Commission Deputy Chair (2025-present) World Athletics Athletes’ Commission Member (2023-present) World Athletics World Plan Implementation Taskforce Member (2023-present) Council Member – Royal Spanish Athletics Federation (2020-2023) Athletes Commission Member – Royal Spanish Athletics Federation (2020-2023) Sports Director – Promoter at GPI Madrid Marcha, World Race Walking Tour Gold in Madrid (Spain) (2022-present) Brand Ambassador and Product Tester – Skechers USA (2013-present) Two-time European medallist ·",
    "published": null
  },
  {
    "title": "Candidates announced for 2025 Athletes' Commission elections | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/candidates-2025-athletes-commission-elections",
    "snippet": "The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December 2016. Since 2019, the Chairperson and one other member of the Athletes’ Commission – one man and one woman – have been full voting members of the World Athletics Council.",
    "published": null
  }
]