[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "Eurosport was closed down in May ... saved later that month when the TF1 Group (<strong>formed after the French government privatised the post ORTF-split TF1 5 years prior to the acquisition) stepped in to replace BSkyB as joint owners</strong>....",
    "published": "2 days ago"
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "<strong>Discovery took a 20% minority interest share in December 2012, and became majority shareholder in the Eurosport venture with TF1 in January 2014</strong>, taking a 51% share of the company, On 22 July 2015 Discovery agreed to acquire TF1&#x27;s remaining 49% stake in the venture.",
    "published": "1 week ago"
  },
  {
    "title": "Eurosport",
    "url": "https://wikideck.com/Eurosport",
    "snippet": "Five days later, that channel&#x27;s transponder space was taken over by RTL II. Eurosport eventually came under a French consortium comprising the TF1 Group, Canal+ Group and Havas Images. <strong>In January 2001, TF1 took full ownership of Eurosport</strong>.",
    "published": null
  },
  {
    "title": "Eurosport | Warner Bros. Entertainment Wiki | Fandom",
    "url": "https://warnerbros.fandom.com/wiki/Eurosport",
    "snippet": "Discovery through its TNT Sports ... <strong>Originally a joint venture between the European Broadcasting Union and Sky established in 1989, it was briefly shut down in 1991 following complaints by competitor Screensport</strong>...",
    "published": null
  },
  {
    "title": "Eurosport and BT Sport will disappear after TNT Sports rebrand | TNT Sports | The Guardian",
    "url": "https://amp.theguardian.com/media/2023/feb/21/eurosport-bt-sport-disappear-tnt-rebrand-tv",
    "snippet": "<strong>WBD, which has a call option to take full control of the joint venture until September 2026, took a 20% stake in Eurosport in 2012 before taking full ownership from French media group TF1 in 2015.</strong>",
    "published": "September 25, 2024"
  }
]