[
  {
    "title": "Knight Ridder - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Knight_Ridder",
    "snippet": "On <strong>March 13, 2006</strong>, The McClatchy Company announced its agreement to purchase Knight Ridder for a purchase price of $6.5 billion in cash, stock and debt. The deal gave McClatchy 32 daily newspapers in 29 markets, with a total circulation of 3.3 million. However, for various reasons, McClatchy ...",
    "published": "1 week ago"
  },
  {
    "title": "Lessons on Ownership from the Sale of Knight Ridder - FBCG",
    "url": "https://www.thefbcg.com/resource/lessons-on-ownership-from-the-sale-of-knight-ridder/",
    "snippet": "If the panel agreed that the buyer would uphold Knight Ridder’s journalistic standards, the purchase could be approved with the support of 67% of stockholders. If the panel feared lower journalistic standards, 80% approval would be required. Lesson number two is that articles of incorporation are an important tool for providing creative methods to protect a company. The McClatchy Company emerged as the buyer of Knight Ridder last month.",
    "published": "June 4, 2025"
  },
  {
    "title": "Knight Ridder, Inc. | American company | Britannica",
    "url": "https://www.britannica.com/topic/Knight-Ridder-Inc",
    "snippet": "…the largest American newspaper chains, Knight Ridder. The Herald extended its international edition to Mexico in 2002. <strong>In 2006 ownership of the paper passed to the McClatchy Company after its acquisition of Knight Ridder</strong>.",
    "published": null
  },
  {
    "title": "Press Release issued jointly by The McClatchy Company and Knight-Ridder, Inc.",
    "url": "https://www.sec.gov/Archives/edgar/data/205520/000119312506052381/dex991.htm",
    "snippet": "The company <strong>first moved beyond its California base by acquiring The Anchorage Daily News in 1979</strong>. It later added the News Tribune (Tacoma) in 1986; the News &amp; Observer (Raleigh) in 1995; the Star Tribune (Minneapolis) in 1998; and Sun Star (Merced, CA) in 2004.",
    "published": null
  },
  {
    "title": "Knight Ridder | Journawiki | Fandom",
    "url": "https://journalism.fandom.com/wiki/Knight_Ridder",
    "snippet": "It was <strong>bought by McClatchy in 2006.</strong> ... Daily newspapers in California, Florida, Georgia, Illinois, Indiana, Kansas, Kansas City, Michigan, Minnesota, Mississippi, North Carolina, North Dakota, Pennsylvania, South Carolina and South Dakota.",
    "published": null
  }
]