[
  {
    "title": "Opinion | Justin Trudeau and Katy Perry Are Worth Rooting For - The New York Times",
    "url": "https://www.nytimes.com/2025/12/18/opinion/justin-trudeau-katy-perry-couple.html",
    "snippet": "Marche is the author, most recently, of “The Next Civil War: Dispatches From the American Future.” · The former Canadian prime minister Justin Trudeau and the pop star <strong>Katy Perry are now publicly a couple</strong>: They acknowledged it, naturally ...",
    "published": "8 hours ago"
  },
  {
    "title": "Canadian Prime Minister Justin Trudeau and his wife announce their separation : NPR",
    "url": "https://www.npr.org/2023/08/03/1191789443/canadian-prime-minister-justin-trudeau-and-his-wife-announce-their-separation",
    "snippet": "TORONTO — Canadian Prime Minister Justin Trudeau and his wife, Sophie Gregoire Trudeau, announced Wednesday that they are <strong>separating after 18 years of marriage</strong>.",
    "published": "August 3, 2023"
  },
  {
    "title": "Why Justin Trudeau And Wife, Sophie Gregoire Separated? Busy Political Life To Alleged Infidelity",
    "url": "https://www.bollywoodshaadis.com/articles/why-did-trudeau-and-his-wife-sophie-gregoire-separate-66496",
    "snippet": "Not many people know this, but Justin’s parents, Pierre Elliott Trudeau and Canadian activist Margaret Sinclair, got divorced when he was just five. And many believed that Justin and Sophie’s marriage would also not last long. In May 2023, the couple celebrated their 18th wedding anniversary, and he also shared a picture from one of their vacations on his social media handle. ... Published: dec. 12, 2025 | 10:57:18 IST",
    "published": "July 30, 2025"
  },
  {
    "title": "All About Justin Trudeau's Estranged Wife, Sophie Grégoire Trudeau",
    "url": "https://people.com/all-about-justin-trudeau-wife-sophie-gregoire-trudeau-11781151",
    "snippet": "Justin Trudeau and <strong>Sophie Grégoire Trudeau</strong> wed in 2005 and announced their separation in 2023 ... Trudeau sparked romance rumors with Katy Perry in July 2025 and confirmed their relationship in October",
    "published": "July 29, 2025"
  },
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "On June 23, 1971, the Prime Minister&#x27;s Office (PMO) announced that Prime Minister Pierre Trudeau&#x27;s wife of four months, <strong>Margaret Trudeau (née Sinclair), was pregnant and due in December</strong>.",
    "published": "4 days ago"
  }
]