[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "The prime minister of France (French: Premier ministre français), officially the prime minister of the French Republic (Premier ministre de la République française), is the nominal head of government of the French Republic and leader of its Council of Ministers, although the officeholder does not chair its meetings, as the president does.",
    "published": "1 week ago"
  },
  {
    "title": "Opinion | France Needs a New France - The New York Times",
    "url": "https://www.nytimes.com/2025/12/22/opinion/france-macron-sixth-republic.html",
    "snippet": "First, the government was toppled by an irate Parliament. Then, in a panic, President Emmanuel Macron tapped a protégé, <strong>Sébastien Lecornu</strong>, to be prime minister; he resigned less than a month later. Confusion raged.",
    "published": "20 hours ago"
  },
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "<strong>Sébastien Lecornu</strong> (French: [sebastjɛ̃ ləkɔʁny]; born 11 June 1986) is a French politician who has served as Prime Minister of France since 2025. Positioned on the right of the ideological political spectrum, Lecornu has promoted Gaullist, Séguinist, and socially conservative beliefs.",
    "published": "1 week ago"
  },
  {
    "title": "France's Prime Minister Sebastien Lecornu delivers a ...",
    "url": "https://www.reutersconnect.com/item/frances-prime-minister-sebastien-lecornu-delivers-a-statement-at-the-hotel-matignon-in-paris/dGFnOnJldXRlcnMuY29tLDIwMjU6bmV3c21sX1JDMloySUFDMk9HNg",
    "snippet": "Access and license millions of multimedia assets and find real-time news photos, archive imagery, video, and more to power your storytelling.",
    "published": "1 month ago"
  },
  {
    "title": "French PM pressures divided parliament to pass contested 2026 budget - France 24",
    "url": "https://www.france24.com/en/france/20251124-french-pm-pressures-divided-parliament-pass-contested-2026-budget",
    "snippet": "France&#x27;s Prime Minister <strong>Sébastien Lecornu</strong> on Monday pressured MPs to pass a national budget for 2026 by the end of the year. The contested legislation will head to the Senate for review on Monday before it is sent back for a final vote in the ...",
    "published": "1 month ago"
  }
]