[
  {
    "title": "IMU Leadership 2023 – 2026 | International Mathematical Union",
    "url": "https://www.mathunion.org/organization/imu-leadership-2023-2026",
    "snippet": "ICMI EC Ex-officio Member (IMU President) Japan · Christoph Sorger · ICMI EC Ex-officio Member (IMU Secretary General) France · *CoP was formerly known as the Committee on Electronic Information and Communication (CEIC). Terms of membership are staggered. Ilka Agricola · CoP Chair 2023 – 2026 ·",
    "published": null
  },
  {
    "title": "General Assembly of the International Mathematical Union | IMU Meetings & Resolutions",
    "url": "https://www.mathunion.org/organization/general-assembly",
    "snippet": "It consists of seven people, namely <strong>the IMU President, the NC Chair (chosen by the IMU President),</strong> three other persons (chosen at random from AO nominations) and two further persons with experience of the IMU (chosen jointly by the NC Chair and IMU President).",
    "published": null
  },
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "Due to the delicate and contentious political status of Taiwan, China has two Adhering Societies to the IMU, which split the voting rights in the General Assembly. The Chinese Mathematical Society in Beijing has three votes, and the Mathematical Society of the Republic of China, located in Tapei, has two votes. ... The International Mathematical Union is administered by an executive committee (EC) which conducts the business of the Union. The EC consists of the President, two vice-presidents, the Secretary, six Members-at-Large, all elected for a term of four years, and the Past President.",
    "published": "February 24, 2025"
  },
  {
    "title": "PRESIDENT'S REPORT",
    "url": "https://www.imu.edu.my/wp-content/uploads/2021/06/president-report-2014.pdf",
    "snippet": "<strong>Bakar Suleiman (Chairman) President</strong> · Dr Mei Ling Young · Provost · Prof Peter Pook · Vice President · Prof Abdul Aziz Baba · Vice President · Prof Victor Lim · Vice President, Education · Prof Mak Joon Wah · Vice President, Research · YBhg Prof Dato’ ·",
    "published": null
  },
  {
    "title": "Governance: Union Board: Indiana Memorial Union: Indiana University Bloomington",
    "url": "https://imu.indiana.edu/union-board/governance.html",
    "snippet": "Committee Chair: Elisabeth Melms Union Board President ubpres@indiana.edu",
    "published": null
  }
]