[
  {
    "title": "Denys Shmyhal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Denys_Shmyhal",
    "snippet": "As Prime Minister, Shmyhal was in charge of handling the response to the COVID-19 pandemic in Ukraine and conducting the defense of Ukraine during the 2022 Russian invasion. On <strong>15 July 2025</strong>, Shmyhal submitted his resignation, a day after President Volodymyr Zelenskyy announced a government ...",
    "published": "November 11, 2025"
  },
  {
    "title": "Ukraine’s Prime Minister Shmyhal Resigns After 5 Years",
    "url": "https://www.kyivpost.com/post/56344",
    "snippet": "On <strong>Tuesday, July 15,</strong> Ukrainian Prime Minister Denys Shmyhal announced his resignation after five years in office.",
    "published": "July 15, 2025"
  },
  {
    "title": "Ukraine's parliament dismisses prime minister and his cabinet",
    "url": "https://kyivindependent.com/ukraines-parliament-dismisses-government/",
    "snippet": "<strong>The Ukrainian parliament on Juĺy 16 voted to accept Prime Minister Denys Shmyhal&#x27;s resignation</strong>, thus dismissing his government and starting a cabinet reshuffle.",
    "published": "July 16, 2025"
  },
  {
    "title": "Ukrainian PM Denys Shmyhal resigns day after Zelenskyy nominates his deputy for post - India Today",
    "url": "https://www.indiatoday.in/world/story/ukrainian-pm-denys-shmyhal-resigns-day-after-zelenskyy-nominates-his-deputy-for-post-2756212-2025-07-15",
    "snippet": "Ukrainian Prime Minister Denys Shmyhal said on Tuesday that <strong>he had submitted his resignation letter</strong>, marking the beginning of a major governmental reshuffle expected later this week.",
    "published": "July 15, 2025"
  },
  {
    "title": "Ukraine's prime minister submits resignation, parliament set to dismiss government on July 16",
    "url": "https://kyivindependent.com/ukraines-parliament-set-to-dismiss-government-on-july-16-amid-cabinet-reshuffle/",
    "snippet": "The parliament is set to dismiss the government on <strong>July 16</strong> as Prime Minister Denys Shymhal submitted his resignation.",
    "published": "July 16, 2025"
  }
]