[
  {
    "title": "Prime Minister of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Saudi_Arabia",
    "snippet": "An ongoing power struggle between the two led to Faisal&#x27;s resignation in 1960, allowing Saud to reclaim the reins of government, but continued discontent saw Faisal return as prime minister in 1962. After the deposition of Saud in 1964, Faisal succeeded him as king, while remaining prime minister. From that point until the appointment of Mohammed bin Salman as prime minister by King Salman, the two offices were merged.",
    "published": "November 10, 2025"
  },
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "Mohammed bin Salman has served as crown prince (2017– ), prime minister (2022– ), and previously as minister of defense (2015–22). As defense minister, Mohammed bin Salman launched Operation Decisive Storm, an intervention in Yemen’s civil war to support Yemeni President Abd Rabbuh Mansur Hadi against Houthi insurgents. Vision 2030 is an initiative by Mohammed bin Salman to attract foreign investment for industries outside Saudi Arabia’s energy sector.",
    "published": "July 17, 2019"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "His seventh son, Crown Prince Mohammed bin Salman, is considered the de facto ruler of Saudi Arabia due to the King&#x27;s poor health and Mohammed&#x27;s own political maneuvering. Mohammed replaced his father as prime minister in 2022, making Salman the first king since Saud in 1964 not to serve as ...",
    "published": "November 3, 2025"
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?RestrictToCategory=Saudi+Arabia",
    "snippet": "The heads of government list is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers, trade ministers and in some cases, ministers responsible for development assistance.&amp;nbsp It has been prepared using information provided by ...",
    "published": null
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed bin Salman <strong>Al Saud</strong> (born 31 August 1985), also known as MbS, is the de facto ruler of the Kingdom of Saudi Arabia, formally serving as Crown Prince and Prime Minister. He is the heir apparent to the Saudi throne, the seventh son of ...",
    "published": "11 hours ago"
  }
]