[
  {
    "title": "Nadia Calviño - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nadia_Calvi%C3%B1o",
    "snippet": "Nadia María Calviño Santamaría (Spanish: [ˈnaðja kalˈβiɲo]; born 3 October 1968) is a <strong>Spanish economist and civil servant serving as the President of the European Investment Bank since January 2024</strong>. From June 2018 to December 2023, Calviño was part of the cabinets led by prime minister ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Nadia Calviño, su marido, sus hijos y los bulos: la vida íntima detrás de sus dos mil días en el poder",
    "url": "https://www.vanitatis.elconfidencial.com/famosos/2025-11-16/nadia-calvino-libro-marido-hijos-feminismo-familia-bulos_4247402/",
    "snippet": "Analizamos el libro de la exministra en clave personal, de su afición por U2, el bulo sobre que le gusta cocinar, el acoso a su familia o su &quot;feminismo no excluyente&quot;",
    "published": "November 16, 2025"
  },
  {
    "title": "Retrato personal de Nadia Calviño: estudiante brillante, una carrera hasta la cima y cuatro hijos | Vanity Fair",
    "url": "https://www.revistavanityfair.es/poder/articulos/nadia-calvino-ministra-economia-marido-hijos/44131",
    "snippet": "Calviño nació en La Coruña en 1968 pero siendo aún muy pequeña, su familia se mudó a Madrid. Tiene un hermano tres años más joven llamado Iván. El padre de Nadia es José María Calviño Iglesias (76), nacido en Lalín y abogado, que fue el primer secretario general de Acción Republicana Democrática Española tras la legalización del partido.",
    "published": "July 9, 2020"
  },
  {
    "title": "Nadia Calviño Biography | Santander International Banking Conference",
    "url": "https://www.santander.com/en/press-room/santander-international-banking-conference/biographies/nadia-calvino",
    "snippet": "President Nadia Calviño is a <strong>Spanish economist and lawyer</strong> with a prominent career as civil servant and politician in the Spanish government and the European Commission.",
    "published": null
  },
  {
    "title": "Nadia Calviño - European Commission",
    "url": "https://commission.europa.eu/persons/nadia-calvino_en",
    "snippet": "President Nadia Calviño is a <strong>Spanish economist and lawyer with a prominent career as civil servant and politician in the Spanish government and the European Commission</strong>. Before becoming President of the European Investment Bank Group on January ...",
    "published": null
  }
]