[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Despite its strong brand image and relatively sizeable share of the high-performance auto market in Europe, by the 1970s, the company was operating at a loss, prompting IRI to sell it to <strong>Fiat Group</strong> in 1986. Alfa Romeo has since maintained its distinct identity and brand through several ownership ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Who Owns Alfa Romeo? | Alfa Romeo of Plano",
    "url": "https://www.alfaofplano.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "From 2007 on, Alfa Romeo was owned by <strong>Fiat Chrysler Automobiles (FCA).</strong> However, on January 16, 2021, FCA merged its operations with the French PSA Group, Peugeot S.A., to form Stellantis, now recognized as the fourth largest automaker globally.",
    "published": "August 25, 2025"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "... Many Sterling Heights drivers may be surprised to know that the history of Alfa Romeo dates back to 1910. When <strong>Cavalier Ugo Stella</strong> purchased the shares of an italian automotive plant in Milan, the company’s legacy of sport-oriented vehicles ...",
    "published": "April 26, 2021"
  },
  {
    "title": "Who Owns Alfa Romeo? | Where is Alfa Romeo Made?",
    "url": "https://www.aristocratmotorsalfaromeo.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "In 1910, <strong>Cavalier Ugo Stellar</strong> acquired shares of an Italian automotive plan founded on the outskirts of Milan, Italy. This plant was called “Anonima Lombarda Fabbrica Automobili,” which created the acronym A.L.F.A. In 1932, the Italian state ...",
    "published": "July 25, 2025"
  },
  {
    "title": "History of Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Alfa_Romeo",
    "snippet": "In 1933 ownership of Alfa Romeo passed, through IRI, to the Italian state because of the heavy debt the company had incurred with banks since the previous decade.",
    "published": "October 20, 2025"
  }
]