[
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "After Indira Gandhi&#x27;s assassination, her son Rajiv Gandhi took charge until 1989, when a decade with five unstable governments began. This was followed by the full terms of P. V. Narasimha Rao, Atal Bihari Vajpayee, Manmohan Singh, and <strong>Narendra Modi</strong>, who is the current prime minister of India, ...",
    "published": "3 days ago"
  },
  {
    "title": "Know the PM | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/pms-profile/",
    "snippet": "<strong>Shri Narendra Modi</strong> was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership.",
    "published": "3 weeks ago"
  },
  {
    "title": "Press Information Bureau",
    "url": "https://www.pib.gov.in/PMContents/PMContents.aspx?menuid=1",
    "snippet": "Prime Minister Congratulates Indian Athletes on extraordinary, record-breaking performance at the World Boxing Cup Finals 2025 Posted on: 24 Nov 2025 · PM to visit Shri Ram Janmbhoomi Mandir in Ayodhya on 25th November Posted on: 24 Nov 2025 · Prime Minister Pays Tribute to Lachit Borphukan on Lachit Diwas Posted on: 24 Nov 2025 · Prime Minister attends the oath taking ceremony of Justice Surya Kant as the Chief Justice of India Posted on: 24 Nov 2025",
    "published": "3 weeks ago"
  },
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "<strong>Narendra Damodardas Modi</strong> (born 17 September 1950) is an Indian politician who has served as the prime minister of India since 2014. Modi was the chief minister of Gujarat from 2001 to 2014 and is the member of parliament (MP) for Varanasi.",
    "published": "2 days ago"
  },
  {
    "title": "PM Events – Prime Minister of India",
    "url": "https://pmevents.mygov.in/en/home/",
    "snippet": "... &quot;Dynamic, dedicated and determined, <strong>Narendra Modi</strong> arrives as a ray of hope in the lives of a billion Indians.&quot; Shri <strong>Narendra Modi</strong> was sworn-in as India’s Prime Minister on 30th May 2019, marking the start of his second term in office.",
    "published": "2 days ago"
  }
]