[
  {
    "title": "Congresswoman Marcy Kaptur |Representing the 9th District of Ohio",
    "url": "https://kaptur.house.gov/",
    "snippet": "Toledo, OH – Today, Congresswoman Marcy Kaptur (OH-09) received confirmation from the US Department of Health and Human Services (HHS) that <strong>funding for Toledo Public Schools Head Start Program has been certified and will resume immediately</strong>.",
    "published": null
  },
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "In the 2020s, <strong>Kaptur&#x27;s district shifted from a reliably Democratic seat to a swing district</strong>. Her 2020 opponent was Rob Weber, who defeated Charles W. Barrett, Tim Connors, and Timothy P. Corrigan in the Republican primary on March 17.",
    "published": "1 week ago"
  },
  {
    "title": "Newsroom | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/media-center",
    "snippet": "Washington, DC – Today, Congresswoman Marcy Kaptur (OH-09) and Congressman Thomas Massie (KY-04) <strong>reintroduced the Balancing Incentives Act of 2025</strong>, bipartisan legislation designed to level the playing field for America’s independent inventors ...",
    "published": null
  },
  {
    "title": "In the News | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/media-center/in-the-news",
    "snippet": "Kaptur visits demonstration farm addressing runoff pollution ... MCCOMB - While agriculture accounts for more than two-thirds of the phosphorus pollution in Lake Erie, many farmers are working hard to find and share conservation practices that will best address that problem. One of the most prominent examples in the western Lake Erie basin is the Ohio Farm Bureau Federation and the U.S. House passes bill by Rep. Marcy Kaptur to boost trainees at VA hospitals",
    "published": null
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "The Hill, &quot;Dem Reps. Kaptur and Kucinich face off in primary under presidential shadow,&quot; March 6, 2012 · Talking Points Memo, &quot;Ohio’s Democratic Civil War Gets Ugly,&quot; March 5, 2012 · The News Messenger, &quot;Kaptur, Kucinich battle for Ohio&#x27;s northern border,&quot; March 5, 2012",
    "published": null
  }
]