[
  {
    "title": "2024–2025 French political crisis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–2025_French_political_crisis",
    "snippet": "The National Rally and the New Popular Front voted against alongside other minor parties. <strong>Macron appointed Sébastien Lecornu as prime minister on 9 September 2025</strong>. Lecornu presented his cabinet on 5 October, but resigned the next day, making him the shortest-serving prime minister in the history ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Welcome to the website of the French Presidency",
    "url": "https://www.elysee.fr/en/",
    "snippet": "5 December 2025 Joint Statement between the French Republic and the People’s Republic of China on the situation on Ukraine and the situation on Palestine. 25 November 2025 Chairs’ statement following 25 November Coalition of the Willing Leaders’ meeting.",
    "published": null
  },
  {
    "title": "2023–2024 French government crisis - Infogalactic: the planetary ...",
    "url": "https://infogalactic.com/info/2023–2024_French_government_crisis",
    "snippet": "He then formed a minority government from which he and Macron sacked the near-entirety of ministers who had rebelled in late December 2023. ... In May 2022, as it is customary after a presidential election in France, Macron appointed a new Prime minister: Élisabeth Borne became the second female head of government in French history.[1] She then formed a new government, the fourth since the start of the Macron Presidency.",
    "published": null
  },
  {
    "title": "French government collapses as MPs vote to oust prime minister - BBC News",
    "url": "https://www.bbc.com/news/live/c5yqgnzw759t",
    "snippet": "There is at the heart of <strong>Bayrou&#x27;s defeat a genuine political crisis now, because after nine months of relative calm, France is back where it was last December with the fall of his predecessor Michel Barnier</strong>.",
    "published": "September 8, 2025"
  },
  {
    "title": "France has a new government. Here’s what it needs to do now | PBS News",
    "url": "https://www.pbs.org/newshour/world/france-has-a-new-government-heres-what-it-needs-to-do-now",
    "snippet": "<strong>The government, put together by newly named Prime Minister Francois Bayrou</strong>, includes members of the outgoing conservative-dominated team and new figures from centrist or left-leaning backgrounds.",
    "published": "December 23, 2024"
  }
]