[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "Jacques Brunel (born 14 January 1954) is a French rugby union coach and former player. He was most recently the French national team head coach, having previously been assistant coach for his nation and had led the Italian national team between <strong>2011 and 2016.</strong>",
    "published": "January 1, 2025"
  },
  {
    "title": "Cinq choses à savoir sur Jacques Brunel",
    "url": "https://www.lequipe.fr/Rugby/Actualites/Cinq-choses-a-savoir-sur-jacques-brunel/861417",
    "snippet": "Jacques Brunel est le nouveau sélectionneur du XV de France. Il a succédé à Guy Novès. D&#x27;Auch à l&#x27;équipe d&#x27;Italie, découvrez le parcours du nouveau patron des Bleus.",
    "published": null
  },
  {
    "title": "France: Jacques Brunel coached games",
    "url": "https://www.rugbydatabase.co.nz/team/coach.php?teamId=45&coachId=179",
    "snippet": "Rugby Database coaching statistics for Jacques Brunel while coaching France including a full list of games",
    "published": null
  },
  {
    "title": "Jacques Brunel has brought France together, but can he bring success? | France rugby union team | The Guardian",
    "url": "https://www.theguardian.com/sport/2018/mar/09/jacques-brunel-france-england-six-nations-2018-rugby-union",
    "snippet": "“That’s Jacques,” says Perry Freshwater, who played in that game, “always as good as his word”. A week later, Brunel had a heart attack. England’s Eddie Jones looks to the future with France on the horizon ... Brunel is 64 now, and has just taken on another heavy load. He took over from Guy Novès as the France coach at the start of January.",
    "published": "October 19, 2022"
  },
  {
    "title": "Jacques Brunel | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/12984",
    "snippet": "After Guy Noves sacking December 2017 Brunel was named as the France national coach.",
    "published": null
  }
]