[
  {
    "title": "Ada Solomon | Producer, Production Manager, Actress",
    "url": "https://www.imdb.com/name/nm1127536/",
    "snippet": "Ada Solomon. Producer: Bad Luck Banging or Loony Porn. Ada Solomon was born on 3 June 1968 in Bucharest, Romania. She is a <strong>producer and production manager</strong>. She is married to Alexandru Solomon.",
    "published": "July 16, 2009"
  },
  {
    "title": "Ada Solomon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ada_Solomon",
    "snippet": "Ada Solomon (born 3 June 1968 in Bucharest) is a <strong>Romanian film producer behind over 60 movies</strong>. After first working in marketing, she turned to media companies in 1993 and produced her first film Asphalt Tango in 1995. In 2004 she created HiFilm Productions where she has worked with directors ...",
    "published": "August 13, 2025"
  },
  {
    "title": "Alexandru Solomon talks doc filmmaking and working with wife Ada | Features | Screen",
    "url": "https://www.screendaily.com/features/alexandru-solomon-talks-doc-filmmaking-and-working-with-wife-ada/5172055.article",
    "snippet": "As one of the three recipients of the 3x3 homages at the Transilvania International Film Festival (TIFF) this month, Romanian documentary director, DoP, producer and screenwriter Alexandru Solomon relished the chance to reflect on how filmmaking in Romania has transformed in the past 30 years. He has been as the forefront of that transformation as the husband and producing partner Ada Solomon of Hi Film and the collective outfit microFILM.",
    "published": "June 27, 2022"
  },
  {
    "title": "Ada Solomon | MIDPOINT Institute",
    "url": "https://www.midpoint-institute.eu/en/person/ada-1dGcDV",
    "snippet": "Ada Solomon is a Romanian producer.",
    "published": null
  },
  {
    "title": "Ada Solomon — Network — EAVE",
    "url": "https://eave.org/network/10719",
    "snippet": "Ada Solomon has <strong>worked in the film business for the last 20 years</strong>. She has served as a line producer for foreign international projects such as Franco Zeffirelli\\&#x27;s CALLAS FOREVER and Didi Danquart\\&#x27;s OFFSET or recently Hermine Huntgeburth\\&#x27;s ...",
    "published": null
  }
]