[
  {
    "title": "Renée Slegers appointed head coach | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/renee-slegers-appointed-head-coach",
    "snippet": "We’re delighted to announce that <strong>Renée Slegers</strong> has been appointed as our permanent head coach. Renée, who has signed a contract through to the end of the 2025/26 season, took charge of our women’s first team in October 2024 on an interim basis.",
    "published": null
  },
  {
    "title": "Arsenal Coaching Staff | Team Behind the Team",
    "url": "https://www.arsenalinsider.com/club/coaching-staff/",
    "snippet": "Arsenal’s coaching staff for the 2025/26 season under <strong>Mikel Arteta</strong> is a close-knit group. But who features among the Spaniard’s small clutch of experts in the Emirates Stadium dugout?",
    "published": "July 8, 2025"
  },
  {
    "title": "Why Arsenal hired Renee Slegers as their new head coach – consistency, solidity and ruthlessness - The Athletic",
    "url": "https://www.nytimes.com/athletic/6066264/2025/01/18/why-arsenal-hired-renee-slegers-as-head-coach/",
    "snippet": "In its place is a new photo showing <strong>Renee Slegers</strong> and Alessia Russo holding their Women’s Super League manager, player and goal of the month awards for December, surrounded by the playing squad and 27 members of backroom staff · Slegers is ...",
    "published": "January 18, 2025"
  },
  {
    "title": "Gabriel Heinze joins coaching team | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/gabriel-heinze-joins-coaching-team",
    "snippet": "<strong>Gabriel Heinze</strong> has joined Mikel Arteta&#x27;s coaching staff as a first team coach",
    "published": null
  },
  {
    "title": "Renee Slegers: Arsenal name permanent head coach after impressive interim spell from former Netherlands midfielder - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/c39n3d3pvygo",
    "snippet": "<strong>Slegers has signed a one-and-a-half-year contract with the Gunners until the end of the 2025-26 season</strong>. &quot;I&#x27;m so excited to be continuing our journey together,&quot; said Slegers. &quot;It&#x27;s a wonderful honour to represent this club as head coach and I ...",
    "published": "January 17, 2025"
  }
]