[
  {
    "title": "Governor-General of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Governor-General_of_Australia",
    "snippet": "The governor-general is selected by the prime minister, but formally appointed by the monarch of Australia on the prime minister&#x27;s advice. Their term is not fixed, but they typically serve for five years. From Federation in 1901 until 1965, 11 out of the 15 governors-general were British aristocrats; however, all since then have been Australian citizens.",
    "published": "5 days ago"
  },
  {
    "title": "List of governors-general of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_governors-general_of_Australia",
    "snippet": "The following chart lists governors-general by lifespan (living governors-general on the green line), with the years outside of their governor-generalship in beige. The following chart shows governors-general by their age (living governors-general in green), with the years of their governor-generalship in blue. ... ^ Queen Victoria appointed Lord Hopetoun as Australia&#x27;s first governor-general on 14 July 1900 and signed this document, legally establishing the office, on 29 October 1900.",
    "published": "October 29, 2025"
  },
  {
    "title": "Former Governors-General | Governor-General of the Commonwealth of Australia",
    "url": "https://www.gg.gov.au/about-governor-general/former-governors-general",
    "snippet": "A list of all former Governors-General.",
    "published": null
  },
  {
    "title": "Governors-General of Australia",
    "url": "http://static.moadoph.gov.au/ophgovau/media/images/apmc/docs/55-Governors-General.pdf",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "Governors-General Since 1901 - AustralianPolitics.com",
    "url": "https://australianpolitics.com/constitution/gg/governors-general-since-1901/",
    "snippet": "There have been five former Australian politicians appointed Governor-General: <strong>Isaacs (Protectionist), McKell (ALP), Casey (Liberal), Hasluck (Liberal) and Hayden (ALP).</strong> In addition, Lord Dudley, Lord Stonehaven, Lord Dunrossil and Lord De L’Isle were active in British politics.",
    "published": "December 5, 2010"
  }
]