[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Alexei Venediktov, editor-in-chief of Echo of Moscow radio station, called the arrest &quot;a political mistake: jailing Navalny transforms him from an online leader into an offline one&quot;. After his arrest, his blog became available in English. Navalny was kept in the same prison as several other activists, including Ilya Yashin and Sergei Udaltsov, the unofficial leader of the Vanguard of Red Youth, a radical Russian communist youth group.",
    "published": "1 week ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "Aleksey Navalny (1976–2024) was a Russian anti-corruption activist and politician who achieved international recognition as one of the most prominent domestic critics of Russian Pres. Vladimir Putin.",
    "published": "March 7, 2023"
  },
  {
    "title": "Alexei Navalny's Political Network Suspended By Russian Authorities : NPR",
    "url": "https://www.npr.org/2021/04/26/990824453/russian-court-suspends-alexei-navalnys-anti-kremlin-network",
    "snippet": "<strong>The jailed opposition leader&#x27;s political network has been ordered to suspend its activities pending a court ruling on whether to label it and affiliated organizations &quot;extremist.&quot;</strong>",
    "published": "April 26, 2021"
  },
  {
    "title": "What is Alexei Navalny’s legacy for the people of Russia?",
    "url": "https://theconversation.com/what-is-alexei-navalnys-legacy-for-the-people-of-russia-249692",
    "snippet": "Three of Navalny’s lawyers were sentenced in January 2025 for participating in an “extremist organisation”, as the ACF was designated by a Moscow court in June 2021. The Russian legislature has also passed a barrage of legislation relating to so-called “foreign agents”, to tarnish the work of those the regime regards as foreign-backed “fifth columnists”. From left: lawyers Igor Sergunin, Alexei Liptser and Vadim Kobzev, who have all represented Navalny, in a Russian courtroom, January 2025.",
    "published": "3 weeks ago"
  },
  {
    "title": "Protests, poisoning and prison: The life and death of Russian opposition leader Alexei Navalny",
    "url": "https://apnews.com/article/russia-navalny-life-timeline-0722708e19e51b10699b2cc73ece0bae",
    "snippet": "2011 — Establishes the Foundation for Fighting Corruption, which will become his team’s main platform for exposing alleged graft among Russia’s top political ranks. December 2011 — Participates in mass protests sparked by reports of widespread rigging of Russia’s parliamentary election, and is arrested and jailed for 15 days for “defying a government official.” · FILE - Alexei Navalny speaks to journalists after being released from a police custody on the outskirts of Moscow early Wednesday, Dec.",
    "published": "March 6, 2024"
  }
]