[
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "In December 2016, a French court convicted her of negligence relating to her role in the Bernard Tapie arbitration, but did not impose a penalty. Lagarde <strong>resigned from the IMF following her nomination as president of the ECB</strong>. In 2019, 2020, 2022, 2023, 2024, and 2025, Forbes ranked her number ...",
    "published": "6 days ago"
  },
  {
    "title": "ECB may lift growth outlook again, Lagarde says | Reuters",
    "url": "https://www.reuters.com/business/ecb-may-upgrade-growth-projections-again-december-lagarde-says-2025-12-10/",
    "snippet": "REUTERS/Heiko Becker/File Photo Purchase Licensing Rights, opens new tab · Financial investors see a <strong>close-to-zero chance of any rate change at the ECB&#x27;s next meeting on December 18</strong> and see unchanged rates for months to come as inflation has ...",
    "published": "4 days ago"
  },
  {
    "title": "'Europe's existential crisis': ECB's Lagarde calls for urgent reforms | Euronews",
    "url": "https://www.euronews.com/business/2025/12/10/europes-existential-crisis-ecbs-lagarde-calls-for-urgent-reforms",
    "snippet": "ECB President Christine Lagarde <strong>urged the European Commission to dismantle internal trade barriers, warning they stifle competitiveness</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "ECB President Christine Lagarde outlines monetary policy and tools to strengthen Europe’s economic resilience",
    "url": "https://www.debrecensun.hu/europe/2025/12/08/ecb-president-christine-lagarde-outlines-monetary-policy-and-tools-to-strengthen-europes-economic-resilience/",
    "snippet": "In a hearing before the European Parliament’s Committee on Economic and Monetary Affairs on <strong>3 December 2025</strong>, ECB President Christine Lagarde discussed the euro area’s economic outlook, current monetary policy, and the instruments available ...",
    "published": "1 week ago"
  },
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "The president of the European Central Bank is the head of the European Central Bank (ECB), the main institution responsible for the management of the euro and monetary policy in the eurozone of the European Union (EU). The current president of the European Central Bank is Christine Lagarde, ...",
    "published": "September 25, 2025"
  }
]