[
  {
    "title": "Detroit Pistons announce coaching staff with plenty of new names | Detroit Bad Boys",
    "url": "https://www.detroitbadboys.com/2024/9/23/24252761/detroit-pistons-coaching-staff-bickerstaff-luke-walton-fred-vinson-sidney-lowe",
    "snippet": "Bickerstaff is taking over after just one season from Monty Williams, and he has pretty well cleared the decks of the former regime’s staff. Bickerstaff is bringing back Jarrett Jack and Steve Scalzi, but is bringing on seven new coaches to Detroit. Some are coming over from Bickerstaff’s time with the Cleveland Cavaliers. Luke Walton, who Pistons fans might remember as a player on the Los Angeles Lakers who lost to the Pistons the last time Detroit won an NBA title, will be Bickerstaff’s lead assistant.",
    "published": "September 24, 2024"
  },
  {
    "title": "Detroit Pistons' 2024-25 coaching staff has some familiar faces",
    "url": "https://www.freep.com/story/sports/nba/pistons/2024/09/23/detroit-pistons-coaching-staff-2024-25-bickerstaff-luke-walton-jarrett-jack/75349269007/",
    "snippet": "9 assistant coaches will be with new Detroit Pistons head coach J.B. Bickerstaff, including <strong>Jarrett Jack, Luke Walton and Sidney Lowe</strong>.",
    "published": "September 23, 2024"
  },
  {
    "title": "DETROIT PISTONS ANNOUNCE COACHING STAFF | Detroit Pistons",
    "url": "https://www.nba.com/pistons/news/detroit-pistons-announce-coaching-staff",
    "snippet": "The Detroit Pistons announced today that <strong>Luke Walton, Sidney Lowe, Fred Vinson, Vitaly Potapenko, Kevin Burleson, Jerome Allen and Josh Estes</strong> have been named...",
    "published": "September 23, 2024"
  },
  {
    "title": "Former assistant returns to Detroit as Pistons finalize coaching staff - mlive.com",
    "url": "https://www.mlive.com/pistons/2024/09/former-assistant-returns-to-detroit-as-pistons-finalize-coaching-staff.html",
    "snippet": "On Monday, the Pistons announced that <strong>Luke Walton, Sidney Lowe, Fred Vinson, Vitaly Potapenko, Kevin Burleson, Jerome Allen, and Josh Estes</strong> will serve as assistant coaches under J.B. Bickerstaff, who is entering his first year in Detroit.",
    "published": "September 23, 2024"
  },
  {
    "title": "J. B. Bickerstaff - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/J._B._Bickerstaff",
    "snippet": "On July 3, 2024, <strong>Bickerstaff became the new head coach of the Detroit Pistons</strong>. On December 23, Bickerstaff would lead the Pistons to their 15th win of the season. This would be one more win than the Pistons had for the entirety of the 2023-24 season.",
    "published": "5 days ago"
  }
]