[
  {
    "title": "Sepp Blatter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sepp_Blatter",
    "snippet": "FIFA president Sepp Blatter was cleared of any misconduct, but his predecessor, Brazilian <strong>João Havelange</strong>, resigned as FIFA&#x27;s honorary president over his part in the scandal, since Havelange along with former FIFA Executive Committee members Ricardo Teixeira and Dr.",
    "published": "February 28, 2002"
  },
  {
    "title": "Joseph Sepp Blatter (1936 - ) | The Presidency",
    "url": "https://www.thepresidency.gov.za/joseph-sepp-blatter-1936",
    "snippet": "Blatter has been working at FIFA since 1975, first as <strong>technical director (1975 – 1981) and then as general secretary (1981 – 1998)</strong> before his election as FIFA president in 1998. He was re-elected as head of FIFA in 2002, and was re-elected unopposed for another four years on 31 May 2007.",
    "published": null
  },
  {
    "title": "Sepp Blatter | Biography, FIFA, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Sepp-Blatter",
    "snippet": "FIFA president Sepp Blatter, 2006.",
    "published": null
  },
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "Prior to his election, Cameroonian <strong>Issa Hayatou</strong> was acting president after the impeachment of Sepp Blatter on 8 October 2015, who was given an eight-year ban from all football-related activities on 21 December 2015 (reduced to six years on 24 ...",
    "published": "November 20, 2025"
  },
  {
    "title": "Why has Sepp Blatter resigned as Fifa president? | Sepp Blatter | The Guardian",
    "url": "https://www.theguardian.com/football/2015/jun/02/why-has-sepp-blatter-resigned-as-fifa-president",
    "snippet": "Garcia is appointed as chair of an investigatory chamber set up by Blatter to examine the 2018 and 2022 World Cup bidding process. ... Mohammed bin Hammam, the Fifa executive committee member for Qatar, withdraws his bid for the Fifa presidency over allegations he offered $40,000 in bribes to Caribbean delegates in return for supporting his campaign. He is eventually banned from football for life. Sepp Blatter to resign as Fifa president after 17 years in role",
    "published": "August 18, 2022"
  }
]