[
  {
    "title": "Banijay Entertainment - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banijay_Entertainment",
    "snippet": "On 9 January 2015, Banijay Group acquired a controlling share in New York City-based American unscripted production outfit <strong>Stephen David</strong> Entertainment.; However ten years later in June 2025, Banijay Entertainment announced it had sold back its share in New York City-based production studio ...",
    "published": "1 day ago"
  },
  {
    "title": "Banijay Group is a leader in the entertainment business",
    "url": "https://group.banijay.com/who-we-are/",
    "snippet": "... Equity investment of Société des Bains de Mer in Betclic. ... Acquisition of Zodiak Media through merger with Banijay (Vivendi retaining 26% of the combined entity). ... Acquisition of Endemol Shine by Banijay. ... Listing of FL Entertainment in July 2022. ... <strong>Stéphane Courbit</strong> is the founder ...",
    "published": "May 24, 2024"
  },
  {
    "title": "Stéphane Courbit - Banijay",
    "url": "https://www.banijay.com/people/stephane-courbit/",
    "snippet": "In 2006, he sold his shares before leaving the group in 2007 to create LOV Group, which would concentrate investment in growing markets such as audiovisual production, luxury hotels, the Internet and energy sectors. In January 2008, Courbit created Banijay Group, and in 2016, he triggered the merger between Banijay Group and Zodiak Media, making him the leader of the world’s largest independent production and distribution company (over 3 billion Euro business), responsible for global hit brands including Temptation Island, Survivor, Wife Swap and Versailles.",
    "published": "April 3, 2024"
  },
  {
    "title": "Banijay Asia - We are Banijay",
    "url": "https://banijayasia.com/key-people/",
    "snippet": "Founder &amp; Group CEO of Banijay Asia &amp; EndemolShine India · <strong>Deepak Dhar</strong> is the man credited with being the key driving force behind content production in India. Starting his career as senior producer at MTV, he went on to work with Star TV and ...",
    "published": null
  },
  {
    "title": "Banijay Asia's CEO Deepak Dhar To Make Brands Central Characters In New Content Strategy - BW Marketing World",
    "url": "https://www.bwmarketingworld.com/article/reality-entertainments-monopolistic-leader-544695",
    "snippet": "<strong>Deepak Dhar</strong>, Founder &amp; Group CEO of Banijay Asia and Endemol Shine India serves hits with Sony, NBC deals and live events",
    "published": null
  }
]