[
  {
    "title": "Televerket (Sweden) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Televerket_(Sweden)",
    "snippet": "Televerket was a Swedish State authority acting as a state-owned corporation (public enterprise), responsible for telecommunications in Sweden from 1853 until 1993. Originally it was named Kongl. Elektriska Telegraf-Werket (literally: Royal Electric Telegraph Agency), which was founded in 1853. Its name changed to Kongl. Telegrafverket in 1871, Kungl. Telegrafverket in 1903, the prefix Kungl. (an abbreviation of ...",
    "published": "June 4, 2025"
  },
  {
    "title": "Jan Stenbeck - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jan_Stenbeck",
    "snippet": "<strong>Jan Hugo Robert Arne Stenbeck</strong> (Swedish pronunciation: [ˈjɑːn ˈstêːnbɛk]; 14 November 1942 – 19 August 2002) was a Swedish business leader, media pioneer, sailor and financier. He was head of Kinnevik Group from 1976 and founded among other things the companies Comviq, Invik &amp; Co AB, ...",
    "published": "July 21, 2025"
  },
  {
    "title": "Televerket – Artist & Author Joakim Lloyd Raboff",
    "url": "https://raboff.com/televerket/",
    "snippet": "There was no posting on it, and therefore only interesting as a relic of Televerket, the precursor of today’s Telia, Sweden’s partially state-owned telecom company. When I moved to Sweden in 1978, Televerket was a monopoly and omnipresent in society.",
    "published": null
  },
  {
    "title": "Televerket - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q52918",
    "snippet": "Swedish State authority acting as a state-owned corporation (public enterprise), responsible for telecommunications in Sweden 1853–1993",
    "published": null
  },
  {
    "title": "Televerket - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Televerket",
    "snippet": "Televerket is the name of two government telecommunications agencies: Televerket (Sweden), former name of Swedish company Telia, later merged to TeliaSonera · Televerket (Norway), former name of Norwegian company Telenor",
    "published": "April 7, 2013"
  }
]