[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "The Fiat Group then created a sports and luxury division from Maserati and Alfa Romeo. There is a planned strategic relationship between these two; engines, platforms and possibly dealers are shared. In the beginning of 2007, Fiat Auto S.p.A. was reorganized and four new automobile companies were created; Fiat Automobiles S.p.A., Alfa Romeo Automobiles S.p.A., Lancia Automobiles S.p.A.",
    "published": "5 days ago"
  },
  {
    "title": "Who Owns Alfa Romeo? | Who Makes Alfa Romeo? | Zeigler Alfa Romeo of Schaumburg",
    "url": "https://www.alfaromeousaofschaumburg.com/who-owns-alfa-romeo/",
    "snippet": "When Cavalier <strong>Ugo Stella</strong> decided to purchase shares of the Anonima Lombarda Fabbrica Automobili in 1910, Alfa Romeo was born. The company’s acronym comes from its original name above and later was used as an integral part of the name (A.L.F.A). ...",
    "published": "July 13, 2019"
  },
  {
    "title": "Who owns alfa romeo? - HotBot",
    "url": "https://www.hotbot.com/answers/who-owns-alfa-romeo",
    "snippet": "Fiat&#x27;s ownership marked a new era for Alfa Romeo, with a renewed focus on design and performance. Several successful models were introduced during this period, including the Alfa Romeo 156 and 147, which won numerous awards. In 2014, Fiat merged with Chrysler Group LLC, forming Fiat Chrysler Automobiles (FCA).",
    "published": null
  },
  {
    "title": "Fiat S.p.A. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_S.p.A.",
    "snippet": "Fiat was founded in 1899 by a group of investors, including <strong>Giovanni Agnelli</strong>. During its more than century-long history, Fiat has also manufactured railway engines and carriages, military vehicles, farm tractors, and aircraft.",
    "published": "3 weeks ago"
  },
  {
    "title": "Who Owns Alfa Romeo | Alfa Romeo FIAT of Santa Monica",
    "url": "https://www.alfaromeousaofsantamonica.com/the-ownership-history-of-alfa-romeo/",
    "snippet": "In early 2021, the PSA group (which owned Peugeot, Citroen, DS, Vauxhall, and Opel) merged with FCA (which owned Fiat, Chrysler, Dodge, RAM, Jeep, and Alfa Romeo) to form Stellantis, and that’s where things stand. Here at Alfa Romeo FIAT of Santa Monica, we’re very excited about what this means for the future of the brand! Regardless of ownership, the people in charge of Alfa Romeo have always dedicated themselves to ensuring these vehicles were fun to drive and impressive to look at.",
    "published": "January 11, 2025"
  }
]