[
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "Marcelo Rebelo de Sousa was <strong>elected President of the Republic for the first time on 24 January 2016 and took office on 9 March</strong>.",
    "published": null
  },
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "On 1 December 2025, Marcelo Rebelo de Sousa was <strong>admitted to University Hospital of São João, in Porto, for urgent surgery due to an incarcerated hernia</strong>, after feeling unwell.",
    "published": "1 week ago"
  },
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "<strong>The current president of Portugal is Marcelo Rebelo de Sousa, who took office on 9 March 2016.</strong>",
    "published": "1 week ago"
  },
  {
    "title": "Portuguese President Rebelo de Sousa hospitalised following emergency surgery | Euronews",
    "url": "https://www.euronews.com/2025/12/02/portuguese-president-rebelo-de-sousa-hospitalised-following-emergency-surgery",
    "snippet": "<strong>Presidency doctors decided that, before returning to Lisbon, Rebelo de Sousa should undergo medical examinations</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "2026 Portuguese presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2026_Portuguese_presidential_election",
    "snippet": "André Ventura, the leader of Chega, played with the idea of being a candidate, until committing in September 2025. Other personalities, like both MEPs João Cotrim Figueiredo (IL) and Catarina Martins (BE), also announced their candidacies, as well as former MP António Filipe (PCP) and MP Jorge Pinto (L). 45 candidates expressed their intention to run for the presidency, but just 14 formalized their candidacy and will be on the ballot. Marcelo Rebelo de Sousa was re-elected in January 2021, securing nearly 61 percent of the votes in the first round.",
    "published": "1 day ago"
  }
]