[
  {
    "title": "Tim Reed backed for Business Council President - Business Council of Australia",
    "url": "https://www.bca.com.au/tim_reed_backed_for_business_council_president",
    "snippet": "Tim Reed brings a wealth of experience, having served on the Business Council’s board <strong>since 2017</strong> and with a history of building one of Australia’s most successful and innovative tech companies in MYOB, delivering solutions for businesses ...",
    "published": null
  },
  {
    "title": "Business Council of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Business_Council_of_Australia",
    "snippet": "The board oversees the council&#x27;s secretariat, committees and task forces, makes recommendations about membership and appointments, and proposes policies. ... President: Geoff Culbert - Chair of the NSW Fundraising Committee for the Australian Olympic Committee ... Former presidents include Tim Reed, Catherine Livingstone, Tony Shepherd, Michael Chaney, Hugh Morgan, Roderick Carnegie and Arvi Parbo.",
    "published": "April 1, 2025"
  },
  {
    "title": "Tim Reed: Positions, Relations and Network - MarketScreener",
    "url": "https://www.marketscreener.com/insider/TIM-REED-A0OYDU/",
    "snippet": "Prior to that, he was the VP Marketing ... President Marketing at Engage PR LLC from 2001 to 2003. <strong>He was the President of the Business Council of Australia from 2019 to 2024</strong>....",
    "published": null
  },
  {
    "title": "Tim Reed | Business News",
    "url": "https://www.businessnews.com.au/Person/Tim-Reed-0",
    "snippet": "Mr Reed <strong>holds a Master of Business Administration from Harvard Business School, graduating as Baker Scholar, and a Bachelor of Commerce (Honours) from the University of Melbourne</strong>.",
    "published": null
  },
  {
    "title": "Tim Reed - AICD",
    "url": "https://www.aicd.com.au/about-aicd/authors-speakers/tim-reed.html",
    "snippet": "Tim is Co-Managing Director of Potentia Capital, an Australian private equity firm that invests in and grows local software businesses; <strong>President of the Business Council of Australia, a role he assumed in 2019 having sat on the BCA Board since 2017,</strong> and non-Executive Director of Transurban Ltd.",
    "published": null
  }
]