[
  {
    "title": "List of prime ministers of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Canada",
    "snippet": "The office was modelled after that which existed in the United Kingdom at the time of Confederation. <strong>John A. Macdonald was commissioned by the Viscount Monck on 24 May 1867 to form the first government of the Canadian Confederation</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "Prime Ministers of Canada",
    "url": "https://lop.parl.ca/sites/ParlInfo/default/en_CA/People/primeMinisters",
    "snippet": "This page provides general details on Canada&#x27;s prime ministers since 1867. For more information on an individual prime minister, including their electoral history and parliamentary roles, click on their name to view their complete profile.",
    "published": null
  },
  {
    "title": "List of prime ministers of Canada | Britannica",
    "url": "https://www.britannica.com/place/list-of-prime-ministers-of-Canada-1800352",
    "snippet": "Though the titular head of Canada is the reigning monarch of the United Kingdom (represented locally by a governor-general), the effective head of government is the prime minister. After a general election, the governor-general calls on the leader of the political party winning the most seats in the House of Commons to become prime minister and to form a government.",
    "published": "November 4, 2011"
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "Prime Minister Carney started his career in finance before joining Canada’s public service to help ensure our economy supports the things that Canadians value – like health care, security, and a life you can afford. As Governor of the Bank of Canada during the 2008 financial crisis, he guided our country through one of the most turbulent economic periods in modern history...",
    "published": null
  },
  {
    "title": "Government Ministries and Prime Ministers of Canada Since 1867 - House of Commons Procedure and Practice, Third edition, 2017 - ProceduralInfo - House of Commons of Canada",
    "url": "https://www.ourcommons.ca/procedure/procedure-and-practice-3/App06-e.html",
    "snippet": "... The government of Sir John A. Macdonald resigned on November 5, 1873, as a result of the Canadian Pacific Railway scandal. On November 7, 1873, the Liberals under Alexander Mackenzie formed a government. ... <strong>Sir John Abbott</strong> served as Prime Minister from the Senate.",
    "published": null
  }
]