[
  {
    "title": "Politics of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Kyrgyzstan",
    "snippet": "After Atambayev retired from presidency, he began criticizing Jeenbekov and their relations worsened over time. Soon Atambayev was accused of corruption by the Jeenbekov administration. Clashes grew between security forces and Atambayev supporters, exacerbating political turmoil. Political insurgency in Kyrgyzstan amplified following controversy about the conduct of October 2020 Kyrgyz parliamentary election, where only four parties met the 7% threshold to achieve parliamentary representation, three of whom were closely aligned with the government.",
    "published": "1 month ago"
  },
  {
    "title": "Factbox: Kyrgyzstan's political turmoil | Reuters",
    "url": "https://www.reuters.com/article/us-kyrgyzstan-protests-factbox/factbox-kyrgyzstans-political-turmoil-idUSKBN2701JO?edition-redirect=in",
    "snippet": "- <strong>More than 400 people were killed in clashes between ethnic Kyrgyz and Uzbeks in southern Kyrgyzstan in 2010.</strong> - A third former president, Almazbek Atambayev, fell out with his successor, Jeenbekov, and was jailed on corruption charges.",
    "published": "October 15, 2020"
  },
  {
    "title": "Sooronbay Jeenbekov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sooronbay_Jeenbekov",
    "snippet": "Jeenbekov&#x27;s son-in-law became the head of the foreign policy department of the president&#x27;s office, his nephew Nooruz headed the &quot;Gazprom Kyrgyzstan&quot; branches, another brother, Jusup Jeenbekov, headed the embassy in Ukraine, and another nephew Teniz became the head of the &quot;Ayyl Bank&quot; branches. Many saw this as a departure from the democratic ideals and principles that Kyrgyzstan tried to uphold since its inception. Such a strengthening of the family-clan regime undermined the trust of the people in the government and became the main reason for its overthrow. As it turned out later, cases with a politically motivated bias were personally handled by the president&#x27;s nephew Rustambek Borombaev in Attorney general&#x27;s office, and his relatives also entered the leadership circles of the corrupt South-West customs of Kyrgyzstan.",
    "published": "October 3, 2025"
  },
  {
    "title": "Understanding the Political Crisis in Kyrgyzstan | Lawfare",
    "url": "https://www.lawfaremedia.org/article/understanding-political-crisis-kyrgyzstan",
    "snippet": "Kyrgyzstan is one of the poorest countries in Central Asia, but also the region’s only true democracy—<strong>Jeenbekov came to power in a 2017 election in which he won only 55 percent of the vote</strong>, unlike the leaders of neighboring Tajikistan and Turkmenistan who have held onto power with sham ...",
    "published": "January 18, 2023"
  },
  {
    "title": "Kyrgyzstan - 2022 World Factbook Archive",
    "url": "https://www.cia.gov/the-world-factbook/about/archives/2022/countries/kyrgyzstan",
    "snippet": "In October 2020, protests against legislative election results spread across Kyrgyzstan, leading to JEENBEKOV’s resignation from the presidency, and catapulting previously imprisoned Sadyr JAPAROV to acting president. In January 2021, Kyrgyzstanis formerly elected JAPAROV as president and approved a referendum to move Kyrgyzstan from a parliamentary to a presidential system.",
    "published": null
  }
]