[
  {
    "title": "Patricia de Lille - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Patricia_de_Lille",
    "snippet": "Patricia de Lille (née Lindt; born 17 February 1951) is a South African politician who is the current Minister of Tourism and leader of the political party Good. She <strong>served as Minister of Public Works and Infrastructure from 2019 to 2023</strong>. She was previously Mayor of Cape Town from 2011 to ...",
    "published": "October 23, 2025"
  },
  {
    "title": "Patricia De Lille | South African History Online",
    "url": "https://sahistory.org.za/people/patricia-de-lille",
    "snippet": "During this period de Lille <strong>served as the Minister for Social Development of the Western Cape from 2010-2011 and come 2011, de Lille would succeed fellow DA Member Dan Plato as the Mayor of the City of Cape Town</strong>, a position she holds as of February ...",
    "published": null
  },
  {
    "title": "Patricia de Lille - Kids | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/kids/article/Patricia-de-Lille/601990",
    "snippet": "De Lille <strong>entered politics when she was in her 30s</strong>. In 1988 she was elected vice president of the National Council of Trade Unions. The council is one of South Africa’s largest labor groups.",
    "published": null
  },
  {
    "title": "Patricia de Lille - Students | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/students/article/Patricia-de-Lille/607278",
    "snippet": "(born 1951). The South African politician Patricia de Lille <strong>founded and led the Independent Democrats (ID) party</strong>. She was the first South African woman to form a political…",
    "published": null
  },
  {
    "title": "Patricia De Lille Biography, Wiki, Age, Husband, Family, Qualifications, Salary, Net Worth and Contact Details |",
    "url": "https://primalinformation.com/patricia-de-lille-wiki/",
    "snippet": "Patricia De Lille was <strong>awarded the Freedom of the City of Birmingham, Alabama, and in 2004 was awarded the honour of being one of the Top 5 Women in Government and Government Agencies</strong>.",
    "published": "January 3, 2021"
  }
]