[
  {
    "title": "Mary Earps’ Manchester United return: Jeers, cheers, selfies and a painful defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6802703/2025/11/13/mary-earps-manchester-united-psg/",
    "snippet": "Sporting a bright yellow Paris Saint-Germain goalkeeping kit, hips swaying from side to side, Mary Earps looked up towards <strong>Old Trafford</strong>’s Sir Bobby Charlton Stand. Game mode was activated for the return of the ‘Mearps’ in Wednesday’s ...",
    "published": "November 13, 2025"
  },
  {
    "title": "Mary Earps receives mixed reception by Manchester United fans on return to Old Trafford | The Independent",
    "url": "https://www.independent.co.uk/sport/football/mary-earps-manchester-united-psg-wcl-old-trafford-return-b2864091.html",
    "snippet": "Mary Earps received a mixed reception from the Manchester United fans during her first return to <strong>Old Trafford</strong> since leaving the club in 2024.",
    "published": "November 12, 2025"
  },
  {
    "title": "Mary Earps booed by fans on Man Utd return after Lionesses controversy | Irish Star",
    "url": "https://www.irishstar.com/sport/soccer/mary-earps-soccer-manchester-united-36241560",
    "snippet": "Mary Earps is back at <strong>Old Trafford</strong> for the first time since leaving Manchester United for Paris Saint-Germain, with the goalkeeper braced for a mixed reception",
    "published": "November 13, 2025"
  },
  {
    "title": "Manchester United beat PSG on Mary Earps' Old Trafford return - BBC Sport",
    "url": "https://www.bbc.com/sport/football/live/cj974374vlnt",
    "snippet": "Manchester United continued their winning run in the Women&#x27;s Champions League, beating Paris St-Germain on Mary Earps&#x27; return to <strong>Old Trafford</strong>.",
    "published": null
  },
  {
    "title": "How Mary Earps’s Manchester United homecoming turned toxic | The Independent",
    "url": "https://www.independent.co.uk/sport/football/mary-earps-hannah-hampton-man-united-psg-b2862864.html",
    "snippet": "That is until Earps steps out onto the <strong>Old Trafford</strong> pitch and faces her former team United who, with all due respect to Le Havre and Fleury, PSG’s opponents over the past two weekends, carry the weight to take this all to another level.",
    "published": "November 12, 2025"
  }
]