[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "In <strong>August 2005, Navalny was admitted to the Social Council of the Central Administrative Okrug of Moscow</strong>, created before the Moscow City Duma election held later that year, in which he took part as a candidate. In November, he was one of the initiators of the Youth Public Chamber, intended ...",
    "published": "1 week ago"
  },
  {
    "title": "Alexei Navalny’s rise from blogger to Putin’s chief rival: Timeline",
    "url": "https://thehill.com/policy/international/4473313-alexei-navalny-life-death-timeline/",
    "snippet": "Navalny establishes the Anti-Corruption Foundation, which became Russia’s largest anti-corruption organization. He also begins speaking out against United Russia, the dominant political party that is affiliated with Putin, calling it a party of “swindlers and thieves.”",
    "published": "February 16, 2024"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. <strong>In 2000, while he was still a student, Navalny joined Yabloko</strong>, ...",
    "published": "March 7, 2023"
  },
  {
    "title": "POLITICS: Navalny timeline infographic",
    "url": "https://www.graphicnews.com/en/pages/41262/politics-navalny-timeline",
    "snippet": "Graphic shows timeline of Russian opposition leader Alexei Navalny.",
    "published": null
  },
  {
    "title": "5 things to know about Russian opposition leader Alexei Navalny – POLITICO",
    "url": "https://www.politico.eu/article/5-things-you-need-to-know-about-alexei-navalny/",
    "snippet": "<strong>In 2018, he became the leader of opposition party Russia of the Future</strong>, but was barred from running for president against Putin that year because of his criminal record. He’s lately been campaigning for politicians running in Russia’s upcoming ...",
    "published": "August 21, 2020"
  }
]