[
  {
    "title": "Ibrox Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ibrox_Stadium",
    "snippet": "<strong>Ibrox Stadium</strong> is a football stadium on the south side of the River Clyde in the Ibrox area of Glasgow, Scotland. The home of Scottish Premiership team Rangers, Ibrox is the third-largest football stadium in Scotland, with an all-seated capacity of 51,700.",
    "published": "October 22, 2025"
  },
  {
    "title": "Ibrox Stadium, Home of Glasgow Rangers",
    "url": "https://www.ibroxstadium.co.uk/",
    "snippet": "<strong>Ibrox Stadium</strong> is the home of Glasgow Rangers Football Club, an all seated stadium with a capacity of 50,817.",
    "published": "June 4, 2025"
  },
  {
    "title": "Ibrox Stadium (2025) - All You Need to Know BEFORE You Go (with Reviews)",
    "url": "https://www.tripadvisor.com/Attraction_Review-g186534-d2720452-Reviews-Ibrox_Stadium-Glasgow_Scotland.html",
    "snippet": "This iconic stadium still looks as good today as when it was first built. It&#x27;s quite basic in it&#x27;s structure with it&#x27;s memorable terracotta brick work to it&#x27;s facade that reminds you of the good old stadia of footballing days out. The Rangers motif and wording is visible in many places around the exterior of the stadium and you can see these but taking the glorious walk all the way around it&#x27;s concourse.",
    "published": null
  },
  {
    "title": "Rangers F.C. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Rangers_F.C.",
    "snippet": "Rangers&#x27; home ground, <strong>Ibrox Stadium</strong>, designed by stadium architect Archibald Leitch and opened in 1929, is a Category B listed building and Scotland&#x27;s third-largest football stadium.",
    "published": "6 days ago"
  },
  {
    "title": "Home | Rangers Football Club",
    "url": "https://www.rangers.co.uk/",
    "snippet": "Welcome to the official online home of Rangers Football Club. Our club website will provide you with information about our players, fixtures, results, transfers and much more.",
    "published": "1 hour ago"
  }
]