[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "In 2020 he was loaned to <strong>Borussia Dortmund</strong>; a few weeks later he moved to the team under a permanent deal. He represented Germany from U15 to U21, and featured at the 2015 U21 European Championship. He made his senior debut in September 2015 and was selected for the 2016 European Championship.",
    "published": "5 days ago"
  },
  {
    "title": "Emre Can",
    "url": "https://www.bvb.de/de/en/teams/football/player/emre-can.html",
    "snippet": "Emre Can has played for <strong>all of Germany&#x27;s youth national teams</strong> since the U15s and made his debut for the senior national team on 4 September 2015 in his hometown of Frankfurt in a European Championship qualifier against Poland. He was a member of the squad at the 2017 Confederations Cup, where ...",
    "published": null
  },
  {
    "title": "Liverpool career stats for Emre Can - LFChistory - Stats galore for Liverpool FC!",
    "url": "https://www.lfchistory.net/players/player/profile/1272",
    "snippet": "In the summer of 2013, Can, now in his twentieth year, moved nearly three hundred miles north to the Rhine city of Leverkusen to join the top local club, <strong>Bayer 04 Leverkusen</strong>. Bayer had finished third in 2012/13 to qualify for the group stage of the Champions League.",
    "published": null
  },
  {
    "title": "Emre Can Borussia Dortmund Midfielder, Profile & Stats | Premier League",
    "url": "https://www.premierleague.com/players/5001/Emre-Can/overview",
    "snippet": "View the player profile of <strong>Borussia Dortmund</strong> Midfielder Emre Can, including stats and videos, on the official website of the Premier League.",
    "published": null
  },
  {
    "title": "Emre Can | Borussia Dortmund | Player Profile | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/player/emre-can",
    "snippet": "All official season statistics and career data on Emre Can. With news, videos and goals from Emre Can in the Bundesliga this season",
    "published": null
  }
]