[
  {
    "title": "Congressman John Garamendi |Representing the 8th District of California",
    "url": "https://garamendi.house.gov/",
    "snippet": "WASHINGTON, D.C. - Today, Congressman John Garamendi (CA-08), senior member of the House Armed Services Committee and Ranking Member of the Readiness Subcommittee, joined Rep.",
    "published": null
  },
  {
    "title": "John Garamendi | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/john-garamendi/G000559",
    "snippet": "John Garamendi, the Representative from California - in Congress from 2009 through Present",
    "published": null
  },
  {
    "title": "Rep. John Garamendi [D-CA8, 2023-2026], Representative for California's 8th Congressional District - GovTrack.us",
    "url": "https://www.govtrack.us/congress/members/john_garamendi/412382",
    "snippet": "Garamendi recently introduced the following legislation: H.R. 4847: Transportation Emergency Relief Extension Act · H.Res. 603: Reaffirming the principles of the United States Constitution, including separation of powers and … · H.R. 4372: To amend title 10 to shorten breach reporting timelines, increase program transparency, and … · H.R. 4170: Bridge Corrosion Prevention and Repair Act of 2025",
    "published": null
  },
  {
    "title": "Garamendi’s Committee Assignments Announced, Including New Roles in Aviation and Counterterrorism | Congressman John Garamendi",
    "url": "https://garamendi.house.gov/press-release/garamendi-s-committee-assignments-announced-including-new-roles-aviation-and",
    "snippet": "By continuing to serve as one of two Northern California representatives on the Transportation and Infrastructure Committee, Garamendi is positioned to continue his work <strong>bringing needed transportation projects, flood protection, and manufacturing jobs to our region</strong>.",
    "published": "January 29, 2015"
  },
  {
    "title": "John Garamendi - Ballotpedia",
    "url": "https://ballotpedia.org/John_Garamendi",
    "snippet": "Garamendi said that he planned to continue working while receiving treatment.[18] ... Ballotpedia monitors legislation that receives a vote and highlights the ones that we consider to be key to understanding where elected officials stand on the issues. To read more about how we identify key votes, click here. The 118th United States Congress began on January 3, 2023, and ended on January 3, 2025.",
    "published": null
  }
]