[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "In August 2010, the blog became a licensed feature of The New York Times online and was renamed FiveThirtyEight: Nate Silver&#x27;s Political Calculus. In <strong>July 2013</strong>, ESPN acquired FiveThirtyEight, hiring Silver as editor-in-chief and a contributor for ESPN.com; the new publication launched on March ...",
    "published": "1 month ago"
  },
  {
    "title": "FiveThirtyEight joins ABC News - ABC News",
    "url": "https://abcnews.go.com/US/fivethirtyeight-joins-abc-news/story?id=54531745",
    "snippet": "<strong>ABC News announced today it has reached an agreement in principle to acquire the renowned data journalism organization FiveThirtyEight from ESPN</strong>.",
    "published": "April 17, 2018"
  },
  {
    "title": "Publishers Daily: ABC News Buys 'FiveThirtyEight'",
    "url": "https://www.mediapost.com/publications/article/317771/abc-news-buys-fivethirtyeight.html",
    "snippet": "<strong>FiveThirtyEight, which covers sports, politics and science, will continue to provide data-driven sports coverage to ESPN, which just sold it to ABC</strong>. The new ownership means FiveThirtyEight will expand its political coverage under ABC News.",
    "published": null
  },
  {
    "title": "Why did ABC News acquire FiveThirtyEight? - Quora",
    "url": "https://www.quora.com/Why-did-ABC-News-acquire-FiveThirtyEight",
    "snippet": "Answer (1 of 2): Short answer: Because ESPN needed to sell FiveThirtyEight, and no one outside the Disney umbrella was willing to pay a high enough price. ESPN had been looking at divesting itself of Nate Silver’s brand for at least a few months now. TheBigLead (a sister publication to USA Toda...",
    "published": null
  },
  {
    "title": "Nate Silver’s FiveThirtyEight Moving From ESPN To ABC News",
    "url": "https://deadline.com/2018/04/fivethirtyeight-leaving-espn-for-abc-news-nate-silver-1202366322/",
    "snippet": "Nate Silver’s data-driven news site FiveThirtyEight is changing teams, with <strong>ABC News saying it has reached an agreement in principle to acquire the site from its Disney corporate sibling ESPN</strong>.",
    "published": "April 17, 2018"
  }
]