[
  {
    "title": "Leadership - IAU",
    "url": "https://www.iau-aiu.net/Leadership",
    "snippet": "<strong>Develop Effective Teams</strong>: Explore leadership expectations and improve interpersonal management skills to unlock the full potential of diverse high-performing teams. Build a Global Network of Peers: Create long-term partnerships, connect with colleagues from all over the world, and share experiences ...",
    "published": null
  },
  {
    "title": "IAU represented at events - IAU",
    "url": "https://www.iau-aiu.net/IAU-at-events",
    "snippet": "Hilligje van’t Land represented the IAU and spoke on Roundtable Four. The conference celebrated <strong>Gülsün Saglamer</strong> for her extraordinary leadership of this network and saw the election of Kerstin Tham, Vice Chancellor, Malmö University, as the new President of the EWORA.",
    "published": null
  },
  {
    "title": "Executive Leadership Programme — International Association of Universities",
    "url": "https://iau.global/elp",
    "snippet": "The 2025-2026 cohort will begin on 24 October 2025 at the IAU 2025 International Conference in Kigali, Rwanda and will continue through the IAU 17th General Conference to be held in Autumn 2026. The ELP will meet in person and online over the course of one year. Each module is complimented by Action Leadership Groups, separated into current and emerging leaders for true peer-to-peer exchange.",
    "published": null
  },
  {
    "title": "Apply for IAU Membership in 2025 by 15 December | American Astronomical Society",
    "url": "https://aas.org/posts/news/2024/10/apply-iau-membership-2025-15-december",
    "snippet": "The membership of individual scientists in the IAU offers access to travel grants to the IAU-sponsored meetings, opportunities for leadership positions on committees and working groups, eligibility for IAU awards, possibilities for outreach and development funding and training, and access to regular email newsletters from the IAU and its Divisions, Commissions, and Working Groups.",
    "published": null
  },
  {
    "title": "International Association of Universities",
    "url": "https://www.iau-aiu.net/",
    "snippet": "The IAU has four priority which inform the Association’s work, namely: Value-based Leadership, Internationalization for the Common Good, Sustainable Development, and Digital Transformation.",
    "published": null
  }
]