[
  {
    "title": "Stade Saint-Symphorien - FC Metz - Metz - The Stadium Guide",
    "url": "https://www.stadiumguide.com/stade-saint-symphorien/",
    "snippet": "Club: FC Metz | Opening: 1923 | Capacity: 26,600 seats | Description: <strong>Stade Saint-Symphorien</strong> opened in 1923 and became the home ground of FC Metz in 1932 following the foundation of the club.",
    "published": "April 29, 2020"
  },
  {
    "title": "Stade Saint-Symphorien - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stade_Saint-Symphorien",
    "snippet": "<strong>Stade Municipal Saint-Symphorien</strong> is a multi-purpose stadium located on the &quot;island Saint-Symphorien&quot; in Longeville-lès-Metz, near Metz, France. It is currently used mostly for football matches, by Ligue 1 club FC Metz. The stadium is able to hold 30,000 people and was built in 1923.",
    "published": "June 15, 2025"
  },
  {
    "title": "FC Metz - Stadium - Stade Saint-Symphorien | Transfermarkt",
    "url": "https://www.transfermarkt.com/fc-metz/stadion/verein/347",
    "snippet": "This page provides you with information about the stadium of the selected club. In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights.",
    "published": null
  },
  {
    "title": "Metz Stadium",
    "url": "https://www.martifer.com/en/projects/metz-stadium",
    "snippet": "With this intervention, the south tribune will seat 8 000 fans instead of the current 3 500. This is a remodeling and expansion project for the <strong>Saint-Symphorien stadium</strong> that will globally increase the stadium&#x27;s capacity by 4 440 seats: from 25,600 to 30,000 seats.",
    "published": null
  },
  {
    "title": "Stade St Symphorien (2025) - All You Need to Know BEFORE You Go (with Reviews)",
    "url": "https://www.tripadvisor.com/Attraction_Review-g187164-d2425591-Reviews-Stade_St_Symphorien-Metz_Moselle_Grand_Est.html",
    "snippet": "Superb football stadium with a great atmosphere. Plenty food outlets inside and restauranmt, bar and souvenir shop outside. Easy walking distance from cetre ... This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust &amp; safety standards. Read our transparency report to learn more. ... Saw an FC Metz game here in Dec 2011.",
    "published": null
  }
]