[
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "He was <strong>head of the Computational Sciences Division (now the Intelligent Systems Division)</strong> at NASA Ames Research Center, where he oversaw a staff of 200 scientists performing NASA&#x27;s research and development in autonomy and robotics, automated software engineering and data analysis, neuroengineering, ...",
    "published": "1 month ago"
  },
  {
    "title": "Peter Norvig Bio",
    "url": "https://norvig.com/bio.html",
    "snippet": "Peter Norvig is a Distinguished Education Fellow at Stanford&#x27;s Human-Centered Artificial Intelligence Institute and a researcher at Google Inc; previously he directed Google&#x27;s core search algorithms group and Google&#x27;s Research group. He was <strong>head of NASA Ames&#x27;s Computational Sciences Division</strong>, where ...",
    "published": null
  },
  {
    "title": "Dr. Peter Norvig | Gradient Ventures",
    "url": "https://www.gradient.com/team/peter-norvig/",
    "snippet": "Dr. Peter Norvig ... Previously he was the <strong>head of the Computational Sciences Division</strong> at NASA Ames Research Center, making him NASA&#x27;s senior computer scientist. He received the NASA Exceptional Achievement Award in 2001.",
    "published": null
  },
  {
    "title": "Peter Norvig | Edge.org",
    "url": "https://www.edge.org/memberbio/peter_norvig",
    "snippet": "At Google Inc he was the Director of Search Quality, responsible for the core web search algorithms from 2002-2005, and has been a Director of Research from 2005 on. Previously he was the <strong>head of the Computational Sciences Division</strong> at NASA Ames Research Center, making him NASA&#x27;s senior computer ...",
    "published": null
  },
  {
    "title": "Peter Norvig - Stanford Researcher & Google Director of Research & Search Quality",
    "url": "https://speakabout.ai/peter-norvig",
    "snippet": "Norvig&#x27;s career spans various pivotal roles, including <strong>leading the Computational Sciences Division</strong> at NASA Ames Research Center and contributing to advancements at companies like Junglee and Sun Microsystems Laboratories.",
    "published": null
  }
]