[
  {
    "title": "Russia: Year After Navalny’s Death, Supporters Targeted | Human Rights Watch",
    "url": "https://www.hrw.org/news/2025/02/20/russia-year-after-navalnys-death-supporters-targeted",
    "snippet": "Human Rights Watch reviewed over a hundred criminal court cases on “financing of extremism” and hundreds of case summaries that leading Russian human rights groups, including Memorial, classify as politically motivated. Those cases indicated that as of February 2025, the authorities have opened criminal cases against more than 50 people for their alleged involvement with the Anti-Corruption Foundation or Navalny’s campaigning offices across the country. At least 37 more people have been criminally charged for donating money to support the work of the Anti-Corruption Foundation; some of those donations as small as US$2.",
    "published": "February 20, 2025"
  },
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "His supporters <strong>protested before the Investigative Committee offices</strong>. Despite the mounting legal pressure, which Navalny described as &#x27;political revenge for his investigations and work at the Anti-Corruption Foundation, as well as revenge for the campaign during the election period&#x27;, he remained ...",
    "published": "1 day ago"
  },
  {
    "title": "Russia's Opposition Is Leaving Indigenous People Behind. We Will Not Remain Silent. - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2025/12/09/russias-opposition-is-leaving-indigenous-people-behind-we-will-not-remain-silent-a91378",
    "snippet": "15, 2025 ... The channel, called Future of Russia, will be broadcast via a free-to-air satellite platform run by Reporters Without Borders. ... In a service attended by hundreds, Navalny’s widow Yulia shared memories of her husband and called on Russians abroad to protest the regime. ... Navalnaya’s spokeswoman said the speed of the designation means the opposition figure is “doing everything right.” ... The activist and widow of Alexander Litvinenko also voiced frustration with Britain’s unwillingness to free Vladimir Kara-Murza in a prisoner swap.",
    "published": "20 hours ago"
  },
  {
    "title": "Russia Labels Navalny’s Anti-Corruption Group as Terrorist Organization - The New York Times",
    "url": "https://www.nytimes.com/2025/11/27/world/europe/russia-navalny-terrorist.html",
    "snippet": "After Mr. Navalny’s death in February 2024 at age 47, law enforcement officers across Russia continued to track down Russians who had wired small amounts of money to support the opposition leader’s work.",
    "published": "3 weeks ago"
  },
  {
    "title": "Russia pursues Navalny supporters, one year after opposition leader's death | Reuters",
    "url": "https://www.reuters.com/world/europe/russia-pursues-navalny-supporters-one-year-after-opposition-leaders-death-2025-02-14/",
    "snippet": "No stranger to protest, Kotov served time in prison five years ago for helping organise mass rallies, and has been arrested and fined several times since for demonstrating against the war in Ukraine, among other activities. &quot;Navalny showed all of us Russians an example of what it means to engage in real politics, to engage in them to the end, without fear of any consequences,&quot; he told Reuters.",
    "published": "February 14, 2025"
  }
]