[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "De Havilland Aircraft of Canada Limited (DHC) is a Canadian aircraft manufacturer <strong>founded in 2018 that purchased the aircraft programs of the original the de Havilland Canada, which was founded in 1928</strong>. The aircraft types currently in production or planned for production include the DHC-6 Twin ...",
    "published": "1 month ago"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "De Havilland Aircraft of Canada Limited, with head offices in Toronto, Ontario, is an aircraft manufacturer <strong>incorporated in 1928</strong>. It has designed and built ic...",
    "published": null
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "In November 2018, <strong>Longview Aviation Capital Corp.</strong> acquired the Dash 8 programme and the de Havilland Canada brand from Bombardier, adding them to the rights and type certificates for all of the out-of-production aircraft (DHC-1 through DHC-7) already sold to its subsidiary Viking Air in 2005.",
    "published": "November 1, 2025"
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "De Havilland Canada&#x27;s history includes being a UK subsidiary and producing iconic aircraft like the Chipmunk and Beaver. <strong>The company transitioned from British ownership to Canadian to American</strong>, ultimately landing under Longview&#x27;s umbrella.",
    "published": "February 21, 2024"
  },
  {
    "title": "de Havilland Canada (1928–1986) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada_(1928–1986)",
    "snippet": "The aircraft company was established ... World War, designed and produced indigenous designs. <strong>In the 1980s, the Government of Canada privatized DHC and in 1986 sold the aircraft company to then Seattle-based Boeing</strong>, which renamed the company to Boeing of Canada Ltd., marking ...",
    "published": "November 1, 2025"
  }
]