[
  {
    "title": "Madison Square Garden - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Madison_Square_Garden",
    "snippet": "It is close to other midtown Manhattan landmarks, including the Empire State Building, Koreatown and Macy&#x27;s at Herald Square. It is home to the New York Rangers of the National Hockey League (NHL), the New York Knicks of the National Basketball Association (NBA) and was home to the New York Liberty of the Women&#x27;s National Basketball Association (WNBA) from 1997 to 2017.",
    "published": "2 weeks ago"
  },
  {
    "title": "New York Knicks - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_York_Knicks",
    "snippet": "The Knicks compete in the National Basketball Association (NBA) as a member of the Atlantic Division of the Eastern Conference. The team plays its home games at <strong>Madison Square Garden</strong>, an arena they share with the New York Rangers of the National Hockey League (NHL).",
    "published": "5 days ago"
  },
  {
    "title": "New York Knicks 2025-2026 Home Game Schedule & Tickets | Ticketmaster",
    "url": "https://www.ticketmaster.com/new-york-knicks-tickets/artist/805988?home_away=home",
    "snippet": "Thursday 12:00 PMThu12:00 PMOpen additional information for New York, NY, <strong>Madison Square Garden</strong>, New York Knicks vs. Cleveland Cavaliers12/25/25, 12:00 PMNew York, NY<strong>Madison Square Garden</strong>New York Knicks vs.",
    "published": "1 week ago"
  },
  {
    "title": "New York Knicks Tickets & 2025 Knicks Games | Vivid Seats",
    "url": "https://www.vividseats.com/new-york-knicks-tickets--sports-nba-basketball/performer/602",
    "snippet": "The Knicks play home games at the <strong>Madison Square Garden</strong>. Vivid Seats has New York Knicks parking tickets for New York Knicks home games at the <strong>Madison Square Garden</strong> or away games.",
    "published": null
  },
  {
    "title": "Where Do The New York Knicks Play?",
    "url": "https://www.elitesportstours.ca/where-do-the-new-york-knicks-play-basketball",
    "snippet": "Where Do The New York Knicks Play? <strong>Madison Square Garden</strong>, known as The Garden or as MSG, is a legendary multi-purpose indoor arena in New York City.",
    "published": null
  }
]