[
  {
    "title": "Omar al-Bashir - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Omar_al-Bashir",
    "snippet": "He was later elected president (with a five-year term) in the 1996 national election, where he was the only candidate legally allowed to run for election. Omar al-Bashir was elected president (with a five-year term) in the 1996 national election and <strong>Hassan al-Turabi</strong> was elected to a seat in ...",
    "published": "4 days ago"
  },
  {
    "title": "Sudan after Omar al-Bashir’s overthrow | The Political Studies ...",
    "url": "https://www.psa.ac.uk/psa/news/sudan-after-omar-al-bashir’s-overthrow",
    "snippet": "For the first time in 30 years Sudan is no longer governed by Omar Al-Bashir. He faces instead a war crimes tribunal for crimes against humanity, either in the Sudan itself, or in The Hague at the",
    "published": null
  },
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Nimeiry, the leader of the newly ... al-Mirghani succeeded to the relatively powerless position of Chairman of the Supreme Council in 1986, after multi-party election held that year. He was deposed in a 1989 military coup led by Lieutenant-General Omar al-Bashir....",
    "published": "1 week ago"
  },
  {
    "title": "Omar al-Bashir brutalised Sudan – how his 30-year legacy is playing out today",
    "url": "https://theconversation.com/omar-al-bashir-brutalised-sudan-how-his-30-year-legacy-is-playing-out-today-204391",
    "snippet": "But their hopes were dashed in October 2021 when <strong>Abdel Fattah al-Burhan</strong> led a coup against his civilian counterparts in the transitional government. In the latest round of conflict that began on 15 April 2023, civil war looms as the security ...",
    "published": "November 7, 2025"
  },
  {
    "title": "Sudan coup: Why Omar al-Bashir was overthrown",
    "url": "https://www.bbc.com/news/world-africa-47852496",
    "snippet": "<strong>Lt Gen Abdel Fattah Abdelrahman Burhan</strong> was then named as head of the transitional military council, to become Sudan&#x27;s third leader in as many days. According to the foreign ministry, Gen Burhan is &quot;committed to having a complete civilian government&quot;.",
    "published": "April 15, 2019"
  }
]