[
  {
    "title": "DFG - German Research Foundation",
    "url": "https://www.dfg.de/en",
    "snippet": "The political breakthrough achieved in the negotiations strengthens Europe as a research hub and opens up new pathways towards climate-resilient and resource-efficient agriculture, says DFG President <strong>Katja Becker</strong>.",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - DFG Office North America",
    "url": "https://www.dfg.de/en/about-us/international-cooperation/dfg-abroad/north-america",
    "snippet": "DFG President <strong>Katja Becker</strong> in virtual conversation with NSF Director Sethuraman Panchanathan (clockwise from top left) Dr. <strong>Katja Becker</strong>, Dr. Sethuraman Panchanathan, Dr. Georg Bechtold, Dr.",
    "published": null
  },
  {
    "title": "German Research Foundation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/German_Research_Foundation",
    "snippet": "The DFG is a member of the International Council for Science and has numerous counterparts around the globe such as the National Natural Science Foundation of China, the National Science Foundation (US) and the Royal Society (UK). The DFG has several representative offices in Asia, North America and Europe and also maintains the Sino-German Center for Research Promotion, which was jointly founded by the DFG and the National Natural Science Foundation of China.",
    "published": "October 2, 2025"
  },
  {
    "title": "KIT - KIT - People - German Research Foundation (DFG)",
    "url": "https://www.kit.edu/kit/english/10633.php",
    "snippet": "The German Research Foundation (Deutsche Forschungsgemeinschaft, DFG) is the self-governing organisation for the funding and promotion of science and research in Germany. The DFG receives the large majority of its funds from the federal government and the states.",
    "published": null
  },
  {
    "title": "German Research Foundation (DFG) | Strategic Partnership for Health Security and Emergency Preparedness (SPH) Portal",
    "url": "https://extranet.who.int/sph/german-research-foundation-dfg",
    "snippet": "It serves all branches of science and the humanities. In organisational terms, the DFG is an association under private law. Its membership consists of German research universities, non-university research institutions, scientific associations and the Academies of Science and the Humanities.",
    "published": null
  }
]