[
  {
    "title": "List of Arsenal F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Arsenal_F.C._managers",
    "snippet": "On 29 November 2019, with Arsenal ... as interim head coach. In December 2019, Arsenal appointed former club captain <strong>Mikel Arteta</strong> as the new head coach....",
    "published": "6 days ago"
  },
  {
    "title": "Arsenal Coaching Staff | Team Behind the Team",
    "url": "https://www.arsenalinsider.com/club/coaching-staff/",
    "snippet": "Arsenal’s coaching staff for the 2025/26 season under <strong>Mikel Arteta</strong> is a close-knit group. But who features among the Spaniard’s small clutch of experts in the Emirates Stadium dugout?",
    "published": "July 8, 2025"
  },
  {
    "title": "Renée Slegers appointed head coach | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/renee-slegers-appointed-head-coach",
    "snippet": "We’re delighted to announce that <strong>Renée Slegers</strong> has been appointed as our permanent head coach. Renée, who has signed a contract through to the end of the 2025/26 season, took charge of our women’s first team in October 2024 on an interim basis.",
    "published": null
  },
  {
    "title": "Why Arsenal hired Renee Slegers as their new head coach – consistency, solidity and ruthlessness - The Athletic",
    "url": "https://www.nytimes.com/athletic/6066264/2025/01/18/why-arsenal-hired-renee-slegers-as-head-coach/",
    "snippet": "This week, that photo, which showed former head coach Jonas Eidevall with last season’s Arsenal squad, was replaced. ... In its place is a new photo showing Renee Slegers and Alessia Russo holding their Women’s Super League manager, player and goal of the month awards for December, surrounded by the playing squad and 27 members of backroom staff",
    "published": "January 18, 2025"
  },
  {
    "title": "Mikel Arteta joining as our new head coach | Club announcement | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/mikel-arteta-joining-our-new-head-coach",
    "snippet": "We&#x27;re delighted to announce <strong>Mikel Arteta</strong> is joining the club as our head coach on Sunday. Mikel, a former club captain, played for us for five seasons from 2011 to 2016 and has signed a three-and-a-half year contract.",
    "published": null
  }
]