[
  {
    "title": "Konstantinos Tasoulas - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Konstantinos_Tasoulas",
    "snippet": "Konstantinos Tasoulas (Greek: Κωνσταντίνος Τασούλας [konstaˈdinos taˈsulas]; born 17 July 1959) is a Greek politician and lawyer who has served as the president of the Hellenic Republic since 13 March 2025. He previously served as President of the Hellenic Parliament from 2019 to 2025.",
    "published": "3 weeks ago"
  },
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "After the plebiscite, he was succeeded by the first elected president, <strong>Michail Stasinopoulos</strong>. A new constitution, promulgated on 11 June 1975, declared Greece a presidential parliamentary democracy (or republic – the Greek δημοκρατία can be translated both ways).",
    "published": "2 weeks ago"
  },
  {
    "title": "CVs",
    "url": "https://www.hellenicparliament.gr/en/vouleftes/viografika-stoicheia/?MPId=29514a2b-4306-4629-a36a-d88ab7d66ff2",
    "snippet": "He was the Chairperson of the Export Promotion Agency from 1990 to 1993. He was elected on the municipal council of the Municipality of Kifissia in 1990. In 1994 he was elected Mayor of Kifissia. In June 2013 he was named President of the Konstantinos Karamanlis Institute for Democracy.",
    "published": null
  },
  {
    "title": "Konstantinos Tasoulas Sworn In as the New President of Greece - GreekReporter.com",
    "url": "https://greekreporter.com/2025/03/13/konstantinos-tasoulas-sworn-in-president-greece/",
    "snippet": "Konstantinos Tasoulas was sworn in as the new President of Greece succeeding <strong>Katerina Sakellaropoulou</strong>, Greece&#x27;s first woman president.",
    "published": "March 13, 2025"
  },
  {
    "title": "Greek PM Chooses Parliament Speaker as Ruling Party's Presidential Candidate | Balkan Insight",
    "url": "https://balkaninsight.com/2025/01/15/greek-pm-chooses-parliament-speaker-as-ruling-partys-presidential-candidate/",
    "snippet": "As parliament readies to elect ... acceptance&quot; who has conducted his role in parliament &quot;impeccably&quot;. President <strong>Katerina Sakellaropoulo</strong> (right), Prime Minister Kyriakos Mitsotakis (left) and Speaker of Parliament Konstantinos ...",
    "published": "January 15, 2025"
  }
]