[
  {
    "title": "Mediocredito Centrale 2025 Company Profile: Valuation, Funding & Investors | PitchBook",
    "url": "https://pitchbook.com/profiles/company/62465-14",
    "snippet": "The deal was made on 28-Oct-2025. To view Mediocredito Centrale’s complete investments and acquisitions history, request access » ... Mediocredito Centrale was founded in 1952. Mediocredito Centrale is headquartered in Rome, Italy. Mediocredito Centrale has 435 total employees. Mediocredito Centrale’s primary industry is Specialized Finance. Mediocredito Centrale is a Private company. The current revenue for Mediocredito Centrale is .",
    "published": null
  },
  {
    "title": "Mediocredito Centrale|Invitalia",
    "url": "https://www.invitalia.it/en/chi-siamo/il-gruppo/mediocredito-centrale",
    "snippet": "Mediocredito Centrale - Banca del Mezzogiorno was acquired by <strong>Invitalia</strong> in August 2017 to develop synergies with the offer of incentives to enterprises and to promote growth policies.",
    "published": null
  },
  {
    "title": "Banca del Mezzogiorno – MedioCredito Centrale - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banca_del_Mezzogiorno_–_MedioCredito_Centrale",
    "snippet": "Banca del Mezzogiorno – MedioCredito Centrale (BdM-MCC) is an Italian bank based in Rome, Lazio region. The bank is entirely controlled by <strong>Invitalia S.p.A.</strong>, which in turn is owned by the Ministry of Economy. The bank was specialized in medium-term loan to companies, which developed into corporate ...",
    "published": "April 5, 2025"
  },
  {
    "title": "Mediocredito Centrale SpA",
    "url": "https://www.vitale-co.com/en/transactions/mediocredito-centrale-s-p-a.html",
    "snippet": "Mediocredito Centrale S.p.A. ... ... and <strong>Banca del Fucino S.p.A. (“BdF”) announce that they have signed, at the headquarters of Invitalia, the sale and purchase agreement for the transfer of the 85.3% stake held by MCC in Cassa di Risparmio di Orvieto S.p.A.</strong>...",
    "published": null
  },
  {
    "title": "Mediocredito Centrale Company Overview, Contact Details & Competitors | LeadIQ",
    "url": "https://leadiq.com/c/mediocredito-centrale/6010f38f881cc9057f4bc493",
    "snippet": "Mediocredito Centrale, <strong>controllata da Invitalia</strong>, da impulso alla crescita del Paese sostenendo le Persone e le Imprese, puntando sui settori strategici per lo sviluppo e l’occupazione, impegnandosi nel rilancio delle aree del Mezzogiorno. Nel 2021 siamo diventati un Gruppo bancario a seguito ...",
    "published": null
  }
]