[
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | Stanford Online",
    "url": "https://online.stanford.edu/schools-centers/stanford-institute-human-centered-artificial-intelligence-hai",
    "snippet": "Stanford <strong>founded the Institute for Human-Centered AI in 2019</strong> to guide and build the future of AI.HAI advances AI research, education, policy and practice to improve the human condition.",
    "published": "October 17, 2024"
  },
  {
    "title": "Stanford",
    "url": "https://hai.stanford.edu/",
    "snippet": "Unless we tap into the full gamut of disciplinary expertise we cannot hope to realize the potential of the technology while avoiding its pitfalls. ... HAI was <strong>established to support innovative AI research that bridges disciplines and fields</strong>. The Institute aims to appoint and support promising ...",
    "published": null
  },
  {
    "title": "At five years old, Institute for Human-Centered AI looks to the future",
    "url": "https://stanforddaily.com/2024/11/05/stanford-hai-five-years/",
    "snippet": "This year, the Stanford Institute for Human-Centered Artificial Intelligence (HAI) celebrated the fifth year since its founding. Looking forward, the institute aims to continue fostering a better understanding of artificial intelligence’s (AI) impacts on society.",
    "published": "November 5, 2024"
  },
  {
    "title": "Human-Centered Artifical Intelligence | Stanford Momentum",
    "url": "https://momentum.stanford.edu/initiatives/human-centered-artificial-intelligence",
    "snippet": "The RAISE Health initiative, a partnership between Stanford Medicine and HAI, promotes ethical AI use in health care by fostering collaboration, sharing resources, and establishing standards for safe, equitable practices. During the COVID-19 pandemic, the Stanford Center for Artificial Intelligence in Medicine and Imaging (AIMI), led by HAI Senior Fellow Curt Langlotz, developed AI models to detect COVID-19 from chest X-rays and CT scans.",
    "published": null
  },
  {
    "title": "Stanford University centers and institutes - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stanford_University_centers_and_institutes",
    "snippet": "HAI&#x27;s mission is to advance AI research that prioritizes human well-being, fostering collaboration across disciplines to ensure AI is developed ethically and inclusively. In its first five years, HAI has directed over $40 million into AI research, supported over 300 scholars, and launched specialized centers like the Stanford Digital Economy Lab and the Center for Research on Foundation Models. The institute has also fostered partnerships with policymakers and industry leaders, advocating for the democratization of AI research.",
    "published": "October 16, 2025"
  }
]