[
  {
    "title": "Governor Brian P. Kemp Office of the Governor",
    "url": "https://gov.georgia.gov/",
    "snippet": "Governor <strong>Brian P.</strong>",
    "published": null
  },
  {
    "title": "Governor of Georgia - Ballotpedia",
    "url": "https://ballotpedia.org/Governor_of_Georgia",
    "snippet": "Georgia has a Republican triplex. The Republican Party controls the offices of governor, secretary of state, and attorney general. See also: Georgia State Legislature, Georgia House of Representatives, Georgia State Senate ... The current Governor of Georgia is <strong>Brian Kemp (R).</strong>",
    "published": null
  },
  {
    "title": "2026 Georgia gubernatorial election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2026_Georgia_gubernatorial_election",
    "snippet": "Republicans also control both the state senate and house of representatives, together with Kemp&#x27;s governorship establishing a government trifecta, alongside complete Republican pick on the state&#x27;s supreme court. A year prior to the elections, the 2025 Georgia Public Service Commission special election resulted in two Democrats being elected to the Commission.",
    "published": "5 days ago"
  },
  {
    "title": "Brian Kemp - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Brian_Kemp",
    "snippet": "There was speculation that he would run in the 2026 United States Senate election in Georgia to challenge incumbent senator Jon Ossoff; in May 2025, he declined to run and endorsed <strong>Derek Dooley</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "About Governor Brian P. Kemp | Governor Brian P. Kemp Office of the Governor",
    "url": "https://gov.georgia.gov/about-us/about-governor-brian-p-kemp",
    "snippet": "A native of Athens, Georgia, <strong>Brian Kemp</strong> started his first small business over 35 years ago with a pickup truck and a shovel. His experience as a small business owner has driven his mission to put hardworking Georgians first since taking office ...",
    "published": "August 7, 2019"
  }
]