[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "An absolute majority is sufficient for approval in any vote, except for Statute revision which requires a two-thirds majority. An equality of votes is resolved by the vote of the President of the Union. ... Since 1922, the IAU General Assembly meets every three years, except for the period between 1938 and 1948, due to World War II.",
    "published": "3 weeks ago"
  },
  {
    "title": "Presidency — International Association of Universities",
    "url": "https://iau.global/presidency",
    "snippet": "Read the President’s Message here. IAU President 2016-2022 Pam Fredmam and IAU President 2022-2026 <strong>Andrew Deeks</strong>",
    "published": null
  },
  {
    "title": "2025 IAU Election Results and New Council Announcement - IAU - International Association of Ultrarunners",
    "url": "https://iau-ultramarathon.org/2025-iau-election-results-and-new-council-announcement.html",
    "snippet": "<strong>Nadeem Khan</strong> was re-elected as President, while Jacek Bedkowski and Robert Boyce assume new roles as Vice President and Treasurer, respectively. Hilary Walker was re-elected and continues as General Secretary.",
    "published": "October 17, 2025"
  },
  {
    "title": "Governance Structure - IAU",
    "url": "https://www.iau-aiu.net/Governance-Structure",
    "snippet": "The Executive Committee is composed of the President and four Vice-Presidents (representing each region of the world). It meets twice a year. The vice-presidents are designated by the President from among the Administrative Board members and their nomination is approved by the Administrative Board.",
    "published": null
  },
  {
    "title": "Executive Committee",
    "url": "https://www.iau.org/Iau/Iau/About/Governance-Overview/Executive-Committee.aspx",
    "snippet": "Welcome to the New IAU Environment! Thank you for your patience as we continue to build our site. The Executive Committee consists of the President of the Union, the President-Elect, six Vice-Presidents , the General Secretary, and the Assistant General Secretary elected by the General Assembly on the proposal of the Special Nominating Committee (SNC) .",
    "published": null
  }
]