[
  {
    "title": "Konstantinos Tasoulas - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Konstantinos_Tasoulas",
    "snippet": "After four rounds of voting, he was elected by the parliament on <strong>12 February 2025</strong>, after winning the votes 160 of 300 MPs. He was sworn in on 13 March 2025. Tasoulas is married to Fani Stathopoulou and they have two children.",
    "published": "1 month ago"
  },
  {
    "title": "Presidential Election 2025 Greece",
    "url": "https://www.robert-schuman.eu/en/monitor/6474-konstantinos-tasoulas-is-elected-president-of-greece",
    "snippet": "Author of the European Elections ... (New Democracy, ND) won the Greek presidential election in the 4th round of voting on <strong>12 February</strong> with 160 votes....",
    "published": null
  },
  {
    "title": "Konstantinos Tasoulas becomes Greece's new president after 4th parliamentary vote",
    "url": "https://www.aa.com.tr/en/europe/konstantinos-tasoulas-becomes-greeces-new-president-after-4th-parliamentary-vote/3479656",
    "snippet": "Giannitsis received 34 votes, Katseli 29, and Kyriakou 14, while 39 lawmakers abstained. Having won the election, Tasoulas is set to be sworn in on <strong>March 13,</strong> succeeding Sakellaropoulou.",
    "published": null
  },
  {
    "title": "Greece Elects New President Despite MPs' Walkout Over Train Crash | Balkan Insight",
    "url": "https://balkaninsight.com/2025/02/12/greece-elects-new-president-despite-mps-walkout-over-train-crash/",
    "snippet": "Konstantinos Tasoulas (centre) at parliament in Athens, <strong>March 2020.</strong> Photo: EPA-EFE/THANASSIS STAVRAKIS/POOL · Greece’s parliament on Wednesday elected former parliamentary speaker Konstantinos Tasoulas, the candidate of the ruling New Democracy ...",
    "published": "February 12, 2025"
  },
  {
    "title": "Veteran conservative politician sworn in as Greece’s new president",
    "url": "https://www.aa.com.tr/en/europe/veteran-conservative-politician-sworn-in-as-greece-s-new-president/3508722",
    "snippet": "Former Greek President Katerina Sakellaropoulou (C-R) stands next to the newly sworn-in Greek President Konstantinos Tasoulas (C-L) at the presidential palace in Athens, Greece on <strong>March 13, 2025</strong>.",
    "published": null
  }
]