[
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "Abdel Fattah al-Burhan Abdelrahman al-Burhan (born 1960) is a Sudanese military officer who has been the de facto leader of Sudan since 2019. Following the Sudanese Revolution in April 2019, he was <strong>handed control of the military junta, the Transitional Military Council</strong>, a day after it was formed, ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Who is al-Burhan, Sudan’s military de facto head of state? | Politics News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2023/4/16/who-is-al-burhan-sudans-military-de-facto-head-of-state",
    "snippet": "By 2019, al-Burhan had travelled to Jordan and Egypt for further military training and had become <strong>chief of staff of the Sudanese army</strong> – a position to which he was promoted in February 2018.",
    "published": "April 16, 2023"
  },
  {
    "title": "Abdel Fattah al-Burhan facts for kids",
    "url": "https://kids.kiddle.co/Abdel_Fattah_al-Burhan",
    "snippet": "Abdel Fattah al-Burhan (born 1960) is a top army general in Sudan. He has been the main leader of Sudan since 2019. After a big change in Sudan in April 2019, he <strong>took charge of the country&#x27;s military leaders</strong>.",
    "published": null
  },
  {
    "title": "Burhan",
    "url": "https://grokipedia.com/page/Burhan",
    "snippet": "Abdel Fattah Abdelrahman al-Burhan (born 11 July 1960) is a Sudanese Army general who has served as <strong>de facto head of state</strong> since 2019, initially heading the Transitional Military Council and subsequently the Transitional Sovereign Council after ...",
    "published": null
  },
  {
    "title": "Is Gen Abdel Fattah Al Burhan beholden to Sudan's Islamists? | The National",
    "url": "https://www.thenationalnews.com/news/mena/2025/11/28/is-gen-abdel-fattah-al-burhan-beholden-to-sudans-islamists/",
    "snippet": "In reality, contend Mr Al Mirghani and other analysts, Gen Al Burhan is the <strong>architect of the return of the Islamists to the public sphere</strong> after their patron Al Bashir was toppled by the military in 2019 amid a popular uprising against his regime.",
    "published": "3 weeks ago"
  }
]