[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "On 21 December 2012, <strong>Discovery Communications purchased a 20 per cent minority interest share in Eurosport from TF1 Group for €170m</strong>. Discovery became the majority shareholder in the Eurosport venture with TF1 in January 2014, taking a 51% share of the company.",
    "published": "2 days ago"
  },
  {
    "title": "Discovery takes full ownership of Eurosport from TF1 Group | Reuters",
    "url": "https://www.reuters.com/article/world/europe/discovery-takes-full-ownership-of-eurosport-from-tf1-group-idUSKCN0PW1YS/",
    "snippet": "<strong>Discovery Communications Inc said on Wednesday it would take full ownership of sports broadcaster Eurosport for 491 million euros ($534 million)</strong> from French media group TF1 Group.",
    "published": "July 22, 2015"
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "Discovery took a 20% minority interest share in December 2012, and became majority shareholder in the Eurosport venture with TF1 in January 2014, taking a 51% share of the company, <strong>On 22 July 2015 Discovery agreed to acquire TF1&#x27;s remaining 49% stake in the venture</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Acquisition of the Eurosport group by Discovery Communications | Groupe TF1 : actualités, communiqués, agenda, événements, publications",
    "url": "https://groupe-tf1.fr/en/communiques/acquisition-eurosport-group-discovery-communications",
    "snippet": "Acquisition of the Eurosport group by Discovery Communications The TF1 group and Discovery Communications today confirm completion of: the acquisition by Discovery Communications of a 49% equity interest in the Eurosport group, which is now <strong>100% owned by Discovery Communications</strong>; the buyout ...",
    "published": null
  },
  {
    "title": "Discovery takes full ownership of Eurosport | Reuters",
    "url": "https://www.reuters.com/article/business/discovery-takes-full-ownership-of-eurosport-idUSL3N1024U6/",
    "snippet": "July 22 (Reuters) - <strong>Discovery Communications Inc said on Wednesday it would take full ownership of sports broadcaster Eurosport for 491 million euros ($534 million)</strong> from French media group TF1 Group.",
    "published": "July 22, 2015"
  }
]