[
  {
    "title": "Denys Shmyhal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Denys_Shmyhal",
    "snippet": "As Prime Minister, Shmyhal was in charge of handling the response to the COVID-19 pandemic in Ukraine and conducting the defense of Ukraine during the 2022 Russian invasion. On <strong>15 July 2025</strong>, Shmyhal submitted his resignation, a day after President Volodymyr Zelenskyy announced a government ...",
    "published": "November 11, 2025"
  },
  {
    "title": "Ukrainian PM Denys Shmyhal resigns, paving way for government reshuffle | Euronews",
    "url": "https://www.euronews.com/my-europe/2025/07/15/ukrainian-pm-denys-shmyhal-resigns-paving-way-for-government-reshuffle",
    "snippet": "&quot;<strong>I am tendering my resignation from the post of the Prime Minister of Ukraine</strong>,&quot; Denys Shmyhal wrote in a letter posted on his Telegram page.",
    "published": "July 20, 2025"
  },
  {
    "title": "Ukrainian premier resigns amid reports of replacement",
    "url": "https://www.aa.com.tr/en/europe/ukrainian-premier-resigns-amid-reports-of-replacement/3631461",
    "snippet": "Shmyhal said he had submitted a formal resignation request to Ukraine’s Verkhovna Rada (parliament) and expressed gratitude to President Volodymyr Zelenskyy for his trust. According to media reports, Shmyhal is expected to take over as Ukraine’s defense minister, while current Defense Minister Rustem Umerov will be appointed ambassador to the US.",
    "published": null
  },
  {
    "title": "Five Years Leading the Cabinet: What Denys Shmyhal’s Government Delivered",
    "url": "https://voxukraine.org/en/five-years-leading-the-cabinet-what-denys-shmyhal-s-government-delivered",
    "snippet": "<strong>On July 16, the Verkhovna Rada of Ukraine voted to dismiss the government led by Denys Shmyhal</strong>. This was the second Cabinet during the presidency of Volodymyr Zelensky and the longest-serving government in the history of independent Ukraine.",
    "published": null
  },
  {
    "title": "Shmyhal Government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Shmyhal_Government",
    "snippet": "On 3 March 2020, Prime Minister Oleksiy Honcharuk tendered his resignation, and by law this triggered the automatic resignation of the Honcharuk Government. In his 4 March 2020 address to the parliament, Zelenskyy expressed his hope for a stronger government, and that day Honcharuk was dismissed by the Verkhovna Rada (Ukraine&#x27;s parliament) and Denys Shmyhal was appointed prime minister.",
    "published": "November 18, 2025"
  }
]