[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "The service combined video, text and graphics with the screen divided into 4 parts: a video section displaying highlights and news bulletins, a breaking news ticker at the bottom and a scoring section for in-depth analysis of results and game stats. Eurosport EPL Romania was a channel owned by Eurosport, which broadcast the English Premier League in Romania.",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport International 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/63601-30",
    "snippet": "Information on acquisition, funding, investors, and executives for Eurosport International. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Discovery takes full ownership of Eurosport | Reuters",
    "url": "https://www.reuters.com/article/business/discovery-takes-full-ownership-of-eurosport-idUSL3N1024U6/",
    "snippet": "<strong>Discovery Communications Inc said on Wednesday it would take full ownership of sports broadcaster Eurosport for 491 million euros ($534 million) from French media group TF1 Group</strong>.",
    "published": "July 22, 2015"
  },
  {
    "title": "Eurosport",
    "url": "https://www.pentagram.com/work/eurosport/story",
    "snippet": "The rebrand follows Discovery’s acquisition of Eurosport which after it bought a majority stake in the sports destination in May 2014 and was completed in a €491m deal in October 2015.",
    "published": null
  },
  {
    "title": "Warner Bros. Discovery - Discovery Communications Agrees to Take Full Control of Eurosport",
    "url": "https://ir.corporate.discovery.com/news-and-events/financial-news/financial-news-details/2015/Discovery-Communications-Agrees-to-Take-Full-Control-of-Eurosport/default.aspx",
    "snippet": "(Silver Spring, Md.) – <strong>Discovery Communications (Nasdaq: DISCA, DISCB, DISCK) today announced an agreement to acquire full ownership of Eurosport</strong>, the leading sports channels group across Europe and Asia, for €491 million from TF1 Group, which has announced it will exercise a put option ...",
    "published": null
  }
]