[
  {
    "title": "Josep Borrell - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Josep_Borrell",
    "snippet": "In July 2019, Borrell was announced as the European Council&#x27;s nominee to be appointed High Representative of the Union for Foreign Affairs and Security Policy. He took office in December 2019. Josep (or José) Borrell Fontelles was born on 24 April 1947 in the Catalan village of La Pobla de Segur, province of Lleida, near the Pyrenees, son of Joan Borrell (father) and Luisa Fontelles Doll (mother).",
    "published": "1 month ago"
  },
  {
    "title": "Josep Borrell - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q312901",
    "snippet": "Catalan-Spanish diplomat and politician (born 1947)",
    "published": null
  },
  {
    "title": "Who’s going to be the EU’s next top diplomat?",
    "url": "https://www.politico.eu/article/eus-top-diplomat-race-crowded-job-politics-european-comission-policy/",
    "snippet": "The high representative of the Union for foreign affairs and security policy and vice president of the European Commission chairs regular meetings of the EU’s 27 foreign, defense and development ministers, and represents the EU at G7 and G20 ministerial meetings. At the moment, the role is held by Spain’s Josep Borrell, who won’t be coming back.",
    "published": "June 7, 2024"
  },
  {
    "title": "Josep Borrell’s final days at the head of European security | International | EL PAÍS English",
    "url": "https://english.elpais.com/international/2024-12-07/josep-borrells-final-days-at-the-head-of-european-security.html",
    "snippet": "On December 1 he left his position. His successor, <strong>Kaja Kallas</strong>, will seek to build a European defense system · Tallinn, Estonia, July 2024. EU High Representative for Foreign Affairs and Security Policy Josep Borrell meets with his successor, <strong>Kaja Kallas</strong>.James Rajotte",
    "published": "December 7, 2024"
  },
  {
    "title": "EU nominations 2019: Who is Josep Borrell?",
    "url": "https://www.dw.com/en/eu-nominations-2019-who-is-spains-josep-borrell/a-49453057",
    "snippet": "He entered politics in 1979 as a city councillor on the outskirts of Madrid, before being appointed to a post in the economy ministry and then election to the Congress of Deputies for Barcelona in 1986. He was named candidate for Spanish elections in 2000 but gave it up after two people he had appointed while at the finance ministry were implicated in a financial scandal over property purchases. He became president of the European Parliament in July 2004 and held the post until January 2007.",
    "published": "July 4, 2019"
  }
]