[
  {
    "title": "Prime Minister of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Saudi_Arabia",
    "snippet": "The prime minister is always either the king of Saudi Arabia or crown prince of Saudi Arabia. <strong>Prince Mohammed bin Salman</strong> has been the prime minister since 27 September 2022. The office was created along with the Council of Ministers on 9 October 1953, by decree of King Saud.",
    "published": "November 10, 2025"
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing - HOG",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?OpenForm=&ExpandView=&RestrictToCategory=Saudi+Arabia",
    "snippet": "The Heads of Government listing is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers and in some cases, ministers responsible for development assistance.",
    "published": null
  },
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "<strong>Mohammed bin Salman</strong> (born August 31, 1985) is the de facto ruler of Saudi Arabia, known for his aggressive foreign policy, ambitious economic vision, and controversial social reforms.",
    "published": "July 17, 2019"
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "In October 2017, Mohammed said that the ultra-conservative Saudi state had not been &quot;normal&quot; for the past 30 years, blaming rigid doctrines that had governed society in a reaction to the Iranian Revolution, which successive leaders &quot;didn&#x27;t know how to deal with&quot;. He stated that he aimed to have Saudi Arabia start &quot;returning to what we were before—a country of moderate Islam that is open to all religions and to the world&quot;. This amounted to telling the country&#x27;s clerics that the deal the royal family struck with them after the Grand Mosque seizure was to be renegotiated.",
    "published": "11 hours ago"
  },
  {
    "title": "Saudi Leadership",
    "url": "https://www.mofa.gov.sa/en/ksa/Pages/leadership.aspx",
    "snippet": "موقع وزارة الخارجية | المملكة العربية السعودية English About Kingdom Saudi Leadership",
    "published": null
  }
]