[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Jesse Ventura (born James George Janos; July 15, 1951) is an American politician, political commentator, actor, media personality, and retired professional wrestler. After achieving fame in the World Wrestling Federation (WWF, now WWE), he <strong>served as the 38th governor of Minnesota from 1999 to 2003.</strong>",
    "published": "3 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Jesse Ventura was the <strong>Governor of Minnesota</strong>. Ventura assumed office on January 8, 1999. Ventura left office on January 6, 2003. Ventura (Green Party of Alaska, Unaffiliated) ran for election for President of the United States. Ventura (Green Party of Alaska) lost in the general election on ...",
    "published": null
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was <strong>elected the 38th Governor of Minnesota</strong> on November 3, 1998 defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He served as Governor for one term. Shocking the political establishment, Ventura became the only Reform Party candidate to ...",
    "published": null
  },
  {
    "title": "Governorship of Jesse Ventura | MNopedia",
    "url": "https://www.mnhs.org/mnopedia/search/index/event/governorship-jesse-ventura",
    "snippet": "In November 1998 Jesse Ventura, a former professional wrestler and sometime movie actor, was <strong>elected governor of Minnesota</strong> after defeating the much better-known and better-financed candidates of the two traditional major parties.",
    "published": "April 14, 2025"
  },
  {
    "title": "Jesse Ventura | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/jesse-ventura",
    "snippet": "Jesse Ventura, born James George Janos on July 15, 1951, is a multifaceted American figure known for his diverse career as a Navy SEAL, professional wrestler, actor, and politician. He served as the <strong>governor of Minnesota from 1999 to 2003</strong>, making ...",
    "published": null
  }
]