[
  {
    "title": "France rushes emergency budget law to avert shutdown after talks collapse | Reuters",
    "url": "https://www.reuters.com/world/french-pm-races-pass-stopgap-budget-law-avoid-shutdown-2025-12-22/",
    "snippet": "[1/2]<strong>French Prime Minister Sebastien Lecornu leaves the Elysee Palace, after a cabinet meeting with President Emmanuel Macron on a special law to allow spending and borrowing into the new year</strong>, after budget talks failed, in Paris, France, December ...",
    "published": "1 day ago"
  },
  {
    "title": "2024–2025 French political crisis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–2025_French_political_crisis",
    "snippet": "On 13 December, <strong>Macron appointed Democratic Movement leader François Bayrou as prime minister</strong>. According to Le Monde, the appointment of Bayrou was decided on at the last minute, with Macron originally telling Bayrou that he would not be named Prime Minister, only to be forced to appoint Bayrou ...",
    "published": "3 days ago"
  },
  {
    "title": "France to build new aircraft carrier, Macron tells troops based in Gulf | Reuters",
    "url": "https://www.reuters.com/world/europe/france-will-build-new-aircraft-carrier-macron-tells-troops-2025-12-21/",
    "snippet": "The French government said <strong>the new vessel would be operational by 2038</strong>, when the Charles de Gaulle aircraft carrier is expected to retire. Work on nuclear propulsion components began last year, and the final order must be placed under the 2025 ...",
    "published": "2 days ago"
  },
  {
    "title": "French government calls for Christmas truce in farmer protests | Reuters",
    "url": "https://www.reuters.com/world/french-government-calls-christmas-truce-farmer-protests-2025-12-19/",
    "snippet": "French farmers with their tractors protest in front of the European Parliament against government measures, including the culling of entire cattle herds, aimed at containing an outbreak of lumpy skin disease among livestock in France, and the EU-Mercosur free trade agreement, in Strasbourg, France, December 17, 2025...",
    "published": "4 days ago"
  },
  {
    "title": "French Politics - World news, culture and opinion",
    "url": "https://www.lemonde.fr/en/politics/",
    "snippet": "Published on December 2, 2025, at 4:00 am (Paris), updated on December 3, 2025, at 5:34 pm Grégoire Biseau Gilles Rof ... <strong>Unions are striking Tuesday to pressure the government as budget talks resume at the Assemblée nationale</strong>.",
    "published": null
  }
]