[
  {
    "title": "David Hurley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley",
    "snippet": "On 16 December 2018, Prime Minister Scott Morrison announced that Queen Elizabeth II had approved the appointment of Hurley as the next Governor-General of Australia, succeeding <strong>Sir Peter Cosgrove</strong>, commencing on 1 July 2019 marking him as the first representative of the monarch who had been ...",
    "published": "October 31, 2025"
  },
  {
    "title": "David Hurley and Related Topics",
    "url": "https://hyperleap.com/topic/David_Hurley",
    "snippet": "Viceregal representative of the Australian monarch, Queen Elizabeth II, in the state of New South Wales. The current governor is retired judge <strong>Margaret Beazley</strong>, who succeeded David Hurley on 2 May 2019.",
    "published": null
  },
  {
    "title": "David Hurley facts for kids",
    "url": "https://kids.kiddle.co/David_Hurley",
    "snippet": "His time as Governor ended in May 2019. He was then chosen by Queen Elizabeth II to be the Governor-General. He started this role in July 2019 and finished in July 2024. <strong>Sam Mostyn</strong> took over from him. ... David ...",
    "published": null
  },
  {
    "title": "Our Patrons",
    "url": "https://www.johnmonash.com/about-us/patrons",
    "snippet": "Ms <strong>Sam Mostyn AC</strong> was sworn in as Australia’s 28th Governor-General on 1 July 2024.",
    "published": null
  },
  {
    "title": "David Hurley - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/David_Hurley",
    "snippet": "On 16 December 2018, it was said that Queen Elizabeth II had allowed Hurley to become the next Governor-General of Australia. This was on the advice of Prime Minister Scott Morrison. He began his term in July 2019. Hurley was born in Wollongong, New South Wales. He is married to Linda. The couple have three children. Wikimedia Commons has media related to David Hurley.",
    "published": "May 3, 2025"
  }
]