[
  {
    "title": "Chairperson Welcomes Appointment of New President of the Federal Democratic Republic of Ethiopia, Commends Tenure of Former President Zewde | African Union",
    "url": "https://au.int/en/pressreleases/20241007/chairperson-welcomes-appointment-new-president-ethiopia",
    "snippet": "The Chairperson further reiterates the continued support of the African Union Commission to the Federal Democratic Republic of Ethiopia&#x27;s journey to deepen the country’s democracy and sustainable development. ... H.E. <strong>Moussa Faki Mahamat</strong> - Former Chairperson ... 2025 Year of Reparations: ...",
    "published": null
  },
  {
    "title": "President of Ethiopia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ethiopia",
    "snippet": "The president of Ethiopia is the head of state of Ethiopia. The position is largely ceremonial with executive power vested in the Council of Ministers chaired by the prime minister. The current president is <strong>Taye Atske Selassie</strong>, who took office on 7 October 2024.",
    "published": "3 weeks ago"
  },
  {
    "title": "List of presidents of Ethiopia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ethiopia",
    "snippet": "Since the formal establishment of the office of president in 1987, there have been 6 official presidents. The president is the head of state of Ethiopia. The current president is <strong>Taye Atske Selassie</strong>, elected on 7 October 2024 by members of the ...",
    "published": "October 22, 2025"
  },
  {
    "title": "Ethiopia's new president: Taye Atske Selassie replaces Sahle-Work Zewde",
    "url": "https://www.bbc.com/news/articles/c4g401e086no",
    "snippet": "Ethiopia&#x27;s parliament has approved ... ceremonial role. In Ethiopia, political power lies with the prime minister - currently <strong>Abiy Ahmed</strong>....",
    "published": "October 7, 2024"
  },
  {
    "title": "Ethiopia picks diplomat as new president",
    "url": "https://www.voanews.com/a/ethiopia-picks-diplomat-as-new-president-/7814398.html",
    "snippet": "Newly appointed Ethiopia&#x27;s President <strong>Taye Atske-Selassie Amde</strong> addresses the parliament after taking his oath at the Parliament Building in Addis Ababa, Oct.",
    "published": "October 8, 2024"
  }
]