[
  {
    "title": "Jean-Luc Mélenchon – POLITICO",
    "url": "https://www.politico.eu/person/jean-luc-melenchon/",
    "snippet": "... Responses to the 96-year-old’s death have become something of a political Rorschach test in France. ... <strong>The Socialists have taken timid steps toward emancipation from far-left firebrand Jean-Luc Mélenchon</strong>.",
    "published": null
  },
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "Mélenchon has been labelled a populist by numerous diverse people, with the Socialist Party senator Luc Carvounas saying he goes to &quot;the summits of demagoguery and populism&quot;, and the magazine Slate stating that Mélenchon&#x27;s rhetoric is &quot;shocking&quot; and implying his entire political life is based around pleasing the people.",
    "published": "2 days ago"
  },
  {
    "title": "Jean-Luc Mélenchon - World news, culture and opinion",
    "url": "https://www.lemonde.fr/en/jean-luc-melenchon/",
    "snippet": "<strong>The Parti Socialiste, which has broken free of radical-left leader Jean-Luc Mélenchon, is not done with its battles</strong>. It will, by 2027, need to win back moderate voters who have shunned it for the past seven years, at a time when PM François ...",
    "published": null
  },
  {
    "title": "Jean-Luc Mélenchon | The Guardian",
    "url": "https://www.theguardian.com/world/jean-luc-melenchon",
    "snippet": "All parties except National Rally and <strong>La France Insoumise</strong> called on by president to show ‘collective responsibility’",
    "published": null
  },
  {
    "title": "The French left is finally eyeing a comeback – POLITICO",
    "url": "https://www.politico.eu/article/france-left-comeback-olivier-faure-jean-luc-melenchon/",
    "snippet": "Mélenchon is “best placed” to beat other left-wing candidates, but he’s “not the best placed to win the presidential election, even against the far right.” · Talks between the left and Bayrou never really took off. | Richard Bouhet/AFP via Getty Images · Socialist Party officials believe the political winds may be shifting in their favor.",
    "published": "January 3, 2025"
  }
]