[
  {
    "title": "President of Georgia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Georgia",
    "snippet": "<strong>Salome Zourabichvili</strong> stated on 29 December and during the following weeks that she remained the president of Georgia. Protests against the ruling party have continued since the election, with hundreds of protesters arrested, beaten or tortured by the police and the ruling-party affiliated violent ...",
    "published": "4 weeks ago"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "Outgoing pro-Western Georgian President <strong>Salome Zourabichvili</strong> said Sunday morning that she would vacate her residence at the Orbeliani Palace in Tbilisi, but insisted she was still the legitimate office holder.",
    "published": "December 29, 2024"
  },
  {
    "title": "The Bitter Standoff Over Georgia's Next President",
    "url": "https://www.rferl.org/a/georgia-president-election-mikheil-kavelashvili-salome-zurabishvili-protests/33237724.html",
    "snippet": "On December 14, an electoral college dominated by the ruling Georgian Dream party is expected to choose <strong>Mikheil Kavelashvili</strong>, a 53-year-old former soccer player and right-wing populist, as Georgia&#x27;s next president.",
    "published": "December 13, 2024"
  },
  {
    "title": "Kavelashvili is inaugurated as Georgia's president, complicating its path toward EU | AP News",
    "url": "https://apnews.com/article/georgia-president-zourabichvili-russia-kavelashvili-215020983cefb6ce1eb2ecad184a9c1e",
    "snippet": "Demonstrators hold red cards outside of the Georgian parliament where the President-elect <strong>Mikheil Kavelashvili</strong>, a former soccer player, takes his oath at the swearing-in ceremony, in Tbilisi, Georgia, Sunday, Dec.",
    "published": "December 30, 2024"
  },
  {
    "title": "2024 Georgian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024_Georgian_presidential_election",
    "snippet": "China: President Xi Jinping congratulated Kavelashvili on his election as President and called it a positive event for the development of China–Georgia relations. Kazakhstan: President Kassym-Jomart Tokayev sent a letter to Kavelashvili, extending New Year greetings and expressing his &quot;best wishes for a joyous and prosperous 2025&quot;.",
    "published": "November 14, 2025"
  }
]