[
  {
    "title": "Anke Domscheit-Berg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anke_Domscheit-Berg",
    "snippet": "<strong>Her mandate ended in 2025 because she did not run for re-election</strong>. Previously, she was a member of the Pirate Party Germany and the Greens. She is married to Daniel Domscheit-Berg.",
    "published": "August 13, 2025"
  },
  {
    "title": "Der nächste Austritt: Auch Anke Domscheit-Berg verlässt die Piratenpartei | FAZ",
    "url": "https://www.faz.net/aktuell/politik/inland/der-naechste-austritt-auch-anke-domscheit-berg-verlaesst-die-piratenpartei-13166068.html",
    "snippet": "<strong>Nach Christopher Lauer verliert die Piratenpartei mit der Netzaktivistin Anke Domscheit-Berg binnen weniger Tage das zweite prominente Gesicht</strong>. Vor allem in der Hauptstadt kämpft die Partei mit einer Austrittswelle.",
    "published": "September 21, 2014"
  },
  {
    "title": "Anke Domscheit-Berg | The Guardian",
    "url": "https://www.theguardian.com/profile/anke-domscheit-berg",
    "snippet": "Anke Domscheit-Berg: You told us: Despite its privacy laws, Germany is the most spied-on country in Europe. The Pirate party is committed to turning this around",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg, chairwoman of the State of Brandenburg Pirate... News Photo - Getty Images",
    "url": "https://www.gettyimages.com/detail/news-photo/anke-domscheit-berg-chairwoman-of-the-state-of-brandenburg-news-photo/180375563",
    "snippet": "Anke Domscheit-Berg, chairwoman of the State of Brandenburg Pirate Party and a candidate for the Bundestag in upcoming general elections, poses prior to speaking to foreign journalists on September...",
    "published": null
  },
  {
    "title": "It's a WikiLife: Anke and Daniel Domscheit-Berg - The Berliner",
    "url": "https://www.the-berliner.com/politics/its-a-wikilife/",
    "snippet": "ANKE: It’s somewhere between 10 and 15 percent. We have the same problem as with women in management in general: a lack of role models. We need more visible women in leadership positions, for other women to think it is possible. Merkel has done that. Recently, more and more great women have been visible in the Pirate Party.",
    "published": "May 20, 2022"
  }
]