[
  {
    "title": "Gerhard Schröder - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gerhard_Schr%C3%B6der",
    "snippet": "Gerhard Fritz Kurt Schröder (German: [ˈɡeːɐ̯haʁt fʁɪts kʊʁt ˈʃʁøːdɐ] ⓘ; born 7 April 1944) is a <strong>German former politician and lobbyist who served as Chancellor of Germany from 1998 to 2005.</strong> From 1999 to 2004, he was also the Leader of the Social Democratic Party of Germany (SPD).",
    "published": "5 days ago"
  },
  {
    "title": "Gerhard Schröder | German Chancellor, Social Democrat | Britannica",
    "url": "https://www.britannica.com/biography/Gerhard-Schroder",
    "snippet": "Gerhard Schröder is a <strong>German politician who was the chancellor of Germany from 1998 to 2005.</strong> Having practiced law in Hannover, Schröder was elected to the Bundestag (lower house of parliament) in 1980 and served there until 1986, when he lost ...",
    "published": "February 1, 2002"
  },
  {
    "title": "Gerhard Schröder - New World Encyclopedia",
    "url": "https://www.newworldencyclopedia.org/entry/Gerhard_Schr%C3%B6der",
    "snippet": "Schröder in Esslingen. &quot;SPD - Trust in Germany&quot; Gerhard Fritz Kurt Schröder (born April 7, 1944), German politician, was <strong>Chancellor of Germany from 1998 to 2005.</strong> A member of the Social Democratic Party of Germany (SPD), he led a coalition government of the SPD and the Greens.",
    "published": null
  },
  {
    "title": "Gerhard Schröder",
    "url": "https://berggruen.org/people/gerhard-schroder",
    "snippet": "Gerhard Schröder, born in Mossenberg (North Rhine-Westfalia) on 7 April 1944, is a <strong>former Chancellor of the Federal Republic of Germany</strong>. He studied at University of Göttingen where he graduated in Law with post-graduate Judicial Clerkship ...",
    "published": null
  },
  {
    "title": "Gerhard Schröder - Geschichte der CDU - Konrad-Adenauer-Stiftung",
    "url": "https://www.kas.de/en/web/geschichte-der-cdu/significant-figures/biogram-detail/-/content/gerhard-schroeder-v1",
    "snippet": "<strong>Gerhard Schröder</strong> wurde am 11. September 1910 als Sohn eines ostfriesischen Reichsbahnbeamten in Saarbrücken geboren. Nach der Versetzung seines Vaters wuchs er in Trier auf.",
    "published": null
  }
]