[
  {
    "title": "Sheikh Abdulaziz bin Abdulrahman Al-Thani Elected President of Umm Salal Club",
    "url": "https://www.qna.org.qa/en/News-Area/News/2024-08/27/0070-sheikh-abdulaziz-bin-abdulrahman-al-thani-elected-president-of-umm-salal-club",
    "snippet": "Doha, August 27 (QNA) - The General Assembly of Umm Salal Club held a meeting, on Tuesday, at its premises and elected HE Sheikh Abdulaziz bin Abdulrahman Al-Thani as <strong>President of Umm Salal Club</strong>, and HE Sheikh Abdulaziz bin Saud Al-Thani as Vice President by acclamation for the electoral 2024-2025 ...",
    "published": null
  },
  {
    "title": "Umm Salal | QSL",
    "url": "https://qsl.qa/en/umm-salal",
    "snippet": "Umm Salal Buy ticket Doha Bank ... bin Abdulrahman Al Thani · Nick Name: Barzan&#x27;s Falcons · Umm Salal Sports Club was <strong>founded in 1979 under the name of Al Tadamun Sports Club</strong>....",
    "published": null
  },
  {
    "title": "Sheikh Abdulaziz bin Abdulrahman Al Thani elected president of Umm Salal Club | The Peninsula Qatar",
    "url": "https://thepeninsulaqatar.com/article/27/08/2024/sheikh-abdulaziz-bin-abdulrahman-al-thani-elected-president-of-umm-salal-club",
    "snippet": "Doha, Qatar: The General Assembly of Umm Salal Club held a meeting today, August 27, at its premises and elected HE Sheikh Abdulaziz bin Abdulrahman Al Thani as <strong>President of Umm Salal Club</strong>, and HE Sheikh Abdulaziz bin Saud Al Thani as Vice President ...",
    "published": "August 27, 2024"
  },
  {
    "title": "Umm Salal SC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Umm_Salal_SC",
    "snippet": "After the dissolution of two other clubs in the second division, Al Tadamun was also dissolved. <strong>The club was reformed in 1996, with Sheikh Abdulaziz bin Abdulrahman Al Thani heading the club</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Sheikh Abdulaziz bin Abdulrahman Elected as President of Umm Salal Club by Acclamation | Ministry of Sports and Youth",
    "url": "https://www.msy.gov.qa/en/news/sheikh-abdulaziz-bin-abdulrahman-elected-as-president-of-umm-salal-club-by-acclamation/",
    "snippet": "<strong>The General Assembly of Umm Salal Club has elected His Excellency Sheikh Abdulaziz bin Abdulrahman Al Thani as President of the club</strong>, and His Excellency Sheikh Abdulaziz bin Saud Al Thani as Vice President by acclamation for the upcoming election cycle (2024-2028).",
    "published": null
  }
]