[
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "UC Santa Cruz Chancellor Cynthia Larive is set to undergo an overdue five-year performance review, part of a standard UC systemwide process led by President James Milliken and faculty leaders. The review comes amid mounting faculty concerns over budget cuts, low morale and leadership communication, following a tumultuous tenure marked by the pandemic, political challenges and campus unrest.",
    "published": "August 22, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Under Chancellor Larive’s leadership, UC Santa Cruz has cemented its place as preeminent research university, with research support now surpassing $200 million annually. She advanced regional economic development by establishing the Innovation and Business Engagement Hub to connect industry with the campus innovation ecosystem.",
    "published": null
  },
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "<strong>On May 16, 2019, Larive was announced as the new chancellor of University of California, Santa Cruz</strong>, succeeding George R.",
    "published": "July 15, 2025"
  },
  {
    "title": "UC Riverside Provost Cynthia K. Larive to become UC Santa Cruz’s 11th chancellor | University of California",
    "url": "https://www.universityofcalifornia.edu/press-room/uc-riverside-provost-cynthia-k-larive-become-uc-santa-cruzs-11th-chancellor",
    "snippet": "Cynthia K. Larive as the <strong>eleventh chancellor of UC Santa Cruz</strong>. Currently the provost and executive vice chancellor at UC Riverside, Larive has served the UC community for nearly a decade and a half as a faculty member, administrator and leader.",
    "published": "November 8, 2021"
  },
  {
    "title": "Cynthia Larive - Chancellor - Univerisity of California Santa Cruz | LinkedIn",
    "url": "https://www.linkedin.com/in/cynthia-larive-83218a8",
    "snippet": "2 others named Cynthia Larive are on LinkedIn See others named Cynthia Larive · See all courses · Include this LinkedIn profile on other websites · Chancellor at Univerisity of California Santa Cruz · Chancellor at Univerisity of California Santa Cruz · University of California, Riverside ·",
    "published": null
  }
]