[
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "We just blogged about a recent project: <strong>the Test-Time Diffusion Deep Researcher (TTD-DR).</strong> This framework uses a Deep Research agent to draft and revise its own drafts using high-quality retrieved information.",
    "published": "1 week ago"
  },
  {
    "title": "Peter Norvig: Today's Most Pressing Questions in AI Are ...",
    "url": "https://hai.stanford.edu/news/peter-norvig-todays-most-pressing-questions-ai-are-human-centered",
    "snippet": "... The AI expert, who joins Stanford HAI as a Distinguished Education Fellow, discusses building inclusive education and broadening access to students. Artificial intelligence expert Peter Norvig is <strong>joining the Stanford Institute for Human-Centered AI this fall as a Distinguished Education Fellow</strong>, ...",
    "published": null
  },
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Norvig is a councilor of the Association for the Advancement of Artificial Intelligence and co-author, with Stuart J. Russell, of Artificial Intelligence: A Modern Approach, now the leading college text in the field.",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Norvig - Stanford HAI",
    "url": "https://hai.stanford.edu/people/peter-norvig",
    "snippet": "Get the latest news, advances in research, policy work, and education program updates from HAI in your inbox weekly. ... Peter Norvig is a Distinguished Education Fellow at Stanford&#x27;s Human-Centered Artificial Intelligence Institute and a researcher at Google Inc; previously he directed Google&#x27;s ...",
    "published": null
  },
  {
    "title": "Dr. Peter Norvig | Stevens Institute of Technology",
    "url": "https://www.stevens.edu/the-presidents-distinguished-lecture-series/dr-peter-norvig",
    "snippet": "But recently, many applications have been created by machine learning: the programmer is replaced by a trainer, who shows the computer examples until it learns to complete the task. This shift in the way software is built is opening up exciting new possibilities and posing new challenges. BIOGRAPHY: Dr. Peter Norvig is Director of Research at Google Inc.",
    "published": null
  }
]