[
  {
    "title": "Greece Elects New President Despite MPs' Walkout Over Train Crash | Balkan Insight",
    "url": "https://balkaninsight.com/2025/02/12/greece-elects-new-president-despite-mps-walkout-over-train-crash/",
    "snippet": "Election by parliament of <strong>Konstantinos Tasoulas</strong> as Greece&#x27;s new president was marred by walk-outs by leftist opposition parties, which accuse him of involvement in an alleged government cover-up over the 2023 Tempi train crash.",
    "published": "February 12, 2025"
  },
  {
    "title": "Presidential Election 2025 Greece",
    "url": "https://www.robert-schuman.eu/en/monitor/6474-konstantinos-tasoulas-is-elected-president-of-greece",
    "snippet": "<strong>Konstantinos Tasoulas</strong> is elected President of Greece",
    "published": null
  },
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "The president of Greece, officially the president of the Hellenic Republic (Greek: Πρόεδρος της Ελληνικής Δημοκρατίας, romanized: Próedros tis Ellinikís Dimokratías), commonly referred to in Greek as the president of the Republic (Πρόεδρος της Δημοκρατίας, Próedros tis Dimokratías, ΠτΔ), is the head of state of Greece.",
    "published": "2 weeks ago"
  },
  {
    "title": "Greek lawmakers elect former parliament speaker Constantine Tassoulas as president | Euronews",
    "url": "https://www.euronews.com/2025/02/12/greek-lawmakers-elect-former-parliament-speaker-constantine-tassoulas-as-president",
    "snippet": "Newly elected President <strong>Constantine Tassoulas</strong> waits to receive the results of the fourth round of voting at the parliament in Athens, 12 February 2025 - AP Photo ... Greek lawmakers have elected a former parliament speaker and leading advocate ...",
    "published": "February 12, 2025"
  },
  {
    "title": "Katerina Sakellaropoulou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Katerina_Sakellaropoulou",
    "snippet": "She was elected by the Hellenic Parliament to succeed <strong>Prokopis Pavlopoulos</strong> on 22 January 2020. Prior to her election as president, Sakellaropoulou served as president of the Council of State, the highest administrative court of Greece.",
    "published": "October 2, 2025"
  }
]