[
  {
    "title": "Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Google",
    "snippet": "Together, they own <strong>about 14% of its publicly listed shares</strong> and control 56% of its stockholder voting power through super-voting stock. The company went public via an initial public offering (IPO) in 2004. In 2015, Google was reorganized as a wholly owned subsidiary of Alphabet Inc.",
    "published": "3 days ago"
  },
  {
    "title": "Alphabet Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
    "snippet": "<strong>Alphabet Inc.</strong> is an American multinational technology conglomerate holding company headquartered in Mountain View, California. Alphabet is the world&#x27;s third-largest technology company by revenue, after Amazon and Apple, the largest technology company by profit, and one of the world&#x27;s most valuable ...",
    "published": "1 week ago"
  },
  {
    "title": "Google | History & Facts; Products & Services | Britannica Money",
    "url": "https://www.britannica.com/money/Google-Inc",
    "snippet": "Since 2015, Google has been a subsidiary of the holding company <strong>Alphabet, Inc</strong>. More than 70% of worldwide online search requests are handled by Google, placing it at the heart of most Internet users’ experience.",
    "published": null
  },
  {
    "title": "The REAL Power: Who Owns 51% of Google?",
    "url": "https://surgegraph.io/business/who-owns-51-of-google",
    "snippet": "... <strong>No single person or organization holds a controlling stake in Google</strong>. Ownership is spread across a wide range of shareholders, from its founders Larry Page and Sergey Brin to numerous individual and institutional investors.",
    "published": null
  },
  {
    "title": "Who Owns Google in 2025? Read about Alphabet Inc.!",
    "url": "https://www.jagranjosh.com/us/explainers/who-is-the-owner-of-google-1860000139",
    "snippet": "Google is the largest and most well-known subsidiary of the multinational technology conglomerate, <strong>Alphabet Inc</strong>. It is the direct owner of Google. <strong>Alphabet Inc</strong>.",
    "published": "September 20, 2025"
  }
]