[
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "His stint as coach came to an abrupt end at the end of 2014 due to poor relations with the President of Montpellier Rugby Club. In 2017–2018 he coached Toulon. In 2019 Galthié was appointed as vice-head coach of the French national team, having been scheduled to succeed <strong>Jacques Brunel</strong> as head ...",
    "published": "3 weeks ago"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "Novès was dismissed in December ... coach <strong>Jacques Brunel, who arrived from the same position with Bordeaux Bègles. Novès&#x27; assistants were dismissed as well. In April 2019, then-French Rugby Federation president Bernard Laporte announced that Fabien Galthié</strong> would be appointed ...",
    "published": "1 week ago"
  },
  {
    "title": "Fabien Galthie: Ten things you should know about the France head coach",
    "url": "https://www.rugbyworld.com/countries/france-countries/fabien-galthie-ten-things-you-should-know-about-the-france-head-coach-134810",
    "snippet": "Find out more about the former France scrum-half who has sparked a turnaround in fortunes of the national team · <strong>Fabien Galthie</strong> has rejuvenated the French team (Getty Images) <strong>Fabien Galthie</strong> has overseen significant improvements in the France ...",
    "published": "January 12, 2024"
  },
  {
    "title": "France rugby union team: Fixtures, squad and head coach",
    "url": "https://news.bet365.com/en-gb/article/france-rugby-union-team-profile/2025012409221201023",
    "snippet": "The top tryscorer in the Six Nations in both 2022 and 2023, Bordeaux Begles wing Penaud is a gamechanger for this France side who time and time again is on hand to apply the finishing touches for <strong>Fabien Galthe</strong>&#x27;s side. A distinguished former player himself, receiving 64 international caps for ...",
    "published": null
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "<strong>Marc Lievremont</strong> and Thierry Dusautoir after the 2011 Rugby World Cup Final. (Photo by Stu Forster/Getty Images) <strong>Marc Lievremont</strong>’s time as France’s head coach included a 2010 Six Nations Grand Slam and second-place finish at the 2011 Rugby ...",
    "published": "May 30, 2025"
  }
]