[
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "<strong>Al-Bashir served as head of state, under the title of Chairman of the Revolutionary Command Council for National Salvation from 1989 to 1993 and as president from 1993 to 2019</strong> (and from 1996 as the leader of the National Congress Party).",
    "published": "1 week ago"
  },
  {
    "title": "List of heads of government of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_government_of_Sudan",
    "snippet": "The current prime minister is <strong>Kamil Idris</strong>. He was appointed by the Transitional Sovereignty Council on 31 May 2025. ... ^ Briefly interrupted following the 2021 coup d&#x27;état, when Abdel Fattah al-Burhan served as head of state and there was ...",
    "published": "October 23, 2025"
  },
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "It was reported that Sudan wanted Israeli support following the capture of Khartoum by the SAF in exchange for Sudan&#x27;s recognition. On 6 March 2024, al-Burhan&#x27;s son, Mohammed Fattah Burhan Rahman, was severely injured after his motorcycle collided with another vehicle in Ankara, Turkey. He died of his injuries on 3 May after spending nearly two months in intensive care. ... ^ While al-Burhan heads the Transitional Sovereignty Council, his role in the council is weak and thus, al-Burhan and the council both served as collective head of state until a coup led by al-Burhan in October 2021 where the council was dissolved and al-Burhan became the sole head of state.",
    "published": "3 days ago"
  },
  {
    "title": "List of Heads of State of Sudan",
    "url": "https://www.worldatlas.com/articles/presidents-of-the-republic-of-sudan.html",
    "snippet": "The power held by the office of the president of Sudan has varied since the creation of the position. Some of the Presidents held an honorary position, such as with President Ismail Al-Azhari, while others exercised total control, as has been the case wit",
    "published": "April 2, 2019"
  },
  {
    "title": "List Of Sudan's Head Of State Since 1956 | History Rep",
    "url": "https://historyrep.com/list-of-sudans-head-of-state-since-1956/",
    "snippet": "Sudan&#x27;s head of state has changed many times since the country gained independence in 1956. At first, Sudan was ruled by the Queen of the UK and Egypt&#x27;s",
    "published": "January 11, 2025"
  }
]