[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Alfa Romeo has since maintained its distinct identity and brand through several ownership changes, including Fiat&#x27;s merger with the American Chrysler Group in 2014, forming <strong>Fiat Chrysler Automobiles (FCA), and FCA&#x27;s subsequent merger in 2021 with the French PSA Group to form Stellantis</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Who Makes Alfa Romeo? | Ron Lewis Alfa Romeo",
    "url": "https://www.ronlewisalfaromeo.com/who-makes-alfa-romeo/",
    "snippet": "<strong>Stellantis</strong> ownership brings many good things to Alfa Romeo customers. The company is spending over €30 billion on new electric cars and tech by 2025. This means Alfa Romeo will have more electric options soon.",
    "published": "October 31, 2025"
  },
  {
    "title": "Who Makes Alfa Romeo? | Alfa Romeo of Omaha",
    "url": "https://www.alfaromeoomaha.com/alfaromeo-research/who-owns-alfa-romeo/",
    "snippet": "Who owns Alfa Romeo, exactly? Alfa Romeo is currently owned by the <strong>Stellantis automotive company</strong>. Despite this, the origin of Italian precision shines through the top Alfa Romeo models like the Stelvio and Giulia models.",
    "published": "January 13, 2024"
  },
  {
    "title": "Who Owns Alfa Romeo: Top Shareholders – Brands Owned By",
    "url": "https://brandsownedby.com/who-owns-alfa-romeo/",
    "snippet": "<strong>Santo Ficili</strong> is the Chief Executive Officer of Alfa Romeo as of 2025. He leads the brand under Stellantis N.V. and is responsible for shaping Alfa Romeo’s strategy, operational direction, and brand identity worldwide.",
    "published": "2 weeks ago"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "Alfa Romeo is an iconic Italian vehicle with a tradition of sleek performance and luxurious design. Learn more about who owns Alfa Romeo and the history behind the brand with Genesis Alfa Romeo.",
    "published": "April 26, 2021"
  }
]