[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "World Athletics Council Vice-President (2023-present) ... Keynote in several masters, graduate schools, seminars, workshops, universities, Federations, NOC, etc. Promotional campaigns of several products and brands ... Development Commission: Chair – Kids&#x27; Athletics work stream, Member – Technical Officials Education work stream, Member – Coaches Education workstream",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "Each member of the Council is elected for a four-year period by the World Athletics Congress, a biennial gathering of athletics officials that consists of the Council, Honorary Members, and up to three delegates from each of the national member federations. Chairpersons and members of Committees, which manage specialist portfolios, are also elected by the Congress.",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://site.uat.aws.worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The term of office for Executive Board Members is four years. ... Chaired British Government Sports Honours Committee (2010-2018) and served within the Cabinet Office as Legacy Ambassador for the London 2012 Games (2012-2017) International Inspiration Chairman (charity delivering London 2012 Bid pledge to use sport to enhance the lives of youth around the world) (2013-2015) ... Chairman, Organising Committee - Asian Athletics Championships (2013 - Pune, India) &amp; (2017 - Odisha, India), and Member, Organising Committee - IAAF Permit Meetings in India",
    "published": null
  },
  {
    "title": "World Athletics Executive Board re-appoints Arat, Hoffman and Sabharwal as members | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/world-athletics-executive-board-arat-hoffman-sabharwal",
    "snippet": "Along with the three re-appointed members, the Executive Board includes World Athletics President <strong>Sebastian Coe</strong>, Senior Vice President Ximena Restrepo, Vice Presidents Raul Chapado, Adille Sumariwalla and Jackson Tuwei, and CEO Jon Ridgeon ...",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Focus on young innovative companies (Governance, Leadership, Business Strategy, Sales, Finance and Venture Capital) as a Board Professional and Consultant · Senior Advisor and Ambassador of Tegla Loroupe Peace Foundation · Initiator and creator of the Athletics for a Better World programme ... Development Commission: Chair – Kids&#x27; Athletics work stream, Member – Technical Officials Education work stream, Member – Coaches Education workstream",
    "published": null
  }
]