[
  {
    "title": "Mariano Rajoy ousted as Spain's prime minister | Mariano Rajoy | The Guardian",
    "url": "https://www.theguardian.com/world/2018/jun/01/mariano-rajoy-ousted-as-spain-prime-minister",
    "snippet": "Mariano Rajoy, once viewed as the ... were convicted of corruption in a case that proved a scandal too far. <strong>He will be replaced by Pedro Sánchez</strong>, the leader of Spain’s opposition socialist PSOE party, which tabled the motion ...",
    "published": "June 1, 2018"
  },
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "On <strong>1 June 2018,</strong> Rajoy and his government was ousted by the opposition parties led by the opposition leader Pedro Sánchez, the secretary-general of the Spanish Socialist Workers&#x27; Party, which only held 84 seats at the time and Sánchez was sworn in the following day.",
    "published": "March 8, 2004"
  },
  {
    "title": "Spain PM Rajoy ousted: What happens next? - BBC News",
    "url": "https://www.bbc.co.uk/news/world-europe-44328463",
    "snippet": "Spanish Socialist <strong>Pedro Sánchez has ousted conservative leader Mariano Rajoy in a no-confidence vote and will be the next prime minister</strong>. It is the first time since the Franco dictatorship and Spain&#x27;s transition to democracy in 1975 that a ...",
    "published": "June 1, 2018"
  },
  {
    "title": "2018 vote of no confidence in the government of Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2018_vote_of_no_confidence_in_the_government_of_Mariano_Rajoy",
    "snippet": "The motion passed with the support of 180 deputies—those of PSOE, Unidos Podemos, Republican Left of Catalonia, Catalan European Democratic Party, Basque Nationalist Party, Compromís, EH Bildu and New Canaries—and resulted in the downfall of Mariano Rajoy&#x27;s government and in Pedro Sánchez becoming new Prime Minister of Spain. Public opinion at the time was found to be overwhelmingly in favour of the motion, as revealed by polling conducted in the days previous and during the events leading to the vote. Subsequently, on 5 June, Rajoy announced his resignation as PP leader and his withdrawal from politics after having led the party for 14 years, vacating his seat in parliament and returning to his position as property registrar in Santa Pola.",
    "published": "September 27, 2025"
  },
  {
    "title": "Sanchez takes charge in Spain as tarnished Rajoy departs | Reuters",
    "url": "https://www.reuters.com/article/us-spain-politics-idUSKCN1IX3XO/",
    "snippet": "Spanish socialist <strong>Pedro Sanchez was catapulted to power on Friday, taking over as prime minister from veteran conservative Mariano Rajoy</strong>, who lost a no-confidence vote in the wake of a corruption scandal.",
    "published": "June 1, 2018"
  }
]