[
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Producer <strong>Ada Solomon</strong> has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian film industry has achieved within the institution.",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "<strong>Mike Downey</strong>, an Irish-British film producer, was elected chairman in 2020. In 2021, Polish filmmaker Agnieszka Holland became the first woman to serve as president of the Academy. That same year, the Academy discontinued use of the abbreviation &quot;EFA&quot; and began referring to itself either by ...",
    "published": "September 3, 2025"
  },
  {
    "title": "Romanian Producer Ada Solomon Elected New Chair of EFA’s Board - FilmNewEurope.com",
    "url": "https://filmneweurope.com/news/region/item/127511-romanian-producer-ada-solomon-elected-new-chair-of-efa-s-board",
    "snippet": "04-12-2025 · By FNE Staff · From left to right: <strong>Ada Solomon</strong> (© Ali Bulboacă); Leontine Petit (© Gert Willem Haasnoot) and Matthieu Darras (© Anastasia Hoppanova). BERLIN: Romanian producer <strong>Ada Solomon</strong> is the new chair of the Board of the ...",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "Royal Television Society Midlands announces 2025 awards winners · London Critics’ Circle Film Awards announces nominations – One Battle After Another leads · From left to right: <strong>Ada Solomon</strong> (Credit: Ali Bulboacă); Leontine Petit (Credit: ...",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "Other renowned films include SORELLA DI CLAUSURA (Ivana Mladenovic, 2025), THE NEW YEAR THAT NEVER CAME (Bogdan Mureșanu, Best Film at the Venice Orizzonti section &amp; European Film Academy Discovery nominee, 2024), DO NOT EXPECT TOO MUCH OF THE END OF THE WORLD (Radu Jude, Special Jury Prize Locarno, 2023). In 2013, Solomon received the European Co-Production Award – Prix Eurimages. Outgoing chair Mike Downey commented: “To quote Shakespeare, &#x27;Parting is such sweet sorrow.&#x27;",
    "published": "2 weeks ago"
  }
]