[
  {
    "title": "Zaza Pachulia (Georgia) - Basketball Stats, Height, Age | FIBA Basketball",
    "url": "https://www.fiba.basketball/en/players/129927-zaza-pachulia",
    "snippet": "Explore the career and performances of Zaza Pachulia. Access all stats, latest news, photos, videos and achievements.",
    "published": null
  },
  {
    "title": "Zaza Pachulia NBA Stats & News",
    "url": "https://www.rotowire.com/basketball/player/zaza-pachulia-2391",
    "snippet": "His averages of 5.4 points, 4.7 rebounds and 1.6 assists were all down from a season prior, extending a three-year trend of shrinking production. With the Warriors set to move on from Pachulia, <strong>the big man now joins the Pistons on a one-year deal for the veteran&#x27;s minimum.</strong>",
    "published": null
  },
  {
    "title": "Zaza Pachulia reveals how losing over $100K on restaurant business made him a better investor - Basketball Network",
    "url": "https://www.basketballnetwork.net/off-the-court/zaza-pachulia-reveals-how-losing-over-100k-on-restaurant-business-made-him-a-better-investor",
    "snippet": "Pachulia reflects on the lessons learned from his failed restaurant ventures during his playing career.Nov 14, 2025 9:25 AM EST · By Peter SunjicEditor and Writer at Basketball Network ... Jan 19, 2019; Detroit, MI, USA; Detroit Pistons center Zaza Pachulia (27) reacts to a call during the ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Zaza Pachulia | Center | Atlanta Hawks",
    "url": "https://www.nba.com/player/2585/zaza-pachulia",
    "snippet": "Follow the action on NBA scores, schedules, stats, news, teams, and players. Buy tickets or watch the games anywhere with NBA League Pass.",
    "published": null
  },
  {
    "title": "Ex-Warriors center Zaza Pachulia excited to unite Bay Area via sports – NBC Sports Bay Area & California",
    "url": "https://www.nbcsportsbayarea.com/nba/golden-state-warriors/all-star-weekened-super-bowl-world-cup-zaza-pachulia/1824987/",
    "snippet": "In an exclusive NBC Sports Bay ... Festus Ezeli, <strong>Pachulia detailed his love for the Bay and his eagerness for his new home to host the 2025 NBA All-Star Game, Super Bowl LX and the 2026 FIFA World Cup</strong>....",
    "published": "February 11, 2025"
  }
]