[
  {
    "title": "Sun Microsystems - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sun_Microsystems",
    "snippet": "Sun contributed significantly to the evolution of several key computing technologies, among them Unix, RISC processors, thin client computing, and virtualized computing. At its height, Sun&#x27;s headquarters were in <strong>Santa Clara, California</strong> (part of Silicon Valley), on the former west campus of ...",
    "published": "1 week ago"
  },
  {
    "title": "Sun Microsystems Inc, 2550 Garcia Ave, Mountain View, CA 94043, US - MapQuest",
    "url": "https://www.mapquest.com/us/california/sun-microsystems-inc-431565487",
    "snippet": "Sun Microsystems Inc, headquartered in <strong>Mountain View, California</strong>, was a prominent technology company known for its development of computer hardware and software, particularly in the UNIX operating system space.",
    "published": null
  },
  {
    "title": "Sun Microsystems 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10596-52",
    "snippet": "Sun Microsystems is headquartered in <strong>Santa Clara, CA</strong>.",
    "published": null
  },
  {
    "title": "Sun Microsystems Corporate Office Headquarters - Phone Number & Address",
    "url": "https://corporateofficeheadquarters.org/sun-microsystems/",
    "snippet": "Sun Microsystems Corporate office Headquarters Sun Microsystems Headquarters Address and Contact Address: <strong>4150 Network Circle, Santa Clara, CA, United States</strong> Phone Number: 95054-1778 Email: Click Here Number of Employees: 38,600 Established: ...",
    "published": "August 23, 2022"
  },
  {
    "title": "Sun Microsystems - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/sun-microsystems",
    "snippet": "Sun Microsystems&#x27;s headquarters? Sun Microsystems is located in · <strong>Santa Clara, California, United States</strong>. Who invested in · Sun Microsystems? Sun Microsystems is funded by · Kleiner Perkins.",
    "published": null
  }
]