[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "In 2022, following the ministerial ... that Morrison showed no respect for his colleagues at Tourism Australia and he left her feeling bullied, also confirming that he &quot;point-blank refused&quot; to provide her or the board with any documentation or to answer questions about how the ad campaign was awarded to Saatchi. This episode and, more generally, his career in marketing led to his satirical sobriquet, &quot;Scotty from Marketing,&quot; ...",
    "published": "6 days ago"
  },
  {
    "title": "'I might be the wife of a former Prime Minister, but I am my own person.' - Eternity News",
    "url": "https://eternitynews.com.au/christian-living/i-might-be-the-wife-of-a-former-prime-minister-but-i-am-my-own-person/",
    "snippet": "<strong>Jenny Morrison</strong> – wife of our former Prime Minister, Scott Morrison – opens her front door dressed in jeans and an elegant linen top. Her feet are bare and her smile is broad. I’m a little nervous because I thought this was going to be ...",
    "published": "December 12, 2023"
  },
  {
    "title": "Scott Morrison's partner: Jenny Morrison | naa.gov.au",
    "url": "https://www.naa.gov.au/explore-collection/australias-prime-ministers/scott-morrison/partner",
    "snippet": "Scott Morrison was the Prime Minister of Australia from 2018 to 2022.",
    "published": null
  },
  {
    "title": "Jenny Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jenny_Morrison",
    "snippet": "<strong>Jennifer Morrison</strong> (née Warren; born 8 January 1968) is an Australian former registered nurse and the wife of Scott Morrison, who was prime minister of Australia from 2018 to 2022.",
    "published": "3 weeks ago"
  },
  {
    "title": "Scott Morrison's Wife, Kids And Career: Everything You Need To Know",
    "url": "https://www.marieclaire.com.au/latest-news/scott-morrison-wife-kids-career/",
    "snippet": "Here, we look at Morrison’s life away from politics—from his wife and children, to his early career. ... Scott Morrison married <strong>Jenny Morrison (nee Warren)</strong> in 1990. The pair met at the young age of 12 on a day trip to Luna Park in Sydney.",
    "published": "November 2, 2023"
  }
]