[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "If so, the president may serve as both the head of state and de facto head of government, while the prime minister serves as his deputy, acting as a link between the legislature and the executive. The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 ...",
    "published": "18 hours ago"
  },
  {
    "title": "Welcome to the website of the French Presidency",
    "url": "https://www.elysee.fr/en/",
    "snippet": "Find out all the news of the President <strong>Emmanuel Macron</strong> on the official website and discover our pages on the history of the French Republic.",
    "published": null
  },
  {
    "title": "France appoints new government under PM Lecornu",
    "url": "https://www.lemonde.fr/en/politics/article/2025/10/12/france-appoints-new-government-under-pm-lecornu_6746354_5.html",
    "snippet": "The lineup, a mix of old and new faces, is Prime Minister <strong>Sébastien Lecornu</strong>&#x27;s second attempt at bringing together a team to overcome months of deadlock and pass a much-needed austerity budget through a deeply divided parliament.",
    "published": "October 13, 2025"
  },
  {
    "title": "Macron names ally Sébastien Lecornu as new French PM",
    "url": "https://www.bbc.com/news/articles/crmenp1k0mjo",
    "snippet": "9 September 2025 · ShareSave · Paul KirbyEurope digital editor · ShareSave · EPA · <strong>Sébastien Lecornu</strong> (L) has served as Emmanuel Macron&#x27;s armed forces minister for the past three years · President Emmanuel Macron has named close ally ...",
    "published": "September 9, 2025"
  },
  {
    "title": "France’s prime minister faces crunch vote in parliament | Politics News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/12/9/frances-prime-minister-faces-crunch-vote-in-parliament",
    "snippet": "French Prime Minister <strong>Sebastien Lecornu</strong> gives a statement on October 8, 2025. [AFP] (AFP) ... France’s National Assembly is set to vote on a major social security budget bill, in a critical test for the embattled Prime Minister <strong>Sebastien Lecornu</strong>, ...",
    "published": "1 week ago"
  }
]