[
  {
    "title": "David Tepper - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Tepper",
    "snippet": "<strong>Tepper bought the NFL&#x27;s Carolina Panthers from original owner and founder Jerry Richardson in May 2018,</strong> and was forced to sell his Steelers shares. He beat out a rival bidder with more ties to the Carolinas, Ben Navarro (Founder and CEO of Beekmok Capital), thanks both to speedy NFL vetting ...",
    "published": "1 day ago"
  },
  {
    "title": "Carolina Panthers",
    "url": "https://www.panthers.com/team/ownership_business/test-david-a-tepper",
    "snippet": "He firmly believes in developing a winning organization that is consistently competitive year after year and gives back to those who need it most in the Panthers community. Tepper, a passionate, lifelong NFL fan, <strong>purchased the Panthers in July 2018,</strong> ...",
    "published": null
  },
  {
    "title": "Carolina Panthers - Owners - RetroSeasons.com",
    "url": "https://www.retroseasons.com/teams/carolina-panthers/history/owners/",
    "snippet": "The Panthers were announced as the league&#x27;s 29th franchise in 1993, and began play in 1995 under original owner and founder <strong>Jerry Richardson</strong>. The Panthers played well in their first two years, finishing 7–9 in 1995 (an all-time best for an ...",
    "published": "August 19, 2025"
  },
  {
    "title": "Carolina Panthers Executives and Owners | Pro-Football-Reference.com",
    "url": "https://www.pro-football-reference.com/teams/car/executives.htm",
    "snippet": "Historical Coaches: Don Shula, George Halas, Bill Belichick, Tom Landry ...",
    "published": null
  },
  {
    "title": "Team History | Pro Football Hall of Fame",
    "url": "https://www.profootballhof.com/teams/carolina-panthers/team-history/",
    "snippet": "Finally, on October 26, 1993, the NFL owners, unanimously selected the Carolinas as the 29th NFL franchise and the first expansion team since 1976. The Panthers played their first-ever game in Canton, Ohio in the annual AFC-NFC Hall of Fame Game. Their opponent in the pre-season classic was the NFL&#x27;s other expansion franchise, the Jacksonville Jaguars.",
    "published": null
  }
]