[
  {
    "title": "Who's the greatest? Ranking Australia's prime ministers",
    "url": "https://lens.monash.edu/@politics-society/2021/08/04/1383572/who-were-australias-best-prime-ministers-we-asked-the-experts",
    "snippet": "Read more: Is the COVID vaccine rollout the greatest public policy failure in recent Australian history? Notably, three of the four most recent prime ministers – <strong>Kevin Rudd, Malcolm Turnbull and Abbott</strong> – are situated towards or in the rear ...",
    "published": "August 4, 2021"
  },
  {
    "title": "List of prime ministers of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Australia",
    "snippet": "Robert Menzies and Kevin Rudd served two non-consecutive terms in office while Alfred Deakin and Andrew Fisher served three non-consecutive terms. The prime ministership of Frank Forde, who was prime minister for seven days in 1945, was the shortest in Australian history.",
    "published": "2 weeks ago"
  },
  {
    "title": "Records of prime ministers of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Records_of_prime_ministers_of_Australia",
    "snippet": "This page details numerous records and characteristics of individuals who have held the office of Prime Minister of Australia. Sir Robert Menzies was the longest-serving prime minister of Australia, serving for 18 years and 163 days total. His first tenure (1939–1941) lasted 2 years and 125 ...",
    "published": "1 week ago"
  },
  {
    "title": "Prime Ministers Of Australia Throughout History - WorldAtlas",
    "url": "https://www.worldatlas.com/articles/prime-ministers-of-australia-through-history.html",
    "snippet": "Australia has had 29 prime ministers throughout the years, with <strong>Malcolm Turnbull</strong> being the country&#x27;s current prime minister.",
    "published": "October 25, 2019"
  },
  {
    "title": "Australia - Visits by Foreign Leaders - Department History - Office of the Historian",
    "url": "https://history.state.gov/departmenthistory/visits/australia",
    "snippet": "history.state.gov 3.0 shell",
    "published": null
  }
]