[
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "He will be inaugurated on <strong>11 March 2026</strong>. At rallies, he regularly counted down the days until this date warning undocumented immigrants that they should leave before then if they ever want the chance to return.",
    "published": "2 days ago"
  },
  {
    "title": "Kast’s Victory in Chile Is Another Win for Global Right-Wing Movement - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/americas/chile-kast-right-wing-movement.html",
    "snippet": "José Antonio Kast had seen it coming. “Our ideas already won — they won in the United States, they won in Italy and they won in Argentina,” he said on Chilean radio one day after President Trump’s inauguration in January.",
    "published": "19 hours ago"
  },
  {
    "title": "José Antonio Kast - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jos%C3%A9_Antonio_Kast",
    "snippet": "José Antonio Kast Rist (born <strong>18 January 1966</strong>), also known by his initials JAK, is a Chilean lawyer and politician.",
    "published": "1 day ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "The son of a Nazi party member and an admirer of Pinochet, Kast built his campaign on a promise to expel tens of thousands of undocumented migrants ... The ultra-conservative former congressman José Antonio Kast has been elected as Chile’s next president.",
    "published": "13 hours ago"
  },
  {
    "title": "Chile Turns Hard To The Right: José Antonio Kast Easily Wins Presidency | The Liberty Beacon",
    "url": "https://www.thelibertybeacon.com/chile-turns-hard-to-the-right-jose-antonio-kast-easily-wins-presidency/",
    "snippet": "Kast will take office in <strong>March</strong>. Guiding off the inauguration date, he has repeatedly warned illegals of how many days they to self-deport, before his administration kicks them out.",
    "published": "1 day ago"
  }
]