[
  {
    "title": "King of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/King_of_Saudi_Arabia",
    "snippet": "<strong>King Abdulaziz Al Saud, known in the West as Ibn Saud, regained his patrimony, which is known as today&#x27;s Saudi Arabia, in 1902</strong>. Restoring his family as emirs of the Emirate of Riyadh, he then established the Sultanate of Nejd as his headquarters in 1922.",
    "published": "2 weeks ago"
  },
  {
    "title": "The Kings of Saudi Arabia",
    "url": "https://www.worldatlas.com/history/the-kings-of-saudi-arabia.html",
    "snippet": "The Kingdom of Saudi Arabia was ... total, the Saudi Arabia Kingdom has had seven kings, with <strong>Salman bin Abdulaziz Al Saud being the current king at 88 years old</strong>....",
    "published": "July 17, 2024"
  },
  {
    "title": "List of kings of Saudi Arabia | First Ruler, Saud Dynasty, Salman, History, Chronological Order, & Crown Prince | Britannica",
    "url": "https://www.britannica.com/topic/list-of-kings-of-Saudi-Arabia",
    "snippet": "<strong>The Saud dynasty was established under the rule of Muhammad ibn Saud in the 18th century</strong> and has since ruled three successive states, followed by the Kingdom of Saudi Arabia (established in 1932).",
    "published": "June 24, 2024"
  },
  {
    "title": "KSA History",
    "url": "https://www.mofa.gov.sa/en/ksa/Pages/history.aspx",
    "snippet": "On the 17th of Jumada I 1351 AH / September the 19th 1932 AD, a royal decree was issued announcing the unification of the country under the name (The Kingdom of Saudi Arabia), starting from Thursday, the 21st of Jumada I 1351 AH / September the 23rd 1932 AD (the first day of Libra).",
    "published": null
  },
  {
    "title": "List of Kings of Saudi Arabia - Saudipedia",
    "url": "https://saudipedia.com/en/article/3863/royal-family/list-of-kings-of-saudi-arabia",
    "snippet": "Founding <strong>King Abdulaziz Bin Abdulrahman Al Saud</strong> The first king, founder, and unifier of the Kingdom of Saudi Arabia, he began the process of reclaiming and unifying the Kingdom in...",
    "published": "February 17, 2025"
  }
]