[
  {
    "title": "Ministry of Health, Population and Hospital Reform - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health,_Population_and_Hospital_Reform",
    "snippet": "The current minister is Abdelhak Saihi (since 9 September 2022). Former ministers include: fr:<strong>Abderrahmane Benbouzid</strong> (January 4, 2020–September 8, 2022) ... In 2020, there were according to the Ministry 586 public health establishments in Algeria. There are 69,948 beds in CHU, EHU, EH, EHS, ...",
    "published": "April 15, 2025"
  },
  {
    "title": "Minister of Health and Population (Nepal) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_of_Health_and_Population_(Nepal)",
    "snippet": "Previously, Prime Minister <strong>Sushila Karki</strong>, who assumed office on 12 September 2025 oversees multiple ministries including the Ministry of Health and population under the interim government.",
    "published": "1 month ago"
  },
  {
    "title": "Ministry of Health and Population (Nepal) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health_and_Population_(Nepal)",
    "snippet": "These include four regional hospitals, 11 zonal hospitals, five teaching hospitals, as well as district hospitals and general hospitals. Bikas Devkota currently holds the position of Secretary of the Ministry of Health and Population. <strong>Roshan Pokhrel</strong> ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Board of Directors | Public Health Ontario",
    "url": "https://www.publichealthontario.ca/en/About/Our-Organization/Board-of-Directors",
    "snippet": "From 2018 to September 2021, Helen served as Ontario’s Deputy Minister of Health, including leading the health response to the COVID-19 pandemic and acting as the Co-Chair of Ontario’s COVID-19 Vaccine Distribution Task Force. She is currently a distinguished fellow at the Munk School of Global Affairs and Public Policy. Prior to her role as Deputy Minister of Health, Helen served as Deputy Minister in Treasury Board Secretariat, Citizenship, Immigration and International Trade, Seniors Affairs and Women’s Issues Ministries.",
    "published": null
  },
  {
    "title": "MoH Leadership | Ministry of Health",
    "url": "https://www.health.go.ke/moh-leadership",
    "snippet": "Skip to main content · &amp;nbsp|Staff Mail&amp;nbsp|A-Z Listing · Select Language · English · French · Japanese · Swahili · MoH Leadership · Leadership · Hon. <strong>Aden Duale</strong>",
    "published": null
  }
]