[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Left_(Germany)",
    "snippet": "From 2014 to 2024 the party led a coalition in Thuringia with the Social Democratic Party and The Greens headed by Minister-President Bodo Ramelow. Die Linke is a founding member of the Party of the European Left, and is the fifth-largest party in The Left group in the European Parliament.",
    "published": "January 7, 2007"
  },
  {
    "title": "Left Party | Germany, Politics, Origin, & Election Results | Britannica",
    "url": "https://www.britannica.com/topic/Left-Party-political-party-Germany",
    "snippet": "With polling that consistently placed it below the key threshold for Bundestag representation, the party appeared headed for electoral irrelevance, especially after former leader Sahra Wagenknecht split to form the Sahra Wagenknecht Alliance (Bündnis Sahra Wagenknecht; BSW) in 2024.",
    "published": "November 10, 2006"
  },
  {
    "title": "Things to know about the Left Party",
    "url": "https://www.dw.com/en/things-to-know-about-germanys-socialist-left-party/a-40013805",
    "snippet": "That alliance was driven to no small extent by the firebrand leader Oskar Lafontaine, the ex-SPD man from western Germany who had dramatically abandoned the finance minister role under Schröder in 1999. <strong>Lafontaine and SED veteran Gregor Gysi</strong> (a ...",
    "published": "July 1, 2022"
  },
  {
    "title": "Die Linke | Parties in the German Bundestag",
    "url": "https://www.deutschland.de/en/topic/politics/die-linke-parties-in-the-german-bundestag",
    "snippet": "In Germany, parties only win seats in parliament if they obtain five percent or more of the votes. ... Historic figures: <strong>Gregor Gysi</strong>, former Chairman of the SED and its successor party, the PDS Bodo Ramelow, Premier of Thuringia, first and only ...",
    "published": "May 8, 2025"
  },
  {
    "title": "Are These the Last Days of Die Linke?",
    "url": "https://jacobin.com/2022/02/are-these-the-last-days-of-die-linke",
    "snippet": "<strong>Oskar Lafontaine</strong> was already in his early sixties, as was PDS chairman Lothar Bisky, who died in 2013. Gregor Gysi, an icon of national politics for decades and still a moral authority in the party today, was in his late fifties.",
    "published": null
  }
]