[
  {
    "title": "2020 Kyrgyz Revolution - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2020_Kyrgyz_protests",
    "snippet": "The protests <strong>began on 5 October 2020</strong>, with a crowd of 1,000 people, that grew to at least 5,000 people by evening in Bishkek (the capital of Kyrgyzstan) in protest against results and allegations of vote-buying in the October 2020 parliamentary election.",
    "published": "February 5, 2025"
  },
  {
    "title": "Post-election protests plunge Kyrgyzstan into crisis - Civicus Monitor",
    "url": "https://monitor.civicus.org/updates/2020/10/21/post-election-protests-plunge-kyrgyzstan-crisis",
    "snippet": "... In response to the official elections results and the allegations of vote rigging, political opposition members and supporters took to the street to protest in the capital Bishkek, as well as in other cities. On <strong>5th October 2020</strong>, several ...",
    "published": null
  },
  {
    "title": "The 2020 Violent Change in Government in Kyrgyzstan Amid the Covid-19 Pandemic: Three Distinct Stories in One | SpringerLink",
    "url": "https://link.springer.com/chapter/10.1007/978-3-030-77489-9_8",
    "snippet": "First, <strong>a genuine citizen mobilization was triggered by the pandemic-related economic decline and rigged elections</strong>. Second, the initial peaceful protest was hijacked, to the surprise of the many, by a populist leader capitalizing on long-existing ...",
    "published": null
  },
  {
    "title": "Kyrgyzstan protesters storm parliamentary building over election result | Kyrgyzstan | The Guardian",
    "url": "https://www.theguardian.com/world/2020/oct/05/kyrgyzstan-election-120-taken-to-hospital-following-result-protest",
    "snippet": "<strong>People protesting against the results of a parliamentary election in Kyrgyzstan have broken into a parliamentary complex and security headquarters in the capital</strong>, with papers seen scattered across the pavement outside and reports parts of the ...",
    "published": "October 6, 2020"
  },
  {
    "title": "Kyrgyzstan is losing its status as Central Asia’s only democracy",
    "url": "https://www.economist.com/asia/2025/12/04/kyrgyzstan-is-losing-its-status-as-central-asias-only-democracy",
    "snippet": "KYRGYZSTAN USED to be an exception in Central Asia: the sole democracy in a region run by strongmen, albeit a flawed one. That is rapidly ceasing to be the case. It regressed a bit closer to the mean on November 30th, when a parliamentary election produced victory for candidates loyal to Sadyr Japarov, the increasingly authoritarian president.",
    "published": "2 weeks ago"
  }
]