[
  {
    "title": "The reasons why Bayern Munich sacked Julian Nagelsmann | Bavarian Football Works",
    "url": "https://www.bavarianfootballworks.com/2023/4/24/23694862/bayern-munich-nagelsmann-kahn-brazzo-termination-tuchel-lewandowski-transfer-mane-sane-kimmich-coman",
    "snippet": "The marquee event of this season is clearly the removal of Julian Nagelsmann as the coach of Bayern Munich. While the move has not produced the desired results, there is still a great deal of confusion as to why Bayern’s leadership made this decision at that juncture of the season.",
    "published": "April 26, 2023"
  },
  {
    "title": "Julian Nagelsmann SACKED by Bayern Munich with Thomas Tuchel lined up as successor| All Football",
    "url": "https://m.allfootballapp.com/news/All/Julian-Nagelsmann-SACKED-by-Bayern-Munich-with-Thomas-Tuchel-lined-up-as-successor/3058505",
    "snippet": "<strong>Julian Nagelsmann has been sacked by Bayern Munich</strong> - with former Chelsea boss Thomas Tuchel lined up to replace him.",
    "published": null
  },
  {
    "title": "Bayern Munich sack coach Julian Nagelsmann",
    "url": "https://www.dw.com/en/bayern-munich-sack-coach-julian-nagelsmann/a-65100563",
    "snippet": "<strong>The German football team Bayern Munich has sacked its coach Julian Nagelsmann with immediate effect</strong>, the club has confirmed. Thomas Tuchel has been named as his successor.",
    "published": "March 24, 2023"
  },
  {
    "title": "Julian Nagelsmann: Why did Bayern Munich sack their manager and turn to Thomas Tuchel? - BBC Sport",
    "url": "https://www.bbc.com/sport/football/65066056",
    "snippet": "In one of the most surprising managerial changes in recent times, <strong>Julian Nagelsmann has been fired as manager of Bayern Munich and replaced by former Chelsea boss Thomas Tuchel</strong>.",
    "published": "March 24, 2023"
  },
  {
    "title": "Why Bayern Munich sacked Julian Nagelsmann - YouTube",
    "url": "https://www.youtube.com/watch?v=2FJZHeAZDto",
    "snippet": "<strong>Julian Nagelsmann was sacked by Bayern Munich on Thursday with Thomas Tuchel announced as his immediate replacement</strong>. So why, with Bayern second in the Bundes...",
    "published": "March 27, 2023"
  }
]