[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "<strong>WBD would serve as managing partner, with Eurosport&#x27;s UK operations to be merged with the BT Sport networks</strong>. As part of the agreement, WBD also negotiated a deal for BT Group to distribute Discovery+ to its television and BT Sport subscribers. WBD would rebrand BT Sport as TNT Sports, deriving ...",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport To Be Replaced By TNT In The UK As Warner Bros. Discovery Shakes Up Sports Portfolio",
    "url": "https://deadline.com/2025/01/eurosport-to-be-replaced-by-tnt-in-the-uk-in-warner-bros-discovery-sports-shakes-up-1236269088/",
    "snippet": "Storied sports channel Eurosport will disappear from British screens next month as Warner Bros. Discovery rejigs its sports portfolio.",
    "published": "January 28, 2025"
  },
  {
    "title": "Un deal à plus de 70 milliards d'euros : Netflix va racheter Warner Bros... mais pas Eurosport",
    "url": "https://www.lequipe.fr/Medias/Actualites/Un-deal-a-plus-de-70-milliards-d-euros-netflix-va-racheter-warner-bros-mais-pas-eurosport/1614698",
    "snippet": "Netflix a annoncé racheter le groupe Warner Bros, mais <strong>le deal n&#x27;inclut pas les chaînes de Discovery, dont Eurosport</strong>. (E. Garnier/L&#x27;Équipe) Sacha Nokovitch publié le 5 décembre 2025 à 15h30",
    "published": "2 weeks ago"
  },
  {
    "title": "List of assets owned by Warner Bros. Discovery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_assets_owned_by_Warner_Bros._Discovery",
    "snippet": "Ellen Digital Ventures (joint venture between Warner Bros. Digital Networks and Ellen DeGeneres) Eurosport - <strong>merged/absorbed into TNT Sports</strong> in 2025",
    "published": "5 days ago"
  },
  {
    "title": "Warner Bros. Discovery Announces New Corporate Structure To Enhance Strategic Flexibility | Warner Bros. Discovery",
    "url": "https://www.wbd.com/news/warner-bros-discovery-announces-new-corporate-structure-enhance-strategic-flexibility",
    "snippet": "<strong>Warner Bros. Discovery expects to start the foundational steps immediately and to complete the implementation of the new corporate structure by mid-2025</strong>.",
    "published": null
  }
]