[
  {
    "title": "Igor Tudor - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Igor_Tudor",
    "snippet": "On 23 March 2025, Tudor replaced <strong>Thiago Motta</strong> as head coach of Serie A club Juventus. This appointment marked the first time Juventus had appointed a foreign manager since Didier Deschamps in the 2006–07 season. He eventually guided the club to the fourth place of league table and Champions ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus sack coach Igor Tudor after seven months in charge - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/46743501/juventus-sack-head-coach-igor-tudor-seven-months-charge",
    "snippet": "His departure was announced on Monday with Juventus confirming <strong>Massimo Brambilla</strong>, coach of Juventus Next Gen in Serie C, will take temporary charge of the first team for their midweek meeting with Udinese.",
    "published": "October 27, 2025"
  },
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "Juventus Football Club announces that it has today relieved Igor Tudor of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of <strong>Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci</strong>.",
    "published": null
  },
  {
    "title": "Thiago Motta no longer First Team coach, Igor Tudor takes over - Juventus",
    "url": "https://www.juventus.com/en/news/articles/thiago-motta-no-longer-first-team-coach-igor-tudor-takes-over-as-first-team-coach",
    "snippet": "Juventus FC announce that <strong>Thiago Motta</strong> has been relieved of his duties as Men’s First Team coach. The club would like to thank <strong>Thiago Motta</strong> and all of his staff for their professionalism and for the work they have carried out in recent months ...",
    "published": null
  },
  {
    "title": "Breaking: Juventus Announce New Manager Until 2026 After Sacking Igor Tudor",
    "url": "https://www.si.com/soccer/juventus/onsi/breaking-juventus-announce-new-manager-2026-sacking-igor-tudor",
    "snippet": "After sacking Igor Tudor last Monday, Juventus had <strong>Massimo Brambilla</strong> serving as interim coach during today&#x27;s match against Udinese, where they won 3-1.",
    "published": "October 29, 2025"
  }
]