[
  {
    "title": "Sadyr Japarov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sadyr_Japarov",
    "snippet": "He was <strong>confirmed as president of Kyrgyzstan by parliament on 16 October 2020.</strong> Since coming to power in 2020, Sadyr Japarov appointed his longtime friend Kamchybek Tashiev as the head of the State Committee for National Security, making him the second most-powerful official in Kyrgyzstan.",
    "published": "3 weeks ago"
  },
  {
    "title": "Kyrgyz President Sadyr Japarov Meets with Wang Yi_Ministry of Foreign Affairs of the People's Republic of China",
    "url": "https://www.fmprc.gov.cn/eng/wjbzhd/202511/t20251121_11757726.html",
    "snippet": "Wang Yi conveyed President Xi Jinping&#x27;s sincere greetings to Sadyr Japarov, noting that head-of-state diplomacy plays an irreplaceable role in leading the development of bilateral relations. President Sadyr Japarov and President Xi Jinping have had three meetings this year, providing top-level design and strategic guarantee for the development of bilateral relations.",
    "published": "November 20, 2025"
  },
  {
    "title": "Sadyr Japarov | president of Kyrgyzstan | Britannica",
    "url": "https://www.britannica.com/biography/Sadyr-Japarov",
    "snippet": "Other articles where Sadyr Japarov is discussed: Kyrgyzstan: Presidency of Sadyr Japarov: …detention, including Atambayev, Isakov, and Sadyr Japarov (Zhaparov), a former associate of Bakiyev imprisoned after his supporters took a government official hostage in 2013.",
    "published": null
  },
  {
    "title": "Profile: Kyrgyz President Sadyr Japarov",
    "url": "https://english.www.gov.cn/news/202502/04/content_WS67a18967c6d0868f4e8ef57b.html",
    "snippet": "In <strong>October 2020, Japarov became the Kyrgyz prime minister and acting president</strong>.",
    "published": "February 4, 2025"
  },
  {
    "title": "Kyrgyzstan election: Sadyr Japarov wins presidency with landslide",
    "url": "https://www.bbc.com/news/world-asia-55613552",
    "snippet": "Mr Japarov, who spent four years in exile, was in prison until October last year for taking a rival politician hostage. He was freed by his supporters, who had taken to the streets after a parliamentary election that was widely seen as rigged. Subsequent protests forced electoral officials to annul the results and ended up toppling the government. Mr Jeenbekov became the third president of the Central Asian state, which gained independence from the Soviet Union in 1991, to be ousted by a popular uprising since 2005.",
    "published": "January 11, 2021"
  }
]