[
  {
    "title": "James L. Dolan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/James_L._Dolan",
    "snippet": "In 1994, Paramount Communications, the owner of Madison Square Garden, was acquired by Viacom, who in turn sold the MSG properties to Cablevision and ITT Corporation, which had 50% ownership each. ITT sold its share to Cablevision three years later. In 1999, Dolan was given an increased role in managing Cablevision&#x27;s sports properties and is now the primary manager of these assets. The teams under his domain include most notably the National Basketball Association&#x27;s New York Knicks, the National Hockey League&#x27;s New York Rangers, and the American Hockey League&#x27;s Hartford Wolf Pack.",
    "published": "3 weeks ago"
  },
  {
    "title": "James Dolan Addresses Future Ownership of Knicks",
    "url": "https://www.si.com/nba/knicks/onsi/news/james-dolan-future-ownership-new-york-knicks",
    "snippet": "The New York Knicks have made plenty of trades on the road back to relevancy, but don&#x27;t expect any shift in the top spot. Current Knicks owner <strong>James Dolan</strong> addre",
    "published": "March 16, 2025"
  },
  {
    "title": "New York Knicks - Owners - RetroSeasons.com",
    "url": "https://www.retroseasons.com/teams/new-york-knicks/history/owners/",
    "snippet": "The team, established by Ned Irish in 1946, was one of the founding members of the Basketball Association of America (BAA), which became the NBA after merging with the rival National Basketball League (NBL) in 1949. The Knicks were successful during their early years and were constant playoff contenders under the franchise&#x27;s first head coach Joe Lapchick.",
    "published": "March 21, 2023"
  },
  {
    "title": "Who is James Dolan? Knicks owner makes waves after decision to fire Tom Thibodeau",
    "url": "https://www.usatoday.com/story/sports/nba/knicks/2025/06/03/knicks-owner-everything-to-know-james-dolan/84015908007/",
    "snippet": "<strong>Dolan</strong> is officially listed as the executive chairman and chief executive officer of Madison Square Garden Sports and Madison Square Garden Entertainment. He is the owner of both the New York Knicks and the NHL&#x27;s New York Rangers.",
    "published": "June 3, 2025"
  },
  {
    "title": "New York Knicks 2025 Playoff Run Redeems Even Team Owner James Dolan - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-05-22/new-york-knicks-2025-playoff-run-redeems-even-team-owner-james-dolan",
    "snippet": "For years, <strong>James Dolan</strong> has borne the brunt of basketball-obsessed New York’s furor and frustration every time another Knicks squad failed to live up to expectations.",
    "published": "May 22, 2025"
  }
]