[
  {
    "title": "Thomas Tuchel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Thomas_Tuchel",
    "snippet": "Tuchel became head coach at Chelsea ... named The Best FIFA Football Coach. He also won the UEFA Super Cup and Chelsea&#x27;s first FIFA Club World Cup. After disagreements with club management, Tuchel was dismissed in 2022. <strong>He signed with Bayern Munich in 2023 and won the Bundesliga</strong> ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Thomas Tuchel: News & profile - FC Bayern München",
    "url": "https://fcbayern.com/en/teams/first-team/former-players/thomas-tuchel",
    "snippet": "<strong>Thomas Tuchel (born 29 August 1973) has been the coach of FC Bayern since 24 March 2023</strong>. Info, titles &amp; news - you can find everything here!",
    "published": null
  },
  {
    "title": "Thomas Tuchel's fascinating coaching journey from Mainz to England manager | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/thomas-tuchel-england-manager-made-in-germany-chelsea-bayern-psg-dortmund-5732",
    "snippet": "Thomas Tuchel spent the best part of a decade honing his craft on Bundesliga touchlines with Mainz and Borussia Dortmund, before reaching consecutive UEFA Champions League finals with Paris Saint-Germain and Chelsea. He then got his hands on the Bundesliga title with Bayern Munich and is now England manager in the next chapter of his compelling coaching journey.",
    "published": "March 18, 2025"
  },
  {
    "title": "Niko Kovač, Thomas Tuchel and the men who've coached Bayern Munich and Borussia Dortmund | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/coaches-bayern-munich-borussia-dortmund-tuchel-kovac-30820",
    "snippet": "His reign kicked off with a 5-0 Supercup win over his former club, which set the tone for a season that ultimately returned a league and cup double, making him the first person in German football history to win a league and cup double as a player and coach. Despite some positive results at the start of the following term, ironically a 5-1 loss to his former club, Frankfurt, saw him dismissed. After spells with Monaco and Wolfsburg, Dortmund decided he was the man to succeed Nuri Şahin after he was let go at the start of 2025. Watch: Niko Kovač&#x27;s first words as Borussia Dortmund coach · Thomas Tuchel Dortmund: July 2015 – May 2017 Bayern: March 2023 – May 2024",
    "published": "February 6, 2025"
  },
  {
    "title": "Introducing new Bayern boss Thomas Tuchel",
    "url": "https://fcbayern.com/en/news/2023/03/profile-new-head-coach-thomas-tuchel",
    "snippet": "A defender by trade, he then played for Stuttgarter Kickers for two years (1992 to 1994) before joining regional league club SSV Ulm 1846, where he was coached by former FC Bayern reserves coach <strong>Rainer Ulrich and Ralf Rangnick</strong>, among others.",
    "published": "March 25, 2023"
  }
]