[
  {
    "title": "Debra Elmegreen - Poughkeepsie, New York, United States | Professional Profile | LinkedIn",
    "url": "https://www.linkedin.com/in/debra-elmegreen-9ab1552a/",
    "snippet": "Past President, International ... Debra Meloy Elmegreen was <strong>Professor of Astronomy on the Maria Mitchell Chair in the Department of Physics and Astronomy for 37 years and is now Professor Emerita</strong>....",
    "published": null
  },
  {
    "title": "Debra Elmegreen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Debra_Elmegreen",
    "snippet": "Debra Meloy Elmegreen (born November 23, 1952 in South Bend, Indiana) is an American astronomer. <strong>She was the first woman to graduate from Princeton University with a degree in astrophysics, and she was the first female post-doctoral researcher at the Carnegie Observatories</strong>.",
    "published": "December 25, 2024"
  },
  {
    "title": "Debra Meloy Elmegreen ￼",
    "url": "http://facultysites.vassar.edu/elmegree/Site/Welcome.html",
    "snippet": "Dr. Elmegreen is <strong>Professor of Astronomy on the Maria Mitchell Chair and Chair of the Department of Physics and Astronomy at Vassar College in Poughkeepsie, New York</strong>. She has been a member of the faculty since 1985. Her research interests include structure, interactions, and star formation in ...",
    "published": null
  },
  {
    "title": "Debra M. Elmegreen , PhD",
    "url": "https://www.vassar.edu/faculty/emeriti/elmegreen",
    "snippet": "Debra Meloy Elmegreen, Professor Emerita of Astronomy, was Professor of Astronomy on the Maria Mitchell Chair from 1994-2022 after joining the faculty in 1985. Debra served as Chair of FPCC and Observer to the Board of Trustees, on the Master Planning Committee, and on several other College committees, in addition to serving as Department Chair for a total of 10 years.",
    "published": null
  },
  {
    "title": "Debra Elmegreen (0000-0002-1392-3520)",
    "url": "https://orcid.org/0000-0002-1392-3520",
    "snippet": "Please enable JavaScript to continue using this application",
    "published": null
  }
]