[
  {
    "title": "Left Party (France) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Left_Party_(France)",
    "snippet": "At the end of 2014, Jean-Luc Mélenchon and Martine Billard resigned, and the party leadership was then collectively ensured by the national secretariat. The weekly newspaper, L&#x27;Intérêt général (formerly À gauche) is sent to all members but also to simple subscribers.",
    "published": "3 weeks ago"
  },
  {
    "title": "Le Parti de Gauche – Le Parti de Gauche (PG) : Pour une République Écosocialiste",
    "url": "https://www.lepartidegauche.fr/",
    "snippet": "Un nouveau secrétariat exécutif national a été élu avec 75% des voix, recevant ainsi la force et la légitimité du congrès pour mettre en œuvre sa feuille de route, construire et développer notre parti, avec le concours de vous toutes et tous. L&#x27;année 2024 sera aussi celle d&#x27;une réactualisation nécessaire de notre programme, avec comme point d&#x27;orgue une convention programmatique au premier trimestre 2025.",
    "published": null
  },
  {
    "title": "Parti de gauche (France) — Wikipédia",
    "url": "https://fr.wikipedia.org/wiki/Parti_de_gauche_(France)",
    "snippet": "<strong>Il veut agir « en faveur de l&#x27;implication citoyenne à tous les niveaux de la vie sociale, dans la protestation comme dans l&#x27;action gouvernementale ».</strong> Soucieux de « reformuler l&#x27;idéal socialiste pour tourner la page du capitalisme », il ...",
    "published": "November 18, 2025"
  },
  {
    "title": "Présidentielle 2027 : la gauche (en partie) unie fait le « serment » d'une candidature et d'un programme communs | Les Echos",
    "url": "https://www.lesechos.fr/politique-societe/politique/presidentielle-2027-la-gauche-en-partie-unie-fait-le-serment-dune-candidature-et-dun-programme-communs-2174516",
    "snippet": "<strong>Olivier Faure, Marine Tondelier, François Ruffin, Clémentine Autain, Benjamin Lucas et Lucie Castets</strong>, s&#x27;étaient donné rendez-vous pour prêter « un serment », « celui d&#x27;un jeu de paume particulier, celui de la gauche et des écologistes ...",
    "published": "July 3, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon : \"Nous sommes les plus forts à gauche\" - POLITIS",
    "url": "https://www.politis.fr/articles/2025/11/entretien-jean-luc-melenchon-nous-sommes-les-plus-forts-a-gauche/",
    "snippet": "Sa stratégie : refonder une gauche de rupture, préparer les municipales en autonomisant La France insoumise et affronter les grands débats sur l’immigration, le syndicalisme, l’Ukraine, la Chine et le Proche-Orient. Lucas Sarafian et Pauline Migevant et Pierre Jequier-Zalc • 18 novembre 2025 libéré",
    "published": "November 20, 2025"
  }
]