[
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "Earlier, Nehru had served as prime minister of the Interim Government of India during the British Raj from 2 September 1946 until 14 August 1947, his party, the Indian National Congress having won the 1946 Indian provincial elections. Nehru was succeeded by Lal Bahadur Shastri, whose 1 year 7-month term ended in his death in Tashkent, then in the USSR, where he had signed the Tashkent Declaration between India and Pakistan.",
    "published": "1 week ago"
  },
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "After Indira Gandhi&#x27;s assassination, her son Rajiv Gandhi took charge until 1989, when a decade with five unstable governments began. This was followed by the full terms of <strong>P. V. Narasimha Rao, Atal Bihari Vajpayee, Manmohan Singh, and Narendra Modi</strong>, who is the current prime minister of India, ...",
    "published": "3 days ago"
  },
  {
    "title": "Former Prime Ministers | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former-prime-ministers/",
    "snippet": "Shri H. D. Deve Gowda, a staunch crusader of socio-economic development and an ardent admirer of the rich cultural heritage of India, was born on May 18, 1933 in Haradanahalli village of Holenarasipura taluk, Hassan District in Karnataka. A Civil Engineering Diploma holder, Shri Deve Gowda plunged into active politics at the early ... More Archive Link ... A man of the masses, firm in his political convictions. On October 13, 1999, he took charge as Prime Minister of India for the second consecutive term at the head of a new coalition government, the National Democratic Alliance.",
    "published": null
  },
  {
    "title": "Prime Ministers of India",
    "url": "https://archivepmo.nic.in/",
    "snippet": "May 22, 2004 - 26th May 2014 · <strong>Shri Atal Bihari Vajpayee</strong>",
    "published": null
  },
  {
    "title": "List of all Prime Ministers of India (1947-2025) | India PM List",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1",
    "snippet": "Gulzarilal Nanda served as acting Prime Minister twice, each time for just 13 days. <strong>Narendra Modi</strong> has been in office since May 26, 2014, and is currently serving his third term after being re-elected in June 2024.",
    "published": "August 22, 2025"
  }
]