[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The Akron Beacon Journal is a morning newspaper in Akron, Ohio, United States. <strong>Owned by Gannett</strong>, it is the sole daily newspaper in Akron and is distributed throughout Northeast Ohio. The paper&#x27;s coverage focuses on local news.",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "The Akron paper was owned by the Knight family for nearly seven decades starting in 1907, and then the Knight Ridder company beginning in 1974. That company sold the Beacon Journal to <strong>McClatchy Co</strong>.",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal Newspaper Guild | Facebook",
    "url": "https://www.facebook.com/ABJNewspaperGuild/",
    "snippet": "The Akron Beacon Journal News Guild, which includes employees of the Beacon Journal and Kent Ravenna Record-Courier newspapers, has signed a two-year agreement with <strong>Gannett Co.</strong> Inc., the newspapers&#x27; parent company.",
    "published": null
  },
  {
    "title": "Akron Beacon Journal 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/153167-50",
    "snippet": "Information on acquisition, funding, investors, and executives for Akron Beacon Journal. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Help Center - Akron Beacon Journal",
    "url": "https://www.beaconjournal.com/ownership",
    "snippet": "As a subscriber, you can schedule temporary holds by visiting account.beaconjournal.com, chat online with an agent by clicking on the link below, or calling Customer Service (phone number and service hours are below). A temporary hold can be set up for up to 30 days through our automated system.",
    "published": null
  }
]