[
  {
    "title": "Angela Merkel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Angela_Merkel",
    "snippet": "Kramp-Karrenbauer was succeeded ... among the various parties to form a government. On 23 November 2021, a new grand coalition was announced, with <strong>Olaf Scholz</strong> nominated to succeed Merkel....",
    "published": "1 week ago"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "<strong>Helmut Kohl</strong> presided over 17 ministers at the start of his fourth term in 1994; the 2002 cabinet, the second of Chancellor Gerhard Schröder, had 13 ministers, and the Angela Merkel cabinet as of 22 November 2005 had 15. Article 65 of the Basic Law sets forth three principles that define how ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Scholz replaces Merkel as German chancellor, opening new era | AP News",
    "url": "https://apnews.com/article/climate-elections-europe-angela-merkel-european-union-675ee26e99ce6e7f57d0f61989b05a16",
    "snippet": "Scholz has become Germany’s ninth post-World War II chancellor, opening a new era for the European Union’s most populous nation and largest economy after Angela Merkel’s 16-year tenure. Scholz’s government takes office with high hopes of modernizing Germany and combating climate change but faces the immediate challenge of handling the country’s toughest phase yet of the coronavirus pandemic.",
    "published": "December 8, 2021"
  },
  {
    "title": "Olaf Scholz elected to succeed Angela Merkel as German chancellor | Olaf Scholz | The Guardian",
    "url": "https://www.theguardian.com/world/2021/dec/08/olaf-scholz-elected-succeed-angela-merkel-german-chancellor",
    "snippet": "<strong>Olaf Scholz</strong> will succeed Angela Merkel as Germany’s new chancellor after securing a majority of 395 of 736 delegates’ ballots in a parliamentary vote on Wednesday morning. Scholz will oversee a liberal-left “traffic light” coalition ...",
    "published": "December 8, 2021"
  },
  {
    "title": "Angela Merkel | Lowy Institute",
    "url": "https://www.lowyinstitute.org/people/contributor/bio/angela-merkel",
    "snippet": "She has been the leader of her party - the Christian Democratic Union (CDU) since 2000, and in 2005 Dr Merkel became Germany&#x27;s first female chancellor. She is also the first East German to hold this office. Prior to entering politics, Dr Merkel worked as a research scientist, having been awarded a doctorate in physical chemistry in 1986. Speech The 2014 Lowy Lecture: Dr Angela Merkel, Chancellor of Germany",
    "published": null
  }
]