[
  {
    "title": "Juventus FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_FC",
    "snippet": "Founded with the name of Sport-Club Juventus, initially as an athletics club, it is the second oldest of its kind still active in the country after Genoa&#x27;s football section (1893) and has competed every season of the premier club division (reformulated in different formats until the Serie A inception in 1929) since its debut in 1900 with the exception of the 2006–07 season, being managed by the industrial Agnelli family almost continuously since 1923.",
    "published": "1 week ago"
  },
  {
    "title": "Andrea Agnelli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Andrea_Agnelli",
    "snippet": "Since becoming chairman, Juventus won nine scudetti in a row, a record in Serie A, including five Coppa Italia titles, of which four in a row since the 2014–15 Coppa Italia, five Supercoppa Italiana titles, and reached two UEFA Champions League finals. Agnelli became the second third-generation member of the Fiat-owner ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Juventus: Entire soccer club board of directors resigns over charges of false accounting | CNN",
    "url": "https://www.cnn.com/2022/11/28/football/juventus-board-resign-andrea-agnelli-spt-intl",
    "snippet": "The entire board of directors of Juventus, including the club’s President <strong>Andrea Agnelli</strong> and CEO Maurizio Arrivabene, has resigned over charges of false accounting, a statement from the Italian soccer club said Monday.",
    "published": "November 28, 2022"
  },
  {
    "title": "Billionaire family that controls Ferrari denies 'groundless' rumors that Italian soccer giants Juventus are up for sale | Fortune Europe",
    "url": "https://fortune.com/europe/2023/09/11/agnelli-family-exor-juventus-football-club-sale/",
    "snippet": "Juventus declined Fortune’s request to comment further on reports of its sale beyond Exor’s denial of the claim. The Agnelli empire, which has stakes in Ferrari, Stellantis, and shoe brand Christian Louboutin, is among the most influential business families in Italy. About 53% of Exor is owned by the Agnellis, whose patriarch, Giovanni Agnelli, founded the automaker Fiat.",
    "published": "September 11, 2023"
  },
  {
    "title": "Juventus FC - Club profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/juventus-turin/startseite/verein/506",
    "snippet": "Italy Tel: +39 11 65631 Fax: +39 11 5119214 Website: www.juventus.com Founded: 01/11/1897 Members: 111.000 Go to club portrait",
    "published": null
  }
]