[
  {
    "title": "Fiat Chrysler Automobiles - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_Chrysler_Automobiles",
    "snippet": "Fiat Chrysler Automobiles N.V., commonly known by the acronym FCA, was an Italian-American multinational corporation primarily known as a manufacturer of automobiles, commercial vehicles, auto parts and production systems. The corporation was established by January 2012, when Fiat Group acquired ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Sergio Marchionne - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sergio_Marchionne",
    "snippet": "<strong>Marchionne was elected as an independent member of the Board of Directors of Fiat S.p.A. in May 2003, until being appointed CEO in 2004.</strong> In June 2009, when Chrysler emerged from Chapter 11 bankruptcy protection, Fiat Group received a 20% stake in Chrysler Group LLC and Marchionne was appointed ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Fiat Chrysler Automobiles (FCA) Executive Team | Comparably",
    "url": "https://www.comparably.com/companies/fiat-chrysler-automobiles-fc/executive-team",
    "snippet": "<strong>Michael Manley</strong> serves as the CEO / President of Fiat Chrysler Automobiles (FCA).",
    "published": null
  },
  {
    "title": "Sergio Marchionne | Biography, Chrysler, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Sergio-Marchionne",
    "snippet": "Though lacking in engineering experience, Marchionne was unexpectedly selected two years later as CEO of the automotive division Fiat Group Automobiles SpA. He quickly returned the troubled car company to profitability, however, by downsizing and restructuring management as well as by speeding the introduction of new models, notably the retro-styled minicar sensation Fiat 500. In 2009 Marchionne replaced Robert Nardelli as CEO of Chrysler Group LLC.",
    "published": null
  },
  {
    "title": "Stellantis Media - Company Historical Timeline",
    "url": "https://media.stellantisnorthamerica.com/newsrelease.do?id=19819&mid=",
    "snippet": "The company confirms plans to invest ... at Trenton Engine Complex. Cummins and Ram Truck celebrate production of the 3 millionth diesel engine. 2018 <strong>Michael Manley</strong> is appointed CEO of Fiat Chrysler Automobiles N.V....",
    "published": null
  }
]