[
  {
    "title": "Petro Poroshenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Petro_Poroshenko",
    "snippet": "Petro Oleksiiovych Poroshenko (born 26 September 1965) is a Ukrainian politician and oligarch who served as the fifth president of Ukraine from 2014 to 2019. He served as the Minister of Foreign Affairs from 2009 to 2010, and as the Minister of Trade and Economic Development in 2012.",
    "published": "1 week ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "Leonid Kuchma was the only president to have served two consecutive terms in office. Viktor Yushchenko, Petro Poroshenko, and Viktor Yanukovych served one term, with the latter being replaced by acting president <strong>Oleksandr Turchynov</strong>, who then also served as Chairman of the Ukrainian Parliament, ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Why Poroshenko lost - Atlantic Council",
    "url": "https://www.atlanticcouncil.org/blogs/ukrainealert/why-poroshenko-lost/",
    "snippet": "On April 21, television star <strong>Volodymyr Zelenskiy</strong> crushed incumbent president Petro Poroshenko in the second round of Ukraine’s presidential election. Even though Zelenskiy has never held elected office, voters were so tired of corruption and ...",
    "published": "August 29, 2019"
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "<strong>Volodymyr Zelensky</strong> (born January 25, 1978, Kryvyy Rih, Ukraine, U.S.S.R. [now in Ukraine]) is a Ukrainian actor and comedian who was elected president of Ukraine in 2019. Although he was a political novice, Zelensky’s anti-corruption platform ...",
    "published": "September 27, 2019"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "He was subsequently impeached and temporarily replaced by Chairman of the Verkhovna Rada <strong>Oleksandr Turchynov</strong>; the chairman serves as acting president when the office is vacant. Early presidential elections were held on 25 May 2014 and won by ...",
    "published": "6 days ago"
  }
]