[
  {
    "title": "Former Malaysian PM Mahathir joins little-known party Putra | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/former-malaysian-pm-mahathir-joins-little-known-party-putra",
    "snippet": "<strong>Former Malaysian prime minister Mahathir Mohamad has joined little-known Parti Bumiputera Perkasa Malaysia (Putra).</strong>",
    "published": "November 25, 2024"
  },
  {
    "title": "Dr Mahathir receives invitation to join Putra as adviser",
    "url": "https://www.malaysiakini.com/news/655590",
    "snippet": "<strong>Dr Mahathir Mohamad is seriously considering an invitation by Parti Bumiputera Perkasa Malaysia (Putra) to join the party as an adviser</strong>.",
    "published": "February 18, 2023"
  },
  {
    "title": "Dr Mahathir, 13 former Pejuang members join Putra | Malay Mail",
    "url": "https://www.malaymail.com/news/malaysia/2023/02/25/dr-mahathir-13-former-pejuang-members-join-putra/56698",
    "snippet": "... KUALA LUMPUR, Feb 25 — <strong>Tun Dr Mahathir Mohamad has joined Parti Bumiputera Perkasa Malaysia (Putra), former Pejuang Tanah Air (Pejuang) central executive committee member Armin Banian Pahamin said</strong>.",
    "published": "February 25, 2023"
  },
  {
    "title": "BERNAMA - Dr Mahathir receives invitation to join Putra as adviser",
    "url": "https://www.bernama.com/en/news.php?id=2165703",
    "snippet": "According to Dr Mahathir, Putra president Datuk Ibrahim Ali made the offer to join the four-year-old party after the party’s Supreme Council decided on the matter at its meeting today. “So far, I do not see a reason why I should not accept the invitation, but I also always give myself time to think seriously when I have to make decisions. “The offer to join Putra goes well with my (political) struggles.",
    "published": null
  },
  {
    "title": "Mahathir Mohamad Fast Facts | KRDO",
    "url": "https://krdo.com/news/national-world/cnn-world/2025/12/10/mahathir-mohamad-fast-facts-2/",
    "snippet": "He became the oldest elected world leader at 92 when he was sworn into office as prime minister of Malaysia in 2018, a decade-and-a-half after retirement. Mahathir was also prime minister of Malaysia from July 1981 to October 2003.",
    "published": "1 week ago"
  }
]