[
  {
    "title": "World Report 2024: Rights Trends in Chile",
    "url": "https://www.hrw.org/world-report/2024/country-chapters/chile",
    "snippet": "In December more than 55 percent of voters rejected the council’s draft. President Gabriel Boric said “the constitutional process is over” and called on political forces to reduce polarization and work within the framework of the current constitution to deliver on Chileans’ urgent needs.",
    "published": "January 11, 2024"
  },
  {
    "title": "Politics of Chile - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Chile",
    "snippet": "For example, the Government response to COVID reinforced a need to formalise how coordination between national, regional and local government occurs, particularly during emergency situations involving constitutional exceptions. There are positive developments in subnational consultation. In January 2023, an agreement was signed with the Association of Regional Governors of Chile (AGORECHI) to advance political decentralisation, particularly intra-government coordination and local participation, administrative decentralization, fiscal decentralization and the development of a National Decentralization Policy.",
    "published": "October 2, 2025"
  },
  {
    "title": "Far-right candidate Jose Antonio Kast wins Chile’s presidential election | Elections News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/12/14/far-right-candidate-jose-antonio-kast-wins-chiles-presidential-election",
    "snippet": "Far-right candidate Jose Antonio Kast has won a run-off election to become Chile’s 38th president, ousting the centre-left government currently in power. On Sunday, with nearly all the ballots counted, Kast prevailed with 58 percent of the vote, defeating former Labour Minister Jeannette Jara, a Communist Party politician who represented the governing centre-left coalition.",
    "published": "2 days ago"
  },
  {
    "title": "BTI 2024 Chile Country Report: BTI 2024",
    "url": "https://bti-project.org/en/reports/country-report/CHL",
    "snippet": "Additionally, the economic and social situation deteriorated in 2022, leading to a substantial victory for the “rejection” option in the September 4 referendum, with a margin of 61.8% versus 38.2%. Nevertheless, political stakeholders responded positively to the collapse of the constitutional process, reaching an agreement in early 2023 to launch a new constitutional reform process, with elections for the new Constitutional Council scheduled for May 2023.",
    "published": null
  },
  {
    "title": "Chile elects Kast as president in sharp rightward shift | Reuters",
    "url": "https://www.reuters.com/world/americas/chile-votes-presidential-race-expected-lurch-country-right-2025-12-14/",
    "snippet": "SANTIAGO, Dec 14 (Reuters) - <strong>Jose Antonio Kast won Chile&#x27;s presidential election on Sunday</strong>, leveraging voter fears over rising crime and migration to steer the country in its sharpest rightward shift since the end of the military dictatorship ...",
    "published": "1 day ago"
  }
]