[
  {
    "title": "Google 2021 Leadership Career Ladder",
    "url": "https://getworkrecognized.com/tools/career-ladders-explorer/google-leadership-2021",
    "snippet": "Google is one of the largest corporations in the world. To support their leaders they came up with 8 essential skills to actually be a good leader. Leadership is important in Google because it will basically drive the 10 thousands of their employees to do right things and support Google&#x27;s immense growth.",
    "published": null
  },
  {
    "title": "Google Leadership Principles At a Glance - Geeknack",
    "url": "https://www.geeknack.com/2020/07/31/google-leadership-principles-at-a-glance/",
    "snippet": "Good communication skills are a must once you find yourself in a leadership position. ImportantLeaders need to be able to communicate when there’s room for improvement, but also know how to provide recognition when it’s due. When you listen to people, they feel personally valued. It signals commitment. No matter what the situation, managers should practice their listening skills, which in turn will help them get a better understanding of the team dynamics and interactions. There’s a reason Google-speak like “moonshot” and “10Xer” has because standard startup lingo.",
    "published": "October 17, 2023"
  },
  {
    "title": "Leadership",
    "url": "https://www.googlecloudpresscorner.com/leadership",
    "snippet": "Vice President, Marketing, Google Cloud · Year · Select Year · 2025 · 2024 · 2023 · 2022 · 2021 ·",
    "published": null
  },
  {
    "title": "Google hires new global head of people operations | HR Dive",
    "url": "https://www.hrdive.com/news/google-hires-new-global-head-of-people-operations/592550/",
    "snippet": "In 2021, <strong>Cicconi will be at the helm to oversee Google&#x27;s experiment with a flexible work week pilot</strong> — a hybrid model in which teams meet for &quot;collaboration days&quot; in the office, and have the choice of spending the other days working from home ...",
    "published": "December 21, 2020"
  },
  {
    "title": "Google insiders say they're unhappy with its risk-averse style as the company grows, with 36 VPs quitting in a year",
    "url": "https://www.businessinsider.com/google-ceo-sundar-pichai-risk-averse-leadership-2021-6",
    "snippet": "Google&#x27;s chief executive, <strong>Sundar Pichai</strong>, reportedly faces a management challenge as a portion of his senior leadership grows restive.",
    "published": "June 22, 2021"
  }
]