[
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "Currently, he is <strong>overseeing the development of the highly anticipated AD ASTRA directed by James Gray and starring Brad Pitt, Ruth Negga, Tommy Lee Jones and Donald Sutherland</strong>. Milchan’s work builds on New Regency’s extensive library which ...",
    "published": null
  },
  {
    "title": "Yariv Milchan - Chairman and CEO @ New Regency Productions - Crunchbase Person Profile",
    "url": "https://www.crunchbase.com/person/yariv-milchan-3665",
    "snippet": "Yariv Milchan (PRODUCER) is the <strong>Chairman and CEO of the Academy Award®-winning New Regency Productions</strong> where he oversees the day-to-day management, creative direction, and overall growth strategy of the company.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "In May 2016, New Regency announced that Brad Weston had stepped of the company as CEO and president after five years as <strong>Yariv Milchan the son of New Regency&#x27;s founder Arnon Milchan had joined the company and became their new chairman and CEO</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Regency Enterprises",
    "url": "https://grokipedia.com/page/Regency_Enterprises",
    "snippet": "December 2024).[5][6] The company is currently led by Yariv Milchan as <strong>Chairman and CEO</strong>, overseeing creative development and global operations.[2] In June 2025, Regency formed a long-term partnership with Shamrock Capital, providing ...",
    "published": null
  },
  {
    "title": "Arnon Milchan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Arnon_Milchan",
    "snippet": "He has been involved in over 130 full-length motion pictures and is the <strong>founder of production company Regency Enterprises</strong>. Regency&#x27;s film credits include 12 Years a Slave, JFK, Heat, Fight Club, and Mr.",
    "published": "2 weeks ago"
  }
]