[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the <strong>chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "UC Santa Cruz chancellor explains decision to have law enforcement clear protesters",
    "url": "https://www.ksbw.com/article/uc-santa-cruz-chancellor-explains-decision-have-law-enforcement-protesters/60963734",
    "snippet": "UC Santa Cruz Cynthia Larive <strong>addressed the student body on Friday morning about the decision to bring in law enforcement to clear anti-genocide protesters</strong>.",
    "published": "May 31, 2024"
  },
  {
    "title": "Cynthia Larive to become 11th chancellor of UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2019/05/chancellor-designate/",
    "snippet": "Cynthia K. Larive as the <strong>eleventh chancellor of UC Santa Cruz</strong>. Currently the provost and executive vice chancellor at UC Riverside, Larive has served the UC community for nearly a decade and a half as a faculty member, administrator ...",
    "published": "May 13, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "<strong>In 2021, Larive launched the Student Success Initiative to ensure all students have access to the full range of experiences fundamental to their education</strong>, and kicked off the most significant faculty hiring effort the campus has pursued since its founding more than 50 years ago.",
    "published": null
  },
  {
    "title": "Campus prepares to welcome incoming chancellor Cynthia Larive - News",
    "url": "https://news.ucsc.edu/2019/05/larive-reaction/",
    "snippet": "Fiona Weigant, department manager for education and the staff representative on the search committee, was thrilled by the news of Larive’s selection. “She embraces who we are and will help us capitalize on our strengths,” said Weigant. “For me, what stood out when she came into the room for her interview was how energetic and prepared she was.",
    "published": "March 18, 2025"
  }
]