[
  {
    "title": "Sheikh Abdulaziz bin Abdulrahman Al-Thani Elected President of Umm Salal Club",
    "url": "https://www.qna.org.qa/en/News-Area/News/2024-08/27/0070-sheikh-abdulaziz-bin-abdulrahman-al-thani-elected-president-of-umm-salal-club",
    "snippet": "Doha, August 27 (QNA) - The General Assembly of Umm Salal Club held a meeting, on Tuesday, at its premises and elected HE Sheikh Abdulaziz bin Abdulrahman Al-Thani as <strong>President of Umm Salal Club</strong>, and HE Sheikh Abdulaziz bin Saud Al-Thani as Vice President by acclamation for the electoral 2024-2025 ...",
    "published": null
  },
  {
    "title": "Sheikh Abdulaziz bin Abdulrahman Al Thani elected president of Umm Salal Club | The Peninsula Qatar",
    "url": "https://thepeninsulaqatar.com/article/27/08/2024/sheikh-abdulaziz-bin-abdulrahman-al-thani-elected-president-of-umm-salal-club",
    "snippet": "Doha, Qatar: The General Assembly of Umm Salal Club held a meeting today, August 27, at its premises and elected HE Sheikh Abdulaziz bin Abdulrahman Al Thani as <strong>President of Umm Salal Club</strong>, and HE Sheikh Abdulaziz bin Saud Al Thani as Vice President ...",
    "published": "August 27, 2024"
  },
  {
    "title": "Umm Salal SC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Umm_Salal_SC",
    "snippet": "After the dissolution of two other clubs in the second division, Al Tadamun was also dissolved. The club was reformed in 1996, with <strong>Sheikh Abdulaziz bin Abdulrahman Al Thani heading the club</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Umm Salal | QSL",
    "url": "https://qsl.qa/en/umm-salal",
    "snippet": "Umm Salal Buy ticket Doha Bank Stars League · MATCHES PLAYED10 · Wins2 · loses8 · DRAW MATCHES0 · Goals17 · GOALS CONCEDED32 · Established: 1979 · President: <strong>Sheikh Abdulaziz bin Abdulrahman Al Thani</strong> · Nick Name: Barzan&#x27;s Falcons · Umm Salal Sports Club was founded in 1979 under the ...",
    "published": null
  },
  {
    "title": "Sheikh Abdulaziz bin Abdulrahman Al Thani elected as president of Umm Salal SC - Read Qatar Tribune on the go for unrivalled news coverage",
    "url": "https://www.qatar-tribune.com/article/195694/SPORTS/Sheikh-Abdulaziz-bin-Abdulrahman-Al-Thani-elected-as-president--of-Umm-Salal-SC",
    "snippet": "He wished success for the club during the coming period and for the new board of directors to achieve the ambitions and goals of Umm Salal. His Excellency thanked the Ministry of Culture and Sports for the support of the club and all the club’s employees for their work in the past period and their constant endeavor to upgrade the club. After announcing his victory by acclamation to head the club, HE Sheikh Dr. Abdulaziz bin Abdulrahman Al Thani said, “We have the vision to build a sports community inside the club, not just a football team, and there was a lengthy meeting with the age groups, and we have big dreams by developing a strategy and action plan for the club to achieve our goals.” His Excellency pointed out that the club is looking for investments to find other sources of income, adding that Umm Salal will start some investment projects that will benefit the club.",
    "published": "August 14, 2020"
  }
]