[
  {
    "title": "Tiger Aspect - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tiger_Aspect",
    "snippet": "The present-day company was founded in 1993 from the merger of <strong>Bennett-Jones&#x27; Tiger Television and Paul Sommers&#x27; Aspect Film &amp; Television</strong>. It has also produced television dramas such as Murphy&#x27;s Law and Sherlock Holmes and the Case of the Silk Stocking, and in October 2006, its drama series ...",
    "published": "1 week ago"
  },
  {
    "title": "Tiger Aspect Productions - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Tiger_Aspect_Productions",
    "snippet": "Tiger Aspect Productions is a British film and television production company of <strong>Peter Bennett-Jones</strong>, founded in 1993 from the merger between Tiger Television and Aspect Film &amp; Television.",
    "published": "November 12, 2025"
  },
  {
    "title": "Tiger Aspect Productions - BlackBook Companies - BCG Pro",
    "url": "https://www.comedy.co.uk/pro/blackbook/companies/tiger_aspect_productions/",
    "snippet": "Originally known as Tiger Television, Tiger Aspect is one of the UK&#x27;s most successful production companies, prolific across a broad range of programme genres. Originally an independent company, Tiger Aspect was bought by <strong>IMG Media</strong> in 2006 and ...",
    "published": null
  },
  {
    "title": "Tiger Aspect bought by IMG Media | Independent production companies | The Guardian",
    "url": "https://www.theguardian.com/media/2006/jun/01/independentproductioncompanies.citynews",
    "snippet": "The deal, which includes subsidiaries such as Tigress - the adventure and wildlife producer - and the Washington DC-based US production company TTP, completes a busy year for IMG which bought the factual specialist <strong>Darlow Smithson</strong> in the spring.",
    "published": "August 11, 2016"
  },
  {
    "title": "Tiger Aspect Productions (UK) | Closing Logo Group | Fandom",
    "url": "https://closinglogogroup.fandom.com/wiki/Tiger_Aspect_Productions_(UK)",
    "snippet": "Background: Tiger Aspect Productions ... by <strong>Peter Bennett-Jones in 1988 as Tiger Television. The company did not yet use an onscreen logo until 1989. They are particularly known for its sitcoms, though it also specialized in shows from other genres. In 1993, it was then merged with Aspect Film &amp; Television to form its current name. In June 2006, the company was purchased by IMG Media, but was later sold to the UK division of Endemol</strong> in November ...",
    "published": null
  }
]