[
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "The European Film Academy was founded in 1989 under the name European Cinema Society by <strong>Swedish</strong> director Ingmar Bergman, along with forty other filmmakers from across Europe, including Bernardo Bertolucci, Claude Chabrol, Dušan Makavejev, István Szabó, and Wim Wenders.",
    "published": "September 3, 2025"
  },
  {
    "title": "Story - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/story/",
    "snippet": "Wim Wenders (1996-2020) Agnieszka Holland (2020-2024) and Juliette Binoche (2024- ) followed in Bergman’s footsteps as Presidents of the Academy. The current chair of the Board is Mike Downey. Matthijs Wouter Knol has been appointed CEO and Director in 2021. The European Film Academy seeks to support and connect its 5,400 members and celebrates and promotes their work.",
    "published": "June 13, 2025"
  },
  {
    "title": "Meet the new Board - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/european-film-academy-new-board/",
    "snippet": "Three incumbent Board members who put themselves forward for a new mandate, have been re-elected. Mike Downey (<strong>Ireland/UK</strong>) will continue as Chair of the Board, with Joanna Szymańska (Poland) now joining Ada Solomon (Romania) as Deputy Chair.",
    "published": "May 13, 2024"
  },
  {
    "title": "Team - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/team/",
    "snippet": "Meet the European Film Academy team, dedicated to supporting and promoting the richness of European cinema.",
    "published": "September 3, 2025"
  },
  {
    "title": "Polish director named president of European Film Academy – The First News",
    "url": "https://www.thefirstnews.com/article/polish-director-named-president-of-european-film-academy-18280",
    "snippet": "&quot;The more than 3,800 members of the European Film Academy (EFA) have elected <strong>Polish</strong> director Agnieszka Holland as new EFA President,&quot; EFA said. Holland was the chairperson of the EFA Council between 2014 and 2019.",
    "published": null
  }
]