[
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "On 8 January 2020, the Presidential Office announced that Volodymyr Zelenskyy was cutting short his trip to Oman owing to the Ukraine International Airlines Flight 752 plane crash in nearby Iran the same day. Also on the same day, internet news site Obozrevatel.com released information that on 7 January 2020, Ukrainian politician of the Opposition Platform — For Life Medvedchuk – who has exclusive relations with the current president of Russia – may have arrived in Oman.",
    "published": "1 day ago"
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "The Ukrainian side is ready to continue working with maximum quality, constructively and honestly, so that the final agreement on establishing peace is strong. President of Ukraine Volodymyr Zelenskyy stated this in Berlin during a joint press conference with Federal Chancellor of Germany Friedrich Merz.",
    "published": "13 hours ago"
  },
  {
    "title": "Ukraine's Zelenskyy abandons hopes of joining NATO ahead of peace talks",
    "url": "https://www.nbcnews.com/world/ukraine/ukraines-zelenskyy-abandons-hopes-joining-nato-peace-talks-rcna249106",
    "snippet": "Ukraine has relinquished its ambition of joining the NATO military alliance in exchange for Western security guarantees as a compromise to end the war with Russia, President Volodymyr Zelenskyy said ahead of talks with U.S. envoys in Berlin",
    "published": "2 days ago"
  },
  {
    "title": "Zelenskyy says Ukraine ready for elections in 60-90 days with guarantees | Fox News",
    "url": "https://www.foxnews.com/world/zelenskyy-appears-change-his-mind-holding-elections-after-trumps-criticism",
    "snippet": "Ukrainian President Volodymyr Zelenskyy said his country could be ready to hold its first election since Russia&#x27;s invasion in 2022 as long as partners can give him security guarantees.",
    "published": "6 days ago"
  },
  {
    "title": "Europe ready to lead ‘multinational force’ in Ukraine as part of US peace plan | Ukraine | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/ukraine-talks-european-leaders-meet-berlin-starmer-macron-zelenskyy-merz-us-witkoff",
    "snippet": "But they added that significant differences remained over the future status of the Ukrainian territories occupied by Russia. Trump told reporters in the Oval Office on Monday he had “very long and very good” talks with Ukrainian counterpart Volodymyr Zelenskyy and European and Nato leaders, adding: “We had numerous conversations with President Putin of Russia, and I think we’re closer now than we have been ever, and we’ll see what we can do.”",
    "published": "6 hours ago"
  }
]