[
  {
    "title": "Banijay Entertainment - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banijay_Entertainment",
    "snippet": "Banijay Entertainment was <strong>formed in January 2008</strong> through the successive acquisition of production companies, first in France then internationally under the leadership of Stéphane Courbit (who was previously the CEO of Endemol France) alongside Groupe Arnault, the Agnelli and De Agostini families ...",
    "published": "1 day ago"
  },
  {
    "title": "Banijay Group is a leader in the entertainment business",
    "url": "https://group.banijay.com/who-we-are/",
    "snippet": "Nicolas then relocated the company to Bordeaux and in a few years positioned it as a European leader in online sports betting and gaming. ... Banijay Group combines business lines with complementary growth profiles. We are an all through Banijay Entertainment, Banijay Live and Banijay Gaming.",
    "published": "May 24, 2024"
  },
  {
    "title": "Banijay Entertainment - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Banijay_Entertainment",
    "snippet": "Banijay Entertainment (formerly known as Banijay Group and Banijay) is a French media company <strong>established in 2008.</strong> On February 23, 2016, they merged with Zodiak Media Group and folded all of the latter&#x27;s subsidiaries.",
    "published": "November 12, 2025"
  },
  {
    "title": "Banijay UK (company) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banijay_UK_Productions",
    "snippet": "A month later in July of that year, French production &amp; distribution company Banijay Group (who owns its British subsidiaries) completed its merger with Endemol Shine UK&#x27;s Dutch-based global production and distribution parent Endemol Shine Group from The Walt Disney Company and Apollo Global Management turning Banijay Group into a global international production and distribution titan as Endemol Shine UK became Banijay&#x27;s new British production division with Banijay placing all of its British subsidiaries such as RDF Television and IWC Media (the two were former Zodiak Media subsidiaries) into the acquired Endemol.Shine UK division and had it renamed to Banijay UK although it retained the former name until 2023.",
    "published": "1 month ago"
  },
  {
    "title": "Our Story - Banijay",
    "url": "https://www.banijay.com/our-story/",
    "snippet": "Banijay is the world&#x27;s largest independent content creation Group for television and multimedia platforms.",
    "published": "November 24, 2016"
  }
]