[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to ABC News pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight. <strong>On March 5, 2025, 538 was shut down by ABC News and its staff were laid off</strong>.",
    "published": "November 19, 2025"
  },
  {
    "title": "FiveThirtyEight is shutting down as part of broader cuts at ABC and Disney | Nieman Journalism Lab",
    "url": "https://www.niemanlab.org/2025/03/fivethirtyeight-is-shutting-down-as-part-of-broader-cuts-at-abc-and-disney/",
    "snippet": "Owen, Laura Hazard. &quot;FiveThirtyEight is <strong>shutting down</strong> as part of broader cuts at ABC and Disney.&quot; Nieman Journalism Lab. Last modified March 5, 2025. Accessed December 7, 2025.",
    "published": null
  },
  {
    "title": "Politics News | Breaking Political News, Video & Analysis-ABC News ...",
    "url": "http://fivethirtyeight.com/",
    "snippet": "This is a listing for &#x27;This Week&#x27; airing Sunday, December 21, 2025 · December 19 · December 19 · The president is set to make remarks on the economy in North Carolina Friday. December 19 · December 19 · Homeland Security Secretary Kristi Noem says the man suspected of killing two Brown University students and an M.I.T.",
    "published": null
  },
  {
    "title": "Daring Fireball: ABC Shuts Down FiveThirtyEight, and Pulls the Plug on Its Website",
    "url": "https://daringfireball.net/2025/03/abc_shuts_down_fivethirtyeight",
    "snippet": "He simply thanked the employees for their work, told them a human resources staffer would follow up, and ended the meeting. The entire affair, I’m told, lasted about 15 minutes. Soon after, employees had their access to ABC News’ systems shut off and the FiveThirtyEight website was pulled offline.",
    "published": null
  },
  {
    "title": "Our Data | FiveThirtyEight",
    "url": "https://data.fivethirtyeight.com/",
    "snippet": "We’re sharing the data and code behind some of our articles and graphics.",
    "published": "February 9, 2018"
  }
]