[
  {
    "title": "Cavaliers' Kenny Atkinson appears on head coach hot seat - Yahoo Sports",
    "url": "https://sports.yahoo.com/articles/cavaliers-kenny-atkinson-appears-head-203319740.html",
    "snippet": "Mon, December 22, 2025 at 8:33 PM UTC· · 2 min read · Cavaliers&#x27; <strong>Kenny Atkinson</strong> appears on head coach hot seat originally appeared on The Sporting News. Add The Sporting News as a Preferred Source by clicking here.",
    "published": "6 hours ago"
  },
  {
    "title": "r/nba on Reddit: Cleveland Cavaliers head coach Kenny Atkinson has won the 2025 Michael H. Goldberg NBCA Coach of the Year Award, the National Basketball Coaches Association announced today.",
    "url": "https://www.reddit.com/r/nba/comments/1k2zvnj/cleveland_cavaliers_head_coach_kenny_atkinson_has/",
    "snippet": "<strong>Coach Atkinson</strong> and the Cavaliers coaching staff were twice awarded the Eastern Conference Coach of the Month Award (October/November and December) and were selected as the coaching staff to represent the Eastern Conference in the 2025 All-Star Game.",
    "published": "April 19, 2025"
  },
  {
    "title": "Kenny Atkinson - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kenny_Atkinson",
    "snippet": "<strong>Kenneth Neil Atkinson</strong> (born June 2, 1967) is an American professional basketball coach and former player who is the head coach for the Cleveland Cavaliers of the National Basketball Association (NBA). He was previously the head coach of the Brooklyn Nets from 2016 to 2020.",
    "published": "October 9, 2025"
  },
  {
    "title": "Cavaliers Head Coach | StatMuse",
    "url": "https://www.statmuse.com/nba/ask/cavaliers-head-coach",
    "snippet": "<strong>Kenny Atkinson</strong> has coached the Cavaliers from 2024-25 to 2025-26.",
    "published": null
  },
  {
    "title": "An Update On Kenny Atkinson’s Job Security With Cavs - Yahoo Sports",
    "url": "https://sports.yahoo.com/articles/kenny-atkinson-job-security-cavs-174334995.html",
    "snippet": "Dec 17, 2025; Chicago, Illinois, USA; Cleveland Cavaliers head coach <strong>Kenny Atkinson</strong> directs his team against the Chicago Bulls during the second half at United Center.",
    "published": "9 hours ago"
  }
]