[
  {
    "title": "Ada Solomon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ada_Solomon",
    "snippet": "Ada Solomon (born 3 June 1968 in Bucharest) is a <strong>Romanian film producer behind over 60 movies</strong>. After first working in marketing, she turned to media companies in 1993 and produced her first film Asphalt Tango in 1995. In 2004 she created HiFilm Productions where she has worked with directors ...",
    "published": "August 13, 2025"
  },
  {
    "title": "Romanian Producer Ada Solomon Has 2 Films in Sarajevo’s Competition and Likes Cinema to Cause Debate: “We Need Dialogue More Than Ever”",
    "url": "https://www.hollywoodreporter.com/movies/movie-news/dracula-film-romania-producer-ada-solomon-interview-locarno-1236344649/",
    "snippet": "&#x27;Dracula&#x27; and more. Romanian producer Ada Solomon of MicroFilm has <strong>three movies in the 2025 Locarno Film Festival competition</strong>.",
    "published": "August 18, 2025"
  },
  {
    "title": "Ada Solomon | Producer, Production Manager, Actress",
    "url": "https://www.imdb.com/name/nm1127536/",
    "snippet": "Ada Solomon. Producer: <strong>Bad Luck Banging or Loony Porn</strong>. Ada Solomon was born on 3 June 1968 in Bucharest, Romania. She is a producer and production manager. She is married to Alexandru Solomon.",
    "published": "July 16, 2009"
  },
  {
    "title": "Ada Solomon - Producer - First Cut Lab",
    "url": "https://firstcutlab.eu/project/ada-solomon-producer/",
    "snippet": "Ada Solomon is a Romanian producer, <strong>founder of Hi Film Productions and Micro Film</strong>. She has produced over 60 titles such as: I DO NOT CARE IF WE GO DOWN IN HISTORY AS BARBARIANS (Radu Jude, 2018, Grand Prix Crystal Globe in KV IFF), AFERIM!",
    "published": "May 12, 2022"
  },
  {
    "title": "Romanian film producer Ada Solomon receives CEI Award 2018 at Trieste Film Festival | CEI",
    "url": "https://www.cei.int/news/6839/romanian-film-producer-ada-solomon-receives-cei-award-2018-at-trieste-film-festival",
    "snippet": "A woman who has become a fundamental reference for New Romanian Cinema and for international co-productions.” Ada Solomon has <strong>served as a line producer for foreign international projects such as Franco Zeffirelli&#x27;s CALLAS FOREVER and Hermine Huntgeburth&#x27;s TOM SAWYER &amp; HUCK FINN</strong>.",
    "published": null
  }
]