[
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "^ a b Rimet was provisionally placed in control of FIFA as chairman during the 1920 Summer Olympics in Antwerp, Belgium.",
    "published": "1 month ago"
  },
  {
    "title": "Gianni Infantino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gianni_Infantino",
    "snippet": "As president of FIFA, he <strong>oversaw the 2018 FIFA World Cup in Russia, for which he accepted the Order of Friendship medal given to him by Vladimir Putin</strong>. He oversaw the 2022 FIFA World Cup in Qatar during which time he defended or minimised controversies surrounding Qatar&#x27;s human rights record.",
    "published": "1 day ago"
  },
  {
    "title": "FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FIFA",
    "snippet": "Many officials were suspended by FIFA&#x27;s ethics committee including Sepp Blatter and Michel Platini. In early 2017, reports became public about FIFA president Gianni Infantino attempting to prevent the re-elections of both chairmen of the ethics committee, Cornel Borbély and Hans-Joachim Eckert, ...",
    "published": "1 day ago"
  },
  {
    "title": "A list of all the FIFA presidents listed: Past to present FIFA presidents",
    "url": "https://sportsbrief.com/football/50855-a-list-fifa-presidents-listed-present-fifa-presidents/",
    "snippet": "Rodolphe Seeldrayers was only the second FIFA president to die in office. Photo courtesy: Twitter Source: Twitter · The second Englishman on the list so far, Arthur was initially acting president before being elected full president. He died in office in 1961. David Wiseman (left), Chairman of the Cup committee and Arthur Drewry, Chairman of the FA Council, conducting the draw for the next round of the competition.",
    "published": "October 19, 2023"
  },
  {
    "title": "FIFA Council",
    "url": "https://inside.fifa.com/organisation/fifa-council",
    "snippet": "The final composition of the FIFA Council consists of 37 members: one President, elected by the FIFA Congress; eight vice presidents, and 28 other members elected by the member associations – each for a term of four years. A minimum of one female representative must be elected per confederation.",
    "published": null
  }
]