[
  {
    "title": "Anke Domscheit-Berg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anke_Domscheit-Berg",
    "snippet": "Anke Domscheit-Berg (née Domscheit; born 17 February 1968 in Premnitz) is a German politician and activist. She was a <strong>member of the Bundestag</strong> from 2017 to 2025. In 2017, she was elected on the party list of The Left, without being a party member. She joined the party in 2021 following her ...",
    "published": "August 13, 2025"
  },
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://grokipedia.com/page/Anke_Domscheit-Berg",
    "snippet": "She <strong>served as a member of the Bundestag for Die Linke</strong> from 2017 to 2025, elected initially on the party list without prior membership before formally joining the party.[1] Wait, no wiki, skip that.",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg - Aktivistin, Publizistin, Mitglied des Deutschen Bundestages",
    "url": "https://mdb.anke.domscheit-berg.de/",
    "snippet": "Mitglied des Deutschen Bundestages Oktober 2017 – März 2025 Mein BlogMedienecho ... Highlights aus den aktuellen Presseberichten. ... „Wir haben kein Geldmangelproblem und mehr Geld hilft nicht“, sagt auch Anke Domscheit-Berg, (Linksfraktion). Es brauche eher ein zentralgesteuertes Digitalbudget und eine Grundgesetzänderung, damit in diesem Bereich mehr Hilfen vom Bund auf föderaler Ebene ankommen.",
    "published": "March 24, 2025"
  },
  {
    "title": "Anke Domscheit-Berg | taz.de",
    "url": "https://taz.de/Anke-Domscheit-Berg/!t5032646/",
    "snippet": "Nach Lauer geht nun auch Netzaktivistin Domscheit-Berg. ... Die Piratenpartei will trotz ihrer schlechten Umfrageergebnisse ins EU-Parlament. Auf dem Parteitag in Bochum werden die Wahlkampfthemen bestimmt. ... Hier finden Sie weitere Antworten auf die sonntaz-Frage „Brauchen wir die Piraten noch?“ – unter anderem von Anke Domscheit-Berg.",
    "published": null
  },
  {
    "title": "Erfolg für die Linke im Bundestag, aber Anke Domscheit-Berg ist raus: Frust oder Freude?",
    "url": "https://www.maz-online.de/lokales/oberhavel/fuerstenberg/fuerstenberg-anke-domscheit-berg-nicht-mehr-im-bundestag-so-geht-es-mit-ihr-weiter-IRCPAC62HZE6NGNO2XFGKWGKQ4.html",
    "snippet": "<strong>Wenn am Dienstag der neue Bundestag zusammenkommt, dann ist Anke Domscheit-Berg aus Fürstenberg nicht mehr dabei</strong>. Im Interview spricht sie über die turbulente letzte Sitzungswoche, Privilegien und ihre Pläne für ihre Heimat Fürstenberg.",
    "published": "March 25, 2025"
  }
]