[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "Prior to the formation of the modern Ukrainian presidency, the previous Ukrainian head of state office was officially established in exile by <strong>Andriy Livytskyi</strong>.",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "^ Although <strong>Leonid Kravchuk</strong>&#x27;s official inauguration ceremony was conducted on 5 December 1991, he carried out most of the presidential responsibilities temporarily ceded to him as Chairman of the Verkhovna Rada from 24 August 1991 until 5 December ...",
    "published": "October 25, 2025"
  },
  {
    "title": "List of heads of state of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_leaders_of_Ukraine",
    "snippet": "From 1990 to 1991 it was simply the head of the Verkhovna Rada until the introduction of the office of the President of Ukrainian SSR. On 5 July 1991, the Supreme Soviet of the Ukrainian SSR passed a law establishing the post of the &quot;President of the Ukrainian SSR&quot;.",
    "published": "October 7, 2025"
  },
  {
    "title": "Volodymyr Zelensky’s biography — Official web site of the ...",
    "url": "https://www.president.gov.ua/en/president",
    "snippet": "<strong>Volodymyr Zelensky</strong>’s biography on Official web site of the President of Ukraine",
    "published": "13 hours ago"
  },
  {
    "title": "Viktor Yanukovych | Facts, Biography, Maidan Protests, & Flight to Russia | Britannica",
    "url": "https://www.britannica.com/biography/Viktor-Yanukovych",
    "snippet": "<strong>Viktor Yanukovych</strong>, Ukrainian politician who served as prime minister (2002–05, 2006–07) and president (2010–14) of Ukraine. His time in office was characterized by the imprisonment of political opponents and close ties to Moscow.",
    "published": "February 9, 2010"
  }
]