[
  {
    "title": "Faculty | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/graduate-programs/phd-public-affairs/security-studies/faculty",
    "snippet": "Alexander Glaser, Professor of Mechanical and Aerospace Engineering and International Affairs; Co-Director, Program in Science and Global Security · Adam M. Goldstein, Associate Professor of Sociology and Public Affairs",
    "published": null
  },
  {
    "title": "Faculty Directory | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/research-faculty-centers/faculty-directory",
    "snippet": "Donald E. Stokes Professor of Public and International Affairs; Professor of Politics and Public Affairs, Emeritus ... Frederick D. Barton · Lecturer in Princeton School of Public and International Affairs",
    "published": null
  },
  {
    "title": "Home | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/",
    "snippet": "<strong>Heather Howard</strong>, Princeton SPIA ... will co-chair Governor-elect Mikie Sherrill&#x27;s Action Team focused on expanding access to affordable health care. ... Katherine “Kate” Ho, the John L. Weinberg Professor of Economics and Business Policy, ...",
    "published": null
  },
  {
    "title": "Leadership | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/about/leadership",
    "snippet": "Ileana Cruz-Marden, MPA *19 Director of Partnerships Tent Partnerships for Refugees Julieta Cuéllar, MPA *19 Director of Strategic Initiatives and Implementation Division of Family and Medical Leave Insurance, Maryland Department of Labor Robert Doar ‘83 President American Enterprise Institute Amber Greene, MPP *12 Chief Equity Officer &amp; Director of Civil Rights City of Baltimore Anna Grzymala-Busse ’92 Michelle and Kevin Douglas Professor of International Studies Stanford University Larry Handerhan, MPA *12 Former Biden-Harris Administration Official, Administration for Children and Fami",
    "published": null
  },
  {
    "title": "Princeton School of Public and International Affairs - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Princeton_School_of_Public_and_International_Affairs",
    "snippet": "Susan L. Marquis, Frank and Marcia Carlucci Dean of the Frederick S. Pardee RAND Graduate School and vice president, innovation, RAND Corporation; chair of the PSPIA Advisory Council · David McCormick, former Under Secretary of the Treasury for International Affairs",
    "published": "October 26, 2025"
  }
]