[
  {
    "title": "Home | President of India",
    "url": "https://www.presidentofindia.gov.in/",
    "snippet": "Click here to Download · Smt. <strong>Droupadi Murmu</strong> was sworn in as the 15th President of India on 25 July, 2022. Previously, she was the Governor of Jharkhand from 2015 to 2021",
    "published": null
  },
  {
    "title": "President of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_India",
    "snippet": "Arunachal Pradesh governor Jyoti Prasad Rajkhowa, who was earlier appointed by the ruling party at the centre, was sacked by <strong>President Pranab Mukherjee</strong> after the Supreme Court struck down his unconstitutional acts. ... ^ The president is the head of the executive per Article 53 and 77 of the ...",
    "published": "2 days ago"
  },
  {
    "title": "Who's Who| National Portal of India",
    "url": "https://www.india.gov.in/my-government/whos-who",
    "snippet": "Lt. Governors &amp; Administrators ... This section gives you information about the persons holding the highest offices as well as respectable positions at the Executive, Judiciary, and Legislature levels in the country.",
    "published": null
  },
  {
    "title": "Government of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_India",
    "snippet": "The government is led by the president of India (currently <strong>Droupadi Murmu</strong> since 25 July 2022) who as head of state holds formal executive power, and thus (following parliamentary elections) appoints, as head of government, the prime minister, ...",
    "published": "1 week ago"
  },
  {
    "title": "List of heads of state of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_India",
    "snippet": "The current head of state of India is <strong>Droupadi Murmu</strong>, elected in 2022 after being nominated by the National Democratic Alliance. From 1947 to 1950, the head of state under the Indian Independence Act 1947 was the King of India, who was also the monarch of the United Kingdom and of the other ...",
    "published": "2 weeks ago"
  }
]