[
  {
    "title": "TF1 Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1_Group",
    "snippet": "<strong>The group was formed after TF1 was privatized in April 1987 in which the channel was launched back on 6 January 1975 twelve years prior. It is controlled with a 43% stake by industrial group Bouygues, and is quoted on Euronext Paris. The history of TF1 traces back to 1975, when the Office de Radiodiffusion-Télévision Française (ORTF) was split into 7 successor institutions</strong>...",
    "published": "2 weeks ago"
  },
  {
    "title": "TF1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1",
    "snippet": "On 16 April, its president, Francis Bouygues, presented a check of three billion francs to the government, completing the privatisation of TF1. <strong>TF1&#x27;s current logo was unveiled on February 2nd, 1990</strong>. It launched a news network, La Chaîne Info (LCI), in 1994. The channel was available in Italy ...",
    "published": "1 week ago"
  },
  {
    "title": "Notre histoire | Le Groupe | Groupe TF1 : actualités, communiqués, agenda, événements, publications",
    "url": "https://groupe-tf1.fr/en/group/our-history",
    "snippet": "<strong>From privatisation in 1987 through European expansion in the 1990s and recent moves into digital, production and music</strong>, TF1 has kept pace with our changing society and left its mark on popular culture. Revisit the key dates in the history of the Group – which is still being written and ...",
    "published": null
  },
  {
    "title": "TF1 Group | Ultimate Pop Culture Wiki | Fandom",
    "url": "https://ultimatepopculture.fandom.com/wiki/TF1_Group",
    "snippet": "<strong>The group was formed after TF1 was privatized in April 1987</strong>. It is controlled with a 43% stake by Bouygues, and is quoted on Euronext Paris. The history of TF1 traces back to 1975, when the Office de Radiodiffusion-Télévision Française (ORTF) ...",
    "published": null
  },
  {
    "title": "TF1 Group",
    "url": "https://corporate-executives.com/companies/tf1-group/",
    "snippet": "<strong>Founded in 1975 by the French Government and privatized in 1987</strong>, the TF1 group is the owner of TF1, Europe’s largest private TV channel.",
    "published": "October 14, 2020"
  }
]