[
  {
    "title": "BAE Systems Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/BAE_Systems_Inc.",
    "snippet": "BAE Systems Inc. is led by president and chief executive officer Tom Arseneault, and is headquartered in <strong>Falls Church, Virginia</strong>. It maintains operating locations in 38 states, with especially large concentrations in the Northeastern and Southeastern regions of the U.S.",
    "published": "3 weeks ago"
  },
  {
    "title": "BAE Systems - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/BAE_Systems",
    "snippet": "BAE Systems plc is a British multinational aerospace, arms and information security company, based in <strong>London</strong>. It is the largest manufacturer in Britain as of 2017. It is the largest defence contractor in Europe and the seventh largest in the world based on applicable 2021 revenues.",
    "published": "2 weeks ago"
  },
  {
    "title": "BAE Systems, Inc. | BAE Systems | United States",
    "url": "https://www.baesystems.com/en-us/our-company",
    "snippet": "BAE Systems, Inc. is a Delaware corporation that has mitigated our foreign ownership through a Special Security Agreement between the U.S. Government, BAE Systems, Inc. and BAE Systems plc. That agreement calls for the appointment of outside directors who, in conjunction with other U.S.",
    "published": null
  },
  {
    "title": "BAE Systems, Inc. Offices: Locations & Headquarters | Built In",
    "url": "https://builtin.com/company/bae-systems/offices",
    "snippet": "BAE Systems, Inc. is headquartered in <strong>Falls Church, Virginia, USA</strong> and has 23 office locations.",
    "published": null
  },
  {
    "title": "Baesystems",
    "url": "https://www.baesystems.com/en-us/who-we-are/locations",
    "snippet": "At BAE Systems, we provide some of the world&#x27;s most advanced, technology-led defence, aerospace and security solutions. We employ a skilled workforce of 90,500 people in more than 40 countries. Working with customers and local partners, we develop, engineer, manufacture, and support products ...",
    "published": null
  }
]