[
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "<strong>Christopher Ruddy</strong> (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and majority owner of Newsmax Media.",
    "published": "5 days ago"
  },
  {
    "title": "Newsmax – Breaking News | News Videos | Politics, Health, Finance",
    "url": "https://www.newsmax.com/",
    "snippet": "Newsmax.com reports today’s news headlines, live news stream, news videos from Americans and global readers seeking the latest in current events, politics, U.S., world news, health, finance, and more.",
    "published": null
  },
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "In an interview with Variety, Ruddy stated that, &quot;We are waiting for the states&#x27; certification and the electoral college, but we will at some point when that happens&quot; and insisted: &quot;We will be supportive of whoever the next president is.&quot; He added &quot;Newsmax would never become Trump TV.",
    "published": "1 week ago"
  },
  {
    "title": "Chris Ruddy - EarthX",
    "url": "https://earthx.org/speaker/chris-ruddy/",
    "snippet": "<strong>Christopher Ruddy</strong> founded Newsmax Media, Inc. in 1998 and serves as its CEO. Newsmax today is one of the nation’s leading broadcasting and digital media companies. The Company includes the Newsmax network, the 4th highestrated cable news channel ...",
    "published": "September 25, 2025"
  },
  {
    "title": "Chris Ruddy '87C | St. John's University",
    "url": "https://www.stjohns.edu/news-media/success-stories/chris-ruddy-87c",
    "snippet": "Ruddy today presides over the burgeoning success of the media company that includes the news website known as Newsmax.com. The site boasts an estimated 20–30 million monthly visitors and is the third-most viewed political website in the country. Newsmax Magazine has more than 400,000 monthly readers and the company’s cable news channel, Newsmax TV, launched in 2014.",
    "published": null
  }
]