[
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "<strong>Mohammed was appointed crown prince on 21 June 2017,</strong> following the King&#x27;s decision to depose Muhammad bin Nayef and make his own son the heir to the throne. The change of succession had been predicted in December 2015 by a public memo published by the German Federal Intelligence Service, which ...",
    "published": "11 hours ago"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Almost all powers under the king ... and economic development issues in Saudi Arabia. King Salman then <strong>removed Muhammad bin Nayef from the line of succession to the Saudi throne on 21 June 2017</strong> and designated his son Mohammed bin Salman as the new crown princ...",
    "published": "November 3, 2025"
  },
  {
    "title": "Succession to the Saudi Arabian throne - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Succession_to_the_Saudi_Arabian_throne",
    "snippet": "Upon the death of King Abdullah on 23 January 2015, <strong>Salman ascended to the throne and Muqrin became crown prince</strong>. At the same time, Muhammad bin Nayef, the Interior Minister and a supporter of Salman&#x27;s, was appointed deputy crown prince, an act that was ratified by the Allegiance Council after ...",
    "published": "September 24, 2025"
  },
  {
    "title": "How MBS Becomes Saudi King When Father Salman Dies, Royal Transition - Business Insider",
    "url": "https://www.businessinsider.com/saudi-king-salman-death-plan-how-mbs-becomes-king-2022-1",
    "snippet": "For 68 years, only the sons of ... the last of Abdulaziz&#x27;s 34 eligible sons, is monarch today. <strong>In 2017, he chose his own son, Mohammed bin Salman, as his heir</strong>....",
    "published": "February 2, 2022"
  },
  {
    "title": "Kingmaker: The Rise of Mohammed bin Salman",
    "url": "https://arabcenterdc.org/resource/kingmaker-the-rise-of-mohammed-bin-salman/",
    "snippet": "For instance, after becoming king, Salman removed the sitting Crown Prince, Muqrin, from power and replaced him with <strong>Mohammed bin Nayef</strong>, the same heir he replaced with his son two years later on June 21.",
    "published": "May 26, 2021"
  }
]