[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The term of office for Executive Board Members is four years. ... Chaired British Government Sports Honours Committee (2010-2018) and served within the Cabinet Office as Legacy Ambassador for the London 2012 Games (2012-2017) International Inspiration Chair (charity delivering London 2012 Bid pledge to use sport to enhance the lives of youth around the world) (2013-2015)",
    "published": null
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://site.uat.aws.worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The term of office for Executive Board Members is four years. ... Chaired British Government Sports Honours Committee (2010-2018) and served within the Cabinet Office as Legacy Ambassador for the London 2012 Games (2012-2017) International Inspiration Chairman (charity delivering London 2012 Bid pledge to use sport to enhance the lives of youth around the world) (2013-2015) ... Chairman, Organising Committee - Asian Athletics ...",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "Included in its charge is the ... of athletics competitions, including the World Athletics Championships. The organisation&#x27;s current president is <strong>Sebastian Coe</strong> of the United Kingdom, who was elected to the four-year position in 2015, and re-elected twice in 2019 and 2023 for ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics Executive Board re-appoints Arat, Hoffman and Sabharwal as members | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/world-athletics-executive-board-arat-hoffman-sabharwal",
    "snippet": "Along with the three re-appointed members, the Executive Board includes World Athletics President <strong>Sebastian Coe</strong>, Senior Vice President Ximena Restrepo, Vice Presidents Raul Chapado, Adille Sumariwalla and Jackson Tuwei, and CEO Jon Ridgeon ...",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "It is responsible for all decisions related to the sport of athletics, as well as for the conduct and management of the sport and its disciplines. Council consists of 26 elected members, including the President, four Vice-Presidents, six Area Presidents (elected by each Area Association), the Chair of the Athletes‘ Commission and one other member of the Athletes’ Commission (elected by members of the Athletes’ Commission) and thirteen Individual Council Members.",
    "published": null
  }
]