[
  {
    "title": "President's wife news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/wife",
    "snippet": "News about President&#x27;s wife <strong>Olena Zelenska</strong> on Official web site of the President of Ukraine",
    "published": "1 day ago"
  },
  {
    "title": "Who Is Ukrainian First Lady Olena Zelenska? - Everything to Know About Volodymyr Zelensky's Wife",
    "url": "https://www.townandcountrymag.com/society/politics/a39944586/ukraine-first-lady-olena-zelenska/",
    "snippet": "Since, however, she has been making more visible appearances—including this weekend for the coronation, where she reunited with Biden in London. Here, everything you need to know about the Ukrainian first lady. ... <strong>Olena</strong> in September 2021 ...",
    "published": "May 5, 2023"
  },
  {
    "title": "Who Is Olena Zelenska? Meet President, Volodymyr Zelenskyy's Wife Who Is The First Lady Of Ukraine",
    "url": "https://www.bollywoodshaadis.com/articles/volodymyr-zelenskyy-wife-olena-zelenska-love-story-high-school-best-friends-husband-wife-61299",
    "snippet": "Ukraine&#x27;s President Volodymyr Zelenskyy and his wife, <strong>Olena Zelenska</strong>, who is the country&#x27;s First Lady, have a cute love story that will surely make you fall in love with the beauty of old-school love.",
    "published": "March 1, 2025"
  },
  {
    "title": "Meet Olena Zelenska, Ukrainian President Volodymyr Zelenskyy's wife: Their high-school love story - The Times of India",
    "url": "https://timesofindia.indiatimes.com/life-style/relationships/love-sex/meet-olena-zelenska-ukrainian-president-volodymyr-zelenskyys-wife-their-high-school-love-story/articleshow/118662272.cms",
    "snippet": "Ukraine President Volodymyr Zelenskyy is often hailed for his strong-headed and courageous nature amidst the Russia-Ukraine war. His wife, <strong>Olena Zelen</strong>",
    "published": "March 2, 2025"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "The First Lady of Ukraine, <strong>Olena Zelenska</strong>, summarized this year’s results of implementing the All-Ukrainian Mental Health Program “How Are You?”. ... The Head of State honored the memory of Poles who, at different times, gave their lives ...",
    "published": "3 days ago"
  }
]