[
  {
    "title": "Australia's Head of State | PM&C",
    "url": "https://www.pmc.gov.au/government/head-of-state",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "Prime Minister of Australia | Prime Minister of Australia",
    "url": "https://www.pm.gov.au/",
    "snippet": "Building Australia’s future · View all media items · Tuesday 16 December 2025 · Transcript · Tuesday 16 December 2025 · Transcript · Tuesday 16 December 2025 · Transcript · Tuesday 16 December 2025 · Transcript · Tuesday 16 December 2025 · Transcript ·",
    "published": null
  },
  {
    "title": "Australian Government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Australian_Government",
    "snippet": "The governor-general usually presides at council meetings, but in their absence another minister nominated as the vice-president of the Executive Council presides at the meeting of the council. Since 1 June 2022, the vice-president has been senator Katy Gallagher. As of 13 May 2025, there are 16 departments of the Australian Government.",
    "published": "2 days ago"
  },
  {
    "title": "Who's who in the current Parliament - Parliamentary Education Office",
    "url": "https://peo.gov.au/understand-our-parliament/parliament-and-its-people/people-in-parliament/whos-who-in-the-current-parliament",
    "snippet": "Meet the leaders in the current Australian Parliament, from our head of state to party leaders and Presiding Officers. ... Mr Albanese is also the leader of the Australian Labor Party. <strong>The Prime Minister</strong> is the leader of the Australian Government.",
    "published": null
  },
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "He also administered the official commencement of the AUKUS security pact between Australia, the United States, and the United Kingdom, and navigated Australia&#x27;s response to the Gaza war. Despite often scoring low approval ratings, his government was re-elected in a landslide victory in the 2025 election, resulting in one of the largest Labor governments in Australian history.",
    "published": "14 hours ago"
  }
]