[
  {
    "title": "List of Golden State Warriors head coaches - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Golden_State_Warriors_head_coaches",
    "snippet": "Their second title was won as the Golden State Warriors in 1975, under coach Al Attles, who played with and coached the Warriors for 25 seasons. He was also the franchise&#x27;s all-time leader in regular season games coached and wins until March 2025 when his record was surpassed by <strong>Steve Kerr</strong>, who ...",
    "published": "November 20, 2025"
  },
  {
    "title": "Steve Kerr - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Steve_Kerr",
    "snippet": "<strong>Kerr is the first head coach in NBA history to lead his team to 67 or more wins in three consecutive seasons. He was named one of the Top 15 Coaches in NBA History in 2022, when the league commemorated its 75th anniversary. In March 2025, Kerr overtook Al Attles</strong> as the Warriors coach with the ...",
    "published": "1 week ago"
  },
  {
    "title": "Warriors Head Coaches | StatMuse",
    "url": "https://www.statmuse.com/nba/ask/warriors-head-coaches",
    "snippet": "<strong>Steve Kerr</strong> has coached the Warriors from 2014-15 to 2025-26.",
    "published": null
  },
  {
    "title": "Golden State Warriors Team Info and News | NBA.com",
    "url": "https://www.nba.com/team/1610612744/warriors",
    "snippet": "12/21/2025, 6:46 PM 路 Drops out of rotation 路 Though Golden State ran with the same starting five for the third game in a row, head coach <strong>Steve Kerr</strong> continued to tinker with the back end of his rotation.",
    "published": null
  },
  {
    "title": "Warriors news: Steve Kerr proclaims he will 'never leave' Stephen Curry",
    "url": "https://clutchpoints.com/nba/golden-state-warriors/warriors-news-steve-kerr-proclaims-will-never-leave-stephen-curry",
    "snippet": "Golden State Warriors head coach <strong>Steve Kerr</strong> made a promise regarding the rest of the team&#x27;s Stephen Curry era. By 路 Jackson StoneDec 21, 2025 at 12:41 PM ET 路 On Saturday evening, the Golden State Warriors got back into the win column with ...",
    "published": "1 day ago"
  }
]