[
  {
    "title": "Power Relations in Sudan after the Fall of Bashir - Stiftung Wissenschaft und Politik",
    "url": "https://www.swp-berlin.org/10.18449/2024RP05/",
    "snippet": "The fact that the Sovereignty Council was given an executive role not originally intended for it also increased Hemedti’s political influence. Meanwhile, the RSF recruited new members in many parts of Sudan, such that, according to estimates, they almost tripled their personnel within four years.88 · Islamist supporters of the NCP regime retained great influence in the SAF and over Burhan himself. The SAF leadership belittled Hemedti and his family as upstarts from the periphery, and ordinary soldiers distrusted him because of the RSF’s role in the sup­pression of the protest camp in June 2019.",
    "published": null
  },
  {
    "title": "Sudanese Sovereignty Council (1964–1965) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudanese_Sovereignty_Council_(1964–1965)",
    "snippet": "These elections marked an important ... of a civilian government. <strong>Ismail al-Azhari, a prominent Sudanese politician, assumed the presidency after winning the elections, and Muhammad Ahmad Mahgoub replaced Sirr Al-Khatim Al-Khalifa as prime minister</strong>....",
    "published": "March 5, 2025"
  },
  {
    "title": "The Evolution of Sudan's Popular Political Forces - MERIP",
    "url": "https://www.merip.org/2021/12/the-evolution-of-sudans-popular-political-forces/",
    "snippet": "The revolutionary wave of 2019 was successful in provoking the ouster of Bashir on April 11, 2019, by the Sudanese military. But the interests of regional and international powers and the effects of political and economic forces in Sudan that had steered people’s desire for radical change into reform-minded non-governmental organizations, plus the diminished role of official organized labor, all set the stage for a compromise over who would govern the country next.",
    "published": "August 22, 2025"
  },
  {
    "title": "Sudan - Politics",
    "url": "https://www.globalsecurity.org/military/world/sudan/politics-2020.htm",
    "snippet": "<strong>Sudan&#x27;s ruling generals and an alliance of opposition groups signed an accord 17 July 2019 creating a transitional power-sharing body</strong>, after weeks of negotiations aimed at breaking the political deadlock that has gripped the country since the toppling of President Omar al-Bashir 11 April 2019.",
    "published": null
  },
  {
    "title": "Sudanese revolution - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudanese_revolution",
    "snippet": "The Sudanese revolution (Arabic: ... for about eight months, during which <strong>the 2019 Sudanese coup d&#x27;état deposed President Omar al-Bashir on 11 April after thirty years in</strong> power....",
    "published": "1 week ago"
  }
]