[
  {
    "title": "Gianni Infantino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gianni_Infantino",
    "snippet": "In 2024, FIFA decided, with Infantino&#x27;s approval, that Infantino&#x27;s name would be engraved on the 2025 FIFA Club World Cup trophy. The trophy also included the following passage, &quot;We are witness to a new age. The golden era of club football: the era of the FIFA Club World Cup. The pinnacle of all club competitions. Inspired by the FIFA president Gianni Infantino.&quot;",
    "published": "1 day ago"
  },
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/organisation/president",
    "snippet": "The official site of the international governing body of football with news, national associations, competitions, results, fixtures, development, organisation, world rankings, statistics, the International Football Association Board, history, laws of the game, futsal, publications, downloads, ...",
    "published": null
  },
  {
    "title": "What are the FIFA Best Awards? And who is nominated this year? - The Athletic",
    "url": "https://www.nytimes.com/athletic/6891405/2025/12/16/fifa-best-awards-bonmati-putellas-dembele-hakimi/",
    "snippet": "FIFA president Gianni Infantino, who handed U.S.",
    "published": "15 hours ago"
  },
  {
    "title": "Gianni Infantino",
    "url": "https://www.forbes.com/profile/gianni-infantino/",
    "snippet": "A big proponent of Video Assistant Referee (VAR), Infantino successfully push for the feature to be present for the first time at the 2018 World Cup. Infantino took the helm at FIFA in February 2016, a few months after his predecessor, <strong>Sepp Blatter</strong> ...",
    "published": null
  },
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "^ Following the provisional exclusion on Sepp Blatter, <strong>Issa Hayatou</strong> assumed the Office of FIFA President on an interim basis in accordance with article 32(6) of the FIFA Statutes because Hayatou was the longest-serving vice-president on FIFA&#x27;s ...",
    "published": "1 month ago"
  }
]