[
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "In late November 2012, Times executive editor Jill Abramson declared her wish to keep Silver and his blog: &quot;We would love to have Nate continue to be part of The New York Times family, and to expand on what he does&quot;, she said. &quot;We know he began in sports anyway, so it is not an exclusively political product. I am excited to talk to Nate when he finishes his book tour about ways to expand that kind of reporting.&quot; On July 22, 2013, ESPN (a subsidiary of the Walt Disney Company) announced that it had acquired ownership of the FiveThirtyEight website and brand, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming months.&quot;",
    "published": "1 week ago"
  },
  {
    "title": "Nate Silver makes move to ESPN - ESPN",
    "url": "https://www.espn.com/espn/story/_/id/9499752/nate-silver-joins-espn-multifaceted-role",
    "snippet": "I&#x27;m excited to expand FiveThirtyEight&#x27;s data-driven approach into new areas, while also reuniting with my love of sports,&quot; Silver said in a statement released by ESPN. &quot;I&#x27;m thrilled that we&#x27;re going to be able to create jobs for a great team of journalists, writers and analysts.",
    "published": "July 22, 2013"
  },
  {
    "title": "How ESPN and ABC landed Nate Silver - POLITICO",
    "url": "https://www.politico.com/blogs/media/2013/07/how-espn-and-abc-landed-nate-silver-168888",
    "snippet": "ESPN has deep pockets, and the rich, multi-platform offer to Silver, funded mostly by ESPN, is a drop in the bucket. Under the deal, to be announced soon, his flagship will return to FiveThirtyEight.com, which currently clicks through to NYTimes.com. The business model mirrors Grantland’s: a strong, independent brand that ladders up to the bigger brand of ESPN (and, in this case, ABC News). Nate will appear on the air on ESPN and ABC, and will get “verticals,” or web hubs, devoted to a variety of new topics.",
    "published": null
  },
  {
    "title": "Nate Silver - ESPN | LinkedIn",
    "url": "https://www.linkedin.com/in/natesilver/",
    "snippet": "Experience: ESPN · Location: Piscataway · 185 connections on LinkedIn. View Nate Silver’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": null
  },
  {
    "title": "Nate Silver of FiveThirtyEight Blog Is to Join ESPN Staff - The New York Times",
    "url": "https://www.nytimes.com/2013/07/20/business/media/nate-silver-blogger-for-new-york-times-is-to-join-espn-staff.html",
    "snippet": "He occasionally hinted in interviews and public appearances that his relationship with The Times had moments of tension. But it was mutually beneficial. The news organization gained Web traffic and prestige by hosting his work, and he received a salary, a wider audience and editorial support. The same will most likely be true at ESPN.",
    "published": "July 20, 2013"
  }
]