[
  {
    "title": "Sooronbay Jeenbekov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sooronbay_Jeenbekov",
    "snippet": "Sooronbay Sharip uulu Jeenbekov (born 16 November 1958) is a Kyrgyz politician who served as the fifth president of Kyrgyzstan from 2017 until his resignation in 2020, following a week of protests.",
    "published": "October 3, 2025"
  },
  {
    "title": "Sooronbay Jeenbekov - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q23810819",
    "snippet": "Sooronbay Jeenbekov · series ordinal · 18 · member of cabinet · First Jeenbekov Cabinet · 0 references · President of Kyrgyzstan · start time · 24 November 2017 · replaces · Almazbek Atambaev · elected in · 2017 Kyrgyz presidential election · end time · 15 October 2020 ·",
    "published": null
  },
  {
    "title": "2019 Kyrgyz protests - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2019_Kyrgyz_protests",
    "snippet": "These events were associated with an attempt to detain the former President of the country, Almazbek Atambayev, which led to clashes between his supporters and security forces. This was a key moment in the modern history of Kyrgyzstan, which revealed the depth of political tension in the country and sparked numerous discussions about the legitimacy of the authorities&#x27; actions and human rights and led to the overthrow of President Sooronbay Jeenbekov ...",
    "published": "August 31, 2025"
  },
  {
    "title": "Kyrgyzstan election: Euphoria turns to insecurity as mob rule spreads",
    "url": "https://www.bbc.com/news/world-asia-54458948",
    "snippet": "Many in Kyrgyzstan blame President Sooronbay Jeenbekov for allowing systematic vote buying and other widespread irregularities during the parliamentary election to ensure that only parties loyal to him won seats in parliament.",
    "published": "October 8, 2020"
  },
  {
    "title": "1,376 Sooronbay Jeenbekov Photos & High Res Pictures - Getty Images",
    "url": "https://www.gettyimages.com/photos/sooronbay-jeenbekov",
    "snippet": "Kyrgyz President Sooronbai Jeenbekov holds the presidential certificate during his inauguration ceremony at the Ala-Archa state residence in Bishkek... Kyrgyzstan&#x27;s President Sooronbay Jeenbekov arrives at the Great Hall of the People for a meeting with China&#x27;s President Xi Jinping on April 28, 2019...",
    "published": null
  }
]