[
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "On 1 December 2025, Marcelo Rebelo de Sousa was <strong>admitted to University Hospital of São João, in Porto, for urgent surgery due to an incarcerated hernia</strong>, after feeling unwell.",
    "published": "1 week ago"
  },
  {
    "title": "Portuguese President Rebelo de Sousa hospitalised following emergency surgery | Euronews",
    "url": "https://www.euronews.com/2025/12/02/portuguese-president-rebelo-de-sousa-hospitalised-following-emergency-surgery",
    "snippet": "The Portuguese head of state was admitted to hospital late on Monday afternoon &quot;after feeling unwell following digestive issues,&quot; but is <strong>said to be recovering following an emergency hernia operation</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Marcelo Rebelo de Sousa valida OE2026 e valoriza contributo parlamentar",
    "url": "https://www.idealista.pt/news/imobiliario/habitacao/2025/12/23/73213-marcelo-rebelo-de-sousa-valida-oe2026-e-valoriza-contributo-parlamentar",
    "snippet": "<strong>O Presidente da República promulgou esta segunda-feira, dia 22 de dezembro de 2025 o Orçamento do Estado para 2026 (OE2026),</strong> salientando a contribuição do parlamento “para a estabilidade financeira interna e externa” e considerando que ...",
    "published": "4 hours ago"
  },
  {
    "title": "Marcelo vetoes decrees of the nationality law due to unconstitutionality. Sul Informação",
    "url": "https://www.sulinformacao.pt/en/2025/12/marcelo-veta-por-inconstitucionalidade-decretos-da-lei-da-nacionalidade/",
    "snippet": "<strong>The two decrees now had to be vetoed on grounds of unconstitutionality by the President of the Republic</strong>, Marcelo Rebelo de Sousa, who, in response to requests from the Socialist Party, decided not to submit any provisions of these decrees to ...",
    "published": "4 days ago"
  },
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "The current <strong>president of Portugal</strong> is Marcelo Rebelo de Sousa, who took office on 9 March 2016.",
    "published": "1 week ago"
  }
]