[
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "Due to the delicate and contentious political status of Taiwan, China has two Adhering Societies to the IMU, which split the voting rights in the General Assembly. The Chinese Mathematical Society in Beijing has three votes, and the Mathematical Society of the Republic of China, located in Tapei, has two votes. ... The International Mathematical Union is administered by an executive committee (EC) which conducts the business of the Union. The EC consists of the President, two vice-presidents, the Secretary, six Members-at-Large, all elected for a term of four years, and the Past President.",
    "published": "February 24, 2025"
  },
  {
    "title": "IMU News 132: July 2025 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/imu-news/archive/2025/imu-news-132-july-2025",
    "snippet": "The framed photograph is from 2002, when Chairman Jiang Zemin and Vice-Premier Li Lanqing received mathematicians during the ICM in Beijing, including Palis, then the President of the IMU. Photo credit: Paula Dugin · <strong>Jacob Palis</strong> passed away on May 7, 2025, at the age of 85, in Rio de Janeiro, ...",
    "published": null
  },
  {
    "title": "IMU University Wins Prestigious Award! – IMU University",
    "url": "https://imu.university/apacaward2025/",
    "snippet": "<strong>Soe Hein</strong>, President of IMU University; Jury Board of Global Startup Award and AEA: ASEAN Advisory Board, for this remarkable achievement! We extend our heartfelt gratitude to Dr. Marcus for his unwavering dedication, #visionary #leadership, and tireless efforts in driving IMU University towards ...",
    "published": null
  },
  {
    "title": "ICMI Newsletter - March 2025 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/icmi/icmi-newsletter-march-2025",
    "snippet": "Editors: Jean-Luc Dorier (ICMI Secretary-General) Jinfa Cai (ICMI Vice President) Lena Koch (ICMI Administrative Manager) Technical support: Vanessa Chung, IMU Secretariat · Publishing dates: March 15, June 15, September 15, December 15 · – From the desk of <strong>Merrilyn Goos</strong>, ICMI President ...",
    "published": null
  },
  {
    "title": "IMU News 129: January 2025 – Advances in Computer Proof Assistants & Mathematics",
    "url": "https://www.mathunion.org/imu-news/archive/2025/imu-news-129-january-2025",
    "snippet": "<strong>Ingrid Daubechies</strong>, James B. Duke Distinguished Professor Emerita of Mathematics and President of the IMU from 2011 to 2014, has been awarded the 2025 National Medal of Science, for her pioneering work on signal processing.",
    "published": null
  }
]