[
  {
    "title": "OFFICIAL: Real Madrid announce Xabi Alonso as new head coach | beIN SPORTS",
    "url": "https://www.beinsports.com/en-us/soccer/la-liga/articles-video/official-real-madrid-announce-xabi-alonso-as-new-head-coach-2025-05-25",
    "snippet": "Real Madrid confirmed this Sunday that <strong>Xabi Alonso will take over as the new head coach of the first team, replacing Italian manager Carlo Ancelotti</strong>. The coach from Tolosa will sign a three-year deal running from June 1, 2025, through June 30, ...",
    "published": null
  },
  {
    "title": "Where Real Madrid And A New Coach Go From Here | Managing Madrid",
    "url": "https://www.managingmadrid.com/2025/4/29/24420159/where-real-madrid-and-a-new-coach-go-from-here",
    "snippet": "The rest of the squad can be guided by a manager with fresh ideas. Carlo Ancelotti was exactly what Real Madrid needed when he came in, and remained the perfect coach for the job for three years — which is typically around the time where managers lose their influence.",
    "published": "April 29, 2025"
  },
  {
    "title": "Next Real Madrid manager: Jurgen Klopp, Zinedine Zidane & the seven candidates to replace doomed Xabi Alonso after Man City humbling | Goal.com",
    "url": "https://www.goal.com/en/lists/next-real-madrid-manager-candidates-replace-xabi-alonso/blt3905b704d8cc77a4",
    "snippet": "Alonso is a progressive coach who needs time to stamp an identity, but that luxury is never on offer in Madrid. Change is inevitable if the inconsistency continues, and there are already seven candidates in the frame to replace the Spaniard.",
    "published": "5 days ago"
  },
  {
    "title": "8 Potential Replacements for Xabi Alonso as Real Madrid Head Coach",
    "url": "https://bleacherreport.com/articles/25323948-8-potential-replacements-xabi-alonso-real-madrid-head-coach",
    "snippet": "After being involved with the playing staff when the club secured promotion in 2023-24, he took the team to 10th in Serie A last season in his first year as a full head coach. <strong>In 2025-26, the 38-year-old has Como up in sixth after 14 games</strong>.",
    "published": null
  },
  {
    "title": "Next Real Madrid manager candidates: Ranking best options to replace Xabi Alonso as coach, including Zidane | Sporting News",
    "url": "https://www.sportingnews.com/us/soccer/real-madrid/news/next-real-madrid-manager-candidates-ranking-replace-xabi-alonso/245f89eb8df943951a2cd9d0",
    "snippet": "There&#x27;s almost no chance of Zidane committing to the Real Madrid job long-term given the prospect of taking over France. However, <strong>it&#x27;s entirely possible that Zidane signs on to coach his old club for the rest of the 2025/26 season</strong> while he waits ...",
    "published": "6 days ago"
  }
]