[
  {
    "title": "ESOblog: In conversation with Catherine Cesarsky: the former ESO Director General talks new projects, leadership and future scientific advances",
    "url": "https://www.eso.org/public/france/blog/in-conversation-with-catherine-cesarsky/",
    "snippet": "In celebration of International Women’s Day, we spoke to Catherine Cesarsky, who was <strong>ESO Director General between 1999 and 2007.</strong> Since then, she has taken on a number of prestigious leadership roles including President of the International ...",
    "published": null
  },
  {
    "title": "Dr. Catherine Cesarsky | ESO",
    "url": "https://www.eso.org/public/about-eso/dg-office/ccesarsk/?lang=",
    "snippet": "From <strong>August 2006 to August 2009</strong>, Catherine Cesarsky was President of the International Astronomical Union.",
    "published": null
  },
  {
    "title": "Dr Catherine Cesarsky | SKAO",
    "url": "https://www.skao.int/en/540/dr-catherine-cesarsky",
    "snippet": "Prof Cesarsky was President of the International Astronomical Union <strong>(2006 to 2009</strong>) and Haut Commissaire à l’énergie atomique in France (2009 to 2012), an advisor to the French government for science and energy issues. Prof Cesarsky continues to be a high-level Science Advisor at CEA.",
    "published": null
  },
  {
    "title": "Catherine Cesarsky - President Elect of the International Astronomical Union (IAU)",
    "url": "https://www.eso.org/public/france/news/eso0323/",
    "snippet": "Catherine Cesarsky, as President Elect for a three-year period <strong>(2003-2006</strong>). The IAU is the world&#x27;s foremost organisation for astronomy, uniting almost 9000 professional scientists on all continents.",
    "published": null
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "Catherine Cesarsky, as <strong>President for a three-year period (2006-2009).</strong> The IAU is a body of distinguished professional astronomers, founded in 1919 to promote and safeguard the science of astronomy in all its aspects through international cooperation.",
    "published": null
  }
]