[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Initially ignored as a novelty ... fights for control over the party, Ventura <strong>left the Reform Party a year after taking office and served the remainder of his term as a member of the Independence Party of Minnesota</strong>....",
    "published": "2 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Ventura (Green Party of Alaska) lost in the general election on November 3, 2020. ... Ventura ran for governor of Minnesota in 1998. <strong>Ventura was elected as a member of the Reform Party, but later left and reorganized the Minnesota Reform Party as the Independence Party</strong>.[1] He did not seek a ...",
    "published": null
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "Citing political infighting and poor leadership, Ventura <strong>left the Reform Party in 2000 and subsequently joined the Independence Party</strong>. He decided not seek a second term as governor.",
    "published": "January 14, 2009"
  },
  {
    "title": "Jesse Ventura considering run for president as independent",
    "url": "https://thehill.com/homenews/campaign/463672-jesse-ventura-considering-run-for-president-as-independent/",
    "snippet": "<strong>He left that party in 2000 to join the Independence Party of Minnesota</strong>. Ventura, who has a program on Russia Today, floated the possibility of running for president as a Libertarian in 2016, but ultimately did not do so.",
    "published": "September 30, 2019"
  },
  {
    "title": "Jesse Ventura Officially Joins Green Party, Spurring 2020 Talk - Independent Political Report",
    "url": "https://independentpoliticalreport.com/2020/05/jesse-ventura-officially-joins-green-party-spurring-2020-talk/",
    "snippet": "In recent days, Ventura has made ... from Ventura’s time as governor when he belonged to the <strong>centrist Minnesota Independence Party, the affiliate of the Reform Party</strong>....",
    "published": "May 3, 2020"
  }
]