[
  {
    "title": "Prime Minister of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Canada",
    "snippet": "The prime minister serves at His Majesty&#x27;s pleasure, meaning the post does not have a fixed term, and once appointed and sworn in by the governor general, the prime minister remains in office until they resign, are dismissed, or die. While the lifespan of a parliament is constitutionally limited to five years, a 2007 amendment to the Canada Elections Act, Section 56.1(2) limited the term of a Parliament to four years, with election day being set as the third Monday in October of the fourth calendar year after the previous polling date.",
    "published": "October 20, 2025"
  },
  {
    "title": "Mark Carney - Prime Minister of Canada | Prime Minister of Canada",
    "url": "https://www.pm.gc.ca/en",
    "snippet": "<strong>Prime Minister Carney</strong> announces new agreement to accelerate the construction of major projects in Ontario ... The government’s plan for generational investments that will build, protect, and empower Canada.",
    "published": "3 days ago"
  },
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "<strong>Mark Joseph Carney</strong> (born March 16, 1965) is a Canadian politician and economist who has been serving as the 24th prime minister of Canada since 2025. He has also been leader of the Liberal Party and the member of Parliament (MP) for Nepean since 2025.",
    "published": "6 hours ago"
  },
  {
    "title": "Prime Minister of Canada (@CanadianPM) / X",
    "url": "https://x.com/CanadianPM?lang=en",
    "snippet": "As #G7Kananaskis concludes, Canada worked with G7 nations to strengthen collective security, advance global energy security and the digital transition, and build economic resilience. We now pass the torch to France to carry this momentum forward. https://ow.ly/qhH850XMLAt ... Prime Minister Carney met virtually with Canada&#x27;s premiers to discuss building a more resilient Canadian economy through deepening trade relationships and delivering supports for Canada’s strategic industries most affected by U.S.",
    "published": "May 9, 2008"
  },
  {
    "title": "Prime Minister of Canada - YouTube",
    "url": "https://www.youtube.com/@CanadianPM",
    "snippet": "This is the official YouTube channel for <strong>Mark Carney</strong>, Prime Minister of Canada. The Prime Minister of Canada is also featured on: twitter.com/CanadianPM Videos made available through this YouTube profile are subject to a Canadian Crown Copyright ...",
    "published": null
  }
]