[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Electoral blocs are not present within the current law system of Russia, so it would be realised via means of a single party, RPR-PARNAS, which is not only eligible for participation in statewide elections, but is also currently not required to collect citizens&#x27; signatures for the right to participate in the State Duma elections scheduled for September 2016, due to the regional parliament mandate previously taken by Nemtsov. The candidates RPR-PARNAS would appoint were to be chosen via primary elections. On 5 July 2015, Kasyanov was elected as the only leader of RPR-PARNAS, and the party was renamed to just PARNAS. He added he would like to eventually re-establish the institution of co-chairmanship, adding, &quot;Neither Alexei Navalny nor Mikhail Khodorkovsky will enter our party today and be elected as co-chairmen.",
    "published": "2 days ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. In 2000, while he was still a student, Navalny joined <strong>Yabloko</strong>, ...",
    "published": "March 7, 2023"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "On 22 February 2018, the former deputy coordinator of the Moscow headquarters of the presidential campaign of Alexei Navalny, Vitaly Serukanov, stated on his Facebook page that documents had been submitted to the Ministry of Justice to rename the party Civic Position to <strong>Party of Progress</strong>.",
    "published": "September 30, 2025"
  },
  {
    "title": "Alexei Navalny’s wife and political heir still has ‘big hopes’ for Russia",
    "url": "https://www.politico.eu/article/alexei-navalny-yulia-navalnaya-political-heir-big-hopes-russia/",
    "snippet": "“I really have big hopes for Russia,” Yulia Navalnaya said in an interview at this year’s POLITICO 28 event. “I understand that it’s very difficult moment. It’s very difficult, difficult moment for the world. It’s very difficult moment for Europe, and, of course, it’s awful time for Russia.” · “But still, as I said, it’s very important for me to continue my husband’s work … He every day showed me, for many years, that never give up.” ... Navalnaya, who lives in exile, has become a prominent voice for anti-Kremlin Russians since the sudden and mysterious death of her husband in a prison camp north of the Arctic Circle in February 2024.",
    "published": "5 days ago"
  },
  {
    "title": "True Beliefs and Opportunism: Navalny’s Tangled Political Development - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/02/01/true-beliefs-and-opportunism-navalnys-tangled-political-development-a72797",
    "snippet": "In 1999, Navalny made his first foray into formal politics, joining the center-left pro-European liberal party, <strong>Yabloko</strong>.",
    "published": "September 1, 2025"
  }
]