[
  {
    "title": "Trainer Markus Kauczinski beim TSV 1860 München: „Wie geil ist das denn?“ - Sport - SZ.de",
    "url": "https://www.sueddeutsche.de/sport/tsv-1860-muenchen-kauczinski-neuer-trainer-li.3324407",
    "snippet": "<strong>Markus Kauczinski übernimmt nach anderthalb Jahren Pause als neuer Trainer den Drittligisten TSV 1860 München</strong>.",
    "published": "October 10, 2025"
  },
  {
    "title": "Zwei Ausfälle – Kauczinski muss 1860 München gegen SC Verl umbauen",
    "url": "https://www.merkur.de/sport/tsv-1860/trotz-verletzungskrise-kauczinski-muss-auf-drei-positionen-umbauen-94087386.html",
    "snippet": "Eigentlich ist der Rückkehrer außen zu Hause, wurde von Kauczinski im Training aber auch schon mal innen ausprobiert. Der Trainer selbst reagiert gelassen auf die vielen Ausfälle. „Niemand ist unersetzlich“, sagte zu unserer Zeitung. Auch die Diskussion um wiederkehrende Schiedsrichter-Benachteiligungen befeuert er nicht. Laut dem Portal liga3-online ist 1860 München zwar das Team mit den meisten Fehlentscheidungen gegen sich (14) – vor Samstag-Gegner Verl (10).",
    "published": "6 days ago"
  },
  {
    "title": "(k+) Pragmatisch, ehrgeizig, unprätentiös: Kauczinski legt los bei 1860 - Erfahrung mit Aufstiegskonstellationen",
    "url": "https://www.kicker.de/pragmatisch-ehrgeizig-unpraetentioes-kauczinski-legt-los-bei-1860-1154786/artikel",
    "snippet": "<strong>Markus Kauczinski startet beim TSV 1860 München</strong>.",
    "published": "October 12, 2025"
  },
  {
    "title": "Zwei tolle Nachrichten zum Start für 1860-Trainer Kauczinski",
    "url": "https://merkur.de/sport/tsv-1860/startschuss-fuer-neuen-1860-trainer-markus-kauczinski-tsv-muenchen-zr-93983637.html",
    "snippet": "<strong>Markus Kauczinksi legt beim TSV 1860 München los</strong>. Heute, das erste Training unter dem neuen Trainer. Der Live-Ticker von der Grünwalder Straße 114. Update vom 13. Oktober, 16:00 Uhr: Nach knapp 90 Minuten beendete Markus Kauczinski sein erstes ...",
    "published": "October 15, 2025"
  },
  {
    "title": "Markus Kauczinski als neuer Trainer bei 1860 München vorgestellt | Fußball News | Sky Sport",
    "url": "https://sport.sky.de/fussball/artikel/markus-kauczinski-als-neuer-trainer-bei-1860-muenchen-vorgestellt/13447773/34240",
    "snippet": "<strong>Markus Kauczinski ist neuer Trainer beim Drittligisten 1860 München</strong>. Wie der Klub am Donnerstagabend mitteilte, übernimmt der 55-Jährige ab dem kommenden Montag die Geschicke beim kriselnden Traditionsklub.",
    "published": "October 9, 2025"
  }
]