[
  {
    "title": "Fiat - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat",
    "snippet": "Fiat Automobiles has received many international awards for its vehicles, including nine European Car of the Year awards, the most of any other manufacturer, and it ranked many times as the lowest level of CO2 emissions by vehicles sold in Europe. On 11 July 1899, Giovanni Agnelli was part of the group of founding members of FIAT, Fabbrica Italiana Automobili Torino.",
    "published": "2 weeks ago"
  },
  {
    "title": "FIAT Group HQ in Turin, Italy (Google Maps)",
    "url": "https://virtualglobetrotting.com/map/fiat-group-hq/view/google/",
    "snippet": "FIAT Group, or Fiat S.p.A. is a European automobile manufacturer, financial and industrial group based in <strong>Turin, Northern Italy</strong>; founded in 1899 by a group of investors including Giovanni Agnelli.",
    "published": "April 6, 2011"
  },
  {
    "title": "Where is Fiat Chrysler Automobiles Located? HQ, Global Offices & Company Insights",
    "url": "https://www.highperformr.ai/company/fca-group",
    "snippet": "Fiat Chrysler Automobiles established in 2014 and headquartered in <strong>Auburn Hills</strong>., Learn more about Fiat Chrysler Automobiles offices, leadership team, mission, and growth journey.",
    "published": null
  },
  {
    "title": "Fiat - Official Website",
    "url": "https://www.fiat.com/",
    "snippet": "Welcome to the official international website of Fiat. Discover our models, Fiat world, the history of the brand and all our latest news.",
    "published": null
  },
  {
    "title": "Fiat S.p.A. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_S.p.A.",
    "snippet": "Fiat-brand cars are built in several locations around the world. Outside Italy, the largest country of production is Brazil, where the Fiat brand is the market leader. The group also has factories in Argentina, Poland and Mexico (where Fiat-brand vehicles are manufactured at plants owned and ...",
    "published": "3 weeks ago"
  }
]