[
  {
    "title": "Executive Board | ETH Zurich",
    "url": "https://ethz.ch/en/the-eth-zurich/organisation/executive-board.html",
    "snippet": "More information about the Vice President for Personnel Development and Leadership · More information about the Secretary General · The Executive Board enacts decrees and administrative rules. Moreover, it regulates the organization of the school. It decides on the founding, renaming, and cancellation of departments and other units. It appoints the Prorectors as well as representatives for special tasks, and it makes employer’s decisions for all employees of ETH Zurich.",
    "published": null
  },
  {
    "title": "Leadership and development – Staffnet | ETH Zurich",
    "url": "https://ethz.ch/staffnet/en/employment-and-work/leadership-and-development.html",
    "snippet": "ETH Zurich is committed to an <strong>open leadership culture based on dialogue</strong> and actively supports the personal development of its employees.",
    "published": null
  },
  {
    "title": "Professor of Leadership | ETH Zurich",
    "url": "https://ethz.ch/en/the-eth-zurich/working-teaching-and-research/faculty/faculty-affairs/ausgeschriebene-professuren/management-und-sozialwissenschaften/Prof_Leadership.html",
    "snippet": "The ideal candidate is an internationally recognised scholar with an outstanding publication record in top-tier management journals and a proven track record of innovative teaching activities for a diverse student body at the undergraduate and graduate levels, as well as in continuing and executive education. In general, at ETH Zurich undergraduate level courses are taught in German or English and graduate level courses are taught in English.",
    "published": null
  },
  {
    "title": "President | ETH Zurich",
    "url": "https://ethz.ch/en/the-eth-zurich/organisation/executive-board/president.html",
    "snippet": "Professor Dr. <strong>Joël Mesot</strong> has been President of ETH Zurich since 1 January 2019.",
    "published": null
  },
  {
    "title": "Executive Board – Staffnet | ETH Zurich",
    "url": "https://ethz.ch/staffnet/en/organisation/executive-board.html",
    "snippet": "The Executive Board of ETH Zürich (f.l.t.r.): <strong>Ulrich Weidmann, Julia Dannath, Günther Dissertori, Christian Wolfrum, Joël Mesot, Vanessa Wood, Stefan Spiegel, Katharina Poiger (General Secretary).</strong>",
    "published": null
  }
]