[
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Peter Norvig (born 14 December 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google. Norvig is the co-author with Stuart J. Russell of the most ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Norvig",
    "url": "https://norvig.com/",
    "snippet": "Distinguished Education Fellow at Stanford HAI, Research Director at Google. Co-author of Artificial Intelligence: A Modern Approach, the leading AI textbook used in 1,500+ universities worldwide. peter@norvig.com / resume / github / medium / photo gallery / legacy homepage",
    "published": null
  },
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "Programmer, designer, author, and manager in high tech R&amp;D. Specialties: internet… · Experience: Stanford Institute for Human-Centered Artificial Intelligence (HAI) · Location: Palo Alto · 500+ connections on LinkedIn. View Peter Norvig’s profile on LinkedIn, a professional community ...",
    "published": "1 week ago"
  },
  {
    "title": "Peter Norvig - AI for Good",
    "url": "https://aiforgood.itu.int/speaker/peter-norvig/",
    "snippet": "Peter Norvig is a Director of Research at <strong>Google Inc</strong>. Previously he was head of Google&#x27;s core search algorithms group, and of NASA Ames&#x27;s Computational",
    "published": "March 25, 2025"
  },
  {
    "title": "Fame | Peter Norvig net worth and salary income estimation Jul, 2025 | People Ai",
    "url": "https://peopleai.com/fame/identities/peter-norvig",
    "snippet": "Peter Norvig Affiliation: <strong>Google Inc.</strong> ... Very short Bio (90 words) He is co-author of Artificial Intelligence: A Modern Approach, the leading textbook in the field, and co-teacher of an Artifical Intelligence class that signed up 160,000 students, ...",
    "published": null
  }
]