[
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "15 December 2025 - 15:17 · On the occasion of Court Employees’ Day, President of Ukraine <strong>Volodymyr Zelenskyy signed decrees appointing judges to local and appellate courts following the results of open competitions</strong>.",
    "published": "13 hours ago"
  },
  {
    "title": "Zelenskyy sets out Ukraine’s red lines in press conference with Macron – as it happened | Ukraine | The Guardian",
    "url": "https://www.theguardian.com/world/live/2025/dec/01/zelenskyy-macron-us-ukraine-russia-steve-witkoff-jared-kushner-moscow-europe-live-latest-news-updates",
    "snippet": "In his comments, Macron also notes that <strong>Ukraine has been open to various proposals on ceasefire and ending the war throughout 2025</strong>, with Russia repeatedly blocking them from progressing.",
    "published": "2 weeks ago"
  },
  {
    "title": "November 25, 2025 – Ukraine war news | CNN",
    "url": "https://www.cnn.com/world/live-news/russia-ukraine-us-peace-plan-trump-11-25-25",
    "snippet": "... In this photo provided by the Ukrainian Presidential Press Office, Ukrainian President <strong>Volodymyr Zelensky</strong> shakes hands with US Army Secretary Dan Driscoll in Kyiv, Ukraine, on November 20.",
    "published": "3 weeks ago"
  },
  {
    "title": "Ukraine drops NATO goal as Trump envoy sees progress in peace talks | Reuters",
    "url": "https://www.reuters.com/world/europe/zelenskiy-demands-dignified-peace-us-ukraine-officials-meet-berlin-2025-12-14/",
    "snippet": "REUTERS/Kylie Cooper Purchase Licensing Rights, opens new tab ... BERLIN/KYIV, Dec 14 (Reuters) - <strong>President Volodymyr Zelenskiy offered to drop Ukraine&#x27;s aspirations to join the NATO military alliance</strong> as he held five hours of talks with U.S.",
    "published": "2 days ago"
  },
  {
    "title": "Zelenskyy says Ukraine ready for elections in 60-90 days with guarantees | Fox News",
    "url": "https://www.foxnews.com/world/zelenskyy-appears-change-his-mind-holding-elections-after-trumps-criticism",
    "snippet": "Zelenskyy said <strong>Ukraine could be ready for its first election since Russia&#x27;s 2022 invasion if international partners provide security guarantees</strong>.",
    "published": "6 days ago"
  }
]