[
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman bin Abdulaziz Al Saud (Arabic: سلمان بن عبد العزيز آل سعود; born 31 December 1935) is King of Saudi Arabia, a position he has held since 2015. He was also <strong>Prime Minister of Saudi Arabia from 2015 to 2022</strong>. He is the 25th son of King Abdulaziz, the founder of Saudi Arabia.",
    "published": "November 3, 2025"
  },
  {
    "title": "Salman bin Abdulaziz al-Saud | Today's latest from Al Jazeera",
    "url": "https://www.aljazeera.com/tag/salman-bin-abdulaziz-al-saud/",
    "snippet": "World leaders from US President Barack Obama to fellow Arab monarchs hail late king and his government’s policies. Salman, <strong>defence minister since 2011</strong>, takes the throne at age of 79 after demise of his half-brother King Abdullah.",
    "published": null
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "From 13 to 16 May 2025, Donald Trump undertook his first major international trip of his second term, visiting Saudi Arabia, Qatar, and the United Arab Emirates. Trump and Mohammed signed a &quot;strategic economic partnership&quot; agreement. The visit elevated Mohammed&#x27;s standing within the Saudi government as King Salman, who did not appear during the Saudi visit, has largely receded from public view.",
    "published": "1 day ago"
  },
  {
    "title": "Saudi Arabia King Salman: Latest News, Photos, Videos on Saudi Arabia King Salman - NDTV.COM",
    "url": "https://www.ndtv.com/topic/saudi-arabia-king-salman",
    "snippet": "Saudi Arabia&#x27;s King Salman <strong>has a lung infection and is undergoing a treatment programme involving antibiotics</strong>, the Royal Court said Sunday in the latest update on the ageing monarch&#x27;s health.",
    "published": null
  },
  {
    "title": "How rich is Saudi Arabia’s King Salman bin Abdulaziz Al Saud? Net worth in 2025 | World News - The Times of India",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/how-rich-is-saudi-arabias-king-salman-bin-abdulaziz-al-saud-net-worth-in-2025/articleshow/125961000.cms",
    "snippet": "Fahda bint Falah Al Hithlain – ... arm, gallbladder surgery in 2020, and reported mild dementia, yet he <strong>continues to perform ceremonial duties as king</strong>.King Salman’s legacy is defined by modernizing Riyadh, steering the kingdom ...",
    "published": "1 week ago"
  }
]