[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the <strong>secretary of the Democratic Party (PD)</strong> since 12 March 2023. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Italy's left picks 'anti-Meloni' politician Elly Schlein to lead the party | Euronews",
    "url": "https://www.euronews.com/my-europe/2023/02/27/the-anti-meloni-meet-elly-schlein-italys-breakout-left-wing-star",
    "snippet": "Elly Schlein at an electoral rally in Modena, Italy. 2 September 2022 - AP Photo/Marco Vasini ... Italy&#x27;s <strong>centre-left Democratic Party (PD)</strong> has selected Elly Schlein as its new leader.",
    "published": "March 1, 2023"
  },
  {
    "title": "Meet the anti-Renzi: Elly Schlein becomes first woman leader of Italy’s center left",
    "url": "https://www.politico.eu/article/elly-schlein-first-woman-leader-italy-social-democratic-party/",
    "snippet": "... Elly Schlein has become the youngest leader and first woman at the helm of the PD | Fabio Frustaci/EPA-EFE ... Radical candidate Elly Schlein is the new leader of Italy’s traditionally <strong>center-left Democratic Party (PD),</strong> ...",
    "published": "February 27, 2023"
  },
  {
    "title": "Elly Schlein: The first woman and LGBTIQ+ leader of Italy’s left | openDemocracy",
    "url": "https://www.opendemocracy.net/en/5050/italy-left-elly-schlein-woman-lgbtiq-democratic-party/",
    "snippet": "Another woman has shaken up Italy’s male-dominated political scene – but this time, she’s a feminist, openly queer and left-wing. Say hello to Elly Schlein, 37, the new head of the <strong>progressive Democratic Party</strong> (PD).",
    "published": "March 9, 2023"
  },
  {
    "title": "Elly Schlein voted leader of Italy’s most important leftwing party in surprise win | Italy | The Guardian",
    "url": "https://www.theguardian.com/world/2023/feb/27/elly-schlein-voted-leader-of-italy-democratic-party-surprise-win",
    "snippet": "Vocal on social justice issues, Schlein, an Italian-American national, has been compared in Italy to the New York congresswoman Alexandria Ocasio-Cortez. She <strong>rejoined the Democratic party</strong> after leaving in 2015 out of frustration over the direction ...",
    "published": "February 27, 2023"
  }
]