[
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "He was one of 24 athletes inducted as inaugural members of the IAAF Hall of Fame. In November 2012, he was appointed chairman of the British Olympic Association. Coe was presented with the Lifetime Achievement award at the BBC Sports Personality of the Year in December 2012.",
    "published": "November 18, 2025"
  },
  {
    "title": "Sebastian Coe | GreatestBritons",
    "url": "https://greatestbritons.com/sebastian-coe-biography/",
    "snippet": "<strong>He is the oldest of four children who were encouraged to play sport by the family</strong>. When Sebastian was still very young the family moved to Warwickshire where he attended school in Stratford-Upon-Avon, before a further move saw Coe at a comprehensive ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Sebastian Coe | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/sebastian-coe",
    "snippet": "A grateful country has bestowed many awards and honors on Coe. He was <strong>made a member of the Order of the British Empire in 1982 and an Officer of the Order of the British Empire in 1990</strong>.",
    "published": null
  },
  {
    "title": "Running My Life: The Autobiography - Sebastian Coe - Google Books",
    "url": "https://books.google.com/books/about/Running_My_Life.html?id=zUZzMAEACAAJ",
    "snippet": "Sebastian Coe is a <strong>world record-breaking middle-distance runner who won four Olympic medals, including the 1500 metres gold medal, at the Olympic Games in Moscow 1980 and Los Angeles in 1984. He was aMember of Parliament for the Conservative Party from 1992-97 and later, Chief of Staff to William Hague. He was created a life peer in 2000 and was appointed a Knight Commander of the Order of the British Empire for services to sport in 2006.</strong>...",
    "published": null
  },
  {
    "title": "Sebastian Coe Biography - Facts, Childhood, Family Life & Achievements",
    "url": "https://www.thefamouspeople.com/profiles/sebastian-coe-6674.php",
    "snippet": "children: Alice India Violet Coe, Harry Sebastian Newbold Coe, Madeleine Rose Coe, Peter Henry Christopher Coe ... awards: Laureus World Sports Award for Lifetime Achievement - 2013 BBC Sports Personality of the Year Award - 1979 BBC Sports Personality of the Year Lifetime Achievement Award - 2012",
    "published": null
  }
]