[
  {
    "title": "Mikheil Kavelashvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikheil_Kavelashvili",
    "snippet": "Zourabichvili, along with opposition ... February 2025, the European Parliament passed a resolution stating that <strong>the European Union does not recognize Kavelashvili as the legitimate president of Georgia</strong>....",
    "published": "5 days ago"
  },
  {
    "title": "Mikheil Kavelashvili sworn in as Georgia's president amid political tensions",
    "url": "https://www.aa.com.tr/en/europe/mikheil-kavelashvili-sworn-in-as-georgias-president-amid-political-tensions/3437181",
    "snippet": "As she departed, <strong>she declared she was taking with her “legitimacy, the flag, and your trust”</strong> and vowed to continue her struggle. Last Sunday, Georgian Prime Minister Irakli Kobakhidze stated that Zourabichvili must vacate her post on the ...",
    "published": null
  },
  {
    "title": "Anti-Western Kavelashvili sworn in as Georgia's president, pro-EU Zourabichvili disputes legitimacy",
    "url": "https://kyivindependent.com/anti-western-kavelashvili-inaugurated-as-georgias-president/",
    "snippet": "Georgian anti-Western politician Mikheil Kavelashvili, an ally of the ruling Georgian Dream party, was inaugurated as the country&#x27;s sixth president on Dec. 29 in a move seen as <strong>illegitimate by the opposition</strong>.",
    "published": "December 29, 2024"
  },
  {
    "title": "Utkarsh",
    "url": "https://utkarsh.com/current-affairs/international/person-in-news-updates/ex-footballer-mikheil-kavelashvili-elected-georgias-president",
    "snippet": "Former footballer Mikheil Kavelashvili was <strong>elected as the new President of Georgia on 14 December, 2024</strong>.",
    "published": "November 19, 2025"
  },
  {
    "title": "Georgia: Ex-footballer Mikheil Kavelashvili named president",
    "url": "https://www.bbc.com/news/articles/c5ygejxej28o",
    "snippet": "Georgia&#x27;s outgoing pro-Western president, Salome Zourabichvili, has condemned Kavelashvili&#x27;s election as a travesty, insisting she holds Georgia&#x27;s only remaining legitimate institution. ... Prime Minister Irakli Kobakhidze has accused Zourabichvili of trying to harm Georgia&#x27;s interests, emphasising that when her term of office ends on 29 December, she will have to retire.",
    "published": "December 14, 2024"
  }
]