[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: one to do business in the United States and legally named Regency Entertainment (USA), Inc., one to do business overseas and legally named Monarchy Enterprises S.á.r.l.",
    "published": "2 days ago"
  },
  {
    "title": "Arnon Milchan Biography | Booking Info for Speaking Engagements",
    "url": "https://www.allamericanspeakers.com/celebritytalentbios/Arnon+Milchan/397739",
    "snippet": "Through his company Regency, in partnership with Warner Brothers, and later with Rupert Murdoch at 20th Century Fox, and other business ventures, such as Puma AG, Milchan acquired a net worth estimated at about $5.1 billion as of 2015. Arnon Milchan has produced over 130 films and is recognized as one of the most prolific producers in Hollywood history, with films such as Noah, 12 Years a Slave, Once Upon a Time in America (1984) (in which he also makes a cameo appearance as the chauffeur), Brazil (1985), Pretty Woman (1990), Under Siege (1992), Natural Born Killers (1994), Boys on the Side (1995), L.A.",
    "published": null
  },
  {
    "title": "Arnon Milchan",
    "url": "https://www.forbes.com/profile/arnon-milchan/",
    "snippet": "Arnon Milchan owns film and TV production company New Regency Enterprises.",
    "published": null
  },
  {
    "title": "New Regency Productions History: Founding, Timeline, and Milestones - Zippia",
    "url": "https://www.zippia.com/new-regency-productions-careers-703122/history/",
    "snippet": "... On May 21, 2008, they hired Hutch Parker as co-chairman of the studio. ... <strong>The Walt Disney Company inherited Fox&#x27;s stake in Regency Enterprises and New Regency Productions after Disney acquired 21st Century Fox&#x27;s assets on March 20, 2019.</strong>",
    "published": "July 21, 2023"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "Milchan has also successfully diversified his company’s activities within the sphere of entertainment, most specifically in the realm of television through Regency Television (“Malcom in the Middle” and “The Bernie Mac Show”), and sports where the company was once the largest shareholder of PUMA, the worldwide athletic apparel and show conglomerate based in Germany, which was later sold after a successful re-branding in 2003.",
    "published": null
  }
]