[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She previously played for WSL clubs <strong>Manchester United, Bristol Academy, Birmingham City, Doncaster Belles, and Reading, and in the Bundesliga with VfL Wolfsburg</strong>. Earps has represented England at under-17, under-19, and under-23 levels, and won her first senior cap in 2017.",
    "published": "8 hours ago"
  },
  {
    "title": "Mary Earps | Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/womens-team/squad/mary-earps",
    "snippet": "After a short spell abroad, she returned to England in summer 2019 to sign for Manchester United. In five seasons with the <strong>Red Devils</strong>, Mary Earps played nearly 100 games and won the 2024 Women’s FA Cup shortly before joining Paris Saint-Germain ...",
    "published": null
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "Before arriving at Manchester United, Earps spent time playing for hometown club <strong>Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg</strong>. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in ...",
    "published": null
  },
  {
    "title": "Mary Earps signs for Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/womens-team/content/mary-earps-signs-for-paris-saint-germain-psg-feminines-women-mercato-2024-2025",
    "snippet": "The England international goalkeeper has signed a contract with the Parisian club until June 2026. Mary Earps began her professional career with <strong>Doncaster Rovers</strong> before moving on to a number of big-name clubs in England, including Birmingham ...",
    "published": null
  },
  {
    "title": "r/WomensSoccer on Reddit: Mary Earps: from Spoty winner to PSG bench (with no shirts in club shop)",
    "url": "https://www.reddit.com/r/WomensSoccer/comments/1ft17uf/mary_earps_from_spoty_winner_to_psg_bench_with_no/",
    "snippet": "Her form doesn’t warrant it and didn’t before her injury/move to PSG, imo. More replies More replies · I&#x27;d highly recommend it&#x27; - Lionesses star Mary Earps explains why she would &#x27;encourage&#x27; England players to move abroad as she continues to enjoy life at PSG",
    "published": "September 30, 2024"
  }
]