[
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "For example, both President George W. Bush and his brother, Florida governor Jeb Bush, referred to José María Aznar as &quot;president&quot; on separate occasions, and Donald Trump referred to <strong>Mariano Rajoy</strong> both as &quot;President&quot; and &quot;Mr. President&quot; during Rajoy&#x27;s 2017 White House visit.",
    "published": "3 weeks ago"
  },
  {
    "title": "Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pedro_S%C3%A1nchez",
    "snippet": "<strong>Pedro Sánchez Pérez-Castejón</strong> (Spanish pronunciation: [ˈpeðɾo ˈsantʃeθ ˈpeɾeθ kasteˈxon] ⓘ; born 29 February 1972) is a Spanish politician and economist who has served as Prime Minister of Spain since 2018. He has also been Secretary-General of the Spanish Socialist Workers&#x27; Party ...",
    "published": "4 days ago"
  },
  {
    "title": "Pedro Sánchez | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/pedro-sanchez",
    "snippet": "After a road trip in which he reconnected with party voters, Sánchez was once again elected the leader of the PSOE in May 2017. On June 1, 2018, Sánchez called for a parliamentary vote of no confidence in Prime Minister Rajoy. Rajoy’s People’s Party had been embroiled in a corruption scandal, and just the week before, his former treasurer and several top members of the People’s Party had been found guilty of taking illegal kickbacks. The no-confidence vote passed with 180 of 350 votes. In accordance with Spain’s system, which requires the initiator of a no-confidence vote to propose a new prime minister, Sánchez succeeded the ousted Rajoy and was sworn in on June 2, 2018.",
    "published": null
  },
  {
    "title": "Prime Minister of Spain | Current Leader",
    "url": "https://planetrulers.com/spain-prime-minister/",
    "snippet": "On 31 May 2018 the PSOE filed a no-confidence motion, which passed with the support of the PSOE, Unidos Podemos, and Basque, Valencian and Catalan regionalist and nationalist parties. On 1 June 2018, a Royal Decree named <strong>Pedro Sánchez</strong> Prime ...",
    "published": "December 31, 2018"
  },
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "<strong>Mariano Rajoy</strong>, Spanish politician who served as prime minister of Spain from 2011 to 2018. He took office amid the European debt crisis and implemented harsh but effective austerity measures.",
    "published": "December 6, 2011"
  }
]