[
  {
    "title": "Socialist Party (France) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Socialist_Party_(France)",
    "snippet": "The PS is a member of the Party of European Socialists, Progressive Alliance and Socialist International. The PS was founded in 1969 from a merger of the French Section of the Workers&#x27; International (SFIO), the Convention of Republican Institutions led by <strong>François Mitterrand, and other groups</strong>.",
    "published": "4 weeks ago"
  },
  {
    "title": "Socialist Party (PS) | Britannica",
    "url": "https://www.britannica.com/topic/Socialist-Party-France",
    "snippet": "Socialist Party (PS), major French political party formally established in 1905. The Socialist Party traces its roots to the French Revolution. Its predecessor parties, formed in the 19th century, drew inspiration from political and social theorists such as Charles Fourier, Henri de Saint-Simon,",
    "published": "July 20, 1998"
  },
  {
    "title": "Socialist Party of France (1902) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Socialist_Party_of_France_(1902)",
    "snippet": "The Socialist Party of France (Parti socialiste de France) was a socialist political party. The party was founded in 1902 during a congress in Commentry by the merger of the Marxist French Workers&#x27; Party led by <strong>Jules Guesde and the Blanquist Socialist Revolutionary Party of Édouard Vaillant</strong>.",
    "published": "September 21, 2025"
  },
  {
    "title": "French Socialist Party",
    "url": "https://spartacus-educational.com/FRsocialist.htm",
    "snippet": "The first socialist party formed in France was the Workers Party in 1880. Its first leader was <strong>Paul Lafargue</strong>, the son-in-law of Karl Marx. The party suffered from internal divisions and by 1895 had split into five different parties.",
    "published": null
  },
  {
    "title": "Socialist Party, France - Oxford Reference",
    "url": "https://www.oxfordreference.com/display/10.1093/oi/authority.20110803100515255",
    "snippet": "Formed in 1905, the SFIO (Section Française de l&#x27;Internationale Ouvrière, French Section of the Socialist International) united the hitherto fragmented socialist groups. These included the Marxists under J. Guesde, the revolutionary socialists, and the pragmatic socialists whose outstanding figure was Jaurès. The party had considerable success, gaining 104 seats in the Chamber of Deputies in 1914.",
    "published": null
  }
]