[
  {
    "title": "BC Partners to acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/bc-partners-acquire-com-hem",
    "snippet": "<strong>Carlyle and Providence acquired Com Hem from EQT in 2006</strong> and, in the same year, they acquired UPC, which was integrated with Com Hem. Under the ownership of Carlyle and Providence, the company has invested nearly SEK 4 billion on developing the company, upgrading the network to the highest ...",
    "published": null
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - <strong>The Carlyle Group and Providence Equity Partners today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT</strong>. Financial details were not disclosed. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  },
  {
    "title": "Com Hem",
    "url": "https://eqtgroup.com/about/current-portfolio/com-hem",
    "snippet": "<strong>EQT III acquired Com Hem AB, a Swedish cable TV operator, in 2003.</strong>",
    "published": null
  },
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "<strong>On 27 April 2021, the owner Tele2 discontinued the use of the Com Hem brand</strong>, while continuing to provide the same services under its own brand. ... The analogue package could also include a few local channels, usually an open access channel ...",
    "published": "June 6, 2025"
  },
  {
    "title": "Com Hem 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10876-33",
    "snippet": "Information on acquisition, funding, investors, and executives for Com Hem. Use the PitchBook Platform to explore the full profile.",
    "published": null
  }
]