[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "President Jokowi expressed his support for Prabowo&#x27;s plan to provide medical aid and instructed him to seek cooperation with the United Arab Emirates on operating a hospital in Gaza and flew to Jordan to attend a summit regarding to Gaza on Jokowi&#x27;s behalf. Prabowo&#x27;s idea also gained support from Prime Minister Anwar Ibrahim, who proposed a joint mission between Indonesia and Malaysia. In his speech at the 2025 United Nations General Assembly, Prabowo remarked that Indonesia would be willing to provide up &quot;20,000 or even more&quot; personnel for the mission.",
    "published": "2 days ago"
  },
  {
    "title": "President of Indonesia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Indonesia",
    "snippet": "Currently there are 14 decorations which will be bestowed upon them soon after taking office, namely: Star of the Republic of Indonesia, 1st Class (Bintang Republik Indonesia Adipurna) Star of Mahaputera, 1st Class (Bintang Mahaputera Adipurna) ... Sjafruddin Prawiranegara (19 December 1948 – 13 July 1949) – Head of the Emergency Government of the Republic of Indonesia.",
    "published": "4 weeks ago"
  },
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "<strong>Prabowo Subianto</strong> (born October 17, 1951, Jakarta, Indonesia) is a former general of the Indonesian army and businessman who is now president of Indonesia (2024– ). Prabowo is the third of four children born to Sumitro Djojohadikusumo, a Javanese ...",
    "published": "December 9, 2024"
  },
  {
    "title": "Indonesia - Travels of the President - Travels - Department History - Office of the Historian",
    "url": "https://history.state.gov/departmenthistory/travels/president/indonesia",
    "snippet": "Indonesia - Travels of the President - Travels - Department History · Further updates to the Travels of the President database are suspended while we work to modernize the data collection and processing work required to maintain this publication. Please see the White House homepage’s briefing room resources for current presidential travel. We invite questions and comments about this resource at history@state.gov. Notice posted, March 3, 2025.",
    "published": null
  },
  {
    "title": "Joint Statement on the Visit of H.E. Prabowo Subianto, President of the Republic of Indonesia, to Pakistan (8-9 December 2025)",
    "url": "https://mofa.gov.pk/press-releases/visit-of-he-prabowo-subianto-president-of-the-republic-of-indonesia-to-pakistan-8-9-december-2025-joint-statement",
    "snippet": "<strong>Prabowo Subianto</strong>, President of the Republic of Indonesia, paid an official visit to Pakistan on 8-9 December 2025. During the visit, President <strong>Prabowo Subianto</strong> held delegation level talks with Prime Minister Shehbaz Sharif and met with H.E.",
    "published": null
  }
]