[
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "In 1990, the organization was renamed the European Film Academy and registered as a non-profit association. In 1996, <strong>Wim Wenders</strong> succeeded Bergman as president, and Nik Powell, a British producer, was elected chairman. Mike Downey, an Irish-British film producer, was elected chairman in 2020.",
    "published": "September 3, 2025"
  },
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Producer <strong>Ada Solomon</strong> has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian film industry has achieved within the institution.",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "The European Film Academy membership has concluded its voting procedures for the 2026 intake, and as well as re-electing 10 members the election results bring three new members of the board for the next two years. Romanian producer <strong>Ada Solomon</strong> has ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Board membership restructuring for 2024 - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/european-film-academy-to-restructure-board-membership-for-2024/",
    "snippet": "In making these changes we will now rectify and recalibrate and the Academy will emerge stronger, more inclusive and fit for purpose for 2023 and years to come.” · <strong>Matthijs Wouter Knol</strong>, CEO and Director of the European Film Academy adds: ...",
    "published": "August 15, 2023"
  },
  {
    "title": "Team - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/team/",
    "snippet": "Meet the European Film Academy team, dedicated to supporting and promoting the richness of European cinema.",
    "published": "September 3, 2025"
  }
]