[
  {
    "title": "American Broadcasting Company - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/American_Broadcasting_Company",
    "snippet": "ABC is headquartered on <strong>Riverside Drive in Burbank, California</strong>, directly across the street from Walt Disney Studios and adjacent to the Team Disney – Roy E. Disney Animation Building. The network maintains secondary offices at 7 Hudson Square in New York City&#x27;s Lower Manhattan neighborhood, ...",
    "published": "3 weeks ago"
  },
  {
    "title": "ABC News (United States) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ABC_News_(United_States)",
    "snippet": "ABC News Live is a 24/7 streaming video news channel for breaking news, live events, newscasts and longer-form reports and documentaries operated by ABC News since 2018, The channel is available through DirecTV Stream, Disney+, FuboTV, Google TV, Haystack News, Hulu, LG Channels, Pluto TV, Prime Video Live TV, Samsung TV Plus, Sling Freestream, The Roku Channel, Tubi, Vizio Watch Free+, Xumo, and YouTube TV.",
    "published": "1 month ago"
  },
  {
    "title": "ABC News, 1717 Desales St NW, Washington, DC 20036, US - MapQuest",
    "url": "https://www.mapquest.com/us/district-of-columbia/abc-news-284228173",
    "snippet": "Get more information for ABC News in <strong>Washington, DC</strong>. See reviews, map, get the address, and find directions.",
    "published": null
  },
  {
    "title": "ABC News, 140 4th Ave N, Seattle, WA 98109, US - MapQuest",
    "url": "https://www.mapquest.com/us/washington/abc-news-410327007",
    "snippet": "Get more information for ABC News in <strong>Seattle, WA</strong>. See reviews, map, get the address, and find directions.",
    "published": null
  },
  {
    "title": "ABC News Headquarters, 47 W 66th St, New York, NY 10023, US - MapQuest",
    "url": "https://www.mapquest.com/us/new-york/abc-news-headquarters-436999890",
    "snippet": "ABC News Headquarters is a prominent media establishment based in <strong>New York, NY</strong>, specializing in delivering news content across various platforms.",
    "published": null
  }
]