[
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Jennifer Westacott AC is an Australian business executive. She served as the chief executive of the Business Council of Australia (BCA) from 2011 to 2023. She is the current <strong>chancellor of Western Sydney University</strong>. She grew up in Springfield in New South Wales, Australia and completed her secondary ...",
    "published": "June 10, 2025"
  },
  {
    "title": "KPMG announces three senior appointments | Media release",
    "url": "https://kpmg.com/au/en/media/media-releases/2024/07/kpmg-announces-three-senior-appointments.html",
    "snippet": "3 July 2025 – David Bradbury, Jennifer Westacott AO and Michael Ebeid AM join <strong>KPMG Australia</strong>.",
    "published": "July 29, 2025"
  },
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "In July 2024 Jennifer was appointed as a <strong>Special Advisor to KPMG</strong>.",
    "published": null
  },
  {
    "title": "Chancellor | Western Sydney University",
    "url": "https://www.westernsydney.edu.au/about_uws/leadership/chancellor",
    "snippet": "As Australia’s Business Champion to Indonesia, she is building closer investment, business and talent links with our nearest neighbour and emerging economic powerhouse. She also serves NSW as a <strong>global ambassador for business events</strong>. From 1 March 2025, Jennifer has served on the Reserve Bank ...",
    "published": null
  },
  {
    "title": "Jennifer Westacott AC - KPMG Australia | LinkedIn",
    "url": "https://www.linkedin.com/in/jennifer-westacott-ac-9aa853146/",
    "snippet": "🔸Research Themes: - Climate Communication: data, discourse, and disinformation - Environmental Histories: of the Southern Ocean and Subterranean Cities in the Asia-Pacific - Creative Methods: for climate action and storytelling approaches to climate adaptation - Climate Justice: ethics of care in disaster journalism and youth-led climate communication - Sustainability: and environmental transitions 🔸Scholarship Benefits: - Tax-free stipend: $36,063 AUD per annum (2025 rate) - International mobility grants: and professional development opportunities - Collaborative research environment: with leading researchers and interdisciplinary teams 🗓Deadline: Monday, 29 September 2025, at 11:55 PM AEST 🔗Learn More: https://lnkd.in/d8r2-zHT",
    "published": "November 17, 2021"
  }
]