[
  {
    "title": "David Hurley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley",
    "snippet": "<strong>2025–: Chancellor of the Australian University of Theology</strong> · Hurley is an Honorary Patron of the ACT Veterans Rugby Club, Patron of Transport Heritage NSW, Patron of the Australian World Orchestra, and the Australian Future Leaders Foundation. As of 2020 he is one of three patrons of the ...",
    "published": "October 31, 2025"
  },
  {
    "title": "Australian University of Theology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Australian_University_of_Theology",
    "snippet": "In October 2024, the tribunal decision ... updates to its constitution in early 2025, it was renamed as Australian University of Theology. <strong>David Hurley became the inaugural chancellor</strong>....",
    "published": "November 8, 2025"
  },
  {
    "title": "David Hurley – A tribute to influential Australian Christians",
    "url": "https://atributetoaustralianchristians.wordpress.com/2018/12/18/david-hurley/",
    "snippet": "Governor-General Hurley and Prime Minister Morrison praying · Recent Christian soldiers who became Australian Governor Generals · Peter Cosgrove “in the end, the motivation to get out of bed in the morning and to be one of Christ’s children is an act of faith”. http://m.ncregister.com/daily-news/peter-cosgrove-from-college-chancellor-to-australias-governor-general",
    "published": "August 25, 2022"
  },
  {
    "title": "Our Board | IHEA",
    "url": "https://ihea.edu.au/our-board/",
    "snippet": "David believes strongly in the importance of a clear and compelling voice to speak on behalf of independent higher education. He is passionate about advocacy for policy that treats all higher education providers fairly and equitably, and is proud of the reputational rise of independent higher education over many years. His academic expertise is theology, having completed a PhD at Australian Catholic University and having taught in theology for a number of years, and his professional background is organisational management.",
    "published": null
  },
  {
    "title": "Faculty of Theology and Philosophy at ACU",
    "url": "https://www.acu.edu.au/about-acu/faculties-directorates-and-staff/faculty-of-theology-and-philosophy",
    "snippet": "The Hon Justice Martin Daubney AM and Ms Virginia Bourke have been appointed to the positions of Chancellor and Pro-Chancellor of Australian Catholic University (ACU).",
    "published": null
  }
]