[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "The Speaker of the House of Representatives, Tony Smith, had determined that there was a prima facie case and, in voting down the motion, the Morrison government became the first government since Federation to refuse a referral from the Speaker. This decision attracted significant attention and criticism from the media.",
    "published": "1 week ago"
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "As the pandemic ebbed, Morrison and Australians were faced with another catastrophic weather-related event.",
    "published": "August 30, 2018"
  },
  {
    "title": "Scott Morrison | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/politics-and-government/scott-morrison",
    "snippet": "As prime minister, he led Australia through significant events, including <strong>the devastating bushfire season of 2019-2020 and the COVID-19 pandemic</strong>, but faced considerable criticism for his handling of these crises and internal party conflicts.",
    "published": null
  },
  {
    "title": "Scott Morrison | CNAS",
    "url": "https://www.cnas.org/people/scott-morrison",
    "snippet": "During Mr. Morrison’s term as Prime Minister <strong>Australian defence spending increased to more than 2% of GDP</strong> and he updated Australia’s defence strategy and security posture to address an increasingly assertive China.",
    "published": "May 4, 2023"
  },
  {
    "title": "Scott Morrison: Rise and fall of Australia's divisive pandemic leader",
    "url": "https://www.bbc.com/news/world-australia-45292331",
    "snippet": "Mr Morrison <strong>negotiated a landmark defence pact with the US and the UK in 2021, called Aukus</strong>. The agreement - widely seen as a joint effort to counter China&#x27;s growing military might - re-aligns Australia more closely with the US.",
    "published": "January 23, 2024"
  }
]