[
  {
    "title": "\"El daño es superlativo\": Aníbal Fernández llamó a \"levantar la voz\" contra el Gobierno POLÍTICA El Intransigente",
    "url": "https://elintransigente.com/2025/12/el-dano-es-superlativo-anibal-fernandez-llamo-a-levantar-la-voz-contra-el-gobierno/",
    "snippet": "El exjefe de Gabinete, Aníbal Fernández, analizó la situación actual de Argentina en una entrevista con Radio 10 y se mostró duramente crítico con el Gobierno.",
    "published": "1 week ago"
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "In 2021, he was appointed as <strong>Minister of Security</strong>. This happened as part of changes in the government after the 2021 legislative primary elections. He served in this role until December 2023.",
    "published": null
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Fernández received a degree in ... gobernador de la Provincia de Buenos Aires y actualmente <strong>jefe de Gabinete de Ministros de la presidencia de la República Argentina</strong>....",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "Following the infant malnutrition scandal in Tucumán in November 2002, Fernández famously stated that this was caused by &quot;a sick society and a ruling class that are sons of bitches, all of them.&quot; He was believed to be planning to run for Governor of Buenos Aires Province in the 2007 elections, but his party (Front for Victory) chose Daniel Scioli instead. Newly elected President Cristina Kirchner appointed him to her cabinet as Minister of Justice, Security and Human Rights following her inauguration in December 2007.",
    "published": "November 15, 2025"
  },
  {
    "title": "Buenos Aires Times | Aníbal Fernández: ‘I understand and share the president’s view on re-election’",
    "url": "https://www.batimes.com.ar/news/argentina/anibal-fernandez-there-will-be-a-guarantee-of-everybody-being-able-to-compete-so-that-there-are-no-complications.phtml",
    "snippet": "<strong>Security Minister</strong> Aníbal Fernández, who has won the confidence of both Alberto Fernández and Cristina Fernández de Krichner in his lengthy political career occupying posts of key importance in different Peronist governments, gave an interview ...",
    "published": "April 28, 2023"
  }
]