[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "During a cabinet meeting on 22 January 2025, Prabowo remarked that he is the first president to oversee a budget that is &quot;up to the ninth unit&quot; and announced that he will cut non-essential spending in his government, from cutting budget for official trips by the ministry to banning ceremonial events that is considered as waste of budget. Doing so, Prabowo managed to cut the budget up to Rp. 306,6 trillion through Presidential Instruction Number 1 of 2025, and the slashed funds will be relocated towards policies that will benefit the people, such as the free school lunch (Indonesian: Makan Bergizi Gratis (MBG), literally: Free Nutritious Lunch) program.",
    "published": "2 days ago"
  },
  {
    "title": "Indonesia Records Notable Improvements in Leadership and Institutional Strength, According to the Chandler Good Government Index 2025 | The Manila Times",
    "url": "https://www.manilatimes.net/2025/12/16/tmt-newswire/pr-newswire/indonesia-records-notable-improvements-in-leadership-and-institutional-strength-according-to-the-chandler-good-government-index-2025/2244045",
    "snippet": "Indonesia Records Notable Improvements in Leadership and Institutional Strength, According to the Chandler Good Government Index 2025",
    "published": "9 hours ago"
  },
  {
    "title": "World Report 2025: Indonesia | Human Rights Watch",
    "url": "https://www.hrw.org/world-report/2025/country-chapters/indonesia",
    "snippet": "The government’s policies undermined free elections, weakened legislative checks on executive powers, and led to an increase in corruption, including in the management of natural resources. The armed forces interfered in civilian affairs. Indonesia’s parliament passed a new criminal code ...",
    "published": "January 16, 2025"
  },
  {
    "title": "The return of the smiling general to Indonesian politics | East Asia Forum",
    "url": "https://eastasiaforum.org/2025/11/26/the-return-of-the-smiling-general-to-indonesian-politics/",
    "snippet": "The Jakarta Post’s headline ‘Prabowo tightens grip, redraws political map’ captured his aim of transformative governance. Its editorial board described a presidency of ‘ambition without reform’, while an accompanying op-ed warned that his actions echo former Indonesian president Suharto’s paternal authoritarianism, emerging as Indonesia’s new ‘smiling general’ as he frames command as compassion. Prabowo’s first year was choreographed through both policy and performance. In October 2025, he delivered three carefully sequenced speeches tracing his governing philosophy of discipline, compassion and continuity.",
    "published": "3 weeks ago"
  },
  {
    "title": "Indonesia - World Leaders",
    "url": "https://www.cia.gov/resources/world-leaders/foreign-governments/indonesia",
    "snippet": "All Foreign Governments · Last Updated: 8/21/2025 · <strong>PRABOWO Subianto Djojohadikusumo</strong> · GIBRAN Rakabuming Raka · Muhaimin ISKANDAR · AIRLANGGA Hartarto · Zulkifli HASAN · PRATIKNO · Agus Harimurti YUDHOYONO · YURSIL Ihza Mahendra · ...",
    "published": null
  }
]