[
  {
    "title": "Hawker Siddeley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Siddeley",
    "snippet": "In 1962, A.V. Roe Canada was dissolved and the remaining assets were transferred to the now defunct Hawker Siddeley Canada. In 1948, the company name was changed to Hawker Siddeley Group. The aircraft division became Hawker Siddeley Aviation (HSA) and the guided missile and space technology ...",
    "published": "August 29, 2025"
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "Later, Hawker Siddeley merged into what is eventually known today as BAE Systems, the British aerospace and defence business. The de Havilland name lives on in De Havilland Canada, which owns the rights to the name and the aircraft produced by de Havilland&#x27;s former Canadian subsidiary, including the Dash 8 regional airliner previously produced by Bombardier Aerospace.",
    "published": "November 1, 2025"
  },
  {
    "title": "Hawker Siddeley | BAE Systems | en - Canada",
    "url": "https://www.baesystems.com/en-ca/heritage/hawker-siddeley",
    "snippet": "This resulted in 2 major consortiums, British Aircraft Corporation and the Hawker Siddeley Aviation. Hawker Siddeley Aircraft was already well-established as a major aircraft manufacturer of aircraft such as the Hunter when it merged with De Havilland Aircraft Company and Blackburn Aircraft Company in 1960.",
    "published": null
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "Commuter airlines did not create ... DHC-7 Dash 7. <strong>In 1974, the year before the Dash 7 first flew, the Canadian government purchased de Havilland Canada from its British owners, Hawker Siddeley Aviation</strong>....",
    "published": null
  },
  {
    "title": "Hawker Siddeley Canada Limited - Archeion",
    "url": "https://www.archeion.ca/hawker-siddeley-canada-limited",
    "snippet": "A.V. Roe Canada’s non-aviation elements were renamed Hawker Siddeley Canada Limited on May 1, 1962. <strong>Its aviation interests were transferred to de Havilland Canada on July 27, 1962</strong>.",
    "published": null
  }
]