[
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "On 1 December 2025, Marcelo Rebelo de Sousa was <strong>admitted to University Hospital of São João, in Porto, for urgent surgery due to an incarcerated hernia</strong>, after feeling unwell.",
    "published": "1 week ago"
  },
  {
    "title": "Portuguese President Rebelo de Sousa hospitalised following emergency surgery | Euronews",
    "url": "https://www.euronews.com/2025/12/02/portuguese-president-rebelo-de-sousa-hospitalised-following-emergency-surgery",
    "snippet": "The Portuguese head of state was <strong>admitted to hospital late on Monday afternoon &quot;after feeling unwell following digestive issues,&quot; but is said to be recovering following an emergency hernia operation</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "President recovering from surgery - The Portugal News",
    "url": "https://www.theportugalnews.com/news/2025-12-02/president-recovering-from-surgery/925830",
    "snippet": "In a press conference to provide ... that <strong>Marcelo Rebelo de Sousa will now have to eat and get up so the medical team can assess his condition and, if all is well, he will only have tests done and it is expected that he can be discharged on Wednesday</strong>...",
    "published": "2 weeks ago"
  },
  {
    "title": "President to be discharged from hospital - The Portugal News",
    "url": "https://www.theportugalnews.com/news/2025-12-03/president-to-be-discharged-from-hospital/926668",
    "snippet": "By TPN/Lusa, in News · 03 Dec ... Maria João Baptista said that <strong>the head of state &quot;ate well and will have to undergo some tests&quot; and should leave the hospital &quot;within a few hours.&quot;</strong>...",
    "published": "2 weeks ago"
  },
  {
    "title": "Rebelo de Sousa cancels state visit to Spain, scheduled for next week, due to health problems",
    "url": "https://thediplomatinspain.com/en/2025/12/05/rebelo-de-sousa-cancels-state-visit-to-spain-scheduled-for-next-week-due-to-health-problems/",
    "snippet": "The 76-year-old president <strong>underwent emergency surgery at a hospital in Porto on Monday, December 1, after experiencing digestive discomfort upon returning from a trip. Rebelo de Sousa was discharged two days later, but doctors estimate that his recovery could take approximately two weeks</strong>...",
    "published": "2 weeks ago"
  }
]