[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 and resigned on 6 October 2025, but was re-appointed on 10 October.",
    "published": "1 day ago"
  },
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "<strong>Sébastien Lecornu</strong> (French: [sebastjɛ̃ ləkɔʁny]; born 11 June 1986) is a French politician who has served as Prime Minister of France since 2025.",
    "published": "1 day ago"
  },
  {
    "title": "French PM wins crucial budget vote",
    "url": "https://www.bbc.com/news/articles/c3w7530w37po",
    "snippet": "Lecornu is Macron&#x27;s fourth prime minister since then – the two previous incumbents Michel Barnier and François Bayrou were both forced to resign after trying to rein in France&#x27;s burgeoning debt. Barnier stepped down exactly a year ago after failing to push through his 2025 social security budget.",
    "published": "1 week ago"
  },
  {
    "title": "France’s prime minister faces crunch vote in parliament | Politics News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/12/9/frances-prime-minister-faces-crunch-vote-in-parliament",
    "snippet": "French Prime Minister <strong>Sebastien Lecornu</strong> gives a statement on October 8, 2025. [AFP] (AFP) ... France’s National Assembly is set to vote on a major social security budget bill, in a critical test for the embattled Prime Minister <strong>Sebastien Lecornu</strong>, ...",
    "published": "1 week ago"
  },
  {
    "title": "France’s latest prime minister has resigned after less than a month – what will Emmanuel Macron do now?",
    "url": "https://theconversation.com/frances-latest-prime-minister-has-resigned-after-less-than-a-month-what-will-emmanuel-macron-do-now-266817",
    "snippet": "Attal resigned and was replaced by the rightwing <strong>Michel Barnier</strong>, who survived just a few months in the job before losing a confidence vote in the assembly. Barnier gave way to François Bayrou, who survived slightly longer in office before also ...",
    "published": "October 6, 2025"
  }
]