[
  {
    "title": "Northwest Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Northwest_Stadium",
    "snippet": "<strong>Northwest Stadium</strong> is a multi-purpose stadium in Landover, Maryland, located within the census-designated place of Summerfield 2.5 miles (4 km) east of Washington, D.C. It is the home venue of the National Football League (NFL) team Washington Commanders.",
    "published": "1 month ago"
  },
  {
    "title": "Northwest Stadium | Washington Commanders, Concerts & Events | Northwest Stadium",
    "url": "https://northweststadium.com/",
    "snippet": "<strong>Northwest Stadium</strong> in Landover, MD, hosts Washington Commanders games, top concerts, and major events. Get tickets, schedules, and venue information!",
    "published": null
  },
  {
    "title": "Stadium Guide | Washington Commanders - Commanders.com",
    "url": "https://www.commanders.com/stadium/stadium-guide",
    "snippet": "To purchase official Washington Commanders merchandise online, go to store.commanders.com/ ... Located in the <strong>Hall of Fame Plaza between Gate D and the Bank of America Gate (Gate E),</strong> the Merrill Touchdown Club memberships feature Main Concourse ...",
    "published": null
  },
  {
    "title": "Northwest Stadium, Washington Commanders football stadium - Stadiums of Pro Football",
    "url": "https://www.stadiumsofprofootball.com/stadiums/northwest-stadium/",
    "snippet": "Just North of the nation’s capitol is <strong>Northwest Stadium</strong>, home of the Washington Commanders. No the stadium is not in Washington, DC, but in Landover, MD. For over two decades the team played at RFK Stadium, a multi-purpose stadium in the ...",
    "published": null
  },
  {
    "title": "Northwest Stadium | Washington Commanders - Commanders.com",
    "url": "https://www.commanders.com/stadium/ffodc",
    "snippet": "<strong>Northwest Stadium</strong>: the home of the Washington Commanders and the biggest Washington DC concerts",
    "published": null
  }
]