[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "Jacques Brunel (born 14 January 1954) is a French rugby union coach and former player. He was <strong>most recently the French national team head coach</strong>, having previously been assistant coach for his nation and had led the Italian national team between 2011 and 2016.",
    "published": "January 1, 2025"
  },
  {
    "title": "Jacques Brunel named new coach of France's national rugby team",
    "url": "https://www.france24.com/en/20171227-rugby-jacques-brunel-named-new-coach-france-national-team",
    "snippet": "Guy Noves was sacked on Wednesday as France coach after two torrid years at the helm with <strong>former Italy boss Jacques Brunel named as his successor</strong>, French rugby federation president Bernard Laporte announced.",
    "published": "December 27, 2017"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "With the otherworldly talents of Antoine Dupont, Damien Penaud, Romain Ntamack and Gregory Alldritt at his fingertips, the 55-year-old took his team to a 2022 Six Nations Grand Slam and four runners-up finishes. Coaching his side to the quarterfinals of their home Rugby World Cup a year ago, there is a sense that there is more to come from France as this talented group of players continues to mature. This could no more be seen than when France beat New Zealand 30-29 to register their third-straight win over the All Blacks in enthralling fashion. ... France’s head coach Jacques Brunel (L) before the Japan 2019 Rugby World Cup quarter-final match against Wales.",
    "published": "May 30, 2025"
  },
  {
    "title": "France national rugby union team - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q518116",
    "snippet": "head coach · <strong>Fabien Galthié</strong> · start time · November 2019 · 1 reference · reference URL · https://www.france24.com/en/20190428-france-rugby-fabien-galthie-jacques-brunel-coach-world-cup · retrieved · 28 April 2019 · archive URL · ...",
    "published": null
  },
  {
    "title": "List of France national rugby union team coaches - FamousFix List",
    "url": "https://www.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "He played as a back-row forward ... Sevens team and with the French Barbarians. ... <strong>Jacques Brunel (born 14 January 1954) is a French rugby union coach and former player</strong>....",
    "published": null
  }
]