[
  {
    "title": "Charlotte Merz: Age, Net Worth, Family & Career Highlights - Mabumbe",
    "url": "https://mabumbe.com/people/charlotte-merz-age-net-worth-family-career-highlights/",
    "snippet": "Their connection was immediate, ... raised three children together. Charlotte <strong>began her legal career in 1994 as a judge at the Arnsberg District Court, specializing in family law</strong>....",
    "published": "May 6, 2025"
  },
  {
    "title": "Newsminimalist",
    "url": "https://www.newsminimalist.com/articles/merzs-wife-charlotte-continues-her-judicial-career-in-germany-e5c3fa4f",
    "snippet": "Charlotte Merz, born in 1961, met Friedrich Merz while studying law, marrying him in 1981 and having three children. <strong>She became a judge specializing in family law, and currently leads an instance</strong>.",
    "published": "May 20, 2025"
  },
  {
    "title": "Friedrich Merz - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1502402/bio/",
    "snippet": "Member of European Parliament for CDUD (1989-1994). Military service with Self-propelled artillery, German Army (Bundeswehr) (1975-1976). <strong>Judge on the District Court of Saarbrücken (1985-1986)</strong>.",
    "published": null
  },
  {
    "title": "Who Is Judge Charlotte Merz, Wife Of New German Chancellor Friedrich Merz, Bio, Age, Children, Education, Religion And Net Worth - The SportsGrail",
    "url": "https://thesportsgrail.com/who-is-judge-charlotte-merz-wife-of-new-german-chancellor-friedrich-merz-bio-age-children-education-religion-and-net-worth/",
    "snippet": "Friedrich Merz has announced that he intends to keep his primary residence there if he becomes the next chancellor. Charlotte is a respected lawyer and reportedly works as a <strong>presiding judge and director of the Arnsberg District Court in Sauerland</strong>.",
    "published": "February 24, 2025"
  },
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "Merz is married to judge Charlotte Merz (née Gass). They have three children together and reside in Arnsberg in the Sauerland region. He is the first chancellor in 27 years (since Helmut Kohl) to have biological children (although Gerhard Schröder adopted a daughter from Russia in July 2004).",
    "published": "1 week ago"
  }
]