[
  {
    "title": "The Chair Company - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Chair_Company",
    "snippet": "Robinson and Kanin emailed Downey to offer him the role of Douglas, which he immediately accepted, without realizing it was a recurring part beyond the pilot episode. Downey filmed his scenes for the pilot shortly after having completed his acting role in the Paul Thomas Anderson film One Battle After Another (2025).",
    "published": "1 week ago"
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) - IMDb",
    "url": "https://www.imdb.com/news/ni65127703/",
    "snippet": "Producer Mike Downey, who is <strong>chair of the European Film Academy</strong> and whose co-production “Girls on Wire” is in Berlin competition, has unveiled a diverse slate of films from his production company Downey Ink at the European Film Market.",
    "published": null
  },
  {
    "title": "Mike Downey | Producer, Actor, Writer",
    "url": "https://www.imdb.com/name/nm0236026/",
    "snippet": "Mike Downey produced Agnieszka Holland&#x27;s CHARLATAN (2020) which was in the Berlinale competition. He <strong>joined the EFA Board in 2004, was elected deputy chairman in 2014, and chairman in 2020.</strong>",
    "published": null
  },
  {
    "title": "Jim Downey | The Chair Company Wiki | Fandom",
    "url": "https://chair-company.fandom.com/wiki/Jim_Downey",
    "snippet": "JavaScript is disabled in your browser · Please enable JavaScript to proceed · A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser",
    "published": null
  },
  {
    "title": "Behind-the-Scenes on Tim Robinson's Comedy Series, The ...",
    "url": "https://www.instagram.com/reel/DQ1-fdsieTi/",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  }
]