[
  {
    "title": "Nadia Calviño",
    "url": "https://www.eib.org/en/about/governance-and-structure/statutory-bodies/management-committee/members/nadia-calvino",
    "snippet": "Nadia Calviño is the President of the European Investment Bank. She was appointed on <strong>1 January 2024</strong>. Follow the President on",
    "published": "3 weeks ago"
  },
  {
    "title": "La Moncloa. 08/05/2019. Nadia Calviño to become chair of European Bank of Reconstruction and Development's board of governors [Government/News]",
    "url": "https://www.lamoncloa.gob.es/lang/en/gobierno/news/Paginas/2019/20190508chair-ebrd.aspx",
    "snippet": "The acting minister will take on the chair of the board of governors until its next annual assembly in <strong>May 2020.</strong> She replaces the Vice-President of the European Commission, Jyrki Katainen, in this rotating position.",
    "published": null
  },
  {
    "title": "Nadia Calviño - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nadia_Calvi%C3%B1o",
    "snippet": "Nadia María Calviño Santamaría (Spanish: [ˈnaðja kalˈβiɲo]; born 3 October 1968) is a Spanish economist and civil servant serving as the President of the European Investment Bank since January 2024. From <strong>June 2018 to December 2023</strong>, Calviño was part of the cabinets led by prime minister ...",
    "published": "6 days ago"
  },
  {
    "title": "EBRD Annual Meeting 2020 Governors’ and keynote statements",
    "url": "https://www.ebrd.com/annual-meeting-statements.html",
    "snippet": "Nadia Calviño, Chair of the EBRD Board of Governors · Documents will be added as they become available. Statement by Mr Rishi Sunak, Chancellor of the Exchequer, on behalf of the United Kingdom Government · Discours de M. Rishi Sunak, Chancelier de l’Échiquier, au nom du Gouvernement du Royaume-Uni ·",
    "published": null
  },
  {
    "title": "Nadia Calviño - President of the European Investment Bank | LinkedIn",
    "url": "https://lu.linkedin.com/in/nadiacalvino/en",
    "snippet": "President of the European Investment Bank · Experience: European Investment Bank (EIB) · Education: Universidad Nacional de Educación a Distancia - U.N.E.D. · Location: Luxembourg · 172 connections on LinkedIn. View Nadia Calviño’s profile on LinkedIn, a professional community of 1 ...",
    "published": "2 weeks ago"
  }
]