[
  {
    "title": "Board of Directors | Stellantis",
    "url": "https://www.stellantis.com/en/company/governance/board-of-directors",
    "snippet": "In addition, Henri de Castries currently serves as Chairman of Europe and Senior Advisor of General Atlantic; Chairman of the board of directors of AXA Assurances IARD Mutuelle; Chairman of the board of directors of AXA Assurances Vie Mutuelle; director of HSBC Holdings plc.; and Vice-Chairman of the board of directors of Nestlé S.A. ... Fiona Clare Cicconi was appointed employee representative on the Stellantis Board with effect from January 17, 2021.",
    "published": null
  },
  {
    "title": "Antonio Filosa Announces New Stellantis Leadership Team on First Day as CEO | Stellantis",
    "url": "https://www.stellantis.com/en/news/press-releases/2025/june/antonio-filosa-announces-new-stellantis-leadership-team",
    "snippet": "AMSTERDAM – <strong>Antonio Filosa</strong> today takes up the role as Chief Executive Officer of Stellantis N.V. and announces his new Stellantis Leadership Team, effective",
    "published": null
  },
  {
    "title": "Stellantis Announces Antonio Filosa – 25-Year Veteran of the Company – to Be Its New Chief Executive Officer | Stellantis",
    "url": "https://www.stellantis.com/en/news/press-releases/2025/may/stellantis-announces-antonio-filosa-25-year-veteran-of-the-company-to-be-its-new-chief-executive-officer",
    "snippet": "<strong>John Elkann</strong> will continue in his role as Executive Chairman when Antonio Filosa takes up his position as Chief Executive Officer on June 23. At that time, Antonio Filosa will also announce Stellantis’ new leadership team.",
    "published": null
  },
  {
    "title": "Stellantis Leadership Team - Company | Stellantis",
    "url": "https://www.stellantis.com/en/company/governance/stellantis-leadership-team",
    "snippet": "Prior to June 2025, he was Head of Programs &amp; Product Planning. In 2022, he was made Head of Global Parts &amp; Services having served as Deputy COO for Enlarged Europe from the creation of Stellantis in January 2021.",
    "published": null
  },
  {
    "title": "John Elkann Chairman Executive Director",
    "url": "https://www.stellantis.com/content/dam/stellantis-corporate/group/governance/leadership/bio/eng/John-Elkann.pdf",
    "snippet": "<strong>John Elkann</strong> was appointed Chairman of Stellantis on January · 17, 2021. He had previously been Chairman of Fiat S.p.A. from",
    "published": null
  }
]