[
  {
    "title": "Office of the Director | NIST",
    "url": "https://www.nist.gov/director",
    "snippet": "Craig Burkhardt was appointed to serve as the Deputy Under Secretary of Commerce for Standards and Technology and NIST Deputy Director in January 2025. In this role, he will serve as Acting Under Secretary and Acting NIST Director until a new director is confirmed by Congress.",
    "published": "March 16, 2009"
  },
  {
    "title": "NIST Senior Leadership | NIST",
    "url": "https://www.nist.gov/director/leadership",
    "snippet": "In this capacity, he is responsible for the NIST suite of technology partnership, quality, and advanced manufacturing programs, including the Hollings Manufacturing Extension Partnership, the Baldrige Performance Excellence Program, the Office of Advanced Manufacturing, the Technology Partnership Program and other extramural activities. ... Delwin Brockett is the Associate Director for Management Resources for the National Institute of Standards and Technology (NIST).",
    "published": "June 2, 2025"
  },
  {
    "title": "List of directors of the National Institute of Standards and Technology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_directors_of_the_National_Institute_of_Standards_and_Technology",
    "snippet": "The National Institute of Standards and Technology succeeded the National Bureau of Standards in 1988. Following is a list of the directors of both agencies. The number of NIST directors is a continuation of the number of NBS directors since Locascio is considered the 17th NIST director ...",
    "published": "3 weeks ago"
  },
  {
    "title": "National Institute of Standards and Technology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/National_Institute_of_Standards_and_Technology",
    "snippet": "Since 1989, the average tenure of NIST directors has fallen from 11 years to 2 years in duration. Since the 2011 reorganization of NIST, the director also holds the title of Under Secretary of Commerce for Standards and Technology.",
    "published": "1 month ago"
  },
  {
    "title": "NIST Organization Structure | NIST",
    "url": "https://www.nist.gov/director/nist-organization-structure",
    "snippet": "Associate Director S. Shyam Sunder · Communications Technology Laboratory Ari Feldman (Acting) ... NIST Center for Neutron Research James M. Adams · Physical Measurement Laboratory James G. Kushmerick · Research Data and Computing Office Gretchen Greene",
    "published": "September 22, 2025"
  }
]