[
  {
    "title": "Tiger Aspect - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tiger_Aspect",
    "snippet": "The present-day company was founded in 1993 from the merger of <strong>Bennett-Jones&#x27; Tiger Television and Paul Sommers&#x27; Aspect Film &amp; Television</strong>. It has also produced television dramas such as Murphy&#x27;s Law and Sherlock Holmes and the Case of the Silk Stocking, and in October 2006, its drama series ...",
    "published": "1 week ago"
  },
  {
    "title": "Tiger Aspect Productions - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Tiger_Aspect_Productions",
    "snippet": "Tiger Aspect Productions is a British film and television production company of Peter Bennett-Jones, founded in 1993 from the merger between Tiger Television and Aspect Film &amp; Television. In June 2006, the company was purchased by <strong>IMG Media</strong>, but ...",
    "published": "November 12, 2025"
  },
  {
    "title": "Tiger Aspect Productions - BlackBook Companies - BCG Pro",
    "url": "https://www.comedy.co.uk/pro/blackbook/companies/tiger_aspect_productions/",
    "snippet": "Originally known as Tiger Television, Tiger Aspect is one of the UK&#x27;s most successful production companies, prolific across a broad range of programme genres. Originally an independent company, Tiger Aspect was bought by <strong>IMG Media</strong> in 2006 and ...",
    "published": null
  },
  {
    "title": "Tiger Aspect Productions Ltd. | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/books/politics-and-business-magazines/tiger-aspect-productions-ltd",
    "snippet": "Private Company Incorporated: 1988 as Tiger Productions Employees: 79 Sales: $59.7 million (2003) NAIC: 512110 Motion Picture, Video Tape Production · Tiger Aspect Productions Ltd. is one of the United Kingdom&#x27;s most successful independent television and film production houses.",
    "published": null
  },
  {
    "title": "Tiger Aspect Productions (UK) | Closing Logo Group | Fandom",
    "url": "https://closinglogogroup.fandom.com/wiki/Tiger_Aspect_Productions_(UK)",
    "snippet": "Background: Tiger Aspect Productions is a British film and television production company founded by <strong>Peter Bennett-Jones</strong> in 1988 as Tiger Television. The company did not yet use an onscreen logo until 1989.",
    "published": null
  }
]