[
  {
    "title": "EBRD Board of Directors",
    "url": "https://www.ebrd.com/shareholders-and-board-of-governors.html",
    "snippet": "While retaining overall authority over the Bank, the Board of Governors delegates most powers to the Board of Directors, which is responsible for approving the EBRD&#x27;s country, sector and thematic strategies, policies and operations.",
    "published": null
  },
  {
    "title": "EBRD: staff, structure, history",
    "url": "https://www.ebrd.com/home/who-we-are.html",
    "snippet": "The EBRD is owned by 77 countries, as well as the European Union and the European Investment Bank. Each shareholder is represented on the Board of Governors, which has overall authority over the Bank. Our President is Odile Renaud-Basso (left). The President manages our work under the guidance of the Board of Directors.",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Bank_for_Reconstruction_and_Development",
    "snippet": "Currently (2024-2025) <strong>Slovenia is the Chair of Board of Governors, while Iceland and Turkey are the Vice Chairs</strong>. The Board of Directors consists of 23 members elected by the Board of Governors. These members can not be on the Board of Governors. Its function is to direct the general operations ...",
    "published": "1 week ago"
  },
  {
    "title": "Directors of the EBRD",
    "url": "https://www.ebrd.com/directors-of-the-ebrd.html",
    "snippet": "His 30-year career includes senior management and leadership positions in merchant banking, private equity, management consulting and engineering. He <strong>joined the EBRD in 2008 as a senior banker with the Corporate Equity team</strong>.",
    "published": null
  },
  {
    "title": "Matteo Patrone",
    "url": "https://www.ebrd.com/who-we-are/Executive-Committee-members.html",
    "snippet": "His 30-year career includes senior management and leadership positions in merchant banking, private equity, management consulting and engineering. He <strong>joined the EBRD in 2008 as a senior banker with the Corporate Equity team</strong>.",
    "published": null
  }
]