[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the secretary of the <strong>Democratic Party (PD)</strong> since 12 March 2023. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "1 week ago"
  },
  {
    "title": "Elly Schlein: The first woman and LGBTIQ+ leader of Italy’s left | openDemocracy",
    "url": "https://www.opendemocracy.net/en/5050/italy-left-elly-schlein-woman-lgbtiq-democratic-party/",
    "snippet": "Another woman has shaken up Italy’s male-dominated political scene – but this time, she’s a feminist, openly queer and left-wing. Say hello to Elly Schlein, 37, the new head of the <strong>progressive Democratic Party</strong> (PD).",
    "published": "March 9, 2023"
  },
  {
    "title": "Elena Ethel \"Elly\" Schlein - UJE - Ukrainian Jewish Encounter",
    "url": "https://ukrainianjewishencounter.org/en/elena-ethel-elly-schlein/",
    "snippet": "Elena Ethel (Elly) Schlein is an <strong>Italian politician</strong>. She was born in 1985 in Lugano, Switzerland. Her father, Melvin Schlein, is an American academic and",
    "published": "April 8, 2025"
  },
  {
    "title": "Italy's left picks 'anti-Meloni' politician Elly Schlein to lead the party | Euronews",
    "url": "https://www.euronews.com/my-europe/2023/02/27/the-anti-meloni-meet-elly-schlein-italys-breakout-left-wing-star",
    "snippet": "Italy&#x27;s <strong>centre-left Democratic Party (PD)</strong> has selected Elly Schlein as its new leader. The 37-year-old MP has emerged as a breakout star in Italian politics, and will hope her elevation to party leader brings a new beginning for the beleaguered ...",
    "published": "March 1, 2023"
  },
  {
    "title": "Meet the anti-Renzi: Elly Schlein becomes first woman leader of Italy’s center left",
    "url": "https://www.politico.eu/article/elly-schlein-first-woman-leader-italy-social-democratic-party/",
    "snippet": "A <strong>left-wing radical</strong> who abandoned the party last decade under centrist Prime Minister Matteo Renzi’s leadership and returned to the fold only a few months ago, Schlein cut her teeth by working as a volunteer for Barack Obama’s U.S. presidential ...",
    "published": "February 27, 2023"
  }
]