[
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) - IMDb",
    "url": "https://www.imdb.com/news/ni65127703/",
    "snippet": "“It is the company’s goal to connect with the best in writing from European and international masters, as well as engage with projects that demonstrate a social conscience and also have an engaged political agenda. I’m with Mayakovsky when he said, ‘Art is not a mirror to hold up to reality, it is a hammer to beat it into shape.’” Downey is developing two feature projects with Prague-based producer Sarka Cimbalova at Marlene Films: an adaptation of Kateřina Tučková’s hit novel “The White Water,” made in partnership with Jan Macola’s Mimesis Film; and “Razor Man,...",
    "published": null
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/mike-downey-downey-ink-berlin-slate-1236306279/",
    "snippet": "“It is the company’s goal to connect with the best in writing from European and international masters, as well as engage with projects that demonstrate a social conscience and also have an engaged political agenda. I’m with Mayakovsky when he said, ‘Art is not a mirror to hold up to reality, it is a hammer to beat it into shape.’” · Downey is developing two feature projects with Prague-based producer Sarka Cimbalova at Marlene Films: an adaptation of Kateřina Tučková’s hit novel “The White Water,” made in partnership with Jan Macola’s Mimesis Film; and “Razor Man,” written by Marek Epstein, whose credits include Agnieszka Holland’s “Charlatan.” As previously announced, Downey is executive producer on Holland’s “Franz,” which is also produced by Marlene Films.",
    "published": "February 16, 2025"
  },
  {
    "title": "Mike Downey • Producer and chairman of the European Film Academy - Cineuropa",
    "url": "https://cineuropa.org/en/interview/440528/",
    "snippet": "He has just been feted at the Stockfish Festival, where he received an honorary award and introduced Fatmir Koci’s The Rise &amp; Fall of Comrade Zylo [+see also: film review trailer interview: Fatmir Koci film profile], which he co-produced and co-wrote. Cineuropa: The Stockfish directors called you “an old friend of Iceland” [see the interview]. Can you tell us a little bit more about this connection? Mike Downey: In 2000, I launched Film and Music Entertainment (FAME UK) with my German partners – the aim was to create a unique Anglo-Irish production house that would collaborate with Europe in a creative and meaningful way.",
    "published": null
  },
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "Founded in 1988, the European Film Academy now unites more than 3,000 European film professionals with the common aim of promoting Europe’s film culture. Mike first joined the board of the European Film Academy 15 years ago and has served alongside a broad range of European film makers including Istvan Szabo, Volker Schloendorff, Wim Wenders, Nikita Mikhalkov, Pawel Pawlikowski, Agnes Jaoui, Krzystof Zanussi, and David Mackenzie .",
    "published": null
  },
  {
    "title": "Mike Downey (producer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mike_Downey_(producer)",
    "snippet": "In September 2020, it was announced that Downey would be the Honorary President of the 2020/2021 jury for the revamped LUX Prize, renamed LUX – the European Audience Film Award by the European Parliament and the European Film Academy (also known as LUX European Audience Film Award).",
    "published": "July 19, 2025"
  }
]