[
  {
    "title": "President's wife news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/wife",
    "snippet": "News about President&#x27;s wife <strong>Olena Zelenska</strong> on Official web site of the President of Ukraine",
    "published": "1 day ago"
  },
  {
    "title": "Olena Zelenska - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olena_Zelenska",
    "snippet": "On 11 September 2020, at the initiative of the President&#x27;s wife, Ukraine joined the Biarritz Partnership, undertaking commitments in the areas of gender equality and the development of barrier-free public space.",
    "published": "2 weeks ago"
  },
  {
    "title": "Meet Olena Zelenska, Ukrainian President Volodymyr Zelenskyy's wife: Their high-school love story - The Times of India",
    "url": "https://timesofindia.indiatimes.com/life-style/relationships/love-sex/meet-olena-zelenska-ukrainian-president-volodymyr-zelenskyys-wife-their-high-school-love-story/articleshow/118662272.cms",
    "snippet": "SAINT-LAURENT-SUR-MER, FRANCE - JUNE 6: Ukrainian President Volodymyr Zelensky and his wife <strong>Olena Zelenska</strong> arrive at the official international ceremony to mark the 80th anniversary of D-Day, at Omaha Beach on June 6, 2024 in Saint-Laurent-sur-Mer, ...",
    "published": "March 2, 2025"
  },
  {
    "title": "WHO IS OLENA ZELENSKA?: Untold Facts About Ukraine’s First Lady and Wife of President Volodymyr Zelensky: BALTIC PRESS, INDEPENDENT: 9798824570717: Amazon.com: Books",
    "url": "https://www.amazon.com/WHO-OLENA-ZELENSKA-President-Volodymyr/dp/B0B14HB5C4",
    "snippet": "She is well-known in Ukraine as the wife of President Volodymyr Zelenskyy. Also, Olena is now serving as Ukraine&#x27;s First Lady, an honorary role she has held since May 2019. She&#x27;s also a writer, having penned the screenplays for a number of films and television shows. As an added bonus, Zelenska is a co-founder of the production business Kvartal 95. After Russia&#x27;s invasion of Ukraine, she rose to prominence. She has the courage to speak up for her spouse and her family.",
    "published": null
  },
  {
    "title": "Who Is Olena Zelenska? Meet President, Volodymyr Zelenskyy's Wife Who Is The First Lady Of Ukraine",
    "url": "https://www.bollywoodshaadis.com/articles/volodymyr-zelenskyy-wife-olena-zelenska-love-story-high-school-best-friends-husband-wife-61299",
    "snippet": "The Ukrainian President, Volodymyr Zelenskyy, is married to <strong>Olena Zelenska</strong>, who is the First Lady of Ukraine. The couple got married on September 6, 2003, and are currently parents of two children, a son named Kyrylo and a daughter named Oleksandra.",
    "published": "March 1, 2025"
  }
]