[
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "Earlier, Nehru had served as prime minister of the Interim Government of India during the British Raj from 2 September 1946 until 14 August 1947, his party, the Indian National Congress having won the 1946 Indian provincial elections. Nehru was succeeded by <strong>Lal Bahadur Shastri</strong>, whose 1 year ...",
    "published": "1 week ago"
  },
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "After Indira Gandhi&#x27;s assassination, her son Rajiv Gandhi took charge until 1989, when a decade with five unstable governments began. This was followed by the full terms of P. V. Narasimha Rao, Atal Bihari Vajpayee, Manmohan Singh, and <strong>Narendra Modi</strong>, who is the current prime minister of India, ...",
    "published": "2 days ago"
  },
  {
    "title": "Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/",
    "snippet": "<strong>Shri Narendra Modi</strong> was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership.",
    "published": null
  },
  {
    "title": "List of all Prime Ministers of India (1947-2025) | India PM List",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1",
    "snippet": "List of all Prime Ministers of India till 2025: <strong>Narendra Modi</strong> is the current and 14th Prime Minister of India who assumed office on 10 June 2024. Jawaharlal Nehru is the first and the longest-serving Prime Minister of India while Indira Gandhi ...",
    "published": "August 22, 2025"
  },
  {
    "title": "Prime Ministers of India",
    "url": "https://archivepmo.nic.in/",
    "snippet": "May 22, 2004 - 26th May 2014 · <strong>Shri Atal Bihari Vajpayee</strong>",
    "published": null
  }
]