[
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "On 27 April 2017 Kinnevik acquired approximately 18.5% of the stock and became Com Hem&#x27;s largest stock holder. Com Hem also operated mobile services as an MVNO using its own brand and since early-2020, also with an online-only brand called Penny (managed by Tele2 since 2021) whose operations are modelled after Google Fi Wireless, and is also a broadband flanker brand using Com Hem/Tele2&#x27;s fixed-line infrastructure.",
    "published": "June 6, 2025"
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - <strong>The Carlyle Group and Providence Equity Partners</strong> today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT. Financial details were not disclosed. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  },
  {
    "title": "Com Hem",
    "url": "https://eqtgroup.com/about/current-portfolio/com-hem",
    "snippet": "<strong>EQT III</strong> acquired Com Hem AB, a Swedish cable TV operator, in 2003.",
    "published": null
  },
  {
    "title": "Com Hem 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10876-33",
    "snippet": "Com Hem Holding AB is a broadcast television company with services that include cable television, broadcast Internet, an ... PitchBook’s comparison feature gives you a side-by-side look at key metrics for similar companies. Personalize which data points you want to see and create visualizations instantly. Request a free trial · One of Com Hem’s 41 competitors is Virgin Media, a Corporate Backed or Acquired company based in Berkshire, United Kingdom.",
    "published": null
  },
  {
    "title": "BC Partners to acquire Com Hem — BC Partners",
    "url": "https://www.bcpartners.com/news/bc-partners-to-acquire-com-hem/",
    "snippet": "July 21, 2011 – <strong>BC Partners</strong>, a leading international private equity firm, today announces that it has signed an agreement to acquire Com Hem, Sweden’s leading TV, broadband and telephony company, from The Carlyle Group (“Carlyle”) and ...",
    "published": "April 28, 2025"
  }
]