[
  {
    "title": "John Garamendi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Garamendi",
    "snippet": "In the general election, he defeated Republican Wes Bannister, 52% to 38%. In fact, he was so confident of winning that he resigned his state senate seat early to give an advantage to his wife Patti, over her top rival for the seat, assemblyman Patrick Johnston (D-Stockton) for the upcoming special election to replace him. In 1991, while serving as California Insurance Commissioner, Garamendi seized Executive Life, a failing life insurance company, and resold it to French investors who turned out to be fronts for a government-owned French bank.",
    "published": "2 weeks ago"
  },
  {
    "title": "John Garamendi | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/john-garamendi/G000559",
    "snippet": "John Garamendi, the Representative from California - in Congress from <strong>2009 through Present</strong>",
    "published": null
  },
  {
    "title": "John Garamendi - Ballotpedia",
    "url": "https://ballotpedia.org/John_Garamendi",
    "snippet": "Garamendi earned a B.A. from the University of California at Berkeley in 1966 and an M.B.A. from Harvard University in 1970. His career experience includes working as the <strong>deputy secretary of the United States Department of the Interior, a businessman, and a rancher</strong>.",
    "published": null
  },
  {
    "title": "About John Garamendi | Congressman John Garamendi",
    "url": "https://garamendi.house.gov/about",
    "snippet": "He also authored the Rural Health Act of California, to ensure that underserved residents in rural communities had access to quality health care. Garamendi subsequently served <strong>four terms in the California State Senate</strong>, where he developed a state agenda to advance California’s economy and ...",
    "published": "August 22, 2023"
  },
  {
    "title": "Congressman John Garamendi |Representing the 8th District of California",
    "url": "https://garamendi.house.gov/",
    "snippet": "Reps. Garamendi and Ryan Call for Public Release of Venezuela Strike Footage ... WASHINGTON, D.C. - Today, Congressman John Garamendi (CA-08), senior member of the House Armed Services Committee and Ranking Member of the Readiness Subcommittee, joined Rep.",
    "published": null
  }
]