[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "In addition to wrestling, Ventura pursued an acting career, appearing in films such as Predator and The Running Man. Ventura <strong>entered politics in 1991 when he was elected mayor of Brooklyn Park, Minnesota, a position he held until 1995</strong>. He was the Reform Party candidate in the 1998 Minnesota ...",
    "published": "2 days ago"
  },
  {
    "title": "Governorship of Jesse Ventura | MNopedia",
    "url": "https://www.mnhs.org/mnopedia/search/index/event/governorship-jesse-ventura",
    "snippet": "Upon returning to Minnesota in 1987 he worked as a talk radio personality. <strong>He got his first political experience as nonpartisan mayor of Brooklyn Park, 1991–1995</strong>. In 1997 Ventura joined the Minnesota chapter of Ross Perot’s national Reform Party.",
    "published": "April 14, 2025"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Jesse Ventura was the Governor of Minnesota. Ventura <strong>assumed office on January 8, 1999</strong>. Ventura left office on January 6, 2003. Ventura (Green Party of Alaska, Unaffiliated) ran for election for President of the United States.",
    "published": null
  },
  {
    "title": "Jesse Ventura | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/jesse-ventura",
    "snippet": "<strong>During the 1990s, Ventura became increasingly involved in state politics</strong>. He joined the Minnesota Independence Party (later affiliated with H. Ross Perot as the Minnesota Reform Party) and supported MIP candidate Dean Barkley for the US Senate.",
    "published": null
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th Governor of Minnesota on <strong>November 3, 1998</strong> defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He served as Governor for one term. Shocking the political establishment, Ventura became the only Reform Party candidate to ...",
    "published": null
  }
]