[
  {
    "title": "The Carlyle Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Carlyle_Group",
    "snippet": "In September 2007, Mubadala Development ... Dhabi of the United Arab Emirates, purchased a 7.5% stake for $1.35 billion. In February 2008, California legislators targeted Carlyle and Mubadala, proposing a bill that would have barred CalPERS from investing money &quot;with private-equity firms that are partly owned by countries with poor ...",
    "published": "November 13, 2025"
  },
  {
    "title": "The Carlyle Group | LinkedIn",
    "url": "https://www.linkedin.com/company/the-carlyle-group",
    "snippet": "At Carlyle, we&#x27;re excited to partner ... the country’s journey and contribute to India’s 2047 Viksit Bharat Vision. Watch his full presentation below. #MIIS2024 ... #MIIS2024 | Unlock the opportunities &amp; challenges of investing in India with a keynote by Amit Jain, MD &amp; Head of The Carlyle Group at the Mint ...",
    "published": null
  },
  {
    "title": "The Carlyle Group investment portfolio | PitchBook",
    "url": "https://pitchbook.com/profiles/investor/10048-15",
    "snippet": "The Carlyle Group has made numerous investments in companies like KFC Korea, Automotive Compliance, and Elder Research within the Restaurants and Bars, Consulting Services (B2B), and Media and Information Services (B2B) industries.",
    "published": null
  },
  {
    "title": "Carlyle | Global Investment Firm",
    "url": "https://www.carlyle.com/",
    "snippet": "We work with our companies to integrate, measure, and communicate their bespoke approach to ESG, as we see these characteristics increasingly valued in investment exits. ... Carlyle provides financing package to Mecachrome Group, a leading global supplier to the aerospace and defense industry",
    "published": null
  },
  {
    "title": "Our People | Carlyle",
    "url": "https://www.carlyle.com/our-people",
    "snippet": "Bagijn received an MSc in economics from Erasmus University Rotterdam, is a CFA charterholder, and serves as a Board member of the Netherland-America Foundation (NAF), which supports high-impact exchange between the two countries. ... Brian A. Bernasek is a Managing Director - Partner and Co-Head of Americas Corporate Private Equity at Carlyle.",
    "published": null
  }
]