[
  {
    "title": "Olena Zelenska - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olena_Zelenska",
    "snippet": "Olena Zelenska has been a scriptwriter for Kvartal 95 since its foundation. The social activities of the First Lady of Ukraine before the war had three main directions: <strong>the health of future generations, equal opportunities and cultural diplomacy</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "President's wife news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/wife",
    "snippet": "The Olena Zelenska Foundation is presenting its <strong>interactive Christmas performance “Speaking Are Those Who Have Listened to Eternity”</strong> for the second time on the grounds of the National Conservation Area “Saint Sophia of Kyiv.” This was ...",
    "published": "1 day ago"
  },
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "Since the beginning of 2025, more than two million children in Ukraine have been provided with free hot meals. This was announced by First Lady Olena Zelenska as she summed up this year’s results of implementing the school nutrition reform.",
    "published": "6 hours ago"
  },
  {
    "title": "The Olena Zelenska Foundation Opened the First “12–21” Youth Space in Bila Tserkva — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/fundaciya-oleni-zelenskoyi-vidkrila-pershij-molodizhnij-pros-101965",
    "snippet": "12 December 2025 - 21:09 · <strong>The first youth space of the “12–21” network, created by the Olena Zelenska Foundation, has opened in Bila Tserkva</strong>. This is a barrier-free center designed for leisure, peer-to-peer interaction, and professional ...",
    "published": "1 week ago"
  },
  {
    "title": "Olena Zelenska Took Part in the Opening of a Kitchen Factory in the Kharkiv Region — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/na-harkivshini-olena-zelenska-vzyala-uchast-u-vidkritti-fabr-101925",
    "snippet": "11 December 2025 - 20:18 · In the Kharkiv region, First Lady of Ukraine Olena Zelenska took part in the <strong>launch of a kitchen factory opened as part of the school nutrition reform</strong>.",
    "published": "2 weeks ago"
  }
]