[
  {
    "title": "Acquisition of the Eurosport group by Discovery Communications | Groupe TF1 : actualités, communiqués, agenda, événements, publications",
    "url": "https://groupe-tf1.fr/en/communiques/acquisition-eurosport-group-discovery-communications",
    "snippet": "Acquisition of the Eurosport group by Discovery Communications The TF1 group and Discovery Communications today confirm completion of: <strong>the acquisition by Discovery Communications of a 49% equity interest in the Eurosport group, which is now 100% owned by Discovery Communications</strong>; the buyout ...",
    "published": null
  },
  {
    "title": "Acquistion of Eurosport France by Eurosport SAS | Groupe TF1 : actualités, communiqués, agenda, événements, publications",
    "url": "https://groupe-tf1.fr/en/communiques/acquistion-eurosport-france-eurosport-sas",
    "snippet": "Boulogne-Billancourt, March 31, ... France. The share capital of Eurosport group (including Eurosport France) is now <strong>51% owned by Discovery Communications and 49% owned by TF1 group</strong>....",
    "published": null
  },
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "<strong>On 21 December 2012, Discovery Communications purchased a 20 per cent minority interest share in Eurosport from TF1 Group for €170m</strong>. Discovery became the majority shareholder in the Eurosport venture with TF1 in January 2014, taking a 51% share of the company.",
    "published": "5 days ago"
  },
  {
    "title": "Warner Bros. Discovery - Discovery Communications To Acquire TF1 Group's Controlling Interest In Top Sports Platform Eurosport",
    "url": "https://ir.corporate.discovery.com/news-and-events/financial-news/financial-news-details/2014/Discovery-Communications-To-Acquire-TF1-Groups-Controlling-Interest-In-Top-Sports-Platform-Eurosport/default.aspx",
    "snippet": "- Transaction Will Create Leading Portfolio of Pay-TV Networks across Europe - Discovery Communications and TF1 Group today announced <strong>Discovery would acquire a controlling interest in Eurosport International through an extension of their larger strategic partnership first announced in December 2012</strong>",
    "published": null
  },
  {
    "title": "DISCOVERY COMMUNICATIONS TO ACQUIRE TF… : Discovery Communications",
    "url": "https://web.archive.org/web/20140124025837/http:/corporate.discovery.com/discovery-news/discovery-communications-acquire-tf1-groups-contro",
    "snippet": "(Silver Spring, Maryland and Paris, France) Discovery Communications and TF1 Group today announced <strong>Discovery would acquire a controlling interest in Eurosport International through an extension of their larger strategic partnership first announced in December 2012.</strong>",
    "published": null
  }
]