[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "It was subsequently acquired by ... TF1 Group later bought out the other owners&#x27; shares. <strong>In 2012, Discovery Communications began to take an ownership in Eurosport, eventually leading to a full buyout in 2015.</strong>...",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport International 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/63601-30",
    "snippet": "Information on acquisition, funding, investors, and executives for Eurosport International. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Eurosport To Be Replaced By TNT In The UK As Warner Bros. Discovery Shakes Up Sports Portfolio",
    "url": "https://deadline.com/2025/01/eurosport-to-be-replaced-by-tnt-in-the-uk-in-warner-bros-discovery-sports-shakes-up-1236269088/",
    "snippet": "Storied sports channel Eurosport will disappear from British screens next month as Warner Bros. Discovery rejigs its sports portfolio.",
    "published": "January 28, 2025"
  },
  {
    "title": "Inside BT Sport and Eurosport’s merger: What the deal means, what happens next and will the joint venture challenge Sky? - SportsPro",
    "url": "https://www.sportspromedia.com/insights/analysis/bt-sport-discovery-eurosport-merger-dazn-sky-explainer/",
    "snippet": "BT might not be involved in a few years and although Eurosport is well known across the continent, it isn’t associated with premium content in the UK market. Meanwhile, Discovery has been eager to stress in recent times that Discovery Sport was more than just Eurosport. “We’ve got no fixed timeline on the brand,” confirms Georgiou.",
    "published": "May 27, 2022"
  },
  {
    "title": "Eurosport",
    "url": "https://www.pentagram.com/work/eurosport/story",
    "snippet": "The rebrand follows Discovery’s acquisition of Eurosport which after it bought a majority stake in the sports destination in <strong>May 2014</strong> and was completed in a €491m deal in October 2015.",
    "published": null
  }
]