[
  {
    "title": "Fred Grim assistant coach Ajax 1",
    "url": "https://english.ajax.nl/articles/fred-grim-assistant-coach-ajax-1",
    "snippet": "Fred Grim has been appointed as <strong>assistant coach to the Ajax 1 technical staff</strong>. Grim (60) previously served as Head of Coaching within Ajax&#x27;s youth academy. The former Ajax and Cambuur goalkeeper spent many years in various coaching roles at ...",
    "published": null
  },
  {
    "title": "r/soccer on Reddit: [VI] Fred Grim will be Ajax first team head coach until at least the winter break",
    "url": "https://www.reddit.com/r/soccer/comments/1p2uetc/vi_fred_grim_will_be_ajax_first_team_head_coach/",
    "snippet": "Ko Itakura stated in Japanese media that Fred Grim informed him the day before Ajax-Benfica that he would be playing at CDM. They had not trained for this ... Simonis next Ajax coach - about to get fired.",
    "published": "4 weeks ago"
  },
  {
    "title": "Fred Grim - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fred_Grim",
    "snippet": "Grim was appointed manager of a relegated FC Emmen side as a replacement of Dick Lukkien in June 2023. On 9 April 2024 FC Emmen announced that Grim was sacked with only 5 games left. <strong>Grim was named assistant to manager John Heitinga at Ajax in October 2025</strong>, only to take over Heitinga&#x27;s tasks ...",
    "published": "2 days ago"
  },
  {
    "title": "Grim Work For Fred As Ajax Struggle To Recover — Ajax Daily",
    "url": "https://www.ajaxdaily.com/2025/grim-work-for-fred-as-ajax-struggle-to-recover/",
    "snippet": "It is fair to say that Fred Grim didn’t exactly ask to be installed as Ajax interim manager following the firing of former boss John Heitinga. Despite this, Grim had one primary goal of being a stabilising force; inject discipline and restore confidence to a squad that looked devoid of all. Having played for Ajax and then being a long-time coach within the academy, Grim was recognised as a safe bet.",
    "published": "1 week ago"
  },
  {
    "title": "Fred Grim: The Ajax Legend Who Rose From Goalkeeper to Master Coach - TechTales Hub - Smart Living Stories",
    "url": "https://www.childrenstorytales.com/2025/10/fred-grim-ajax-legend-who-rose-from.html",
    "snippet": "In <strong>October 2025, Grim completed his remarkable journey by returning to Ajax as assistant coach to John Heitinga</strong>. Technical director Alex Kroes praised the appointment, stating that Grim brings &quot;quality and a wealth of experience, both on the ...",
    "published": "October 8, 2025"
  }
]