[
  {
    "title": "Governance | Université Paris-Saclay",
    "url": "https://www.universite-paris-saclay.fr/en/about/governance",
    "snippet": "The President and Vice-Presidents at Université Paris-Saclay · The Governing Board of Paris-Saclay University defines the policy set forth by Paris-Saclay University, elects its President and approves the strategic plan, as well as the organization and operation of Paris-Saclay University.",
    "published": "July 8, 2025"
  },
  {
    "title": "The President and Vice-Presidents at Université Paris-Saclay | Université Paris-Saclay",
    "url": "https://www.universite-paris-saclay.fr/en/president-and-vice-presidents-universite-paris-saclay",
    "snippet": "Claire Lartigue Vice-President for the Education and University Life Commission (CFVU) ... Serge Édouard Vice-President for Social Dialogue, Quality of Life at Work and Organisational Improvement",
    "published": "October 1, 2025"
  },
  {
    "title": "Election of the president of Université Paris-Saclay | Université Paris-Saclay",
    "url": "https://www.universite-paris-saclay.fr/en/news/election-president-universite-paris-saclay",
    "snippet": "On Tuesday 11 June 2024, the Governing board of Université Paris-Saclay convened to elect the university’s new president. <strong>Camille Galap</strong> was elected by the members of the Governing board (36 voting members) president of Université Paris-Saclay ...",
    "published": "June 11, 2024"
  },
  {
    "title": "Paris-Saclay elects new president after months-long crisis",
    "url": "https://www.timeshighereducation.com/news/paris-saclay-elects-new-president-after-months-long-crisis",
    "snippet": "<strong>Camille Galap</strong>, former interim administrator of the university, succeeds Estelle Iacona as leader",
    "published": "June 19, 2024"
  },
  {
    "title": "Paris-Saclay University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris-Saclay_University",
    "snippet": "Since October 2023, the university has been a partner of the French private Grande École IPSA for double degrees in aerospace. In February 2024, Paris-Saclay, which brings together nearly 50,000 students, is facing a leadership crisis. The Board of Administrators has still not been able to elect its future chairman and has been under the supervision of a provisional administrator for several months.",
    "published": "3 weeks ago"
  }
]