[
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anibal_Fernandez",
    "snippet": "In 2021, he was appointed as Minister of Security in replacement of <strong>Sabina Frederic</strong>, as part of a cabinet reshuffle following the government&#x27;s poor showings in the 2021 legislative primary elections. In 2006, Anibal Fernández, who was serving as the Interior Minister at the time, referred ...",
    "published": "March 27, 2025"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "During Kirchner’s government he was named minister of interior in 2003 and in 2007, and during <strong>Cristina Fernandez</strong>’s government, he was assigned as minister of justice, security and human rights.",
    "published": null
  },
  {
    "title": "Presidency of Alberto Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Presidency_of_Alberto_Fern%C3%A1ndez",
    "snippet": "Fernández first appointed anthropologist <strong>Sabina Frederic</strong> as security minister. Frederic positioned herself as a staunch opponent of previous security minister Patricia Bullrich&#x27;s policies.",
    "published": "November 7, 2025"
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "He has been a close supporter of former Presidents <strong>Néstor Kirchner</strong> and Cristina Fernández de Kirchner. From 2021 to 2023, he served as Argentina&#x27;s Minister of Security under President Alberto Fernández.",
    "published": null
  },
  {
    "title": "The Berni Headlock and the Cristina Shake | Buenos Aires Times",
    "url": "https://www.batimes.com.ar/news/amp/opinion-and-analysis/the-berni-headlock-and-the-cristina-shake.phtml",
    "snippet": "And Berni was always part of a specific communication strategy where the continued criticism of former national security minister <strong>Sabrina Frederic</strong> coupled with a hands-on tough guy approach on crime helped a sector the ruling coalition portray ...",
    "published": null
  }
]