[
  {
    "title": "Who is Sebastian Coe dating? Sebastian Coe girlfriend, wife",
    "url": "https://www.whosdatedwho.com/dating/sebastian-coe",
    "snippet": "6 July 2025... Sebastian Coe news, gossip, photos of Sebastian Coe, biography, Sebastian Coe girlfriend list 2025. Relationship history. Sebastian Coe relationship list. Sebastian Coe dating history, 2025, 2024, list of Sebastian Coe relationships.",
    "published": null
  },
  {
    "title": "Lord Sebastian Coe weds his long-term girlfriend",
    "url": "https://www.telegraph.co.uk/news/celebritynews/8617434/Lord-Sebastian-Coe-weds-his-long-term-girlfriend.html",
    "snippet": "Thank you for your interest. Unauthorised access is prohibited. To access this content, you must have prior permission and a valid contract. Please contact our team at licensing@telegraph.co.uk to discuss licensing options · If you are a Telegraph Subscriber, please contact customerservic...",
    "published": null
  },
  {
    "title": "Back on track after break-up, Seb Coe and his glamorous Los Angeles fiancee - as 68-year-old Olympian is set to wed for the third time | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/news/article-14878961/Back-track-break-Seb-Coe-glamorous-Los-Angeles-fiancee-68-year-old-Olympian-set-wed-time.html",
    "snippet": "Published: 20:15 EDT, 5 July 2025 ... 68-year-old Olympian has ‘quietly reunited’ with glamorous Los Angeles PR woman <strong>Sarah Robarts</strong> and the pair are ‘happier than ever’ and planning their future....",
    "published": "July 6, 2025"
  },
  {
    "title": "Seb Coe and his glamourous fiancée - who would have been wife number 3 - 'separate nine months after announcing engagement' | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/news/article-12579461/Seb-Coe-glamourous-fianc-e-wife-number-3-separate-nine-months-announcing-engagement.html",
    "snippet": "Now friends have been left &#x27;stunned&#x27; by the news that Sebastian Coe has split from the glamorous PR woman he planned to make wife number three.",
    "published": "September 30, 2023"
  },
  {
    "title": "Seb Coe is dating Lionel Richie's glamorous ex-wife: Twice-married World Athletics boss, 69, has found love again with US model and fashion designer Diane Richie, 58 | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/tvshowbiz/article-15375063/Seb-Coe-dating-Lionel-Richie-ex-wife-Diane-Richie.html",
    "snippet": "But Sebastian Coe turned more than a few heads when he arrived at the World Athletics Awards 2025 in Monaco with Lionel Richie’s glamorous ex-wife, Diane.",
    "published": "1 week ago"
  }
]