[
  {
    "title": "Official Announcement: Xabi Alonso - Real Madrid",
    "url": "https://www.realmadrid.com/en-US/news/club/announcements/comunicado-oficial-xabi-alonso-25-05-2025",
    "snippet": "Real Madrid C. F. confirms that Xabi Alonso will be the Real Madrid coach for the next three seasons, from <strong>1 June 2025, until 30 June 2028</strong>. Xabi Alonso is a Real Madrid legend and one of the greatest players in world football history.",
    "published": "May 25, 2025"
  },
  {
    "title": "Inside Real Madrid: Have Vinicius Jr and Rodrygo saved Xabi Alonso from the sack? - The Athletic",
    "url": "https://www.nytimes.com/athletic/6890596/2025/12/15/real-madrid-xabi-alonso-job-vinicius-jr-rodrygo/",
    "snippet": "Meanwhile, in the build-up to Sunday’s match over the weekend, several sources expected Alvaro Arbeloa, Madrid’s reserve team manager, to be named as Alonso’s successor if he is finally sacked. Like Alonso, the 42-year-old is a former Madrid and Liverpool player. ... Xabi Alonso was only hired in May, but he is already under significant pressure.",
    "published": "1 day ago"
  },
  {
    "title": "Reports Conflict on Real Madrid's Xabi Alonso Appointment Start Date",
    "url": "https://www.forbes.com/sites/tomsanderson/2025/05/12/transfer-expert-confirms-real-madrid-alonso-appointment-but-reports-conflict-on-start-date/",
    "snippet": "Transfer market expert Fabrizio Romano used his X account to reveal that <strong>Xabi Alonso has agreed to replace Carlo Ancelotti as Real Madrid head coach</strong>.",
    "published": "May 12, 2025"
  },
  {
    "title": "Real Madrid firing Alonso would be easy. Replacing him? Much harder - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/47312994/real-madrid-firing-alonso-easy-replacing-much-harder",
    "snippet": "Real Madrid manager Xabi Alonso may have bought himself more time and the lack of viable alternatives available right now might help keep him in the job. Juan Manuel Serrano Arce/Getty Images · Firstly, who to hire, and how could they avoid the eternal &quot;out of the frying pan into the fire&quot; dilemma? The dream appointment is Zinedine Zidane.",
    "published": "1 day ago"
  },
  {
    "title": "8 Potential Replacements for Xabi Alonso as Real Madrid Head Coach",
    "url": "https://bleacherreport.com/articles/25323948-8-potential-replacements-xabi-alonso-real-madrid-head-coach",
    "snippet": "So, let&#x27;s talk about the man at the center of all the drama: manager Xabi Alonso. The club&#x27;s former midfield maestro took charge on <strong>June 1,</strong> succeeding the most decorated coach in Madrid&#x27;s illustrious history, Carlo Ancelotti.",
    "published": null
  }
]