[
  {
    "title": "Angela Merkel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Angela_Merkel",
    "snippet": "Merkel stepped down as leader of the CDU in 2018 and did not seek a fifth term as chancellor in the 2021 federal election. Following the Russian invasion of Ukraine, her legacy came under increased scrutiny both in Germany and abroad for her relatively good relations with Russia and increasing the German economy&#x27;s dependence on Russia, as well as the downsizing of the Bundeswehr that occurred during her tenure. Merkel was born Angela Dorothea Kasner in 1954, in the Eimsbüttel quarter of Hamburg, the daughter of Horst Kasner (1926–2011; né Kaźmierczak), a Lutheran pastor and a native of Berlin, and his wife Herlind (1928–2019; née Jentzsch), born in Danzig (now Gdańsk, Poland), a teacher of English and Latin.",
    "published": "2 days ago"
  },
  {
    "title": "Angela D Merkel | Archives of Women's Political Communication",
    "url": "https://awpc.cattcenter.iastate.edu/directory/angela-d-merkel/",
    "snippet": "Angela Merkel served as Germany&#x27;s chancellor from <strong>2005 to 2021</strong> and the leader of the Christian Democratic Union (CDU) from 2000 to 2018, the first female to hold either position. Merkel was born in Hamburg on July 17, 1954.",
    "published": null
  },
  {
    "title": "Angela Merkel governs Germany | 16 years as chancellor",
    "url": "https://www.deutschland.de/en/topic/politics/angela-merkel-governs-germany-16-years-as-chancellor",
    "snippet": "... Minister in <strong>Helmut Kohl</strong>’s cabinet – in 1991, Chancellor <strong>Helmut Kohl</strong> unexpectedly appointed Angela Merkel as minister for women and youth. She had previously been elected ...",
    "published": "July 17, 2024"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "<strong>Helmut Kohl</strong> presided over 17 ministers at the start of his fourth term in 1994; the 2002 cabinet, the second of Chancellor Gerhard Schröder, had 13 ministers, and the Angela Merkel cabinet as of 22 November 2005 had 15.",
    "published": "2 weeks ago"
  },
  {
    "title": "Angela Merkel | Book, Biography, Putin, Education, Freedom, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Angela-Merkel",
    "snippet": "Biography of German politician Angela Merkel, who in 2005 became the first female chancellor of Germany. Her willingness to adopt the positions of her political opponents has been characterized as pragmatism, although critics have decried her approach as the absence of a clear stance and ideology.",
    "published": "December 7, 2005"
  }
]