[
  {
    "title": "Catherine Cesarsky - President Elect of the International Astronomical Union (IAU)",
    "url": "https://www.eso.org/public/france/news/eso0323/",
    "snippet": "Catherine Cesarsky, as <strong>President Elect for a three-year period (2003-2006).</strong> The IAU is the world&#x27;s foremost organisation for astronomy, uniting almost 9000 professional scientists on all continents.",
    "published": null
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "Catherine Cesarsky, as <strong>President for a three-year period (2006-2009).</strong> The IAU is a body of distinguished professional astronomers, founded in 1919 to promote and safeguard the science of astronomy in all its aspects through international cooperation.",
    "published": null
  },
  {
    "title": "Dr. Catherine Cesarsky | ESO Polska",
    "url": "https://www.eso.org/public/poland/about-eso/dg-office/ccesarsk/",
    "snippet": "From <strong>August 2006 to August 2009</strong>, Catherine Cesarsky was President of the International Astronomical Union.",
    "published": null
  },
  {
    "title": "ESOblog: In conversation with Catherine Cesarsky: the former ESO Director General talks new projects, leadership and future scientific advances",
    "url": "https://www.eso.org/public/france/blog/in-conversation-with-catherine-cesarsky/",
    "snippet": "<strong>From 2006 to 2009</strong>, Catherine Cesarsky was President of the International Astronomical Union, before becoming High Commissioner for CEA, advising the French government on science and energy issues between 2009 and 2012, then a high level science ...",
    "published": null
  },
  {
    "title": "Catherine Cesarsky - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Catherine_J._Cesarsky",
    "snippet": "She is the current chairperson of the Square Kilometre Array&#x27;s governing body, SKAO Council. She was the <strong>first female president of the International Astronomical Union (2006-2009)</strong> and the first female director general of the European Southern ...",
    "published": "December 25, 2024"
  }
]