[
  {
    "title": "Konstantinos Tasoulas - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Konstantinos_Tasoulas",
    "snippet": "Konstantinos Tasoulas (Greek: Κωνσταντίνος Τασούλας [konstaˈdinos taˈsulas]; born 17 July 1959) is a Greek politician and lawyer who has served as the <strong>president of the Hellenic Republic since 13 March 2025</strong>. He previously served as President of the Hellenic Parliament from ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Tasoulas: War Reparations Still Claimable",
    "url": "https://athens-times.com/konstantinos-tasoulas-from-kalavryta-war-crime-reparations-are-active-and-claimable/",
    "snippet": "<strong>President of the Republic</strong> Konstantinos Tasoulas stated in Kalavryta, during ceremonies marking the 82nd anniversary of the massacre, that ‘the Greek State has continuously maintained that its claims for reparations and restitution for war ...",
    "published": "3 days ago"
  },
  {
    "title": "Tasoulas Celebrates 157 Years of Presidential Guard",
    "url": "https://athens-times.com/president-kostas-tasoulas-shares-meal-with-evzones-on-157th-anniversary-of-presidential-guard/",
    "snippet": "The Commander of the Presidential Guard, Lieutenant Colonel Konstantinos Bousis, presented the President with a pair of handmade black tsarouchia (traditional Greek shoes) originating from the Epirus region. President Tasoulas praised the unit’s legacy, noting its establishment in 1868 by royal decree to serve as an elite palace guard. He highlighted its evolution through political changes, its current role protecting the Tomb of the Unknown Soldier, the Presidential Mansion, and Camp Tsavelas, and emphasized the unwavering public admiration for the Guard.",
    "published": "4 days ago"
  },
  {
    "title": "Konstantinos Tasoulas becomes Greece's new president after 4th parliamentary vote",
    "url": "https://www.aa.com.tr/en/europe/konstantinos-tasoulas-becomes-greeces-new-president-after-4th-parliamentary-vote/3479656",
    "snippet": "Konstantinos Tasoulas elected on Wednesday as <strong>Greece&#x27;s new president</strong> in the fourth round of voting in the country&#x27;s parliament.",
    "published": null
  },
  {
    "title": "Konstantinos Tasoulas sworn in as Greece’s new president | eKathimerini.com",
    "url": "https://www.ekathimerini.com/politics/1263974/konstantinos-tasoulas-sworn-in-as-greeces-new-president/",
    "snippet": "Former Parliament speaker Konstantinos Tasoulas became the <strong>ninth president of the Hellenic Republic</strong> since the fall of the 1967-1974 dictatorship and the abolition of the monarchy, on Thursday.",
    "published": "March 13, 2025"
  }
]