[
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed bin Salman was born on 31 August 1985 to Prince Salman bin Abdulaziz (later King of Saudi Arabia) and his third wife, <strong>Fahda bint Falah Al Hithlain</strong>. He is the eldest of his mother&#x27;s six children and the eighth child and seventh son of his father. His full siblings include Prince Turki ...",
    "published": "11 hours ago"
  },
  {
    "title": "Sara bint Mashour Al Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sara_bint_Mashour_Al_Saud",
    "snippet": "<strong>Sara bint Mashour Al Saud</strong> (Arabic: سارة بنت مشهور آل سعود) is a member of the Saudi royal family and wife of Saudi Crown Prince Mohammed bin Salman, who is her first cousin. She is a granddaughter of King Abdulaziz.",
    "published": "1 week ago"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman is the third oldest living head of state, the oldest living monarch, and Saudi Arabia&#x27;s first head of state born after the unification of Saudi Arabia. He has a reported personal wealth of at least US$18 billion, which makes him the third wealthiest royal in the world. Salman is a son of King Abdulaziz and Hassa bint Ahmed Al Sudairi, making him one of the Sudairi Seven.",
    "published": "November 3, 2025"
  },
  {
    "title": "How Many Wives Does King Salman Have? Truth Revealed! | History",
    "url": "https://vocal.media/history/how-many-wives-does-king-salman-have-truth-revealed",
    "snippet": "Sultana played a pivotal role in King Salman&#x27;s life, particularly during his early years as a member of the Saudi royal family. She is the mother of several of his children, including some of his most influential sons, such as Crown Prince Mohammed bin Salman. Beyond her role in the family, Sultana was known for her dedication to philanthropic and humanitarian causes in Saudi Arabia, which earned her respect and admiration within the kingdom.",
    "published": null
  },
  {
    "title": "Who is Mohammed bin Salman's Wife? Meet Sara bint Mashoor bin Abdulaziz Al Saud - House of Saud",
    "url": "https://houseofsaud.com/mohammed-bin-salmans-wife-sara-bint-mashoor-bin-abdulaziz-al-saud/",
    "snippet": "Marriage to Mohammed bin Salman Despite the turmoil in her personal life, Sara continued to speak out for reforms in the Kingdom. In 2008, she married Crown Prince Mohammed bin Salman, her half cousin, and they had five children together, two daughters and three sons. In 2012, Sara and her family were granted political asylum in the UK, making her the first senior member of the Saudi ruling family to do so.",
    "published": "September 19, 2023"
  }
]