[
  {
    "title": "Spouse of the President | President of the Republic of Slovenia",
    "url": "https://www.predsednica-slo.si/en/soprog-predsednice",
    "snippet": "During his time at the university, Musar worked on various projects for UNESCO, EBRD, UNDP, US EPA and the World Bank, where he was also employed in 1993. In 2000, he joined Aktiva Group, where he managed various projects and was involved in setting up and managing venture capital funds.",
    "published": null
  },
  {
    "title": "EBRD Board of Directors visits Slovenia",
    "url": "https://www.ebrd.com/home/news-and-events/news/2023/ebrd-board-of-directors-visits-slovenia.html",
    "snippet": "The Board delegation will be accompanied by EBRD senior management representatives: Charlotte Ruhe, Managing Director, Central and South Eastern Europe; Victoria Zinchuk, Director, Regional Head of Central Europe; and <strong>Nora Kocsis</strong>, Associate ...",
    "published": null
  },
  {
    "title": "EBRD Board of Directors",
    "url": "https://www.ebrd.com/shareholders-and-board-of-governors.html",
    "snippet": "Learn about the EBRD&#x27;s journey to investing more than €210 billion in over 7,500 projects · Through projects, business services and involvement in high-level policy reform, we&#x27;re doing more than ever before",
    "published": null
  },
  {
    "title": "EBRD adopts new strategy for Slovenia",
    "url": "https://www.ebrd.com/news/2014/ebrd-adopts-new-strategy-for-slovenia.html",
    "snippet": "<strong>Jolanta Gabriel</strong>, senior banker, has been appointed Head of Office. The new strategy for Slovenia has been met with strong interest by the local media.",
    "published": null
  },
  {
    "title": "Directors of the EBRD",
    "url": "https://ebrd.com/directors-of-the-ebrd.html",
    "snippet": "Mr Patrone previously held the post of Managing Director, Eastern Europe and Caucasus. In that role, he was responsible for the Bank’s operations and policy engagement initiatives in Armenia, Azerbaijan, Georgia and Moldova and for spearheading the Bank&#x27;s crisis response to the war on Ukraine. His 30-year career includes senior management and leadership positions in merchant banking, private equity, management consulting and engineering. He joined the EBRD in 2008 as a senior banker with the Corporate Equity team.",
    "published": null
  }
]