[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "He began his senior career at <strong>Bayern Munich</strong>, playing mostly in the club&#x27;s reserve side before his 2013 transfer to Bayer Leverkusen. A season later, he was signed by Premier League club Liverpool for £9.75 million where he made over 150 appearances across all tiers of competition and would ...",
    "published": "2 days ago"
  },
  {
    "title": "Emre Can",
    "url": "https://www.bvb.de/de/en/teams/football/player/emre-can.html",
    "snippet": "As a footballer, I learned that you have to give everything to win. There’s no doubt that you can learn from defeat. But winning is much better. I hate losing.” · Can played for Eintracht’s youth team for three years <strong>(2006 to 2009)</strong> before moving to Bayern Munich’s U17 team.",
    "published": null
  },
  {
    "title": "Emre Can Borussia Dortmund Midfielder, Profile & Stats | Premier League",
    "url": "https://www.premierleague.com/players/5001/Emre-Can/overview",
    "snippet": "View the player profile of <strong>Borussia Dortmund</strong> Midfielder Emre Can, including stats and videos, on the official website of the Premier League.",
    "published": null
  },
  {
    "title": "Liverpool career stats for Emre Can - LFChistory - Stats galore for Liverpool FC!",
    "url": "https://www.lfchistory.net/players/player/profile/1272",
    "snippet": "<strong>Liverpool</strong> activated a £9.75m release clause to bring Can to Anfield in the summer of 2014. Having excelled in Germany as an energetic box to box midfield player, Can was used mainly on the right side of a back three for <strong>Liverpool</strong>, but still loved to get forward.",
    "published": null
  },
  {
    "title": "Emre Can | Borussia Dortmund | Player Profile | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/player/emre-can",
    "snippet": "All official season statistics and career data on Emre Can. With news, videos and goals from Emre Can in the Bundesliga this season",
    "published": null
  }
]