[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the <strong>secretary of the Democratic Party (PD) since 12 March 2023</strong>. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Why Elly Schlein is freaking out Italy’s ‘soft’ socialists",
    "url": "https://www.politico.eu/article/elly-schlein-italy-soft-socialist-democratic-party-leader/",
    "snippet": "Right-wing hardliners could not dream of an easier target than Elly Schlein, the new leader of Italy’s center-left Democratic Party (PD).",
    "published": "March 2, 2023"
  },
  {
    "title": "Meet the anti-Renzi: Elly Schlein becomes first woman leader of Italy’s center left",
    "url": "https://www.politico.eu/article/elly-schlein-first-woman-leader-italy-social-democratic-party/",
    "snippet": "<strong>Schlein becomes the youngest leader and first woman at the helm of the PD</strong>, and is seen by supporters as a breath of fresh air for the party — historically dominated by middle-aged men — while critics point out that her unabashedly left-wing ...",
    "published": "February 27, 2023"
  },
  {
    "title": "Elly Schlein Will Tilt Italy’s Democrats to the Left, but Don’t Expect Revolutionary Change",
    "url": "https://jacobin.com/2023/03/elly-schlein-italy-democratic-party-left-primary-election/",
    "snippet": "Italy’s Democratic primary handed victory to Elly Schlein, the most left-wing leader in the party’s history. Her success relied on mobilizing nonmembers — but she faces an uphill struggle overhauling a party long in thrall to corporate liberalism.",
    "published": null
  },
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "The Democratic Party (Italian: Partito Democratico, PD) is a social democratic political party in Italy. <strong>The party&#x27;s secretary is Elly Schlein, elected in the 2023 leadership election</strong>, while the party&#x27;s president is Stefano Bonaccini.",
    "published": "1 day ago"
  }
]