[
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: ... (Партия Прогресса, Partiya Progressa), is a <strong>banned opposition political party in Russia founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018</strong> by Alexei Navalny, who was also the founder of the non-profit ...",
    "published": "September 30, 2025"
  },
  {
    "title": "Alexei Navalny, Russia",
    "url": "https://www.europarl.europa.eu/cmsdata/240201/Profile of the 2021 Sakharov Prize nominee, Alexei Navalny.pdf",
    "snippet": "Alexei Navalny is a Russian opposition ... party in Russia. Navalny was a member of the · Russian Opposition Coordination Council and is the <strong>leader of the Russia of the Future party</strong> as ·...",
    "published": null
  },
  {
    "title": "Alexei Navalny’s most powerful legacy is urging Russians to imagine their country without Putin",
    "url": "https://www.chathamhouse.org/2024/02/alexei-navalnys-most-powerful-legacy-urging-russians-imagine-their-country-without-putin",
    "snippet": "This showed that Navalny’s impact ... to register Navalny’s ‘Russia of the Future’ political party, <strong>this regional network functioned as a de facto party</strong>....",
    "published": "February 17, 2024"
  },
  {
    "title": "Navalny’s Future Russia Did Not Include Everyone | Davis Center",
    "url": "https://daviscenter.fas.harvard.edu/insights/navalnys-future-russia-did-not-include-everyone",
    "snippet": "These two facets of Navalny are not mutually exclusive. They rather shed light on how he managed to build a dedicated and relatively large — at least for Russian opposition groups — supporter base as his political career grew in the late 2010s.",
    "published": null
  },
  {
    "title": "Kremlin Foe Navalny Launches New Political Party",
    "url": "https://www.rferl.org/a/russia-navalny-new-political-party/29237240.html",
    "snippet": "Russian opposition leader Aleksei ... Vladimir Putin. The new party, called Russia Of The Future, was <strong>created at a May 19 founding convention in Moscow</strong>, Lybov Sobol, a senior associate of the Kremlin critic, said on ...",
    "published": "May 19, 2018"
  }
]