[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "Micheál Martin (Irish: [ˈmʲiːçaːl̪ˠ]; born 16 August 1960) is an Irish Fianna Fáil politician serving as Taoiseach since January 2025, having previously held the position from 2020 to 2022. Martin served as Tánaiste, Minister for Foreign Affairs and Minister for Defence from December 2022 to January 2025.",
    "published": "3 weeks ago"
  },
  {
    "title": "Taoiseach - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taoiseach",
    "snippet": "Following the 2020 election, Fianna Fáil and Fine Gael entered coalition together for the first time. The two agreed to rotate the role of Taoiseach, with Micheál Martin going first before becoming Tánaiste under <strong>Leo Varadkar</strong>, and later Simon Harris, of the smaller Fine Gael party.",
    "published": "4 days ago"
  },
  {
    "title": "Micheal Martin | Taoiseach, Previous Offices, & Family Tragedy | Britannica",
    "url": "https://www.britannica.com/biography/Micheal-Martin",
    "snippet": "Micheal Martin, Irish politician who became taoiseach (prime minister) of Ireland in 2020 after the party he led, Fianna Fail, entered into an unprecedented coalition government with its historical rival, Fine Gael, and the Green Party following an indecisive general election that produced a hung parliament.",
    "published": "February 3, 2022"
  },
  {
    "title": "Leo Varadkar becomes taoiseach as Micheál Martin steps down",
    "url": "https://www.bbc.com/news/world-europe-63945064",
    "snippet": "The deal brought together <strong>Mr Varadkar</strong>&#x27;s Fine Gael party, Mr Martin&#x27;s Fianna Fáil and the Green Party in a historic compromise. <strong>Mr Varadkar</strong>, a qualified medical doctor, previously served as taoiseach and minister of defence from 2017 to 2020.",
    "published": "December 17, 2022"
  },
  {
    "title": "Micheál Martin becomes Irish prime minister for second time | ...",
    "url": "https://www.euractiv.com/section/politics/news/micheal-martin-becomes-irish-prime-minister-for-second-time/",
    "snippet": "Martin’s Fianna Fáil is the largest political party in the Dáil. The party struck a coalition deal with its old rival-turned-partner, Fine Gael, on 14 January, along with a loose formation of largely conservative independents. The centre-right politician has served as Taoiseach once before, between 2020-2022, during a previous coalition between Fianna Fáil, Fine Gael and the Greens.",
    "published": "January 24, 2025"
  }
]