[
  {
    "title": "X Corp. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/X_Corp.",
    "snippet": "X Corp. is <strong>an American technology company headquartered in Bastrop, Texas</strong>. Established by Elon Musk in 2023 as the successor to Twitter, Inc., it is a wholly owned subsidiary of xAI since March 28, 2025, which is itself partly owned by Musk. The company owns the social networking service X ...",
    "published": "1 month ago"
  },
  {
    "title": "Company-X - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/company-x",
    "snippet": "Company-X makes solving common and complex business problems with software look easy. Our developers are that good.",
    "published": null
  },
  {
    "title": "Software Solutions to run the world better - Company X",
    "url": "https://companyx.com/",
    "snippet": "<strong>Bespoke software solutions that run the world better</strong>. Senior level expertise to solve complex problems, integrate systems and enhance efficiency with AI.",
    "published": "August 11, 2025"
  },
  {
    "title": "New Zealand software specialist Company-X offers Silicon Valley level software savvy delivered with a Kiwi can-do attitude. | Company-X",
    "url": "https://companyx.com/about",
    "snippet": "Founded in 2012 by software specialists David Hallett and Jeremy Hughes, New Zealand software specialist Company-X immediately won contracts with New Zealand government departments and a Silicon Valley multinational. The team has grown to more than 50 New Zealand-based software specialists, with only the best and brightest passing our interview and assessment process.",
    "published": null
  },
  {
    "title": "The X Company",
    "url": "https://www.thexlife.co/about",
    "snippet": "The X Company is <strong>the real estate development and operations team behind X — the first and largest branded network of member clubs and private residences in the country</strong>. The X Co. is currently active in six markets, with 5,000 beds in the current ...",
    "published": null
  }
]