[
  {
    "title": "Who owns Borussia Dortmund (BVB)? Owners' net worth, source of wealth and ownership history",
    "url": "https://www.interestingfootball.com/2025/05/who-owns-borussia-dortmund-bvb-owners.html",
    "snippet": "Borussia Dortmund is currently owned by a publicly traded company with major shareholders including <strong>Bernd Geske, Evonik Industries AG, Signal Iduna, Ralph Dommermuth Beteiligungen GmbH and Puma SE</strong>.",
    "published": null
  },
  {
    "title": "Who Owns Borussia Dortmund? BVB Shareholders - Investing.com",
    "url": "https://www.investing.com/equities/borussia-dortmund-gmbh-co-kgaa-ownership",
    "snippet": "Discover who owns Borussia Dortmund. Access the ownership overview, view the top Borussia Dortmund shareholders, institutional holders, and leading mutual fund investors.",
    "published": null
  },
  {
    "title": "Hans-Joachim Watzke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hans-Joachim_Watzke",
    "snippet": "<strong>Hans-Joachim &quot;Aki&quot; Watzke</strong> (born 21 June 1959, Marsberg, North Rhine-Westphalia) is a German businessman and football official. He served as the CEO of Borussia Dortmund from 2005 until 2025 and is the club&#x27;s elected president since November 23, 2025.",
    "published": "1 month ago"
  },
  {
    "title": "Borussia Dortmund 2025 Company Profile: Stock Performance & Earnings | PitchBook",
    "url": "https://pitchbook.com/profiles/company/59881-15",
    "snippet": "As of 29-Sep-2025 the stock price of Borussia Dortmund is $4.15. The current market capitalization of Borussia Dortmund is <strong>$458M</strong>.",
    "published": null
  },
  {
    "title": "Borussia Dortmund GmbH : Shareholders Board Members Managers and Company Profile | DE0005493092 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/BORUSSIA-DORTMUND-GMBH-435951/company/",
    "snippet": "Borussia Dortmund GmbH &amp; Co KGaA is a Germany-based company engaged in the operation of Ballspielverein Borussia (BVB), a professional football club based in Dortmund, Germany. The Company has around 8 functional areas such as sports, communications, human resources, organization, finance, legal and IR, marketing and digitalization, commercial partnerships.",
    "published": null
  }
]