[
  {
    "title": "France rugby coach: Who has led the men's team over the years? ...",
    "url": "https://www.rugbyworld.com/news/france-rugby-coach-over-the-years-172332",
    "snippet": "It was a largely uninspiring stint in charge, which included a series defeat to New Zealand down under and uninspiring Six Nations campaigns. At the 2019 Rugby World Cup, Brunel was in charge in name only, with Fabien Galthie present in the coach’s box for every game as the team exited in the quarter finals again.",
    "published": "May 30, 2025"
  },
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Fabien Galthié (French pronunciation: [fabjɛ̃ ɡaltie]; born 20 March 1969) is a French rugby union coach and former player, currently the head coach of the France national team. His usual position was at scrum-half. He played much of his club rugby for Colomiers, and later on in his career, ...",
    "published": "3 weeks ago"
  },
  {
    "title": "France national rugby union team coaches - FamousFix.com list",
    "url": "https://m.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "The list France national rugby union team coaches includes <strong>Marc Lièvremont</strong>, Fabien Galthié, Daniel Dubroca, Bernard Laporte and Jacques Fouroux.",
    "published": null
  },
  {
    "title": "Fabien Galthie’s right-hand man exits after France’s World Cup failure : Planet Rugby",
    "url": "https://www.planetrugby.com/news/fabien-galthies-right-hand-man-departs-after-frances-rugby-world-cup-failure-report",
    "snippet": "France head coach Fabien Galthie with <strong>Raphael Ibanez</strong> behind him. France are in search for a new team manager after reports stated <strong>Raphael Ibanez</strong> had left his position in the set-up.",
    "published": "November 20, 2023"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "After the 2023 Rugby World Cup, Ghezal, Labit and Giroud left the France coaching staff and were replaced respectively by Stade Français forwards coach <strong>Laurent Sempéré</strong>, former international centre Patrick Arlettaz and Nicolas Jeanjean, who ...",
    "published": "1 week ago"
  }
]