[
  {
    "title": "Oleksandr Turchynov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Oleksandr_Turchynov",
    "snippet": "In 2005, Turchynov served as the head of the Security Service of Ukraine. Turchynov is a <strong>former acting President of Ukraine from the removal from power of President Viktor Yanukovych on 21 February 2014, until Petro Poroshenko was sworn in as Ukrainian President on 7 June 2014.</strong>",
    "published": "2 weeks ago"
  },
  {
    "title": "Ukraine: Speaker Oleksandr Turchynov named interim president - BBC News",
    "url": "https://www.bbc.com/news/world-europe-26312008",
    "snippet": "Parliament in Ukraine has named its speaker as interim president. Oleksandr Turchynov takes charge following the dismissal of President Viktor Yanukovych on Saturday.",
    "published": "February 23, 2014"
  },
  {
    "title": "Oleksandr Turchynov facts for kids",
    "url": "https://kids.kiddle.co/Oleksandr_Turchynov",
    "snippet": "Oleksandr Valentynovych Turchynov (born March 31, 1964) is a Ukrainian politician, screenwriter, and economist. He is best known for <strong>serving as the acting President of Ukraine in 2014</strong> during a very important time in the country&#x27;s history.",
    "published": null
  },
  {
    "title": "Embassy of Ukraine to Canada - Acting President of Ukraine, Chairman of the Verkhovna Rada of Ukraine Oleksandr Turchynov met with Prime Minister of Canada Stephen Harper",
    "url": "https://canada.mfa.gov.ua/en/news/20378-zustrich-vo-prezidenta-ukrajini-golovi-verkhovnoji-radi-ukrajini-oleksandra-turchinova-z-premjer-ministrom-kanadi-stivenom-garperom",
    "snippet": "Acting President of Ukraine, <strong>Chairman of the Verkhovna Rada of Ukraine</strong> Oleksandr Turchynov met with Prime Minister of Canada Stephen Harper",
    "published": null
  },
  {
    "title": "Oleksandr Turchynov | Historica Wiki | Fandom",
    "url": "https://historica.fandom.com/wiki/Oleksandr_Turchynov",
    "snippet": "In 2014, following the Euromaidan revolution, he became acting Prime Minister for five days in February 2014, <strong>acting President from February to June 2014</strong>, and Chairman of the Verkhovna Rada from February to November 2014.",
    "published": "October 29, 2024"
  }
]