[
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Saudi Arabian banks froze more than 2,000 domestic accounts as part of the crackdown. According to The Wall Street Journal, the Saudi government targeted cash and assets worth up to $800 billion. The Saudi authorities claimed that amount was composed of assets worth around $300 billion to $400 billion that they can prove was linked to corruption. On 27 September 2022, Mohammed was appointed as Prime Minister of Saudi Arabia by King Salman.",
    "published": "11 hours ago"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "U.S. intelligence officials believe that King Salman has been kept apart from <strong>Princess Fahda</strong> for several years, on the orders of their son Prince Mohammed bin Salman. She has six sons with Salman: Prince Mohammed (b. 1985), Crown Prince and Prime Minister of Saudi Arabia.",
    "published": "November 3, 2025"
  },
  {
    "title": "Mohammed bin Salman: Biography, Saudi Arabian Crown Prince",
    "url": "https://www.biography.com/political-figures/mohammed-bin-salman",
    "snippet": "﻿FULL NAME: ﻿Mohammed bin Salman Al Saud ﻿BORN: ﻿August 31, 1985 ﻿BIRTHPLACE: Jeddah, Saudi Arabia ﻿SPOUSE: <strong>﻿Sara bint Mashhoor bin Abdulaziz Al Saud</strong> (2008–present) ﻿CHILDREN: 5 ﻿ASTROLOGICAL SIGN: Virgo﻿﻿﻿﻿﻿ · ...",
    "published": "February 17, 2022"
  },
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "Mohammed bin Salman is the de facto ruler of Saudi Arabia, known for his aggressive foreign policy, ambitious economic vision, and controversial social reforms. He formally serves as crown prince and prime minister and is the son of King Salman.",
    "published": "July 17, 2019"
  },
  {
    "title": "How Many Wives Does King Salman Have? Truth Revealed! | History",
    "url": "https://vocal.media/history/how-many-wives-does-king-salman-have-truth-revealed",
    "snippet": "In a world filled with monarchs and royal families, there&#x27;s often a sense of intrigue surrounding their personal lives. King Salman of Saudi Arabia is no exception. The question that has piqued the curiosity of many is: How many wives does King Salman have?",
    "published": null
  }
]