[
  {
    "title": "Salome Zourabichvili | Warsaw Security Forum",
    "url": "https://warsawsecurityforum.org/profile/salome-zourabichvili-2025/",
    "snippet": "Salome Zourabichvili is a Georgian politician and former diplomat who currently serves as the <strong>President of Georgia</strong>, in office since December 2018.",
    "published": "September 11, 2025"
  },
  {
    "title": "Salomé Zourabichvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salom%C3%A9_Zourabichvili",
    "snippet": "She said however that <strong>she remained the legitimate president</strong>. She was quoted saying &quot;This building doesn&#x27;t belong to anyone, this building was a symbol while the President, who was legitimate, sat here. I&#x27;m taking away the legitimacy, I&#x27;m taking away the flag, I&#x27;m taking away what is your trust&quot;.",
    "published": "1 week ago"
  },
  {
    "title": "Georgian President Salome Zourabichvili to address the European Parliament | News | European Parliament",
    "url": "https://www.europarl.europa.eu/news/en/press-room/20241217IPR26008/georgian-president-salome-zourabichvili-to-address-the-european-parliament",
    "snippet": "Ms Zourabichvili’s <strong>presidential term is due to end on 29 December</strong>, with the new Georgian parliament having recently appointed her successor Mikheil Kavelashvili.",
    "published": null
  },
  {
    "title": "Salome Zourabichvili vows to remain in office after pro-Moscow party's election win questioned - Washington Times",
    "url": "https://www.washingtontimes.com/news/2025/jan/9/salome-zourabichvili-vows-remain-office-pro-moscow/",
    "snippet": "Her opponent, professional soccer player turned Georgian politician Mikheil Kavelashvili, was the only name on the ballot. He was sworn into office on Dec. 29, but Ms. Zourabichvili said she’s not going anywhere.",
    "published": "January 10, 2025"
  },
  {
    "title": "From Salome Zourabichvili, President of Georgia » Official web-site of President of Azerbaijan Republic",
    "url": "https://president.az/en/articles/view/63850",
    "snippet": "Thank you for your and Prime Minister Pashinyan&#x27;s joint letter advancing my nomination for the Nobel Peace Prize. I am deeply appreciative of your kind recognition, which... 06 December 2025, 15:45",
    "published": null
  }
]