[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "In September 2008 he retired from ... In 2011 Dawkins joined the professoriate of the New College of the Humanities, <strong>a private university in London established by the philosopher A.</strong>...",
    "published": "1 week ago"
  },
  {
    "title": "Biography:Richard Dawkins - HandWiki",
    "url": "https://handwiki.org/wiki/Biography:Richard_Dawkins",
    "snippet": "In 2011, Dawkins joined the professoriate of the New College of the Humanities, <strong>a private university in London established by A</strong>.",
    "published": "March 9, 2024"
  },
  {
    "title": "Richard Dawkins heads lineup at private £18,000-a-year university | Higher education | The Guardian",
    "url": "https://www.theguardian.com/education/2011/jun/05/new-college-dawkins-grayling-ferguson",
    "snippet": "There is a starry lineup of professorial talent: Richard Dawkins will <strong>teach evolutionary biology and science literacy</strong>; Niall Ferguson will lecture on economics and economic history; and Steven Pinker will teach philosophy and psychology.",
    "published": "November 26, 2017"
  },
  {
    "title": "New College of the Humanities – The Disorder Of Things",
    "url": "https://thedisorderofthings.com/tag/new-college-of-the-humanities/",
    "snippet": "Now there is a new New School. A New College in fact. A.C. Grayling, Richard Dawkins, Ronald Dworkin and Peter Singer (yes, Peter Singer), amongst others, have inaugurated this new space for privatised inquiry. <strong>Tuition fees will be £18,000 a year</strong>.",
    "published": null
  },
  {
    "title": "New College of the Humanities - Company Profile & Staff Directory | ContactOut",
    "url": "https://contactout.com/company/new-college-of-the-humanities-839787",
    "snippet": "The college&#x27;s curriculum is enriched by the NCH Diploma, which features core courses such as Applied Ethics, Critical Reasoning, and Science Literacy, designed to cultivate critical thinking and interdisciplinary skills. One of the hallmarks of NCH is its exceptional faculty, comprising renowned scholars and thought leaders like Simon Blackburn, Sir Partha Dasgupta, Richard Dawkins, and AC Grayling, among others.",
    "published": "September 10, 2025"
  }
]