[
  {
    "title": "Civil War in Sudan | Global Conflict Tracker",
    "url": "https://www.cfr.org/global-conflict-tracker/conflict/power-struggle-sudan",
    "snippet": "In February 2025, RSF leadership and its allies gathered in Nairobi, Kenya, to advance their plan to create a parallel government. They signed a charter outlining key aspects of a post-war government, including secularism, democracy, a decentralized structure, and a unified national army. In early March, the RSF signed a new constitution, signaling its intent to garner diplomatic leverage and legitimacy. That same month, the Sudanese government filed a complaint to the International Court of Justice, accusing the UAE of complicity in genocide due to its arms support for the RSF.",
    "published": null
  },
  {
    "title": "Briefing on the situation in Sudan – Amani Africa",
    "url": "https://amaniafrica-et.org/briefing-on-the-situation-in-sudan-16-december-2025/",
    "snippet": "From the communiqué it adopted after the session, the PSC tasked the AU Commission ‘to regularly monitor and report such heinous crimes committed throughout Sudan, in order to put in place preventive measures and reduce the risk of recurrence; develop proposals on how to address them to prevent their further escalation; [and] develop a plan for the protection of civilians, and make recommendations to the PSC within three weeks.’ · PSC went further and directed the Chairperson of the AU Commission to engage with the Members of the PSC Presidential Ad-hoc Committee, under the leadership of Yoweri Kaguta Museveni, President of Uganda, to urgently facilitate the negotiation process between the leaders of the Sudanese Armed Forces (SAF) and the paramilitary Rapid Support Forces (RSF), including the holding of an AU Special Summit on Sudan.",
    "published": null
  },
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Since independence was proclaimed on 1 January 1956, six individuals (and three multi-member sovereignty councils) have served as head of state of Sudan, currently under the title President of the Republic of Sudan. Prior to independence, Sudan was governed as a condominium by Egypt and the United Kingdom, under the name Anglo-Egyptian Sudan.",
    "published": "November 14, 2025"
  },
  {
    "title": "Timeline of the Sudanese civil war (2025) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Timeline_of_the_Sudanese_civil_war_(2025)",
    "snippet": "The Leadership Council of the Sudan Founding Alliance (TASIS), a coalition led by the RSF, announced a parallel government with Hemedti as chair of a 15-person presidential council and <strong>Mohammed Hassan Osman al-Ta&#x27;ishi as prime minister</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "World Report 2025: South Sudan | Human Rights Watch",
    "url": "https://www.hrw.org/world-report/2025/country-chapters/south-sudan",
    "snippet": "On September 1, the NSS shutdown the annual general assembly of the South Sudan Doctors Union without providing a reason. On September 3, the NSS gave the union a list of requirements to fulfil including to not discuss, “controversial issues” and to supply a list of all attendees. The Union was allowed to meet in October after meeting the NSS demands. On October 2, Kiir dismissed Akol Kor Kuc as director general of the NSS internal security bureau. Between November 7 and 11, the new leadership released at least 16 detainees including Michael Wetnhialic, a political activist detained since March and Morris Mabior Awikjiok, a South Sudanese critic and former refugee, whom they had continued to hold in violation of the justice minister directives in June and a court order in August to release him.",
    "published": "January 16, 2025"
  }
]