[
  {
    "title": "Sara bint Mashour Al Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sara_bint_Mashour_Al_Saud",
    "snippet": "<strong>Sara bint Mashour Al Saud</strong> (Arabic: سارة بنت مشهور آل سعود) is a member of the Saudi royal family and wife of Saudi Crown Prince Mohammed bin Salman, who is her first cousin. She is a granddaughter of King Abdulaziz.",
    "published": "1 week ago"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman&#x27;s third wife is Fahda bint Falah Al Hithlain, granddaughter of Rakan bin Hithlain and great-granddaughter of Dhaydan bin Hithlain, leaders of the Al Ajman tribe. U.S. intelligence officials believe that King Salman has been kept apart from <strong>Princess Fahda</strong> for several years, on the orders ...",
    "published": "November 3, 2025"
  },
  {
    "title": "Princess Fahda, Wife of Saudi King Salman, Arrives in Tangier for Vacation",
    "url": "https://www.moroccoworldnews.com/2023/08/30853/princess-fahda-wife-of-saudi-king-salman-arrives-in-tangier-for-vacation/",
    "snippet": "<strong>Princess Fahda bint Falah Al Hithlain</strong>, wife of Saudi Arabia’s King Salman bin Abdulaziz and mother of Crown Prince Mohammed bin Salman, has chosen Morocco to spend her personal vacation.",
    "published": "August 4, 2023"
  },
  {
    "title": "Fahda bint Falah Al Hithlain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fahda_bint_Falah_Al_Hithlain",
    "snippet": "<strong>Fahda married King Salman in 1984</strong>. She is thirty years younger than him. She has six children with King Salman: Crown Prince and Prime Minister Mohammed, Prince Turki, Defense Minister Prince Khalid, Prince Nayef, Prince Bandar and Prince Rakan. Her second eldest son, Turki, is a businessman.",
    "published": "1 month ago"
  },
  {
    "title": "Who is Princess Sara bint Mashour bin Abdulaziz Al Saud, Wife of Crown Prince Mohammed bin Salman Al Saud of Saudi Arabia? 3 Facts You Need To Know",
    "url": "https://www.harpersbazaararabia.com/culture/royal-watch/princess-sara-bint-mashour-bin-abdulaziz-al-saud",
    "snippet": "The STREAM centre, ilmi (which means “My Knowledge” in Arabic) is scheduled to open in 2025. On April 6, 2008 HRH <strong>Princess Sara bint Mashour bin Abdulaziz Al Saud</strong> married Crown Prince Mohammed bin Salman Al Saud.",
    "published": "October 23, 2023"
  }
]