[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "In 1989, he was first elected to Dáil Éireann for Cork South-Central, a seat he has represented ever since. After the victory of Fianna Fáil at the 1997 general election, Taoiseach <strong>Bertie Ahern</strong> appointed Martin to cabinet as Minister for Education and Science.",
    "published": "3 weeks ago"
  },
  {
    "title": "Taoiseach - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taoiseach",
    "snippet": "Following the 2020 election, Fianna Fáil and Fine Gael entered coalition together for the first time. The two agreed to rotate the role of Taoiseach, with Micheál Martin going first before becoming Tánaiste under <strong>Leo Varadkar</strong>, and later Simon Harris, of the smaller Fine Gael party.",
    "published": "4 days ago"
  },
  {
    "title": "Micheal Martin | Taoiseach, Previous Offices, & Family Tragedy | Britannica",
    "url": "https://www.britannica.com/biography/Micheal-Martin",
    "snippet": "Micheal Martin, Irish politician who became taoiseach (prime minister) of Ireland in 2020 after the party he led, <strong>Fianna Fail</strong>, entered into an unprecedented coalition government with its historical rival, Fine Gael, and the Green Party following ...",
    "published": "February 3, 2022"
  },
  {
    "title": "Leo Varadkar becomes taoiseach as Micheál Martin steps down",
    "url": "https://www.bbc.com/news/world-europe-63945064",
    "snippet": "The deal brought together <strong>Mr Varadkar</strong>&#x27;s Fine Gael party, Mr Martin&#x27;s Fianna Fáil and the Green Party in a historic compromise. <strong>Mr Varadkar</strong>, a qualified medical doctor, previously served as taoiseach and minister of defence from 2017 to 2020.",
    "published": "December 17, 2022"
  },
  {
    "title": "Micheál Martin – Houses of the Oireachtas",
    "url": "https://www.oireachtas.ie/en/members/member/Miche%C3%A1l-Martin.D.1989-06-29/",
    "snippet": "Covid-19 Pandemic 2. Deputy Micheál Martin asked the Taoiseach his views on whether there will be scope to narrow the time between phases 4 and 5 of the Roadmap for Reopening Society and Business if all the five health indicators are positive.",
    "published": null
  }
]