[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "(or Newsmax.com, previously styled NewsMax) is an American cable news, political opinion commentary, and digital media company founded by <strong>Christopher Ruddy</strong> in 1998. It has been variously described as conservative, right-wing, and far-right. Newsmax Media divisions include its cable and broadcast ...",
    "published": "1 week ago"
  },
  {
    "title": "Newsmax TV - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax_TV",
    "snippet": "It was launched to provide independent news; its founder, <strong>Chris Ruddy</strong> described it as intended to be a &quot;kinder, gentler Fox News,&quot; saying that &quot;Our goal is to be a little more boomer-oriented, more information-based rather than being vituperative and polarizing.&quot;",
    "published": "2 weeks ago"
  },
  {
    "title": "Christopher Ruddy | Long Island University",
    "url": "https://liu.edu/roosevelt/~/link.aspx?_id=CBEEEDD71542408AA2E0F8E91B527511&_z=z",
    "snippet": "Ruddy founded Newsmax in 1998 to publish online and offline content in the fields of news, politics, health and finance. Newsmax.com ranks consistently as one of the country&#x27;s most trafficked news websites. Newsmax TV, a cable and over-the-top media service news channel started in 2014, is carried in more than 70 million U.S.",
    "published": null
  },
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "Ruddy has been both a &quot;Patron&quot; and a &quot;Sustaining Donor&quot; to the Wikimedia Foundation. He is an alumnus of the American Swiss Foundation. Following Ruddy&#x27;s work at the Pittsburgh Tribune-Review, he started Newsmax with the owner of the Tribune-Review, <strong>Richard Mellon Scaife</strong>, and a $25,000 investment ...",
    "published": "5 days ago"
  },
  {
    "title": "Chris Ruddy '87C | St. John's University",
    "url": "https://www.stjohns.edu/news-media/success-stories/chris-ruddy-87c",
    "snippet": "As the Founder, Chief Executive Officer, and President of Newsmax Media Inc., Mr. Ruddy today presides over the burgeoning success of the media company that includes the news website known as Newsmax.com. The site boasts an estimated 20–30 million monthly visitors and is the third-most viewed political website in the country. Newsmax Magazine has more than 400,000 monthly readers and the company’s cable news channel, Newsmax TV, launched in 2014.",
    "published": null
  }
]