[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Marcia Carolyn Kaptur (/ˈkæptər/ ... district since 1983. <strong>A member of the Democratic Party, Kaptur is the longest-serving woman in congressional history and the dean of Ohio&#x27;s congressional delegation since 2009 when Representative Ralph Regula retired</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "↑ 2.0 2.1 Biographical Directory of the United States Congress, &quot;Kaptur, Marcia Carolyn,&quot; accessed Oct. 28, 2022 · ↑ Congresswoman Marcy Kaptur, &quot;About Marcy,&quot; accessed August 22, 2025",
    "published": null
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "In 1981, while pursuing a doctorate in urban planning and development finance at MIT, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the 1982 recession to stage a nationally-recognized upset.",
    "published": "May 27, 2025"
  },
  {
    "title": "Rep. Marcy Kaptur - D Ohio, 9th, In Office - Biography | LegiStorm",
    "url": "https://www.legistorm.com/person/bio/51457/Marcia_Carolyn_Kaptur.html",
    "snippet": "See more about Rep. Marcy Kaptur - D Ohio, 9th, In Office, including dates served, biography, salaries paid, personal financial disclosures, office information, staff directories and other biographical information.",
    "published": null
  },
  {
    "title": "About Marcy",
    "url": "https://marcykaptur.com/about-marcy/",
    "snippet": "JavaScript is disabled in your browser · Please enable JavaScript to proceed · A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser",
    "published": null
  }
]