[
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and doctorate degrees in zoology in 1966 at the University of Oxford under famed ethologist Nikolaas Tinbergen (who was best known for his work with both instinctive and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "In his own work, Maeterlinck tried to explain memory in termites and ants by stating that neural memory traces were added &quot;upon the individual mneme&quot;. Nonetheless, the author James Gleick describes Dawkins&#x27;s concept of the meme as &quot;his most famous memorable invention, far more influential than his selfish genes or his later proselytising against religiosity&quot;. In 2006 Dawkins founded the Richard Dawkins Foundation for Reason and Science (RDFRS), a non-profit organisation.",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins - Curriculum Manager Coach - Bayt.com People",
    "url": "https://people.bayt.com/richard-dawkins-51973545/",
    "snippet": "View the professional profile of Richard Dawkins, a seasoned Curriculum Manager Coach with <strong>over 26 years, 7 Months</strong> of experience, on Bayt.com.",
    "published": null
  },
  {
    "title": "Richard Dawkins - Kids | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/kids/article/Richard-Dawkins/476248",
    "snippet": "After this, Dawkins wrote many more books that explored the ways in which evolution may happen. He was especially known for trying to explain science in simple terms that many people could understand. In 1995 he was made the Charles Simonyi professor of public understanding of science at Oxford University. Richard Dawkins was outspoken about his atheism, which means he did not believe in God.",
    "published": null
  },
  {
    "title": "Richard Dawkins - Oxford Reference",
    "url": "https://www.oxfordreference.com/display/10.1093/oi/authority.20110803095703340",
    "snippet": "(1941– )British scientist whose books on genetics and evolution have found a wide general readership.Born in Nairobi, Kenya, Dawkins studied at Oxford, then taught at the University of California, Berkeley (1967–69), before returning to Oxford as a fellow of New College.",
    "published": null
  }
]