[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and is on the advisory board of the University of Austin.",
    "published": "1 week ago"
  },
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "Teaching the Value of Science and Advancing Secularism Founded in 2006 by Richard Dawkins, the foundation’s mission is to realize Richard’s vision to remove ...",
    "published": "July 17, 2025"
  },
  {
    "title": "OPEN DISCUSSION MARCH 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/2025/03/open-discussion-march-2025/",
    "snippet": "I happen to think that government service is an honorable profession, based partially on a 30 year career and even longer dealing with government workers while I was at a private law firm. Government employees work very hard every day to provide the services their agencies were designed for.",
    "published": "April 1, 2025"
  },
  {
    "title": "Contact Richard Dawkins, Email: ****@companyx.com & Phone Number | Worker at Company-X - ZoomInfo",
    "url": "https://www.zoominfo.com/p/Richard-Dawkins/8825059920",
    "snippet": "Richard Dawkins is a Worker at Company-X based in San Francisco, California.Explore more · Company-X · 2025-present (4 months) Founded in 2012 by software specialists David Hallett and Jeremy Hughes, New Zealand software specialist Company-X immediately won contracts with New Zealand government departments and a Silicon Valley multinational.",
    "published": null
  },
  {
    "title": "Richard Dawkins Net Worth 2025: How He Makes Money And Salary",
    "url": "https://pennbookcenter.com/richard-dawkins-net-worth/",
    "snippet": "Public Speaking – Dawkins regularly speaks at conferences, debates, and lectures, earning substantial fees. Academic Salary – As a professor at Oxford, he held a prestigious position that provided a stable income. Media Appearances – Documentaries and interviews have added to his earnings. Foundation Work – While not a direct source of income, his foundation has enhanced his influence and reach. Richard Dawkins’ books have been bestsellers for decades.",
    "published": null
  }
]