[
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "In May 2024, the government legislated a vehicle emission standard for new vehicles sold in Australia from 1 July 2025, in an effort to introduce more fuel efficient vehicles to the Australian market. Albanese&#x27;s government took office during a massive surge in electricity prices exacerbated by the global energy crisis and the Russo-Ukrainian War. On 9 December 2022, Albanese convened a meeting of the National Cabinet and announced a coordinated plan to introduce temporary caps on gas and coal prices.",
    "published": "9 hours ago"
  },
  {
    "title": "Anthony Albanese vows to deploy all resources against antisemitism as criticism mounts after Bondi attack | Anthony Albanese | The Guardian",
    "url": "https://www.theguardian.com/australia-news/2025/dec/15/anthony-albanese-vows-to-deploy-all-resources-against-antisemitism-as-criticism-mounts-following-bondi-attack-ntwnfb",
    "snippet": "Anthony Albanese says <strong>his government will dedicate “every single resource required” to eradicate antisemitism in Australia after the Bondi terror shooting</strong>, after envoy Jillian Segal and the Coalition accused Labor of not doing enough to ...",
    "published": "1 day ago"
  },
  {
    "title": "Anthony Albanese ‘ready for the fight’ to tighten firearms laws as National party and gun groups push back | Bondi beach terror attack | The Guardian",
    "url": "https://www.theguardian.com/australia-news/2025/dec/16/anthony-albanese-ready-for-the-fight-to-tighten-firearms-laws-as-national-party-and-gun-groups-push-back-ntwnfb",
    "snippet": "Tue 16 Dec 2025 01.23 ESTLast modified on Tue 16 Dec 2025 01.35 EST · Share · Anthony Albanese says he is “ready for the fight” to tighten Australia’s firearms laws after the Bondi beach terror attack, as the gun lobby and the National party push back against changes they claim are attempts to divert attention from radicalisation.",
    "published": "7 hours ago"
  },
  {
    "title": "Australian PM Anthony Albanese Omits Jews in Statement on Hanukkah Massacre",
    "url": "https://freebeacon.com/israel/australian-pm-anthony-albanese-omits-jews-in-statement-on-hanukkah-massacre/",
    "snippet": "Australian prime minister Anthony Albanese speaks to the media after the terror attack at Sydney&#x27;s Bondi Beach. Adam Kredo · December 14, 2025 · Australian prime minister Anthony Albanese released a statement after Sunday’s terror attack on a Hanukkah celebration in Sydney in which he made no mention of Jews or anti-Semitism.",
    "published": "1 day ago"
  },
  {
    "title": "Anthony Albanese sidesteps calls for reform amid growing community anger over MP travel perks | Australian politics | The Guardian",
    "url": "https://www.theguardian.com/australia-news/2025/dec/11/anthony-albanese-sidesteps-calls-for-reform-amid-growing-community-anger-over-mp-travel-perks",
    "snippet": "Thu 11 Dec 2025 02.05 ESTLast modified on Thu 11 Dec 2025 02.25 EST · Share · Anthony Albanese has sidestepped calls for reform or an inquiry into politicians’ expenses and travel perks, saying he is more focused on the under-16s social media ban than growing community outrage over MPs using taxpayer funds to fly their spouses to football games, cricket matches and exclusive dinners.",
    "published": "5 days ago"
  }
]