[
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "After working for 15 years as a <strong>city and regional planner</strong>, primarily in Toledo and Chicago, she accepted an appointment as a domestic policy advisor to President Jimmy Carter. During his Administration, she helped maneuver 17 housing and neighborhood revitalization bills through Congress.",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Afterwards, she joined the Carter administration as a domestic policy advisor on urban affairs and helped advance several housing and neighborhood revitalization bills through Congress. Following her time in Washington D.C., Kaptur went to Massachusetts to do graduate work.",
    "published": "1 week ago"
  },
  {
    "title": "Marcy Kaptur - BW Center for Women and Politics in Ohio | Baldwin Wallace University",
    "url": "https://www.bw.edu/centers/women-and-politics-of-ohio/bios/04-kaptur-marcy/",
    "snippet": "Prior Experience: <strong>Urban Planner for the Toledo-Lucas County Plan Commissions from 1969-1975; Director of Planning for the National Center for Urban Ethnic Affairs from 1975-1977</strong>; Domestic Policy Advisor for President Jimmy Carter from 1977-1979 ...",
    "published": null
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Kaptur served as an <strong>urban policy advisor</strong> in the Jimmy Carter (D) administration from 1977 to 1979 and was pursuing a doctorate in urban affairs at the Massachusetts Institute of Technology when she first ran for election in 1982.[5][2] Kaptur was assigned to the following committees:[Source] ...",
    "published": null
  },
  {
    "title": "The Honorable Marcy Kaptur (D-OH) Biography",
    "url": "https://www.congress.gov/115/meeting/house/108368/witnesses/HHRG-115-VR03-Bio-K000009-20180613.pdf",
    "snippet": "an appointment as a domestic policy advisor to President Jimmy Carter. During his Administration, she · helped maneuver 17 housing and neighborhood revitalization bills through Congress. In 1981, while pursuing a doctorate in urban planning and development finance at MIT, she was recruited · by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she · was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the 1982 recession",
    "published": null
  }
]