[
  {
    "title": "Anne-Marie Slaughter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anne-Marie_Slaughter",
    "snippet": "Slaughter, Anne-Marie (2021). <strong>Renewal: From Crisis to Transformation in Our Lives, Work, and Politics</strong>. The Public Square. Princeton University Press.",
    "published": "October 1, 2025"
  },
  {
    "title": "Anne-Marie Slaughter - Project Syndicate",
    "url": "https://www.project-syndicate.org/columnist/anne-marie-slaughter",
    "snippet": "<strong>Oct 3, 2025</strong> Anne-Marie Slaughter calls on middle powers to take the lead and work with overlapping coalitions of states and non-state actors.",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter",
    "url": "https://www.newamerica.org/our-people/anne-marie-slaughter/",
    "snippet": "Currently <strong>CEO of the think and action tank New America</strong>, Anne-Marie Slaughter is a global leader, scholar, and public intellectual. She was the J. Sinclair Armstrong Professor of International, Foreign, and Comparative Law at Harvard Law School ...",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter Speaks to a Private Tuck Audience | Tuck School of Business",
    "url": "https://tuck.dartmouth.edu/news/articles/anne-marie-slaughter-speaks-to-a-private-tuck-audience",
    "snippet": "Lippman said that Slaughter’s confident presence at Tuck sets a good example for how women should strive to be. “If I could leave Tuck having accomplished one thing,” she said, “I’d want every single female to leave more confident than when they got here.” · The annual Women In Business Conference addressed that topic last fall, where the theme was “Be Your Own Champion.” The conference featured keynote speeches by female alumni who are senior executives, as well as workshops on leadership and self-advocacy.",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter | الشرق الأوسط",
    "url": "https://english.aawsat.com/home/writer/Anne-Marie%20Slaughter",
    "snippet": "Latest News · <strong>Israel Will Soon Slow or Halt Aid into Parts of Northern Gaza as it Ramps up Offensive</strong> · UK Refuses to Invite Israeli Government Officials to London Arms Fair over the War in Gaza · Russian Mass Drone, Missile Attack on Southern Ukraine Kills 1 and Wounds Dozens · Anne-Marie ...",
    "published": null
  }
]