[
  {
    "title": "Banijay Entertainment - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banijay_Entertainment",
    "snippet": "Banijay Entertainment S.A. (formerly ... 185,000 hours of original programming. Headquartered in Paris, the company was founded in January 2008 by <strong>Stéphane Courbit</strong>, former president of Endemol France, and has risen since its inception, to become a €3.2bn turnover ...",
    "published": "1 day ago"
  },
  {
    "title": "Banijay Group is a leader in the entertainment business",
    "url": "https://group.banijay.com/who-we-are/",
    "snippet": "Entrepreneurship is embedded in Banijay Group’s DNA. The Group was founded by <strong>Stéphane Courbit</strong> (now Chairman of Banijay Group), and is led by entrepreneurs at every level of its organization.",
    "published": "May 24, 2024"
  },
  {
    "title": "Our Story - Banijay",
    "url": "https://www.banijay.com/our-story/",
    "snippet": "We are a collective of multi-talented on and off-screen creatives from 25 territories, united in ambition and diverse in thinking · Launched in 2008, media powerhouse Banijay is home to over 130 creative companies across 25 territories and delivers on average over 17,000 hours of content and ...",
    "published": "November 24, 2016"
  },
  {
    "title": "Stéphane Courbit - Banijay",
    "url": "https://www.banijay.com/people/stephane-courbit/",
    "snippet": "In January 2008, Courbit created Banijay Group, and in 2016, he triggered the merger between Banijay Group and Zodiak Media, making him the leader of the world’s largest independent production and distribution company (over 3 billion Euro business), responsible for global hit brands including Temptation Island, Survivor, Wife Swap and Versailles.",
    "published": "April 3, 2024"
  },
  {
    "title": "About: Banijay",
    "url": "https://dbpedia.org/page/Banijay",
    "snippet": "Headquartered in Paris, the company was founded in January 2008 by <strong>Stéphane Courbit</strong>, formerly president of Endemol France, and has risen since its inception, to become a €3bn turnover business.",
    "published": null
  }
]