[
  {
    "title": "Scott Morrison | National Museum of Australia",
    "url": "https://www.nma.gov.au/explore/features/prime-ministers/scott-morrison",
    "snippet": "Former Treasurer Scott John Morrison replaced <strong>Malcolm Turnbull</strong> as the Prime Minister after a leadership ballot on 24 August 2018.",
    "published": null
  },
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "The vote was mostly along party lines, with Bridget Archer being the only Coalition MP to vote in favour of the motion. On 23 January 2024, Morrison announced his resignation from Parliament. He formally resigned on 28 February 2024 and was succeeded by <strong>Simon Kennedy</strong>, who won the 2024 Cook ...",
    "published": "6 days ago"
  },
  {
    "title": "Prime Ministers | MOAD",
    "url": "https://apm-origin.moadoph.gov.au/prime-ministers",
    "snippet": "<strong>Anthony Albanese</strong> became Australia’s 31st Prime Minister when the Labor Party won office, replacing the Liberal-National Party Coalition government led by Scott Morrison.",
    "published": null
  },
  {
    "title": "Morrison government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Morrison_government",
    "snippet": "He was replaced as Leader of the Nationals and Deputy Prime Minister by <strong>Barnaby Joyce</strong>. Scott Morrison was Treasurer in the Turnbull government and became Prime Minister following the resignation of Malcolm Turnbull in 2018.",
    "published": "2 weeks ago"
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "Scott Morrison (born May 13, 1968, Bronte, New South Wales, Australia) is an Australian conservative politician who served as leader of the Liberal Party and prime minister of Australia (2018–22). He became prime minister in August 2018 following a challenge by the right wing of the party to the leadership of Malcolm Turnbull, who stepped down as party leader and prime minister. After Peter Dutton, who instigated the leadership challenge, was unable to win enough support to succeed Turnbull, Morrison ascended to the premiership as a compromise candidate.",
    "published": "August 30, 2018"
  }
]