[
  {
    "title": "Kim Jong Un demands major health sector ‘reform’ at Pyongyang hospital opening | NK News",
    "url": "https://www.nknews.org/2025/10/kim-jong-un-demands-major-health-sector-reform-at-pyongyang-hospital-opening/",
    "snippet": "North Korean leader <strong>Kim Jong Un</strong> severely criticized the country’s Ministry of Public Health and called for health sector “reform” at the opening ceremony for the Pyongyang General Hospital on Monday, according to state media.",
    "published": "October 7, 2025"
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform (Algeria) | GHDx",
    "url": "https://ghdx.healthdata.org/organizations/ministry-health-population-and-hospital-reform-algeria",
    "snippet": "Formerly named the Ministry of Health and Population (Ministère de la Santé et de la Population).",
    "published": null
  },
  {
    "title": "WHO EMRO - Country success stories",
    "url": "https://www.emro.who.int/world-patient-safety-day/2025/country-success-stories.html",
    "snippet": "In particular, the establishment of the General Administration for Patient Safety at the Ministry of Health and Population provided the leadership and coordination, in collaboration with WHO, that made the project possible. With every step, Egypt is proving that universal health coverage isn’t just a policy – it’s a promise. And through the PSFHI, that promise is being kept. September 2025 – In a significant stride towards safer, more compassionate neonatal care, the Islamic Republic of Iran has successfully scaled up the implementation of kangaroo mother care (KMC) and developmental care packages in neonatal intensive care units (NICUs).",
    "published": null
  },
  {
    "title": "Ministry of Health, Population, and Hospital Reform | COMIT",
    "url": "https://www.comitglobal.org/authority/rechBtDWIo3AgjQYV",
    "snippet": "Berman Institute of Bioethics &amp; Center for Immunization Research, Johns Hopkins University. Covid-19 Maternal Immunization Tracker (COMIT). www.comitglobal.org. Accessed: 1/10/2025, 4:20:00 PM · If you have questions or comments, or would like to notify us of any technical issues you are ...",
    "published": null
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health,_Population_and_Hospital_Reform",
    "snippet": "The Ministry of Health, Population and Hospital Reform (MSPRH) is the health ministry of Republic of Algeria. It is located in El Madania, a municipality of Algiers. The Ministry is responsible for public health facilities and population monitoring. The Minister is a member of the Council of ...",
    "published": "April 15, 2025"
  }
]