[
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "In 2026, the complete board of the European Film Academy will consist of Chair <strong>Ada Solomon</strong> Deputy Chairs Matthieu Darras and Leontine Petit Albania, Bosnia and Herzegovina, Croatia, Kosovo, Montenegro, North Macedonia, Serbia, Slovenia Danijel ...",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "In 1996, Wim Wenders succeeded Bergman as president, and Nik Powell, a British producer, was elected chairman. <strong>Mike Downey</strong>, an Irish-British film producer, was elected chairman in 2020. In 2021, Polish filmmaker Agnieszka Holland became the first woman to serve as president of ...",
    "published": "September 3, 2025"
  },
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Producer <strong>Ada Solomon</strong> has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian film industry has achieved within the institution.",
    "published": "2 weeks ago"
  },
  {
    "title": "Romanian Producer Ada Solomon Elected New Chair of EFA’s Board - FilmNewEurope.com",
    "url": "https://filmneweurope.com/news/region/item/127511-romanian-producer-ada-solomon-elected-new-chair-of-efa-s-board",
    "snippet": "BERLIN: Romanian producer <strong>Ada Solomon</strong> is the new chair of the Board of the European Film Academy, as Mike Downey’s term has come to an end. Her new deputy chairs are Dutch producer Leontine Petit and French consultant Matthieu Darras.",
    "published": "2 weeks ago"
  },
  {
    "title": "Producer Ada Solomon elected European Film Academy board chair - AGERPRES",
    "url": "https://agerpres.ro/english/2025/12/04/producer-ada-solomon-elected-european-film-academy-board-chair--1508684",
    "snippet": "It is a time of change and I am ready to embrace the challenge, knowing I am supported by the Academy&#x27;s outstanding executive team and the wonderful people on the Board of the European Film Academy, especially the newly elected deputy chairs Leontine Petit and Matthieu Darras,&#x27; <strong>Ada Solomon</strong> is ...",
    "published": null
  }
]