[
  {
    "title": "Alphabet Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
    "snippet": "Alphabet is mainly owned by <strong>institutional investors</strong>, who own over 60% of shares. The founders Larry Page and Sergey Brin each control around 3% of all shares, but control with other insiders the majority of voting shares.",
    "published": "2 weeks ago"
  },
  {
    "title": "Who Currently Owns Alphabet? A Deep Dive Investigation",
    "url": "https://surgegraph.io/business/who-currently-owns-alphabet",
    "snippet": "For example, <strong>Larry Page and Sergey Brin</strong>, the co-founders of Google now known as Alphabet, control enormous shares, a function of their creation of the company and ongoing control.",
    "published": "January 19, 2025"
  },
  {
    "title": "Alphabet Investor Relations - Home",
    "url": "https://abc.xyz/",
    "snippet": "As Sergey and I wrote in the original founders letter 11 years ago, “Google is not a conventional company. We do not intend to become one” · As part of that, we also said that you could expect us to make “smaller bets in areas that might seem very speculative or even strange when compared ...",
    "published": null
  },
  {
    "title": "Who owns Alphabet in 2025? GOOGL shareholders explained | Capital.com",
    "url": "https://capital.com/en-int/analysis/alphabet-shareholder-who-owns-most-googl",
    "snippet": "Founders <strong>Larry Page and Sergey Brin</strong> together own over 85% of Alphabet’s Class B stock, giving them approximately 51.4% of total voting power. No institutional investor or external entity holds a major Class B stake.",
    "published": "November 18, 2025"
  },
  {
    "title": "Alphabet Inc | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/history/alphabet-inc",
    "snippet": "Alphabet Inc. is an American multinational conglomerate holding company formed in 2015 as part of a restructuring of Google, which became one of its subsidiaries. Headquartered in Mountain View, California, Alphabet Inc. is now one of the largest technology companies globally, ranking among peers like Apple, Amazon, and Microsoft.",
    "published": null
  }
]