[
  {
    "title": "The European Film Academy Reveals The Shortlists For The 2025 EFA Awards",
    "url": "https://nextbestpicture.com/the-european-film-academy-reveals-the-shortlists-for-the-2025-efa-awards/",
    "snippet": "The European Film Academy has announced a shortlist of 67 titles eligible for nominations at the 38th European Film Awards, which will be held on January 17th, 2026. The selection features 44 narrative features, 15 documentaries, and eight animated films. Of these, 27 are directed or co-directed ...",
    "published": "October 14, 2025"
  },
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Producer <strong>Ada Solomon</strong> has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian film industry has achieved within the institution.",
    "published": "2 weeks ago"
  },
  {
    "title": "Academy new members 2025: check the full list - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/new-members-2025-full-list/",
    "snippet": "34th European Film Awards Berlin PLEASE NOTE: Accreditation to the European Film Awards is limited to people who have been fully vaccinated against Covid-19 or who have recovered after a Covid-19 infection – provided they do not show typical Covid-19 symptoms.",
    "published": "May 16, 2025"
  },
  {
    "title": "Sección European Film Academy | Festival de Cine de Sevilla",
    "url": "https://festivalcinesevilla.eu/en/seccion-european-film-academy-2025",
    "snippet": "En 2025 Sevilla volverá a ser ... de la Academia de Cine Europeo. Para acompañar la cita, se ha realizado una cuidada selección de películas que aspiran a ser galardonadas. <strong>Tarik Saleh</strong> | Sweden, France, Denmark | 2025 | 115 min. | O.V. in Arabic, subtitles in Spanish and English Sección ...",
    "published": null
  },
  {
    "title": "The nominees for LUX – Audience Award 2025 - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/lux-award-2025-nomination/",
    "snippet": "The European Film Academy reveals ... Film Academy in partnership with the European Commission and Europa Cinemas. The five shortlisted films were announced today during an announcement event at the European Parliament in Strasbourg. ... The winner of the LUX Audience Award is chosen jointly by citizens across the EU and by MEPs.",
    "published": "March 25, 2025"
  }
]