[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "Micheál Martin (Irish: [ˈmʲiːçaːl̪ˠ]; born 16 August 1960) is an Irish Fianna Fáil politician <strong>serving as Taoiseach since January 2025, having previously held the position from 2020 to 2022</strong>. Martin served as Tánaiste, Minister for Foreign Affairs and Minister for Defence from December ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Micheál Martin - Taoiseach and Uachtarán Fhianna Fáil. TD for Cork South Central. | LinkedIn",
    "url": "https://ie.linkedin.com/in/miche%C3%A1l-martin-b6a7b4b9",
    "snippet": "<strong>Taoiseach from 2020 to 2022</strong> Elected Uachtarán Fhianna Fáil on the 26th of January 2011 Minister for Foreign Affairs (May 2008 - January 2011) Minister for Enterprise, Trade and Employment (September 2004 - May 2008) Minister for Health and ...",
    "published": "November 6, 2025"
  },
  {
    "title": "Micheál Martin returns as Ireland's prime minister after securing backing of the parliament | AP News",
    "url": "https://apnews.com/article/ireland-micheal-martin-taoiseach-return-eab53d572e0400715276f89b962d92d5",
    "snippet": "DUBLIN (AP) — Irish lawmakers ... a coalition government. <strong>Members of the lower house of parliament, the Dáil, voted by 95 to 76 to confirm Martin as taoiseach, the Irish title for prime minister.</strong>...",
    "published": "January 23, 2025"
  },
  {
    "title": "Leo Varadkar becomes taoiseach as Micheál Martin steps down",
    "url": "https://www.bbc.com/news/world-europe-63945064",
    "snippet": "Now, the Fianna Fáil leader Micheál Martin has handed over the most important job in Ireland to his Fine Gael counterpart, <strong>Leo Varadkar</strong>. The parties agreed the deal after a general election in 2020, when Sinn Féin surged to win the most ...",
    "published": "December 17, 2022"
  },
  {
    "title": "Micheal Martin | Taoiseach, Previous Offices, & Family Tragedy | Britannica",
    "url": "https://www.britannica.com/biography/Micheal-Martin",
    "snippet": "<strong>As leader of Fianna Fáil, Martin assumed the role of taoiseach on June 27, 2020.</strong> At University College Cork, Micheál Martin studied history and Irish, earning a bachelor’s degree.",
    "published": "February 3, 2022"
  }
]