[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "In January 2015, <strong>Sergio Mattarella</strong>, a veteran left-wing Christian Democrat and founding member of the PD, whose candidacy had been proposed by Renzi and unanimously endorsed by the party&#x27;s delegates, was elected President of Italy during a presidential election triggered by President Giorgio ...",
    "published": "1 day ago"
  },
  {
    "title": "Democratic Party – Democratic and Progressive Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_–_Democratic_and_Progressive_Italy",
    "snippet": "On 29 July, Letta announced the formation of a joint list between the PD, Article One (Art.1), the Italian Socialist Party (PSI), and Solidary Democracy (DemoS) in the upcoming general election, and was officially founded that same day. Other minor parties joined later.",
    "published": "August 9, 2025"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "The Italian center left’s many damaging choices were not individual follies or even outbreaks of collective madness. Rather, they are rooted in this party’s recent history and political culture — and its particular social base. The Democratic Party may have only a short history, but it has already passed through several sometimes strikingly contradictory phases. The party was founded in 2007 as a result of the convergence of the Democrats of the Left (direct heirs of the Italian Communist Party) and the Margherita (heir to part of Christian Democracy).",
    "published": null
  },
  {
    "title": "Democratic Party | political party, Italy | Britannica",
    "url": "https://www.britannica.com/topic/Democratic-Party-political-party-Italy",
    "snippet": "https://premium.britannica.com/premium-membership/?utm_source=premium&amp;utm_medium=nav-login-box&amp;utm_campaign=black-friday-2025 ... Ask the Chatbot Games &amp; Quizzes History &amp; Society Science &amp; Tech Biographies Animals &amp; Nature Geography &amp; Travel Arts &amp; Culture ProCon Money Videos ... …party, known simply as the Democratic Party (Partito Democratico), emerged when the DS merged with the centrist Daisy (Margherita) party.",
    "published": null
  },
  {
    "title": "Political cheat sheet: What to know about Italy's Democratic Party",
    "url": "https://www.thelocal.it/20170904/what-is-italys-ruling-democratic-party-politics-ideology",
    "snippet": "Like most of Italy&#x27;s other major parties, the reason the PD was only formed quite recently is due to a massive corruption trial known as Mani Pulite (Clean Hands). or tangentopoli, in the early 1990s, which rocked the political establishment and led to a major shake-up of key players. PD was formed in its aftermath to unite a wide range of left-wing and centre-left parties, with founding members including former Communists and former Christian Democrats...",
    "published": "September 8, 2022"
  }
]