[
  {
    "title": "Yulia Svyrydenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yulia_Svyrydenko",
    "snippet": "On 14 July 2025, President Zelenskyy announced a government reshuffle and nominated Svyrydenko as Prime Minister of Ukraine. Her appointment was approved by the Verkhovna Rada on 17 July. Svyrydenko is the second female Prime Minister of Ukraine since Ukrainian independence in 1991, following in Yulia Tymoshenko&#x27;s footsteps.",
    "published": "1 month ago"
  },
  {
    "title": "Ukraine PM Denys Shmyhal resigns as Zelensky backs Yulia Svyrydenko as successor",
    "url": "https://www.moneycontrol.com/world/ukraine-pm-denys-shmyhal-resigns-as-zelensky-backs-yulia-svyrydenko-as-successor-article-13281661.html/amp",
    "snippet": "Ukrainian Prime Minister <strong>Denys Shmyhal</strong> handed in his resignation on Tuesday after the country&#x27;s President Volodymyr Zelensky decided to nominate First Deputy Prime Minister Yuliia Svyrydenko to succeed him in the role.",
    "published": "July 15, 2025"
  },
  {
    "title": "Ukraine's new PM takes charge of narrower cabinet of Zelensky loyalists",
    "url": "https://www.lemonde.fr/en/international/article/2025/07/17/ukraine-s-new-pm-takes-charge-of-narrower-cabinet-of-zelensky-loyalists_6743455_4.html",
    "snippet": "Yulia Svyrydenko, 39, who succeeds <strong>Denys Shmyhal</strong> and previously served as economy minister, is well regarded by the US administration, with whom she negotiated the critical minerals agreement.",
    "published": "July 17, 2025"
  },
  {
    "title": "‘Yulia’s not in it for the money’ Who is Ukraine’s new prime minister? And how was she appointed despite the wartime ban on cabinet dismissals? — Meduza",
    "url": "https://meduza.io/en/feature/2025/07/21/yulia-s-not-in-it-for-the-money",
    "snippet": "Having survived Ukraine’s last cabinet reshuffle in the summer of 2024, <strong>Denys Shmyhal</strong> stepped down from the role of prime minister last week. With Shmyhal now set to lead the Defense Ministry, taking his place as head of government is Yulia ...",
    "published": "July 21, 2025"
  },
  {
    "title": "EXPLAINED: Who is Yulia Svyrydenko, Zelensky’s Pick for New Prime Minister?",
    "url": "https://www.kyivpost.com/post/56283",
    "snippet": "And the position of Head of Government will be taken by Deputy Prime Minister and Minister of Economy Yulia Svyrydenko.",
    "published": "July 14, 2025"
  }
]