[
  {
    "title": "Black Press - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Black_Press",
    "snippet": "Black Press Group Ltd. (BPG) is a Canadian commercial printer and newspaper publisher founded in 1975 by David Holmes Black. Based in <strong>Surrey, British Columbia</strong>, it was previously owned by the publisher of Toronto Star (Torstar, 19.35%) and Black (80.65%). In March 2024, it was announced that ...",
    "published": "4 weeks ago"
  },
  {
    "title": "Black Press Group Ltd Company Profile",
    "url": "https://www.dnb.com/business-directory/company-profiles.black_press_group_ltd.60495afdde9afa9acf5671d00d45f072.html",
    "snippet": "By clicking the button above, you agree to our Terms of Use and consent to our contact process. See our Privacy Notice to unsubscribe · By clicking the button above, you agree to our Terms of Use. You consent to Dun &amp; Bradstreet (D&amp;B) using this data for marketing and analytical purposes, ...",
    "published": null
  },
  {
    "title": "Black Press Group Ltd - Company Profile and News - Bloomberg Markets",
    "url": "https://www.bloomberg.com/profile/company/6869173Z:CN",
    "snippet": "Company profile page for Black Press Group Ltd including stock price, company news, executives, board members, and contact information",
    "published": null
  },
  {
    "title": "NANAIMO NEWS BULLETIN / BLACK PRESS GROUP LTD | City of Nanaimo",
    "url": "https://www.nanaimo.ca/business_report/bus_details.aspx?licence=100452",
    "snippet": "Business licence details for NANAIMO NEWS BULLETIN / BLACK PRESS GROUP LTD, including address, phone number, business description, map views, and more...",
    "published": null
  },
  {
    "title": "Black Press Media Ltd, 15288 54A Ave, Surrey, BC V3S 6T4, CA - MapQuest",
    "url": "https://www.mapquest.com/ca/british-columbia/black-press-media-ltd-285205108",
    "snippet": "Black Press Media Ltd., based in <strong>Surrey, BC</strong>, is a leading provider of credible and hyperlocal journalism, serving over 80 communities across Canada and North America through a dedicated team of more than 200 journalists.",
    "published": null
  }
]