[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "In a cabinet reshuffle in January 2000, Martin was appointed Minister for Health and Children. Martin&#x27;s predecessor, <strong>Brian Cowen</strong>, described the position as &quot;like being in Angola&quot;, because &#x27;landmines&#x27; can go off at any time.",
    "published": "3 weeks ago"
  },
  {
    "title": "Micheal Martin | Taoiseach, Previous Offices, & Family Tragedy | Britannica",
    "url": "https://www.britannica.com/biography/Micheal-Martin",
    "snippet": "The principal challenge facing him was to build on the largely successful response of his predecessor, <strong>Leo Varadkar</strong>, to the coronavirus SARS-CoV-2 global pandemic, which had reached Ireland in early 2020.",
    "published": "February 3, 2022"
  },
  {
    "title": "Minister: Micheál Martin",
    "url": "https://isad.ie/item.php?t=m&id=3",
    "snippet": "After lengthy negotiations, he ... served as Taoiseach for the first half of the five-year term, with his predecessor <strong>Leo Varadkar</strong> as Tánaiste....",
    "published": null
  },
  {
    "title": "Micheál Martin - Taoiseach and Uachtarán Fhianna Fáil. TD for Cork South Central. | LinkedIn",
    "url": "https://ie.linkedin.com/in/miche%C3%A1l-martin-b6a7b4b9",
    "snippet": "Taoiseach and Uachtarán Fhianna Fáil. TD for Cork South Central. · Taoiseach and Uachtarán Fhianna Fáil, TD for Cork South Central. Tánaiste &amp; Minister for Foreign Affairs &amp; Minister for Defence from 2022 to 2025. Taoiseach from 2020 to 2022 Elected Uachtarán Fhianna Fáil on the 26th of January 2011 Minister for Foreign Affairs (May 2008 - January 2011) Minister for Enterprise, Trade and Employment (September 2004 - May 2008) Minister for Health and Children (January 2000 - September 2004) Minister for Education (June 1997 - January 2000) Fianna Fáil Front Bench spokesperson on Education and the Gaeltacht (1995 - 1997) I am a former Chairman of the Oireachtas All Party Committee on the Irish Language.",
    "published": "November 6, 2025"
  },
  {
    "title": "Taoiseach Micheál Martin TD",
    "url": "https://www.fiannafail.ie/taoiseach/micheal-martin?hsLang=en",
    "snippet": "Micheál Martin was born in Turners Cross, Cork, the son of <strong>Paddy Martin</strong>, formerly of CIE and ex-Irish International boxer, and Lana Corbett. He was educated locally, at Scoil Chríost Rí and Coláiste Chríost Rí, and remains a frequent visitor to both schools.",
    "published": null
  }
]