[
  {
    "title": "Tiger Aspect - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tiger_Aspect",
    "snippet": "The present-day company was founded in 1993 from the merger of Bennett-Jones&#x27; Tiger Television and Paul Sommers&#x27; Aspect Film &amp; Television. It has also produced television dramas such as Murphy&#x27;s Law and Sherlock Holmes and the Case of the Silk Stocking, and in October 2006, its drama series Robin Hood began showing on BBC One. They also produced the American reality television series Damage Control for MTV, and the animated children&#x27;s series Charlie and Lola, which was based on the books written by Lauren Child. Tiger Aspect has also made a documentary at the Buckinghamshire Railway Centre (BRC), Quainton, on the life of Sir John Betjeman for his centenary celebrations.",
    "published": "2 weeks ago"
  },
  {
    "title": "Tiger Aspect Productions - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/tiger-aspect-productions",
    "snippet": "Tiger Aspect Productions acquired by Endemol · Acquired by · Endemol · Announced Date · Nov 23, 2009 · Company Comparison Map · People · View Profiles &amp; Contacts · Headcount · 51-100 · Contacts · 32 · News · News• · Jan 24, 2025 · Broadcast — Tiger Aspect to focus on comedy as Lucy Bedford departs ·",
    "published": null
  },
  {
    "title": "Tiger Aspect Productions - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Tiger_Aspect_Productions",
    "snippet": "Tiger Aspect Productions is a British film and television production company of <strong>Peter Bennett-Jones</strong>, founded in 1993 from the merger between Tiger Television and Aspect Film &amp; Television.",
    "published": "November 12, 2025"
  },
  {
    "title": "Tiger Aspect Productions 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/120957-76",
    "snippet": "Tiger Aspect Productions is headquartered in London, United Kingdom.",
    "published": null
  },
  {
    "title": "Tiger Aspect Productions - BlackBook Companies - BCG Pro",
    "url": "https://www.comedy.co.uk/pro/blackbook/companies/tiger_aspect_productions/",
    "snippet": "Originally known as Tiger Television, Tiger Aspect is one of the UK&#x27;s most successful production companies, prolific across a broad range of programme genres. Originally an independent company, Tiger Aspect was bought by <strong>IMG Media</strong> in 2006 and ...",
    "published": null
  }
]