[
  {
    "title": "Patricia de Lille - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Patricia_de_Lille",
    "snippet": "Patricia de Lille (née Lindt; born 17 February 1951) is a South African politician who is the current <strong>Minister of Tourism and leader of the political party Good</strong>. She served as Minister of Public Works and Infrastructure from 2019 to 2023. She was previously Mayor of Cape Town from 2011 to ...",
    "published": "October 23, 2025"
  },
  {
    "title": "Patricia De Lille | South African History Online",
    "url": "https://sahistory.org.za/people/patricia-de-lille",
    "snippet": "During this period de Lille served as the Minister for Social Development of the Western Cape from 2010-2011 and come 2011, de Lille would succeed fellow DA Member Dan Plato as the <strong>Mayor of the City of Cape Town</strong>, a position she holds as of February ...",
    "published": null
  },
  {
    "title": "Patricia de Lille :: People's Assembly",
    "url": "https://www.pa.org.za/person/patricia-de-lille/",
    "snippet": "Patricia de Lille was appointed as <strong>Minister of Tourism of the Republic of South Africa</strong> on the 6 March 2023. She was reappointed on 30 June 2024. She was Minister of Public Works and Infrastructure from 30 May 2019 to 6 March 2023 She is currently ...",
    "published": null
  },
  {
    "title": "Patricia de Lille - Kids | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/kids/article/Patricia-de-Lille/601990",
    "snippet": "De Lille entered politics when she was in her 30s. In 1988 she was elected <strong>vice president of the National Council of Trade Unions</strong>. The council is one of South Africa’s largest labor groups.",
    "published": null
  },
  {
    "title": "Patricia de Lille | New Climate Economy | Commission on the Economy and Climate",
    "url": "https://newclimateeconomy.net/content/patricia-de-lille",
    "snippet": "Currently the <strong>Minister of Public Works and Infrastructure</strong>, Patricia de Lille has fought injustice for more than 40 years through her involvement in politics. She is known for her role as a trade unionist in the struggle for equality and as the initial whistle-blower on the infamous Arms Deal ...",
    "published": null
  }
]