[
  {
    "title": "Mark Aguiar | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is a consultant at the Federal Reserve Bank of Minneapolis and the Walker Professor of Economics and International Finance at Princeton University. Previously, he was a professor of economics at the University of Rochester and a senior economist at the Federal Reserve Bank of Boston.",
    "published": null
  },
  {
    "title": "Mark Aguiar - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Aguiar",
    "snippet": "Mark Armando Aguiar (born 1966) is an American economist who has served as the Walker Professor of Economics and International Finance at Princeton University since 2015. Born in 1966, Aguiar graduated magna cum laude from Brown University with a BA in history and Chinese in 1988.",
    "published": "October 23, 2025"
  },
  {
    "title": "Mark A. Aguiar",
    "url": "https://gceps.princeton.edu/mark-a-aguiar/",
    "snippet": "Aguiar <strong>joined the Princeton faculty in 2011</strong>, after holding appointments at the University of Rochester and the University of Chicago Graduate School of Business, and serving as senior economist at the Federal Reserve Bank of Boston.",
    "published": null
  },
  {
    "title": "Department of Economics Princeton University Princeton, NJ 08544 Mark Aguiar",
    "url": "https://www.markaguiar.com/CV/cv.pdf",
    "snippet": "Mark Aguiar · maguiar@princeton.edu · www.markaguiar.com · Employment · <strong>Walker Professor of Economics and International Finance, Princeton University, 2015-present</strong> · Professor of Economics, Princeton University, 2011-2015 · Professor of Economics, University of Rochester, 2009-2011 ·",
    "published": null
  },
  {
    "title": "Mark A. Aguiar",
    "url": "https://jrc.princeton.edu/people/mark-aguiar",
    "snippet": "Mark A. Aguiar is the Walker Professor of Economics and International Finance at Princeton University. His research focuses on models of consumption and savings with applications in both open- and closed-economy macroeconomics. Specific interests include life cycle consumption and savings, current account dynamics, sovereign debt, and the interplay of time allocation and consumption.",
    "published": null
  }
]