[
  {
    "title": "Taoiseach - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taoiseach",
    "snippet": "The incumbent Taoiseach is <strong>Micheál Martin, TD</strong>, leader of Fianna Fáil, who took office on 23 January 2025, following the 2024 general election and an agreement between Fianna Fáil, Fine Gael and independent TDs.",
    "published": "4 days ago"
  },
  {
    "title": "Dáil Éireann: Micheál Martin elected taoiseach after chaos subsides",
    "url": "https://www.bbc.com/news/articles/c05l794gze6o",
    "snippet": "Fianna Fail leader <strong>Micheál Martin</strong> has been elected taoiseach (Irish prime minister) for the second time after chaos in the Dáil (lower house of Irish Parliament) subsided.",
    "published": "January 23, 2025"
  },
  {
    "title": "Micheál Martin: Ireland finally appoints new prime minister after chaos in parliament | CNN",
    "url": "https://www.cnn.com/2025/01/23/world/ireland-micheal-martin-taoiseach-prime-minister-intl",
    "snippet": "<strong>Micheál Martin</strong> became Ireland’s taoiseach (prime minister) for the second time in his political career on Thursday, a day later than planned.",
    "published": "January 23, 2025"
  },
  {
    "title": "Taoiseach | Meaning, Pronunciation, & List of Heads of Government of Ireland | Britannica",
    "url": "https://www.britannica.com/topic/taoiseach",
    "snippet": "The taoiseach is the head of government of Ireland. The taoiseach must be a member of the Dail Eireann (House of Representatives), the lower house of the Oireachtas (Parliament).",
    "published": "April 5, 2024"
  },
  {
    "title": "Government of Ireland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_Ireland",
    "snippet": "The Government of Ireland (Irish: Rialtas na hÉireann) is the executive authority of Ireland, headed by the Taoiseach, the head of government. The government – also known as the cabinet – is composed of ministers, each of whom must be a member of the Oireachtas, which consists of Dáil Éireann and Seanad Éireann.",
    "published": "1 month ago"
  }
]