[
  {
    "title": "New America (organization) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_America_(organization)",
    "snippet": "New America was founded in 1999 by <strong>Ted Halstead, Sherle Schwenninger, Michael Lind, and Walter Russell Mead</strong> as the New America Foundation.",
    "published": "2 weeks ago"
  },
  {
    "title": "New America (New America Foundation) - InfluenceWatch - InfluenceWatch",
    "url": "https://www.influencewatch.org/non-profit/new-america-foundation/",
    "snippet": "<strong>Ted Halstead</strong> founded New America and was president and CEO from 1999-2007. Halstead convinced liberal commentator Bill Moyers, the former press secretary for President Lyndon Johnson, to back the project.",
    "published": "May 2, 2023"
  },
  {
    "title": "New America - Idealist",
    "url": "https://www.idealist.org/en/nonprofit/7fac3721eea14653b557589e2f59f162-new-america-washington",
    "snippet": "The initial challenge, which continues ... but often threatening change. Under the leadership of founding president <strong>Ted Halstead and his successor Steve Coll</strong>, New America became a vibrant intellectual community and public policy ...",
    "published": null
  },
  {
    "title": "New America Foundation - MacArthur Foundation",
    "url": "https://www.macfound.org/grantee/new-america-foundation-23754/",
    "snippet": "Founded in 1999, New America Foundation (New America) has dedicated itself to renewing, reimagining, and realizing the promise of America in an era of rapid technological and social change. New America envisions a fully representative, responsive, creative and inclusive democracy that fosters thriving human potential, economic security, innovation, and sustainability around the globe.",
    "published": null
  },
  {
    "title": "New America (organization)",
    "url": "https://grokipedia.com/page/New_America_(organization)",
    "snippet": "New America was established in 1999 by <strong>Ted Halstead</strong> as a nonprofit think tank dedicated to fostering innovative policy ideas and amplifying emerging voices in American public discourse, with a focus on addressing challenges in technology, economics, ...",
    "published": null
  }
]