[
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "Juventus Football Club announces that it has today relieved <strong>Igor Tudor</strong> of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": null
  },
  {
    "title": "Welcome, Coach Thiago Motta! - Juventus",
    "url": "https://www.juventus.com/en/news/articles/welcome-coach-thiago-motta",
    "snippet": "Welcome, Coach <strong>Thiago Motta</strong>! Juventus Football Club is delighted to announce <strong>Thiago Motta</strong> as the new First Team head coach.",
    "published": null
  },
  {
    "title": "Juventus FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_FC",
    "snippet": "On 8 August 2020, Sarri was sacked from his managerial position, one day after Juventus were eliminated from the 2019–20 UEFA Champions League by Lyon. On the same day, former player <strong>Andrea Pirlo</strong> was announced as the new coach, signing a two-year contract.",
    "published": "3 days ago"
  },
  {
    "title": "Thiago Motta no longer First Team coach, Igor Tudor takes over - Juventus",
    "url": "https://www.juventus.com/en/news/articles/thiago-motta-no-longer-first-team-coach-igor-tudor-takes-over-as-first-team-coach",
    "snippet": "The club wish them the best of luck for the future. Juventus FC also announce that the Men’s First Team will now be led by <strong>Igor Tudor</strong>, who will take charge of his first training session tomorrow, Monday, 24 March.",
    "published": null
  },
  {
    "title": "Welcome, Coach Luciano Spalletti - Juventus",
    "url": "https://www.juventus.com/en/news/articles/welcome-coach-luciano-spalletti",
    "snippet": "<strong>Luciano Spalletti</strong> is the new head coach of Juventus, signing an agreement with the Club until June 30, 2026. Born in Certaldo, in the province of...",
    "published": null
  }
]