[
  {
    "title": "Eqtgroup",
    "url": "https://eqtgroup.com/about/history",
    "snippet": "Over the course of Sweden’s modern ... Inspired by the Wallenberg family’s philosophy of responsible ownership, <strong>Conni Jonsson received a mandate from the board of Investor AB to establish EQT in 1994</strong> with the backing from Investor AB, AEA Investors and SEB....",
    "published": null
  },
  {
    "title": "EQT AB - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_AB",
    "snippet": "As of 2025, EQT&#x27;s assets under ... to the 2024 edition of Private Equity International&#x27;s PEI 300 ranking. The company was <strong>founded in 1994 by SEB, AEA Investors, and Investor AB</strong>....",
    "published": "3 weeks ago"
  },
  {
    "title": "EQT: From Nordic Roots to Global Dominance",
    "url": "https://quartr.com/insights/company-research/eqt-from-nordic-roots-to-global-dominance",
    "snippet": "EQT’s rise from a dinner discussion in Stockholm’s Gamla Stan in 1993 to a global investment leader by 2024 exemplifies its dedication to responsible ownership and value creation. <strong>Founded in 1994</strong> with support from Investor AB and the Wallenberg ...",
    "published": "September 11, 2025"
  },
  {
    "title": "What is Brief History of EQT AB Company? – MatrixBCG.com",
    "url": "https://matrixbcg.com/blogs/brief-history/eqtgroup",
    "snippet": "EQT AB was formally founded on <strong>November 22, 1994</strong>, emerging from discussions between Conni Jonsson and Claes Dahlbäck. Inspired by the Wallenberg family&#x27;s philosophy, Jonsson established EQT with backing from Investor AB, SEB, and AEA Investors.",
    "published": "August 19, 2025"
  },
  {
    "title": "What is Brief History of EQT AB Company? – PortersFiveForce.com",
    "url": "https://portersfiveforce.com/blogs/brief-history/eqtgroup",
    "snippet": "The EQT AB history began on <strong>September 9, 1994</strong>, in Stockholm, Sweden, founded by Conni Jonsson and a consortium led by the Wallenberg family&#x27;s Investor AB.",
    "published": "2 weeks ago"
  }
]