[
  {
    "title": "Prime Ministers of Canada",
    "url": "https://lop.parl.ca/sites/ParlInfo/default/en_CA/People/primeMinisters",
    "snippet": "This page provides general details on Canada&#x27;s prime ministers since 1867. For more information on an individual prime minister, including their electoral history and parliamentary roles, click on their name to view their complete profile",
    "published": null
  },
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "He was a triple citizen of Canada, Ireland and the United Kingdom, having obtained Irish citizenship in the late 1980s, and British citizenship in 2018 – the latter while governor of the Bank of England, fulfilling a commitment he made when accepting the role. Shortly before becoming Canadian Prime Minister in March 2025, he said that he had started the process of formally renouncing his British and Irish citizenship to signify his commitment to Canada.",
    "published": "1 day ago"
  },
  {
    "title": "List of prime ministers of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Canada",
    "snippet": "The 24th and current prime minister is <strong>Mark Carney</strong>, who assumed office on 14 March 2025. There are currently six living former prime ministers.",
    "published": "2 weeks ago"
  },
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "On January 6, 2025, citing that Canada &quot;[deserved] a real choice in the next election&quot;, and that he was facing &quot;internal battles&quot; he felt would be a distraction, Trudeau announced during a news conference at Rideau Cottage that he would tender his resignation as leader of the Liberal Party, and as prime minister of Canada after the party elects his successor. He also announced that Governor General Mary Simon would prorogue Parliament until March 24, while the party organizes and holds its next leadership election.",
    "published": "5 days ago"
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "The Right Honourable <strong>Mark Carney</strong>, Prime Minister of Canada<strong>Mark Carney</strong> is Canada’s 24th Prime Minister. He was elected Leader of the Liberal Party of Canada and sworn in as Prime Minister in March 2025.",
    "published": null
  }
]