[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an <strong>emeritus fellow of New College, Oxford</strong>. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and ...",
    "published": "1 week ago"
  },
  {
    "title": "Contact Richard Dawkins, Email: ****@myflorida.gov & Phone Number | Senior Clerk at State of Florida - ZoomInfo",
    "url": "https://www.zoominfo.com/p/Richard-Dawkins/8273949340",
    "snippet": "Richard Dawkins works in the industry of <strong>Government, State</strong>.",
    "published": null
  },
  {
    "title": "Contact Richard Dawkins, Email: ****@companyx.com & Phone Number | Worker at Company-X - ZoomInfo",
    "url": "https://www.zoominfo.com/p/Richard-Dawkins/8825059920",
    "snippet": "Richard Dawkins is a <strong>Worker at Company-X</strong> based in San Francisco, California....",
    "published": null
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and doctorate degrees in zoology in 1966 at the University of Oxford under famed ethologist Nikolaas Tinbergen (who was best known for his work with both instinctive and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley.",
    "published": "July 15, 2009"
  },
  {
    "title": "Professor Richard Dawkins FRS",
    "url": "https://royalsociety.org/people/richard-dawkins-11316/",
    "snippet": "Richard Dawkins is an evolutionary biologist and expert in animal behaviour. Richard is well known for his ability to communicate concepts from his research and beyond to a non-specialist audience. Thus he has been a key figure in raising public understanding of science.",
    "published": null
  }
]