[
  {
    "title": "New President to be - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/juliette-binoche-to-be-the-new-president-european-film-academy/",
    "snippet": "The film has also helped shape her career as an actress, and actress who continued to give a soul to many more projects she has starred in. <strong>I can warmly recommend Juliette Binoche as the new President</strong> and endorse her to all Academy members, ...",
    "published": "March 14, 2024"
  },
  {
    "title": "Juliette Binoche: New Academy President - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/juliette-binoche-starting-as-new-president-of-european-film-academy-as-of-1-may-2024/",
    "snippet": "‘It’s an enormous pleasure to announce the endorsement of the membership of the board’s proposal to confirm Juliette Binoche as President of the European Film Academy,’ says producer and Chair of European Film Academy, <strong>Mike Downey</strong>, ‘she ...",
    "published": "June 27, 2024"
  },
  {
    "title": "Nominees Welcome Guide 2026 - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/activities/nominees-welcome-guide-2026/",
    "snippet": "The European Film Academy was finally founded in 1989 as the European Cinema Society by its first president Ingmar Bergman and 40 filmmakers to advance the interests of the European film industry. Wim Wenders (1996-2020) Agnieszka Holland (2020-2024) and <strong>Juliette Binoche (2024- )</strong> followed in ...",
    "published": "October 29, 2024"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "<strong>Since 2024, Actress Juliette Binoche is the President of the European Film Academy</strong>. The Presidency is an honorary position and as such independent from the board. In 2026, the complete board of the European Film Academy will consist of Chair ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Juliette Binoche named 2025 Cannes Film Festival President of the Jury | Euronews",
    "url": "https://www.euronews.com/culture/2025/02/04/juliette-binoche-named-2025-cannes-film-festival-president-of-the-jury",
    "snippet": "“You really have to pick up the film you think is going to be something - the film that&#x27;s going to change something in you.” · You can read the full interview here. The 78th edition of the Cannes Film Festival runs <strong>13-24 May 2025</strong>.",
    "published": "February 4, 2025"
  }
]