[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "While FiveThirtyEight expressed ... In April 2018, it was announced that FiveThirtyEight would be transferred to ABC News from <strong>ESPN, Inc., majority owned by The Walt Disney Company</strong>....",
    "published": "1 month ago"
  },
  {
    "title": "Welcome to the new 538 website - ABC News",
    "url": "https://abcnews.go.com/538/introducing-538-abc-news/story?id=103218541",
    "snippet": "18, 538 content will be published at a new vertical on the ABC News website, www.abcnews.com/538, where we will be focusing on coverage of elections, politics and American society. This means we will no longer be posting articles on our old website, www.fivethirtyeight.com.",
    "published": "September 18, 2023"
  },
  {
    "title": "Publishers Daily: ABC News Buys 'FiveThirtyEight'",
    "url": "https://www.mediapost.com/publications/article/317771/abc-news-buys-fivethirtyeight.html",
    "snippet": "The new ownership means FiveThirtyEight will expand its political coverage under ABC News. ABC News and ESPN Inc. are both divisions of <strong>The Walt Disney Company</strong>.",
    "published": null
  },
  {
    "title": "ABC News Takes Over Nate Silver’s FiveThirtyEight",
    "url": "https://variety.com/2018/tv/news/abc-news-ffivethirtyeight-espn-nate-silver-1202755646/",
    "snippet": "But the news outlet will go back to square one at ABC News. In an unusual transfer of corporate assets, <strong>Walt Disney</strong>’s ABC News said it would acquire Silver’s much-scrutinized operation from sibling ESPN.",
    "published": "April 17, 2018"
  },
  {
    "title": "Why did ABC News acquire FiveThirtyEight? - Quora",
    "url": "https://www.quora.com/Why-did-ABC-News-acquire-FiveThirtyEight",
    "snippet": "Answer (1 of 2): Short answer: Because ESPN needed to sell FiveThirtyEight, and no one outside the Disney umbrella was willing to pay a high enough price. ESPN had been looking at divesting itself of Nate Silver’s brand for at least a few months now. TheBigLead (a sister publication to USA Toda...",
    "published": null
  }
]