[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. <strong>In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008</strong>, and is ...",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and doctorate degrees in zoology in 1966 at the University of Oxford under famed ethologist Nikolaas Tinbergen (who was best known for his work with both instinctive and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins Biography - Facts, Childhood, Family Life & Achievements",
    "url": "https://www.thefamouspeople.com/profiles/clinton-richard-dawkins-2646.php",
    "snippet": "<strong>In 1990 he assumed the post of a reader in zoology at the University of Oxford</strong>. He was appointed Simonyi Professor for the Public Understanding of Science at Oxford in 1995—a position that had been endowed by Charles Simonyi with the specific ...",
    "published": null
  },
  {
    "title": "Richard Dawkins - Kids | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/kids/article/Richard-Dawkins/476248",
    "snippet": "After this, Dawkins wrote many more books that explored the ways in which evolution may happen. He was especially known for trying to explain science in simple terms that many people could understand. In 1995 he was made the Charles Simonyi professor of public understanding of science at Oxford University. Richard Dawkins was outspoken about his atheism, which means he did not believe in God.",
    "published": null
  },
  {
    "title": "Richard Dawkins: A Biography | Discovery Institute",
    "url": "https://www.discovery.org/a/10291/",
    "snippet": "Clinton Richard Dawkins (born March 26, 1941, in Nairobi, Kenya) is a bestselling atheist popularizer of Darwinian evolutionary theory and its counter-religious implications. His scientific field is…",
    "published": "October 15, 2024"
  }
]