[
  {
    "title": "Succession to the Saudi Arabian throne - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Succession_to_the_Saudi_Arabian_throne",
    "snippet": "The current ruler of Saudi Arabia is <strong>King Salman</strong>, who succeeded King Abdullah on his death on 23 January 2015.",
    "published": "September 24, 2025"
  },
  {
    "title": "Saudi Royal Transition: Why, What, and When? | The Washington Institute",
    "url": "https://www.washingtoninstitute.org/policy-analysis/saudi-royal-transition-why-what-and-when",
    "snippet": "Since Ibn Saud captured the holy cities of Mecca and Medina in 1925, successive rulers have taken responsibility for the Islamic shrines. King Fahd formalized this role in 1986, changing his title from &quot;majesty&quot; to &quot;Custodian of the Two Holy Places.&quot; Retaining the religious title but relinquishing political leadership would be consistent with the sense that the former is more important -- a key ingredient in Saudi Arabia&#x27;s claim to leadership of the wider Arab and Muslim worlds.",
    "published": null
  },
  {
    "title": "House of Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/House_of_Saud",
    "snippet": "Succession has been from brother to brother since the death of the founder of modern Saudi Arabia. <strong>Abdulaziz was succeeded by his son Saud who was succeeded by his half-brother Faisal</strong>. Faisal was succeeded by his brother Khalid who, in turn, was succeeded by his half-brother Fahd.",
    "published": "1 month ago"
  },
  {
    "title": "Politics of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Saudi_Arabia",
    "snippet": "In 2007, the Allegiance Council was created to regulate the succession. In 2009, the king made significant personnel changes to the government by appointing reformers to key positions and the first woman to a ministerial post. However, the changes have been criticized as being too slow or merely cosmetic, and the royal family is reportedly divided on the speed and direction of reform. In 2011, Abdullah announced that women will be able to be nominated to the Shura Council. Politics in Saudi Arabia, outside the royal family, can be examined in three contexts: the extent to which the royal family allows political participation by the wider Saudi society, opposition to the regime, and Islamist terrorism.",
    "published": "November 2, 2025"
  },
  {
    "title": "SUDDEN SUCCESSION Examining the Impact of Abrupt Change in the Middle East",
    "url": "https://www.washingtoninstitute.org/media/4172",
    "snippet": "Table 1. Saudi main line of succession · W W W . W A S H I N G T O N I N S T I T U T E . O R G \b ... King Khalid had been Faisal’s crown prince. Kha­ ... Fahd eventually died in 2005, at age eighty-four. ... King Abdullah died in 2015 at age ninety-two. ... Table 2. Effective years of leadership ...",
    "published": null
  }
]