[
  {
    "title": "Yabloko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yabloko",
    "snippet": "The immediate predecessor of the Yabloko party was the electoral bloc Yavlinsky-Boldyrev-Lukin, formed for the legislative elections of 1993. &quot;Yabloko&quot; is an acronym of the names of its founders: &quot;Я&quot; (Ya) for <strong>Grigory Yavlinsky</strong>; &quot;Б&quot; (B) for Yury Boldyrev, and &quot;Л&quot; (L) for Vladimir Lukin, with ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Yabloko | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/yabloko",
    "snippet": "Yabloko was one of the leading liberal opposition parties in the newly democratic Russia of the 1990s. Yabloko&#x27;s founder and leader was <strong>Grigory Yavlinsky</strong>, a liberal economist who had stayed aloof from the new democratic political movements being formed between 1989 and 1991.",
    "published": null
  },
  {
    "title": "Russian Democratic Party YABLOKO » The Russian United Democratic Party YABLOKO",
    "url": "https://eng.yabloko.ru/the-russian-united-democratic-party-yabloko/",
    "snippet": "YABLOKO founder <strong>Grigory Yavlinsky</strong> came fourth and third in presidential elections of 1996 and 2000, respectively, was not allowed to run in the presidential elections of 2012, and came fifth in 2018, when Vladimir Putin became President for ...",
    "published": null
  },
  {
    "title": "Russian Democratic Party YABLOKO",
    "url": "https://eng.yabloko.ru/",
    "snippet": "Lies and legitimacy The founder of the Yabloko Party analyses the political situation. Article by Grigory Yavlinsky on radio Svoboda.",
    "published": null
  },
  {
    "title": "What is the Russian political party Yabloko? What is its platform? Why are its representatives allowed to sit in the Moscow and Saint Petersburg city councils? - Quora",
    "url": "https://www.quora.com/What-is-the-Russian-political-party-Yabloko-What-is-its-platform-Why-are-its-representatives-allowed-to-sit-in-the-Moscow-and-Saint-Petersburg-city-councils",
    "snippet": "Answer (1 of 2): Yabloko is a Russian political party founded in 1993 by <strong>Grigory Yavlinsky, Yuri Boldyrev and Vladimir Lukin</strong>. The “YaBL” part of the party name is based on the surnames of the founders, while “yabloko” means “apple” ...",
    "published": null
  }
]