[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Justin Pierre James Trudeau (born December 25, 1971) is a Canadian politician who served as the 23rd prime minister of Canada from 2015 to <strong>2025</strong>. He led the Liberal Party from 2013 until his resignation in <strong>2025</strong> and was the member of Parliament (MP) for Papineau from 2008 until <strong>2025</strong>.",
    "published": "4 days ago"
  },
  {
    "title": "Justin Trudeau, Resigned. What Next for US – Canadian Relations? | Wilson Center",
    "url": "https://www.wilsoncenter.org/article/justin-trudeau-resigned-what-next-us-canadian-relations",
    "snippet": "On <strong>January 6, 2025</strong>, Canadian Prime Minister Justin Trudeau announced his intention to resign as Liberal Party leader as soon as the party is able to choose a new leader.",
    "published": null
  },
  {
    "title": "Canada Institute Experts React to Prime Minister Justin Trudeau's Resignation | Wilson Center",
    "url": "https://www.wilsoncenter.org/article/canada-institute-experts-react-prime-minister-justin-trudeaus-resignation",
    "snippet": "On <strong>January 16th, 2025</strong>, Canadian Prime Minister Justin Trudeau announced his resignation as head of the Liberal Party. Canada Institute Global Fellows offer their perspectives below on what this pivotal moment means for Canadian policy and politics.",
    "published": "January 7, 2025"
  },
  {
    "title": "Trudeau Resigns as Trade War Looms | CSIS",
    "url": "https://www.csis.org/analysis/trudeau-steps-down-now-what",
    "snippet": "A1: <strong>Trudeau did not immediately resign</strong>. He said he would step down once the Liberal Party held a vigorous and competitive leadership race and that he had asked the party president to initiate the process.",
    "published": "January 9, 2025"
  },
  {
    "title": "Canadian Prime Minister Justin Trudeau and his wife announce their separation : NPR",
    "url": "https://www.npr.org/2023/08/03/1191789443/canadian-prime-minister-justin-trudeau-and-his-wife-announce-their-separation",
    "snippet": "Canada&#x27;s Prime Minister Justin Trudeau and his wife, Sophie Gregoire Trudeau, arrive at Rideau Hall in Ottawa, Ontario, Sept. 11, 2019. The Canadian prime minister and his wife announced Wednesday, <strong>Aug. 2, 2023</strong>, that they are separating after ...",
    "published": "August 3, 2023"
  }
]