[
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "<strong>In 2002, Van Susteren switched to the Fox News Channel after a highly publicized contract-bidding war</strong>. Before starting at Fox she also underwent cosmetic surgery that significantly changed her look. She hosted the current affairs show On the Record w/ Greta Van Susteren.",
    "published": "August 20, 2025"
  },
  {
    "title": "Greta Van Susteren: MSNBC Only Network That Ever Tried to Control My Show | Barrett Media",
    "url": "https://barrettmedia.com/2025/03/21/greta-van-susteren-msnbc-only-network-that-ever-tried-to-control-my-show/",
    "snippet": "“I almost thought they were joking because I had like a 15 or 18-year career in the news business and nobody ever told me and so it never occurred to me.” ... Greta Van Susteren had <strong>previously worked at both CNN and Fox News before joining MSNBC</strong>.",
    "published": "March 24, 2025"
  },
  {
    "title": "Greta Van Susteren Net Worth 2025 - The Surprising Figure - Mac Issues",
    "url": "https://macissues.com/greta-van-susteren/",
    "snippet": "<strong>During her 14-year tenure at the network, Van Susteren reportedly commanded an annual salary that peaked at around $7 million</strong> for hosting “On the Record with Greta Van Susteren.” This long-running show became a cornerstone of Fox’s evening lineup, significantly bolstering her wealth.",
    "published": "March 11, 2025"
  },
  {
    "title": "Greta Van Susteren - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1336063/bio/",
    "snippet": "Greta Van Susteren. Actress: Notorious. Born in Appleton, Wisconsin, Greta Van Susteren was awarded a Bachelor&#x27;s degree with Distinction in Economics from the University of Wisconsin in 1976. In 1979, she was awarded a law degree and, in 1982, a master of laws in trial advocacy from Georgetown Law Center, serving as a civil and criminal attorney in Wisconsin for several years.",
    "published": null
  },
  {
    "title": "Greta Van Susteren – USC Center on Communication Leadership and Policy",
    "url": "https://communicationleadership.usc.edu/greta-van-susteren-3/",
    "snippet": "Prior to Fox, Greta worked at CNN for 7 years where she started out as a legal analyst then became co-host of CNN’s daily legal program Burden of Proof. She went on to host the channel’s prime time news and analysis show The Point with Greta Van Susteren.",
    "published": null
  }
]