[
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "Founded in 2006 by Richard Dawkins, the foundation’s mission is to realize Richard’s vision to remove the influence of religion in science education and public policy, and eliminate the stigma that surrounds atheism and non-belief.",
    "published": "July 17, 2025"
  },
  {
    "title": "Homepage | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/home/",
    "snippet": "The Richard Dawkins Foundation for Reason &amp; Science’s mission is to <strong>promote scientific literacy and a secular worldview</strong>. For some, the connection is not obvious; they may seem like different objectives at first glance, but if you’ve ever doubted just how inextricably linked they are, all you …",
    "published": "November 8, 2023"
  },
  {
    "title": "Richard Dawkins Foundation for Reason and Science - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins_Foundation_for_Reason_and_Science",
    "snippet": "Faircloth is author of the book Attack of the Theocrats, How the Religious Right Harms Us All and What We Can Do About It. The Richard Dawkins Foundation (United States branch) later hired Faircloth, who has ten years experience as a state legislator, as <strong>Director of Strategy and Policy</strong>.",
    "published": "September 22, 2025"
  },
  {
    "title": "Richard Dawkins Foundation for Reason and Science | UIA Yearbook Profile | Union of International Associations",
    "url": "https://uia.org/s/or/en/1100068524",
    "snippet": "2025 Round Table · Future Round Tables · Past Round Tables · Sponsorship Opportunities · Online Masterclasses · 115 Years of UIA · Active Membership · – Current Active Members · Associate Membership · – Associate Membership Categories and Benefits ·",
    "published": null
  },
  {
    "title": "What We Do | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/aboutus/",
    "snippet": "The Teacher Institute for Evolutionary Science (TIES) will give middle school teachers the tools they need to effectively teach evolution and answer its critics. Led by Director of TIES Bertha Vazquez, the Foundation has developed a variety of free resources to middle school teachers as well as full-day workshops based on the new Next Generation Science Standards.",
    "published": "February 4, 2021"
  }
]