[
  {
    "title": "From Zlatko Čajkovski to Vincent Kompany: A history of Bayern Munich coaches | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/a-history-of-bayern-munich-s-coaches-nagelsmann-flick-guardiola-heynckes-15694",
    "snippet": "He subsequently became Germany coach, taking over at the international helm from another former Bayern man, Hansi Flick. <strong>Julian Nagelsmann</strong> oversaw 84 games at the Bayern Munich helm.",
    "published": "November 4, 2025"
  },
  {
    "title": "Vincent Kompany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Vincent_Kompany",
    "snippet": "Vincent Jean Mpoy Kompany (born 10 April 1986) is a Belgian professional football manager and former player who played as a centre-back. He is the head coach of Bundesliga club Bayern Munich. As a player, he is best known for his eleven seasons at Manchester City, eight of which he served as captain.",
    "published": "2 days ago"
  },
  {
    "title": "The origins of Bayern Munich manager Vincent Kompany - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cwye2169wxvo",
    "snippet": "... German football journalist Seb Stafford-Bloor says it is over-simplistic to claim he has, &quot;failed upwards&quot; by taking the job in Munich. He compares Kompany&#x27;s appointment to <strong>Jurgen Klopp</strong> being hired by Borussia Dortmund in 2008, having led ...",
    "published": "February 12, 2025"
  },
  {
    "title": "Bayern Munich - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/bayern-munich/mitarbeiterhistorie/verein/27",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  },
  {
    "title": "Bayern Munich » Coaching Staff List",
    "url": "https://www.worldfootball.net/teams/bayern-muenchen/9/",
    "snippet": "Football - results, news, statistics and much more...",
    "published": null
  }
]