[
  {
    "title": "Italian Communist Party - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Italian_Communist_Party",
    "snippet": "The collapse of the Communist governments in the Eastern Europe led Occhetto to conclude that the era of Eurocommunism was over. Under his leadership, <strong>the PCI dissolved and refounded itself as the Democratic Party of the Left</strong>, which branded itself as a progressive left-wing and democratic socialist ...",
    "published": "1 week ago"
  },
  {
    "title": "Democratic Party of the Left - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_of_the_Left",
    "snippet": "In <strong>February 1998</strong>, the party merged with minor parties to form Democrats of the Left. At its peak in 1991, the party had a membership of 989,708; by 1998, it was reduced to 613,412. The PDS evolved from the Italian Communist Party (PCI), the largest Communist party in the Western Bloc for most ...",
    "published": "May 4, 2025"
  },
  {
    "title": "Full article: The Italian Communist Party in the 1980s and the denouement of the Italian party system",
    "url": "https://www.tandfonline.com/doi/full/10.1080/1354571X.2022.2097690",
    "snippet": "The long ‘constituent phase’ which followed the Central Committee’s approval of Occhetto’s proposal saw the party arrive at its 19th Congress (in <strong>March 1989)</strong> with two other motions opposing that presented by Occhetto (Bassolino’s ‘modern ...",
    "published": null
  },
  {
    "title": "Democrats of the Left | Political Party, Italy, Ideology, History | Britannica",
    "url": "https://www.britannica.com/topic/Democrats-of-the-Left",
    "snippet": "After World War II, the PCI joined five other antifascist parties in coalition governments until <strong>May 1947</strong>, when premier Alcide De Gasperi of the Christian Democratic Party (Partito della Democrazia Cristiana) excluded both the PCI and the Italian ...",
    "published": "July 20, 1998"
  },
  {
    "title": "From Gramsci to Renzi, from the Italian Communist Party to the Democratic Party: Exploring the Subjective and Objective Dimensions of Transformation Processes | SpringerLink",
    "url": "https://link.springer.com/chapter/10.1007/978-3-031-96332-2_6",
    "snippet": "It draws on key insights from interviews with central figures in Italy’s political left and the trade union historically closest to its trajectory, the CGIL. The chapter provides a concise overview of the evolution of the Italian left, from the Italian Communist Party (PCI) to the Democratic Party (PD), with a particular emphasis on the latter.",
    "published": null
  }
]