[
  {
    "title": "PUBLIC EUROPEAN BANK FOR RECONSTRUCTION AND DEVELOPMENT",
    "url": "https://www.ebrd.com/content/dam/ebrd_dxp/assets/pdfs/office-of-the-general-counsel/annual-meetings/annual-meeting-2025/am2025-proceedings-english.pdf",
    "snippet": "284 EBRD Codes of Conduct ... Resolution No. 285 Financial Statements and Independent Auditors’ Report ... Resolution No. 286 Special Funds’ Financial Statements 2024 ... Resolution No. 287 Amendments to the Rules for the Regular Election of Directors ... The Governor for Slovenia, Mr Klemen Boštjančič, was the Chair of the Board of Governors.",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Bank_for_Reconstruction_and_Development",
    "snippet": "Currently (2024-2025) Slovenia is the Chair of Board of Governors, while Iceland and Turkey are the Vice Chairs. The Board of Directors consists of 23 members elected by the Board of Governors. These members can not be on the Board of Governors. Its function is to direct the general operations of the bank, notably: ... In accordance with the Board of Governors, establishing policies and making other decisions, loans, investments; ... Submit yearly for approval the audited accounts to the Board of Governors. The EBRD is composed of many members with voting powers, from European and non-European states to the membership of other institutions such as the European Investment Bank, however depending on the geographical location of each member, voting rights differ.",
    "published": "1 week ago"
  },
  {
    "title": "EBRD Board of Directors",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership/ebrd-board-of-directors.html",
    "snippet": "Learn about the EBRD&#x27;s journey to investing more than €210 billion in over 7,500 projects. ... Through projects, business services and involvement in high-level policy reform, we&#x27;re doing more than ever before.",
    "published": null
  },
  {
    "title": "Directors of the EBRD",
    "url": "https://www.ebrd.com/directors-of-the-ebrd.html",
    "snippet": "Prior to working at the EBRD, <strong>Mr Patrone</strong> was Managing Director of the private equity arm of Finanziaria Internazionale, an Italian merchant bank, where he spent 10 years investing in a broad range of sectors.",
    "published": null
  },
  {
    "title": "Who we are",
    "url": "https://www.ebrd.com/home/who-we-are.html",
    "snippet": "Each shareholder is represented on the Board of Governors, which has overall authority over the Bank. Our President is <strong>Odile Renaud-Basso</strong> (left). The President manages our work under the guidance of the Board of Directors.",
    "published": null
  }
]