[
  {
    "title": "From Zlatko Čajkovski to Vincent Kompany: A history of Bayern Munich coaches | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/a-history-of-bayern-munich-s-coaches-nagelsmann-flick-guardiola-heynckes-15694",
    "snippet": "A pair of DFB Cups completed domestic doubles, but the big prize of the Champions League eluded the Bavarians with three semi-final exits to Atletico Madrid, Barcelona and Real. Nevertheless, he left Munich with the best record of any coach in Bundesliga history at 2.52 points per game and the best win rate for FCB (77.01 per cent) until Flick.",
    "published": "November 4, 2025"
  },
  {
    "title": "Vincent Kompany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Vincent_Kompany",
    "snippet": "With two defeats, two goalless ... decided to step down from managerial duties on the pitch, to focus primarily on being a player. Head coach <strong>Simon Davies</strong> would be placed in charge of tactical changes and substitutions, while Kompany would be given the captain&#x27;s arm ...",
    "published": "2 days ago"
  },
  {
    "title": "Vincent Kompany: 10 things on the Bayern Munich head coach | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/10-things-vincent-kompany-bayern-munich-coach-guardiola-man-city-27605",
    "snippet": "&quot;He&#x27;s fresh, has seen it all and speaks the players&#x27; languages, which I think is essential, especially at FC Bayern,&quot; former Bayern midfielder <strong>Stefan Effenberg</strong> told T-Online. Kompany (l.) was just 20 when he joined Hamburg from Anderlecht.",
    "published": "April 2, 2025"
  },
  {
    "title": "The origins of Bayern Munich manager Vincent Kompany - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cwye2169wxvo",
    "snippet": "After working as head coach at his boyhood club <strong>Anderlecht</strong>, Kompany earned plaudits for bringing Burnley back to the Premier League in 2022-23 by playing an impressive brand of attacking, possession-based football.",
    "published": "February 12, 2025"
  },
  {
    "title": "Vincent Kompany succeeds Thomas Tuchel as Bayern Munich head coach | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/vincent-kompany-new-bayern-munich-coach-succeeds-tuchel-27534",
    "snippet": "Bayern Munich have named Vincent Kompany as their replacement for <strong>Thomas Tuchel</strong> in the head coaching role.",
    "published": "May 31, 2024"
  }
]