[
  {
    "title": "From Zlatko Čajkovski to Vincent Kompany: A history of Bayern Munich coaches | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/a-history-of-bayern-munich-s-coaches-nagelsmann-flick-guardiola-heynckes-15694",
    "snippet": "A pair of DFB Cups completed domestic doubles, but the big prize of the Champions League eluded the Bavarians with three semi-final exits to Atletico Madrid, Barcelona and Real. Nevertheless, he left Munich with the best record of any coach in Bundesliga history at 2.52 points per game and the best win rate for FCB (77.01 per cent) until Flick.",
    "published": "November 4, 2025"
  },
  {
    "title": "Bayern Munich - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/fc-bayern-munchen/mitarbeiterhistorie/verein/27",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  },
  {
    "title": "Bayern Munich’s Uli Hoeneß heaps praise on Vincent Kompany for fun football, non-controversial communication",
    "url": "https://www.bavarianfootballworks.com/bayern-munich-coaches/149606/bayern-munich-uli-hoenes-heaps-praise-on-vincent-kompany-for-fun-football-non-controversial-communication-thomas-tuchel-julian-nagelsmann",
    "snippet": "That’s not the case with him, ... who Hoeneß famously did not get along with well, but the head coach before that, <strong>Julian Nagelsmann</strong>, had his controversial moments as well....",
    "published": "4 weeks ago"
  },
  {
    "title": "The origins of Bayern Munich manager Vincent Kompany - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cwye2169wxvo",
    "snippet": "... German football journalist Seb Stafford-Bloor says it is over-simplistic to claim he has, &quot;failed upwards&quot; by taking the job in Munich. He compares Kompany&#x27;s appointment to <strong>Jurgen Klopp</strong> being hired by Borussia Dortmund in 2008, having led ...",
    "published": "February 12, 2025"
  },
  {
    "title": "Bayern Munich » Coaching Staff List",
    "url": "https://www.worldfootball.net/teams/bayern-muenchen/9/",
    "snippet": "Football - results, news, statistics and much more...",
    "published": null
  }
]