[
  {
    "title": "The Rise of France Insoumise",
    "url": "https://jacobin.com/2025/11/france-insoumise-hegemonic-left-democracy",
    "snippet": "We predict a showdown with fascism: “In the end, it will be us versus them,” as Jean-Luc Mélenchon has said for more than a decade. This battle demands the strengthening of tools that we have patiently built: France Insoumise media, communications both internal and public-facing on social media, our security service, and organizational discipline.",
    "published": null
  },
  {
    "title": "France in Crisis: an Interview with Jean Luc Melenchon and La France Insoumise - CounterPunch.org",
    "url": "https://www.counterpunch.org/2025/10/29/france-in-crisis-an-interview-with-jean-luc-melenchon-and-la-france-insoumise/",
    "snippet": "This was followed in September 2025 by an email interview with LFI leader Jean Luc Melenchon (JLM). ... La France Insoumise: <strong>In terms of the strategic situation, we are at the end of Macronism</strong>.",
    "published": "October 29, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon - Actualités, vidéos et infos en direct",
    "url": "https://www.lemonde.fr/jean-luc-melenchon/",
    "snippet": "<strong>Le leader de La France insoumise a estimé, lundi 31 mars, que « la décision de destituer un élu devrait revenir au peuple »,</strong> à rebours des autres partis de gauche, qui ont fustigé ses propos.",
    "published": null
  },
  {
    "title": "« Entrisme religieux » : le passage sans encombre de Jean-Luc Mélenchon devant les parlementaires",
    "url": "https://www.lemonde.fr/politique/article/2025/12/06/entrisme-religieux-le-passage-sans-encombre-de-jean-luc-melenchon-devant-les-parlementaires_6656302_823448.html",
    "snippet": "BERTRAND GUAY / AFP · <strong>Il avait deux possibilités : la colère théâtrale ou la bonhomie savante</strong>. Entre ces deux registres qu’il maîtrise à merveille, Jean-Luc Mélenchon a opté pour le second à la faveur de son audition, samedi 6 décembre, ...",
    "published": "1 week ago"
  },
  {
    "title": "La France insoumise - Accueil - La France insoumise",
    "url": "https://lafranceinsoumise.fr/",
    "snippet": "JE REJOINS J&#x27;habite hors de France À LA UNE Le programme l&#x27;Avenir en commun édition 2025 Retrouvez le programme À LA UNE Signez la pétition pour la",
    "published": "September 16, 2025"
  }
]