[
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "With more than 99% of polling stations counted, Kast took <strong>58.16% of the vote, against 41.84% for the leftist Jeannette Jara</strong>, a former labour minister under the current president, Gabriel Boric.",
    "published": "13 hours ago"
  },
  {
    "title": "Far-right candidate Jose Antonio Kast wins Chile’s presidential election | Elections News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/12/14/far-right-candidate-jose-antonio-kast-wins-chiles-presidential-election",
    "snippet": "The tally also marks a significant comeback for Kast himself, the 59-year-old leader of the Republican Party. <strong>The 2025 election marks his third attempt to win the presidency</strong> — and his first successful bid.",
    "published": "2 days ago"
  },
  {
    "title": "Chile elects Kast as president in sharp rightward shift | Reuters",
    "url": "https://www.reuters.com/world/americas/chile-votes-presidential-race-expected-lurch-country-right-2025-12-14/",
    "snippet": "SANTIAGO, Dec 14 (Reuters) - <strong>Jose Antonio Kast won Chile&#x27;s presidential election</strong> on Sunday, leveraging voter fears over rising crime and migration to steer the country in its sharpest rightward shift since the end of the military dictatorship ...",
    "published": "1 day ago"
  },
  {
    "title": "José Antonio Kast Elected President of Chile - The New York Times",
    "url": "https://www.nytimes.com/2025/12/14/world/americas/chile-election-candidates.html",
    "snippet": "With over 98 percent of the ballots counted, Mr. Kast had <strong>more than 58 percent of the vote</strong>, a resounding victory over Jeannette Jara, the candidate for the center-left and a member of the Communist Party of Chile, who had about 42 percent.",
    "published": "2 days ago"
  },
  {
    "title": "Chile’s Jose Antonio Kast Wins 2025 Presidential Election - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-12-14/chile-s-jose-antonio-kast-wins-2025-presidential-election",
    "snippet": "Ultra-conservative José Antonio Kast won Chile’s presidency by a landslide Sunday, harnessing voter anger over crime and migration to drive the country into its most dramatic rightward shift in decades.",
    "published": "2 days ago"
  }
]