[
  {
    "title": "Borussia Dortmund - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Borussia_Dortmund",
    "snippet": "Borussia Dortmund GmbH &amp; Co. KGaA became the first and, so far, the only publicly traded sports club on the German stock market. 4.61% of Borussia Dortmund GmbH &amp; Co. KGaA is owned by the sports club, <strong>Borussia Dortmund e.V.; 8.24% by Bernd Geske; and 67.24% widely spread shareholdings</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "Who owns Borussia Dortmund (BVB)? Owners' net worth, source of wealth and ownership history",
    "url": "https://www.interestingfootball.com/2025/05/who-owns-borussia-dortmund-bvb-owners.html",
    "snippet": "Borussia Dortmund is currently owned by a publicly traded company with major shareholders including <strong>Bernd Geske, Evonik Industries AG, Signal Iduna, Ralph Dommermuth Beteiligungen GmbH and Puma SE</strong>.",
    "published": null
  },
  {
    "title": "Borussia Dortmund GmbH : Shareholders Board Members Managers and Company Profile | DE0005493092 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/BORUSSIA-DORTMUND-GMBH-435951/company/",
    "snippet": "Borussia Dortmund GmbH &amp; Co KGaA is a Germany-based company engaged in the operation of Ballspielverein Borussia (BVB), a professional football club based in Dortmund, Germany. The Company has around 8 functional areas such as sports, communications, human resources, organization, finance, legal and IR, marketing and digitalization, commercial partnerships.",
    "published": null
  },
  {
    "title": "Borussia Dortmund 2025 Company Profile: Stock Performance & Earnings | PitchBook",
    "url": "https://pitchbook.com/profiles/company/59881-15",
    "snippet": "<strong>Borussia Dortmund GmbH &amp; Co KGaA</strong> operates a football club. The company conducts its business through the following segme ... PitchBook’s comparison feature gives you a side-by-side look at key metrics for similar companies.",
    "published": null
  },
  {
    "title": "Ownership of Borussia Dortmund | Download Scientific Diagram",
    "url": "https://www.researchgate.net/figure/Ownership-of-Borussia-Dortmund_fig5_344375289",
    "snippet": "Feb 2025 · Ricardo Gúdel · View · ... Members&#x27; associations, also known as supporter-owned or community-owned clubs, are primarily found in Germany (e.g., <strong>FC Bayern Munich</strong> and BV Borussia Dortmund) and, to some extent, in Spain (e.g., Real ...",
    "published": null
  }
]