[
  {
    "title": "Yabloko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yabloko",
    "snippet": "In the elections to the State Duma ... of voters voted for Yabloko (750 000 people). <strong>On 14 October 2021, the Federal Political Committee of the party decided to withdraw from the election candidates who supported the idea of Smart Voting Alexei Navalny</strong>....",
    "published": "3 weeks ago"
  },
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "In 2000, following the announcement of a new law that raised the electoral threshold for State Duma elections, <strong>Navalny joined the Russian United Democratic Party Yabloko</strong>. According to Navalny, the law was stacked against Yabloko and Union of Right Forces, and he decided to join, even though ...",
    "published": "1 week ago"
  },
  {
    "title": "Russian Democratic Party YABLOKO",
    "url": "https://eng.yabloko.ru/",
    "snippet": "On Thursday, 27 November, a hearing ... Code). Yabloko MP of the Legislative Assembly of St.Peterburg, Olga Shtannikova, was accused of such an offence. She, back in 2013, reposted on VKontakte a message about an anti-corruption investigation mentioning politician Alexei Navalny...",
    "published": null
  },
  {
    "title": "‘We consider Alexey Navalny’s ideas destructive and dangerous for Russia’ | openDemocracy",
    "url": "https://www.opendemocracy.net/en/odr/yablokov-russia-navalny-rybakov/",
    "snippet": "Nikolay Rybakov, the leader of Russia’s Yabloko opposition party, talks to openDemocracy about imprisoned opposition leader Navalny, smart voting and corruption",
    "published": "July 8, 2021"
  },
  {
    "title": "Explainer: Does Russia’s ‘Systemic Opposition’ Still Exist? - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2025/04/28/explainer-does-russias-systemic-opposition-still-exist-a88868",
    "snippet": "<strong>It once served as a career launching pad for prominent opposition figures including Alexei Navalny, Ilya Yashin and Maxim Katz</strong> — though all were expelled from the party under varying pretexts.",
    "published": "April 28, 2025"
  }
]