[
  {
    "title": "Kevin Volland | MLSsoccer.com",
    "url": "https://www.mlssoccer.com/players/kevin-volland/",
    "snippet": "Kevin Volland is a young right winger scored 11 goals and assisted on 9 others in the Bundesliga this season. He is the captain of the Under-21 German national team. ... Volland made his senior international debut against Poland on May 13th. ... Volland started his career with 1860 Munich in the 2.Bundesliga before moving to Hoffenheim. He has only missed one game with the club over the last two Bundesliga seasons.",
    "published": null
  },
  {
    "title": "Kevin Volland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kevin_Volland",
    "snippet": "On 17 August 2023, Volland signed a contract with <strong>Union Berlin</strong> ahead of their inaugural Champions League campaign. In April 2025, with his contract running until 2026, it was announced that Volland would leave <strong>Union Berlin</strong> in the summer to return to former club 1860 Munich.",
    "published": "2 weeks ago"
  },
  {
    "title": "Kevin Volland to Return to TSV 1860 München | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/kevin-volland-to-return-to-tsv-1860-muenchen--lPiUbM",
    "snippet": "1. <strong>FC Union Berlin</strong> and Kevin Volland have agreed to end their partnership in the summer, with the 32-year-old attacking all-rounder to return to the club of his youth, TSV 1860 München.",
    "published": null
  },
  {
    "title": "Union Berlin bring Kevin Volland back to the Bundesliga | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/union-berlin-sign-former-germany-forward-kevin-volland-monaco-24393",
    "snippet": "... Volland, who played for 1860 Munich, Hoffenheim and <strong>Bayer Leverkusen</strong> before moving to France in 2020, has signed an undisclosed deal. &quot;I was raised in the Bundesliga and have always followed it,&quot; the 31-year-old said.",
    "published": "August 18, 2023"
  },
  {
    "title": "Ex-Germany player Volland to leave Union for boyhood club 1860 Munich - Yahoo Sports",
    "url": "https://sports.yahoo.com/article/ex-germany-player-volland-leave-094329191.html",
    "snippet": "Volland will return to 1860 where he arrived as a teenager and made his first team debut in 2010, before moving on to Hoffenheim two years later, followed by terms at <strong>Bayer Leverkusen</strong> and then Monaco.",
    "published": "April 21, 2025"
  }
]