[
  {
    "title": "Mahathir Mohamad Fast Facts | KRDO",
    "url": "https://krdo.com/news/national-world/cnn-world/2025/12/10/mahathir-mohamad-fast-facts-2/",
    "snippet": "He became the oldest elected world leader at 92 when he was sworn into office as prime minister of Malaysia in 2018, a decade-and-a-half after retirement. Mahathir was also prime minister of Malaysia from July 1981 to October 2003.",
    "published": "1 week ago"
  },
  {
    "title": "Mahathir Mohamad | AP News",
    "url": "https://apnews.com/hub/mahathir-mohamad",
    "snippet": "Former Malaysian Prime Minister Mahathir Mohamad marked a historic milestone as he turned 100.",
    "published": null
  },
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "Your rise to this high office has sprung from your deep convictions and your constancy of political purpose which have led the people of Malaysia to trust your integrity, fairness and firmness. I feel confident that we can work together to strengthen the traditionally close ties between our two countries. I send you my warmest wishes for your success. –This congratulatory letter was sent by Lee Kuan Yew on the day Mahathir was sworn in as Prime Minister · Not long after assuming office, Mahathir visited Singapore in December 1981 as part of a delegation to meet with Prime Minister Lee Kuan Yew.",
    "published": "3 days ago"
  },
  {
    "title": "Mahathir Mohamad’s Legacy: Triumph Over Health Battles and Political Turbulence (2025 Update) – THAI.NEWS – Thailand Breaking News",
    "url": "https://thai.news/news/thailand/mahathir-mohamads-legacy-triumph-over-health-battles-and-political-turbulence-2025-update",
    "snippet": "All this talk about his health but not enough focus on the political mess he left behind after his brief return in 2018. ... No leader is perfect. He took risks returning at a time of need, which benefits outweigh the negatives. ... Jake W. July 14, 2025",
    "published": null
  },
  {
    "title": "Mahathir Mohamad | The Guardian",
    "url": "https://www.theguardian.com/politics/mahathir-mohamad",
    "snippet": "Prime minister Mahathir Mohamad’s resignation sets rival parties against each other and could result in a snap election",
    "published": null
  }
]