[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Die_Linke",
    "snippet": "&#x27;The Left&#x27;), also known as the ... in Germany. The party was founded in 2007 as the result of <strong>the merger of the Party of Democratic Socialism (PDS) and Labour and Social Justice – The Electoral Alternative</strong>....",
    "published": "January 7, 2007"
  },
  {
    "title": "Welcome: Die Linke English pages",
    "url": "https://en.die-linke.de/welcome/",
    "snippet": "Our movement is based on the the traditions of democracy and socialism, on the struggles for human rights and emancipation, against fascism and racism, imperialism and militarism. We aim to overcome all social relationships in which people are exploited, disenfranchised and deprived of the right to make their own decisions and in which the social and natural foundations of their lives are destroyed.",
    "published": null
  },
  {
    "title": "Left Party | Germany, Politics, Origin, & Election Results | Britannica",
    "url": "https://www.britannica.com/topic/Left-Party-political-party-Germany",
    "snippet": "Left Party, German political party that ruled East Germany as the Socialist Unity Party of Germany (SED) and now contests elections in united Germany as the Left (Die Linke).",
    "published": "November 10, 2006"
  },
  {
    "title": "German elections: The Left party advocates for 'fair immigration society', right to asylum - InfoMigrants",
    "url": "https://www.infomigrants.net/en/post/62864/german-elections-the-left-party-advocates-for-fair-immigration-society-right-to-asylum",
    "snippet": "The Left party (Die Linke) was founded in 2007.",
    "published": null
  },
  {
    "title": "Die Linke | Parties in the German Bundestag",
    "url": "https://www.deutschland.de/en/topic/politics/die-linke-parties-in-the-german-bundestag",
    "snippet": "Die Linke has its origins in the Socialist Unity Party of Germany in the former GDR. Read what has become of it now.",
    "published": "May 8, 2025"
  }
]