[
  {
    "title": "ESPN, Inc. Fact Sheet - ESPN Press Room U.S.",
    "url": "https://espnpressroom.com/us/espn-inc-fact-sheet/",
    "snippet": "ESPN launched on September 7, 1979, and is <strong>80 percent owned by ABC, Inc., an indirect subsidiary of The Walt Disney Company</strong>. Hearst holds a 20 percent interest.",
    "published": "September 22, 2025"
  },
  {
    "title": "ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ESPN",
    "snippet": "On October 10, 1993, ESPN2—a ... reach to 75 million subscribers. Ownership of ABC, and thus control of ESPN, was acquired by <strong>Capital Cities Communications in 1985</strong>....",
    "published": "4 days ago"
  },
  {
    "title": "ESPN Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ESPN_Inc.",
    "snippet": "Currently headed by executive <strong>James Pitaro</strong> since March 5, 2018, it owns and operates the ESPN-branded cable television, satellite television and streaming media channels and services including ESPN itself, ESPN DTC, ESPN+, ESPN2, ESPN3, ESPNU, ESPNews, ESPN Deportes, ESPN Radio, ESPN.com, ACC ...",
    "published": "4 days ago"
  },
  {
    "title": "ESPN's Corporate Ownership - ESPN Press Room U.S.",
    "url": "https://espnpressroom.com/us/espns-corporate-ownership/",
    "snippet": "1978 Jun 17 Corporate title of Entertainment and Sports Programming Network adopted (full name no longer exists) <strong>1979 Feb 22 Getty Oil agrees in principle to purchase 85% of ESPN</strong> 1981 Sep 23 Getty and ABC Video, a wholly owned subsidiary of ABC, Inc, announce letter of intent for pay sports ...",
    "published": "August 28, 2019"
  },
  {
    "title": "History of ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_ESPN",
    "snippet": "<strong>In 1984, ABC reached a deal with Getty Oil to acquire ESPN</strong>. ABC retained an 80% share, and sold a 20% interest to Nabisco. The Nabisco shares were later sold to the Hearst Corporation, which still holds a 20% ownership stake in the channel today. In May 1985, ABC was purchased by Capital Cities ...",
    "published": "November 11, 2025"
  }
]