[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "<strong>In 2000, following the announcement of a new law that raised the electoral threshold for State Duma elections, Navalny joined the Russian United Democratic Party Yabloko</strong>. According to Navalny, the law was stacked against Yabloko and Union of Right Forces, and he decided to join, even though ...",
    "published": "1 week ago"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "<strong>Navalny joined the Russian United Democratic Party</strong>, also known as “Yabloko.” It was immediately clear to him that the new law was directed at Yabloko, encouraging him to take a more active role in the party, despite him claiming in an interview ...",
    "published": null
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. <strong>In 2000, while he was still a student, Navalny joined Yabloko</strong>, ...",
    "published": "March 7, 2023"
  },
  {
    "title": "Russia’s ‘Last Liberal Party’ Cuts Ties With Navalny Supporters - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/10/18/russias-last-liberal-party-cuts-ties-with-navalny-supporters-a75327",
    "snippet": "Russian liberal party Yabloko announced Monday it will cut ties with members who had backed jailed Kremlin critic Alexei Navalny’s anti-Kremlin voting initiative, a move that underlines bitter divisions in the country’s fragmented opposition.",
    "published": "September 10, 2025"
  },
  {
    "title": "Alexei Navalny",
    "url": "https://grokipedia.com/page/Alexei_Navalny",
    "snippet": "cropped_2cropped2​ Alexei ... reports and videos.[1] Initially aligned with liberal politics after <strong>joining the Yabloko party in 2000</strong>, Navalny engaged in nationalist activities, including participation in the annual ...",
    "published": null
  }
]