[
  {
    "title": "Knight Ridder - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Knight_Ridder",
    "snippet": "Knight Ridder /ˈrɪdər/ was an American media company, specializing in newspaper and Internet publishing. It was <strong>bought by McClatchy on June 27, 2006</strong>, allowing the latter to become the second largest newspaper publisher in the United States at the time, with 32 daily newspaper brands sold.",
    "published": "1 week ago"
  },
  {
    "title": "Lessons on Ownership from the Sale of Knight Ridder - FBCG",
    "url": "https://www.thefbcg.com/resource/lessons-on-ownership-from-the-sale-of-knight-ridder/",
    "snippet": "Lesson number two is that articles of incorporation are an important tool for providing creative methods to protect a company. <strong>The McClatchy Company emerged as the buyer of Knight Ridder last month</strong>.",
    "published": "June 4, 2025"
  },
  {
    "title": "Press Release issued jointly by The McClatchy Company and Knight-Ridder, Inc.",
    "url": "https://www.sec.gov/Archives/edgar/data/205520/000119312506052381/dex991.htm",
    "snippet": "Holders of McClatchy Class B stock acting by written consent have adopted the merger agreement, approved the issuance of the shares in the merger and approved an amendment to McClatchys restated certificate of incorporation to increase the authorized Class A common stock from 100 million shares to 200 million shares in connection with the merger. No further vote of McClatchys stockholders is required. Knight Ridder generated $3.1 billion in revenue and $638 million in EBITDA in 2005, pro forma for full year ownership of all Knight Ridder newspapers.",
    "published": null
  },
  {
    "title": "Knight Ridder, Inc. | American company | Britannica",
    "url": "https://www.britannica.com/topic/Knight-Ridder-Inc",
    "snippet": "…the largest American newspaper chains, Knight Ridder. The Herald extended its international edition to Mexico in 2002. <strong>In 2006 ownership of the paper passed to the McClatchy Company after its acquisition of Knight Ridder</strong>.",
    "published": null
  },
  {
    "title": "McClatchy Will Buy Knight Ridder for $4.5 Billion : NPR",
    "url": "https://www.npr.org/templates/story/story.php?storyId=5260417",
    "snippet": "Paul was where we started,&quot; she said, referring to the Beacon-Journal and the Pioneer Press, respectively. &quot;So that&#x27;s sort of too bad.&quot; Knight Ridder had slashed newsroom budgets in recent years at its larger papers as circulation and advertising revenues declined. The company sought to shore up profit margins to appease Wall Street investors. But it didn&#x27;t work. Knight Ridder&#x27;s biggest investors forced CEO Tony Ridder to sell. Knight Ridder&#x27;s corporate secretary, Polk Laffoon, says the papers that remain with McClatchy will be in good hands.",
    "published": "March 13, 2006"
  }
]