[
  {
    "title": "Abdullah of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdullah_of_Saudi_Arabia",
    "snippet": "Abdullah bin Abdulaziz Al Saud (1 August 1924 – 23 January 2015) was <strong>King and Prime Minister of Saudi Arabia from 1 August 2005 until his death in 2015.</strong> Prior to his accession, he was Crown Prince of Saudi Arabia from 13 June 1982.",
    "published": "October 12, 2025"
  },
  {
    "title": "Abdullah of Saudi Arabia | King, Biography, History, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Abdullah-of-Saudi-Arabia",
    "snippet": "Before becoming king, Abdullah served as crown prince from 1982 to 2005 and was the de facto ruler after King Fahd’s stroke in 1995. The 2002 Arab Peace Initiative called for Israel to withdraw from territories occupied in 1967 in exchange for full Arab normalization of relations with Israel. Abdullah introduced moderate reforms, including limited deregulation, foreign investment, privatization, and the country’s first municipal elections based on adult male suffrage. Abdullah of Saudi Arabia (born c.",
    "published": "August 11, 2005"
  },
  {
    "title": "A King's Biography | King Abdullah bin Abdulaziz Biography Center",
    "url": "https://kingabdullah.sa/?page_id=2591&lang=en",
    "snippet": "He was keen on the heritage of ... festival organized by the National Guard, and is still held every year. <strong>He was appointed as King of Saudi Arabia after the death of his brother King Fahd in 2005</strong>, and took the title of Custodian of the Two Holy Mosques, after King Fahd, ...",
    "published": "June 10, 2021"
  },
  {
    "title": "Biography of King Abdullah, Ruler of Saudi Arabia",
    "url": "https://www.thoughtco.com/king-abdullah-of-saudi-arabia-195665",
    "snippet": "Abdullah bin Abdulaziz Al Saud (August 1, 1924–January 23, 2015) was the <strong>king of Saudia Arabia from 2005 to 2015.</strong> During his reign, tensions increased between conservative Salafi (Wahhabi) forces and liberal reformers.",
    "published": "June 17, 2019"
  },
  {
    "title": "King Abdullah bin Abdulaziz Biography Center |",
    "url": "https://kingabdullah.sa/?lang=en",
    "snippet": "... Abdullah bin Abdulaziz bin Abdulrahman Al Saud: The 6th King of Saudi Arabia and the 10th son of King Abdulaziz, was <strong>born and educated in Riyadh, he was appointed head of the National Guard in 1963, and improved it from traditional units to a major military institution</strong>.",
    "published": "July 6, 2020"
  }
]