[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "Eurosport (formerly known as DSport) is an Indian pay television sports channel owned by <strong>Warner Bros. Discovery India</strong> for the Indian subcontinent. It was launched as DSport in February 2017 with a partnership between Discovery India and Lex Sportel. In January 2020, Lex Sportel parted ways ...",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "<strong>Discovery</strong>. <strong>Discovery</strong> took a 20% minority interest share in December 2012, and became majority shareholder in the Eurosport venture with TF1 in January 2014, taking a 51% share of the company, On 22 July 2015 <strong>Discovery</strong> agreed to acquire TF1&#x27;s remaining 49% stake in the venture.",
    "published": "October 31, 2025"
  },
  {
    "title": "When will Eurosport be switched off and replaced by TNT Sports? Merger explained",
    "url": "https://www.radiotimes.com/tv/sport/eurosport-tnt-sports-merger/",
    "snippet": "<strong>Warner Bros Discovery</strong>, the company which has owned the Eurosport brand since 2014, will merge Eurosport 1 and 2 with its TNT Sports brand. In 2023, a WBD merger with BT led to BT Sport being rebranded as TNT Sports.",
    "published": "February 20, 2025"
  },
  {
    "title": "Eurosport | Warner Bros. Entertainment Wiki | Fandom",
    "url": "https://warnerbros.fandom.com/wiki/Eurosport",
    "snippet": "Owned by <strong>Warner Bros. Discovery</strong> through its TNT Sports International unit, it operates two main channels—Eurosport 1 and Eurosport 2—across most of its territories, and streams on Max and Discovery+. Originally a joint venture between the ...",
    "published": null
  },
  {
    "title": "Eurosport - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/eurosport",
    "snippet": "Eurosport is a pan-European television sports network, owned and operated by <strong>Discovery Communications</strong>.",
    "published": null
  }
]