[
  {
    "title": "The Birth Of ESPN & Major Media with Founder Bill Rasmussen [Podcast 244]",
    "url": "https://growthtofreedom.com/the-birth-of-espn-major-media-with-founder-bill-rasmussen",
    "snippet": "His name is <strong>Bill Rasmussen</strong>. He’s the Founder of ESPN.",
    "published": "August 17, 2020"
  },
  {
    "title": "History of ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_ESPN",
    "snippet": "ESPN was founded by <strong>Bill Rasmussen, his son Scott Rasmussen, and 43 year old eye doctor and Aetna insurance agent Ed Eagan</strong>. Bill, who had an affinity with sports for much of his life, was fired from his position as the communications manager for the New England Whalers in 1978.",
    "published": "November 11, 2025"
  },
  {
    "title": "The Untold Origin Story of ESPN",
    "url": "https://airmail.news/issues/2024-2-17/a-whole-new-ball-game",
    "snippet": "How <strong>Bill and Scott Rasmussen</strong> created ESPN, sports programming’s North Star, on a wing, a prayer, and a chunk of Getty cash—and walked out with almost nothing.",
    "published": "October 7, 2025"
  },
  {
    "title": "ESPN’s Lee Corso, Bill Rasmussen and Marc Herklotz Inducted into Sports Broadcasting Hall of Fame - ESPN Front Row",
    "url": "https://www.espnfrontrow.com/2025/12/espns-lee-corso-bill-rasmussen-and-marc-herklotz-inducted-into-sports-broadcasting-hall-of-fame/",
    "snippet": "NEW YORK – On Tuesday night, a trio of ESPNers – legendary college football analyst Lee Corso, ESPN founder <strong>Bill Rasmussen</strong> and innovative technical director Marc Herklotz – were inducted into the Sports Broadcasting Hall of Fame as members ...",
    "published": "5 days ago"
  },
  {
    "title": "ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ESPN",
    "snippet": "<strong>Bill Rasmussen</strong> came up with the concept of ESPN in May 1978, after he was fired from his job with the World Hockey Association&#x27;s New England Whalers. Rasmussen and his ESPN co-founder Ed Eagan, joined by Rasmussen&#x27;s son Scott (who had also been ...",
    "published": "4 days ago"
  }
]