[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Trudeau remained Liberal leader ... as his successor on March 9. He resigned as prime minister five days later and stood down as an MP at the 2025 federal election. On June 23, 1971, the Prime Minister&#x27;s Office (PMO) announced that Prime Minister Pierre Trudeau&#x27;s wife of four months, Margaret Trudeau (née Sinclair), was pregnant and due in December. Justin Trudeau was ...",
    "published": "4 days ago"
  },
  {
    "title": "Qui succédera à Justin Trudeau ? | La Presse",
    "url": "https://www.lapresse.ca/actualites/chroniques/2025-01-07/qui-succedera-a-justin-trudeau.php",
    "snippet": "En décembre, le New York Times consacrait un portrait à la ministre des Affaires étrangères, qualifiée d’une des « principales prétendantes » (top contender) à la succession de M. Trudeau. Les conservateurs l’accusaient de lui jouer dans le dos. Or, elle avait réitéré au quotidien américain sa loyauté envers son chef.",
    "published": "January 7, 2025"
  },
  {
    "title": "Les candidats à la succession de Trudeau déjà sous les critiques | Le Devoir",
    "url": "https://www.ledevoir.com/politique/canada/830434/candidats-succession-trudeau-deja-critiques",
    "snippet": "Les conservateurs cassent déjà du sucre sur le dos des candidats pressentis à la succession de Justin Trudeau, à commencer par l’ancien gouverneur de la Banque du Canada Mark Carney et l’ancienne ministre des Finances Chrystia Freeland, vus comme les meilleurs libéraux pour faire face au gouvernement de Donald Trump.",
    "published": "January 7, 2025"
  },
  {
    "title": "Justin Trudeau’s Crisis Has Canada's Liberal Party Weighing Succession Rules - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2024-12-26/trudeau-s-crisis-puts-spotlight-on-succession-rules-for-canada-s-liberal-party",
    "snippet": "The turmoil that’s threatening to topple Prime Minister Justin Trudeau has members of his political party poring over the rulebook for replacing him.",
    "published": "December 26, 2024"
  },
  {
    "title": "What we know about the succession rules for Canada's Liberals as Trudeau faces calls to resign | The Province",
    "url": "https://theprovince.com/news/politics/succession-rules-for-canadas-liberals/wcm/3b5658b7-fb70-41d2-b46a-1f4f50ca5e29",
    "snippet": "Trudeau decisively won the last contest in 2013, after hundreds of thousands of people joined. The open-membership policy is likely to be a greater concern this time around, after an official inquiry found evidence of foreign interference in Canadian politics. Treasury Board President Ginette Petitpas Taylor hugs Prime Minister Justin Trudeau as Gov.",
    "published": "December 26, 2024"
  }
]