[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "He is an <strong>emeritus fellow of New College, Oxford</strong>. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and is on the advisory board of the University of Austin. Dawkins has won several academic and writing awards, among them ...",
    "published": "3 days ago"
  },
  {
    "title": "Professor Richard Dawkins FRS",
    "url": "https://royalsociety.org/people/richard-dawkins-11316/",
    "snippet": "Richard Dawkins is an evolutionary biologist and expert in animal behaviour. Richard is well known for his ability to communicate concepts from his research and beyond to a non-specialist audience. Thus he has been a key figure in raising public understanding of science.",
    "published": null
  },
  {
    "title": "Richard Dawkins CV: Academic Achievements | PDF",
    "url": "https://www.scribd.com/document/111336056/cv-521",
    "snippet": "It outlines his professional positions including being a <strong>Research Assistant to Professor N.</strong> Tinbergen FRS from 1965-1967 and Assistant Professor of Zoology at University of California, Berkeley from 1967-1969.",
    "published": null
  },
  {
    "title": "Richard Dawkins: Social Sciences and Humanities H-index & Awards - Academic Profile | Research.com",
    "url": "https://research.com/u/richard-dawkins",
    "snippet": "The various areas that Richard Dawkins examines in his Darwinism study include Environmental ethics and Genealogy.",
    "published": null
  },
  {
    "title": "Richard Dawkins - Students | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/students/article/Richard-Dawkins/603802",
    "snippet": "In 1995 Dawkins was made the <strong>Charles Simonyi professor of public understanding of science at Oxford University</strong>. In this position he continued to publish prolifically and produced an array of television programs.",
    "published": null
  }
]