[
  {
    "title": "2025 Chilean general election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Chilean_general_election",
    "snippet": "Each point represents a poll. Each line is a local regression that represents the two candidates. No candidate obtained the required majority to win the presidency outright. As a result, the election proceeded to a runoff between Jeannette Jara and <strong>José Antonio Kast</strong> on 14 December 2025.",
    "published": "20 hours ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "Sun 14 Dec 2025 18.40 ESTLast modified on Tue 16 Dec 2025 00.08 EST · Share · The ultra-conservative former congressman <strong>José Antonio Kast</strong> has been elected as Chile’s next president.",
    "published": "6 hours ago"
  },
  {
    "title": "Chile elects Kast as president in sharp rightward shift | Reuters",
    "url": "https://www.reuters.com/world/americas/chile-votes-presidential-race-expected-lurch-country-right-2025-12-14/",
    "snippet": "[1/3]<strong>Jose Antonio Kast</strong>, presidential candidate of the far-right Republican Party of Chile and his wife Maria Pia Adriasola wave to their supporters as they celebrate after Kast won Chile&#x27;s presidency in a presidential runoff election, in Santiago, ...",
    "published": "1 day ago"
  },
  {
    "title": "Chile elects Kast as president, deepening regional shift to law-and-order politics | CNN",
    "url": "https://www.cnn.com/2025/12/14/americas/chile-election-kast-latam-intl",
    "snippet": "<strong>Jose Antonio Kast</strong> won Chile’s presidential election on Sunday, leveraging voter fears over rising crime and migration to take the country to its sharpest rightward shift since the end of dictatorship in 1990.",
    "published": "2 days ago"
  },
  {
    "title": "What Chile’s New President Jose Kast Means for Trump's America and the Rest of the World",
    "url": "https://foreignpolicy.com/2025/12/15/chile-kast-trump-populism-america-venezuela/",
    "snippet": "Chile&#x27;s presidential candidate <strong>Jose Antonio Kast</strong> of the Republican Party waves to supporters during his closing campaign rally in Temuco, Chile on December 11, 2025. Chile&#x27;s presidential candidate <strong>Jose Antonio Kast</strong> of the Republican Party waves ...",
    "published": "18 hours ago"
  }
]