[
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: ... Прогресса, Partiya Progressa), is a banned opposition political party in Russia founded on 15 December 2012 by <strong>Leonid Volkov</strong> and later refounded on 19 May 2018 by Alexei Navalny, who was also the founder of the non-profit organisation ...",
    "published": "1 month ago"
  },
  {
    "title": "Progressive Party of Russia (21st Century Crisis) | Alternative History | Fandom",
    "url": "https://althistory.fandom.com/wiki/Progressive_Party_of_Russia_(21st_Century_Crisis)",
    "snippet": "Throughout its history, it has received heavy funding from the United States, United Kingdom, Germany and France, though the Russian Progressives deny this. The Progressive Party of Russia was formed during the presidency of <strong>Vladimir Zhirinovsky</strong>, ...",
    "published": null
  },
  {
    "title": "Progressive Party (Russia) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Progressive_Party_(Russia)",
    "snippet": "The Progressive Party (Russian: Прогрессивная партия), also known as the Progressists (Russian: прогрессисты), was a group of moderate Russian liberals organized in 1912. It had 25 deputies in the Third Duma and 48 in the Fourth.",
    "published": "May 1, 2025"
  },
  {
    "title": "Russia of the Future — Google Arts & Culture",
    "url": "https://artsandculture.google.com/entity/g11bc6hfrlk?hl=en",
    "snippet": "Russia of the Future, originally known as the People&#x27;s Alliance and formerly called the Progress Party, is an unregistered opposition political party in Russia founded on 15 December 2012 by a member of the Russian opposition <strong>Leonid Volkov</strong> and later ...",
    "published": null
  },
  {
    "title": "Progressive Bloc | Liberal, Centrist & Reformist | Britannica",
    "url": "https://www.britannica.com/topic/Progressive-Bloc",
    "snippet": "Progressive Bloc, coalition of moderate conservatives and liberals in the fourth Russian Duma (elected legislative body) that tried to pressure the imperial government into adopting a series of reforms aimed at inspiring public confidence in the government and at improving the management of Russia’s effort in World War I.",
    "published": "July 20, 1998"
  }
]