[
  {
    "title": "List of Paris Saint-Germain FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Paris_Saint-Germain_FC_managers",
    "snippet": "He led Paris to back-to-back Coupe de France wins in 1982 and 1983, the club&#x27;s first major titles. In 1986, <strong>Gérard Houllier</strong> became the first manager to crown PSG champions of France.",
    "published": "6 days ago"
  },
  {
    "title": "Paris St-Germain: Mauricio Pochettino replaces Thomas Tuchel as head coach - BBC Sport",
    "url": "https://www.bbc.com/sport/football/55466395",
    "snippet": "Former Tottenham and Southampton boss <strong>Mauricio Pochettino</strong> has been appointed head coach of Paris St-Germain. The Argentine, 48, who succeeded Thomas Tuchel, has signed a deal until 30 June 2022, with the option of an extra year.",
    "published": "January 2, 2021"
  },
  {
    "title": "Thomas Tuchel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Thomas_Tuchel",
    "snippet": "After only managing to secure 3 more league wins, and with PSG third in Ligue 1, behind Lyon and eventual winners Lille, Tuchel was dismissed on 24 December, despite placing top of their Champions League group. His dismissal occurred a day after beating Strasbourg 4–0, surprising many at the club, including assistant coach Zsolt Lőw. Tuchel&#x27;s tenure at Paris Saint-Germain was marred by a fractured relationship with the club&#x27;s hierarchy.",
    "published": "3 weeks ago"
  },
  {
    "title": "Luis Enrique could hold a historic agreement: PSG are reportedly open to offer a surprising renewal offer to the Spanish coach - World Soccer Talk",
    "url": "https://worldsoccertalk.com/news/luis-enrique-could-hold-a-historic-agreement-psg-are-reportedly-open-to-offer-a-surprising-renewal-offer-to-the-spanish-coach/",
    "snippet": "<strong>Luis Enrique</strong> has successfully elevated PSG to one of the world&#x27;s elite teams by securing a historic victories streak. In order to secure his continuity, the Spaniard coach is positioned to receive a groundbreaking contract renewal, potentially ...",
    "published": "1 day ago"
  },
  {
    "title": "Paris Saint-Germain » Coaching Staff List",
    "url": "https://www.worldfootball.net/teams/paris-saint-germain/9/",
    "snippet": "Football - results, news, statistics and much more...",
    "published": null
  }
]