[
  {
    "title": "James L. Dolan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/James_L._Dolan",
    "snippet": "As the companies&#x27; chairman, Dolan oversees all operations within the company and supervises day-to-day operations of its professional sports teams, the New York Knicks and New York Rangers, as well as their regional sports networks, which include MSG Network and MSG Plus. Dolan was previously CEO of Cablevision, founded by his father, until its sale in June 2016 to European telecom conglomerate Altice. Dolan is one of six children of Cablevision founder Charles Dolan and his wife, Helen Ann Dolan, and nephew of Cleveland Guardians owner Larry J.",
    "published": "3 weeks ago"
  },
  {
    "title": "James Dolan | Madison Square Garden Sports Executive Chairman and CEO",
    "url": "https://www.msgsports.com/leadership/james-l-dolan/",
    "snippet": "James L. Dolan is Executive Chairman and Chief Executive Officer of <strong>Madison Square Garden Sports Corp.</strong> (MSG Sports), which features the New York Knicks (NBA) and New York Rangers (NHL) franchises.",
    "published": "June 21, 2024"
  },
  {
    "title": "New York Knicks - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_York_Knicks",
    "snippet": "On the day of the meeting, Kase made his proposal to the panel of owners; however, they were much more impressed by Irish and his vast resources; Kase relented and the franchise was awarded to Irish. Irish wanted a distinct name for his franchise that was representative of the city of New York. He called together members of his staff for a meeting to cast their votes in a hat. After tallying the votes, the franchise was named the Knickerbockers.",
    "published": "5 days ago"
  },
  {
    "title": "Who is the Knicks' owner? Everything to know about James Dolan",
    "url": "https://www.usatoday.com/story/sports/nba/knicks/2025/06/03/knicks-owner-everything-to-know-james-dolan/84015908007/",
    "snippet": "FEELING SENTIMENTAL: Knicks superfan Ben Stiller &#x27;grateful&#x27; for work fired Tom Thibodeau did in New York · Dolan is officially listed as the executive chairman and chief executive officer of Madison Square Garden Sports and Madison Square Garden Entertainment. He is the owner of both the New York Knicks and the NHL&#x27;s New York Rangers.",
    "published": "June 3, 2025"
  },
  {
    "title": "New York Knicks Scores, Stats and Highlights - ESPN",
    "url": "https://www.espn.com/nba/team/_/name/ny/new-york-knicks",
    "snippet": "— Tyrese Maxey scored 30 points, VJ Edgecombe had 23 and the Philadelphia 76ers became just the second visiting team to win at Madison Square Garden this season, beating the New York Knicks 116-107 on Friday night.",
    "published": "1 day ago"
  }
]