[
  {
    "title": "Mark Carney - Prime Minister of Canada | Prime Minister of Canada",
    "url": "https://www.pm.gc.ca/en",
    "snippet": "December 9, 2025 · Published · 52045 · See all news · Budget 2025: Canada Strong · The government’s plan for generational investments that will build, protect, and empower Canada. Published · Speech from the Throne · Read about the overall goals of the government and how it will accomplish them.",
    "published": null
  },
  {
    "title": "Ministry (Cabinet) as of Monday, December 1, 2025 - Members of Parliament - House of Commons of Canada",
    "url": "https://www.ourcommons.ca/members/en/ministries",
    "snippet": "Once appointed, <strong>the Prime Minister</strong> selects a number of confidential advisers, usually from among the members of the governing party, who are made members of the Privy Council and sworn in as ministers. Collectively, they are known as the “Ministry” or cabinet.",
    "published": null
  },
  {
    "title": "2025 Canadian federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Canadian_federal_election",
    "snippet": "By December 22, 21 Liberal MPs had publicly called for Trudeau to step down. On January 6, 2025, Trudeau announced his intention to resign as prime minister after the party elected his successor. The ensuing leadership election was won by <strong>Mark Carney</strong>, former governor of the Bank of Canada and ...",
    "published": "2 days ago"
  },
  {
    "title": "Canada: Latest News, Top Stories and Analysis - POLITICO",
    "url": "https://www.politico.com/canada-politics-news-updates-analysis",
    "snippet": "Conservative MP joins Canada’s Liberal government, moving Carney closer to majority government · The stunning twist brings the prime minister one step closer to a secure hold on the office until 2029. By Mickey Djuric and Zi-Ann Lum | November 04, 2025 03:38 PM",
    "published": null
  },
  {
    "title": "2025 Liberal Party of Canada leadership election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Liberal_Party_of_Canada_leadership_election",
    "snippet": "The dissident MPs continued to push for a caucus vote on Trudeau&#x27;s leadership, though there is no formal mechanism in the party to force one. On December 16, hours before the government&#x27;s fall economic statement, Chrystia Freeland, the minister of finance and deputy prime minister, resigned due to her opposition to Trudeau&#x27;s fiscal policy.",
    "published": "4 days ago"
  }
]