[
  {
    "title": "De Havilland Canada and Avincis Aviation Announce Joint Initiatives - De Havilland Canada",
    "url": "https://dehavilland.com/partnerships/de-havilland-canada-and-avincis-aviation-announce-joint-initiatives/",
    "snippet": "As part of these initiatives, <strong>Avincis has agreed to transfer ownership of its ADS-B and FMS supplemental type certificates for the CL aircraft to De Havilland Canada</strong> for inclusion in its spare parts catalogue, thereby providing access to critical ...",
    "published": "2 weeks ago"
  },
  {
    "title": "De Havilland Aircraft of Canada 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/292700-62",
    "snippet": "Information on acquisition, funding, investors, and executives for De Havilland Aircraft of Canada. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "News - De Havilland Canada",
    "url": "https://dehavilland.com/news/",
    "snippet": "De Havilland Aircraft of Canada Limited news. Learn about aftermarket support, aircraft sales, corporate initiatives, our team, and our partnerships in Canada and around the world.",
    "published": "March 20, 2024"
  },
  {
    "title": "De Havilland Canada and Avincis Aviation Announce Joint Initiatives",
    "url": "https://www.globenewswire.com/news-release/2025/12/03/3199140/0/en/De-Havilland-Canada-and-Avincis-Aviation-Announce-Joint-Initiatives.html",
    "snippet": "CALGARY, Alberta and LISBON, Portugal, Dec. 03, 2025 (GLOBE NEWSWIRE) -- De Havilland Aircraft of Canada Limited and Avincis are pleased to announce...",
    "published": "2 weeks ago"
  },
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "De Havilland Field, in Wheatland County, Alberta. The new facility is intended to merge its two manufacturing facilities and produce the Twin Otter and Dash 8 planes, as well as the new DHC-515 firefighting aircraft. <strong>First production at the new site is planned to begin in 2025</strong>...",
    "published": "1 month ago"
  }
]