[
  {
    "title": "Yulia Svyrydenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yulia_Svyrydenko",
    "snippet": "Yulia Anatoliivna Svyrydenko (Ukrainian: Юлія Анатоліївна Свириденко, IPA: [ˈjul⁽ʲ⁾ijɐ ɐnɐˈtɔl⁽ʲ⁾ijiu̯nɐ swɪrɪˈdɛnko]; born 25 December 1985) is a Ukrainian politician who has served as the 19th prime minister of Ukraine since 17 July 2025.",
    "published": "November 22, 2025"
  },
  {
    "title": "Yulia Svyrydenko: Government's Winter Support continues | Cabinet of Ministers of Ukraine",
    "url": "https://www.kmu.gov.ua/en/news/yuliia-svyrydenko-zymova-pidtrymka-vid-derzhavy-tryvaie",
    "snippet": "Department of Information and Public Communications of the Secretariat of the Cabinet of Ministers of Ukraine, posted 16 December 2025 15:54 ... <strong>Government winter support continues</strong>, emphasized Ukrainian Prime Minister Yulia Svyrydenko.",
    "published": null
  },
  {
    "title": "Yulia Svyrydenko: Government adopts decision to allocate an additional UAH 400 million to support people released from russian captivity | Cabinet of Ministers of Ukraine",
    "url": "https://www.kmu.gov.ua/en/news/yuliia-svyrydenko-uriad-ukhvalyv-rishennia-dodatkovo-spriamuvaty-400-mln-hrn-na-pidtrymku-liudei-zvilnenykh-z-rosiiskoho-polonu",
    "snippet": "<strong>The Government has decided to allocate an additional UAH 400 million to support people released from russian captivity, as well as the families of those who are still in captivity</strong>.",
    "published": null
  },
  {
    "title": "Yulia Svyrydenko: Government approves a series of decisions to support people with disabilities | Cabinet of Ministers of Ukraine",
    "url": "https://www.kmu.gov.ua/en/news/yuliia-svyrydenko-uriad-ukhvalyv-nyzku-rishen-dlia-pidtrymky-liudei-z-invalidnistiu",
    "snippet": "Department of Information and Public Communications of the Secretariat of the Cabinet of Ministers of Ukraine, posted 17 December 2025 19:36 ... Today, at its session, <strong>the Government approved a series of decisions to support people with disabilities</strong>...",
    "published": null
  },
  {
    "title": "Yulia Svyrydenko held working meeting with Prime Minister of Portugal Luis Montenegro | Cabinet of Ministers of Ukraine",
    "url": "https://www.kmu.gov.ua/en/news/yuliia-svyrydenko-provela-robochu-zustrich-z-premier-ministrom-portuhalii-luishem-montenehru",
    "snippet": "Prime Minister of Ukraine Yulia Svyrydenko <strong>held a working meeting with Prime Minister of Portugal Luís Montenegro, to discuss key areas of bilateral cooperation, including defense, economy, and energy security</strong>.",
    "published": null
  }
]