[
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "Mediapart points out that the hunt for RSA fraudsters has been - with great communication support - the flagship policy pursued by the department since the arrival of Lecornu. Another flagship policy was closing two priority education colleges, which was justified by their low occupancy rates.",
    "published": "1 week ago"
  },
  {
    "title": "Sébastien Lecornu, French Minister for the Armed Forces | Ministère des Armées et des Anciens combattants",
    "url": "https://www.defense.gouv.fr/en/ministry/sebastien-lecornu-french-minister-armed-forces",
    "snippet": "Son of a medical secretary and a technician in the aeronautics industry, Sébastien Lecornu <strong>studied law at Paris 2 Panthéon-Assas University</strong>.",
    "published": "April 22, 2025"
  },
  {
    "title": "Lecornu | Normandy for Peace",
    "url": "https://www.normandiepourlapaix.fr/en/personnes-structures/lecornu",
    "snippet": "Sébastien Lecornu was born on 11 June 1986. The son of a medical secretary and an aviation industry technician, Mr. Lecornu <strong>studied law at the Université Paris 2 Panthéon Assas</strong>.",
    "published": null
  },
  {
    "title": "Can Macron’s quiet power broker Sébastien Lecornu navigate France’s fractured politics as PM?",
    "url": "https://www.france24.com/en/france/20250910-sebastien-lecornu-the-quiet-power-broker-tasked-with-uniting-france-divided-parties-emmanuel-macron",
    "snippet": "Unlike many French leaders, Lecornu did not come through the so-called &quot;grandes écoles&quot;, top professional schools, that have long trained French elites. <strong>Educated in private Catholic schools</strong>, he studied law before beginning – but never completing ...",
    "published": "September 10, 2025"
  },
  {
    "title": "Family tree of Sébastien LECORNU - Geneastar",
    "url": "https://en.geneastar.org/genealogy/lecornus/sebastien-lecornu",
    "snippet": "On 9 September 2025, he was appointed as Prime Minister by Emmanuel Macron after the Bayrou government was brought down by a vote of no confidence. Early life and education Lecornu was born on 11 June 1986 in Eaubonne, Val-d&#x27;Oise Department, to Jean-Pierre Lecornu, an aeronautical technician at the Safran Aircraft Engines factory in Vernon, and Martine Rousseau, a medical secretary.",
    "published": null
  }
]