[
  {
    "title": "Sara bint Mashour Al Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sara_bint_Mashour_Al_Saud",
    "snippet": "Sara bint Mashour Al Saud (Arabic: سارة بنت مشهور آل سعود) is a member of the Saudi royal family and <strong>wife of Saudi Crown Prince Mohammed bin Salman</strong>, who is her first cousin. She is a granddaughter of King Abdulaziz. Sara bint Mashour is the daughter of Prince Mashour bin Abdulaziz ...",
    "published": "1 week ago"
  },
  {
    "title": "Who is Sara bint Mashour Al Saud? Everything you need to know - Tuko.co.ke",
    "url": "https://www.tuko.co.ke/facts-lifehacks/celebrity-biographies/447794-who-sara-bint-mashour-al-saud-everything-know/",
    "snippet": "<strong>Sara bint Mashour Al Saud is the only woman who is publicly known as Mohammed bin Salman&#x27;s wife</strong>.",
    "published": "November 20, 2024"
  },
  {
    "title": "Who is Princess Sara bint Mashour bin Abdulaziz Al Saud, Wife of Crown Prince Mohammed bin Salman Al Saud of Saudi Arabia? 3 Facts You Need To Know",
    "url": "https://www.harpersbazaararabia.com/culture/royal-watch/princess-sara-bint-mashour-bin-abdulaziz-al-saud",
    "snippet": "On <strong>April 6, 2008</strong> HRH Princess Sara bint Mashour bin Abdulaziz Al Saud married Crown Prince Mohammed bin Salman Al Saud.",
    "published": "October 23, 2023"
  },
  {
    "title": "Sara bint Mashoor bin Abdulaziz Al Saud - Biography - House of Saud",
    "url": "https://houseofsaud.com/sara-bint-mashoor-bin-abdulaziz-al-saud-biography/",
    "snippet": "It’s not just a lineage; it’s a legacy that she carries with her, a blend of history and responsibility. Love &amp; Marriage: <strong>Married to Crown Prince Mohammed bin Salman since 2008</strong>, Sara’s life is a narrative of love and partnership, set against ...",
    "published": null
  },
  {
    "title": "Meet Sara Bint Mashour Al Saud - Wife Of Crown Prince MBS",
    "url": "https://www.salonprivemag.com/princess-sara-bint-mashour-al-saud/",
    "snippet": "<strong>She is the wife of Crown Prince Mohammed bin Salman</strong>, the man who effectively runs Saudi Arabia and will one day be its king. Yet most people have never seen her photograph. She doesn’t appear at state dinners or accompany her husband on foreign ...",
    "published": "November 14, 2025"
  }
]