[
  {
    "title": "Memories Of Prabowo Subianto's Luxury Marriage - Titiek Suharto Who Was Flooded With Criticism",
    "url": "https://voi.id/en/memori/364875",
    "snippet": "#Prabowo Subianto #KPK #Hero&#x27;s Day #Purbaya Yudhi Sadewa #ledakan di sma 72 jakarta · | INFO SEHAT · 10 November 2025, 16:55 · | ECONOMY · 10 November 2025, 16:54 · | NEWS · 10 November 2025, 16:54 · | MOBIL · 10 November 2025, 16:52 · | NEWS · 10 November 2025, 16:51 ·",
    "published": null
  },
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "In pursuit of those ends his government has launched large-scale populist spending programmes (such as the free nutritious meals scheme and rice-aid and electricity-discount policies) while simultaneously ordering a budget-efficiency sweep: a January 2025 presidential instruction cut Rp 306.6 trillion of spending to redirect funds into social programmes. To complement this, his government has shifted the revenue-mobilisation paradigm: the 2026 draft budget sets a growth target of 5.4 % (with a long-term aspiration of 8 %) and projects a deficit cap of ~2.5 % of GDP, emphasising better tax-to-GDP ratio rather than raw debt expansion. Prabowo Subianto’s decision to appoint Purbaya Yudhi Sadewa as Minister of Finance on 8 September 2025 signaled a change in economic policymaking, a departure from the fiscal-orthodoxy of his predecessor Sri Mulyani Indrawati.",
    "published": "1 day ago"
  },
  {
    "title": "Prabowo Subianto: Latest News and Updates | South China Morning Post",
    "url": "https://www.scmp.com/topics/prabowo-subianto",
    "snippet": "Prabowo Subianto Djojohadikusumo is Indonesia’s eighth president, representing the Gerindra Party. He took office in October 2024. A former military general previously accused of human rights abuses during the presidency of his father-in-law Suharto, Prabowo served as defence minister under former president Joko Widodo, who defeated him in two prior elections.",
    "published": null
  },
  {
    "title": "Crowd Roars as Prabowo Welcomes Former Wife Titiek Soeharto during Final Rally",
    "url": "https://jakartaglobe.id/news/crowd-roars-as-prabowo-welcomes-former-wife-titiek-soeharto-during-final-rally",
    "snippet": "Presidential candidate Prabowo Subianto paused for a moment, allowing the crowd to roar as <strong>he welcomed his former wife, Siti Hediati Hariyadi, more popularly known as Titiek Soeharto</strong>, during the final campaign rally at Bung Karno Stadium in ...",
    "published": "February 10, 2024"
  },
  {
    "title": "Prabowo Subianto: The tainted ex-military chief who will be Indonesia's new leader",
    "url": "https://www.bbc.com/news/world-asia-68237141",
    "snippet": "During this period he also moved into Suharto&#x27;s inner sanctum, marrying in 1983 one of the former dictator&#x27;s daughters, Siti Hediati Hariyadi. Their marriage lasted 15 years, ending around the same time of the regime&#x27;s collapse. Prabowo at this time was commander of a special forces unit accused of the activists&#x27; abductions.",
    "published": "February 15, 2024"
  }
]