[
  {
    "title": "DFG - Deutsche Forschungsgemeinschaft - DFG fördert neun neue Forschungsgruppen und eine neue Kolleg-Forschungsgruppe",
    "url": "https://www.dfg.de/de/service/presse/pressemitteilungen/2025/pressemitteilung-nr-42",
    "snippet": "Der auf der Theorie sozialer Identität basierende Ansatz des „Identity <strong>Leadership</strong>“ untersucht, wie Führung gesellschaftlichen Zusammenhalt stärken und Herausforderungen wie Polarisierung, Krisen und dem Klimawandel bewältigen kann.",
    "published": null
  },
  {
    "title": "DFG Personnel Rates for 2025",
    "url": "https://www.dfg.de/resource/blob/345092/60-12-2025-en.pdf",
    "snippet": "DFG Personnel Rates for 2025 · Since the introduction of flexible funding in all funding programmes, the DFG approves funding · for staff in the form of standard amounts. These amounts are calculated by the DFG Head Office · using the relevant pay scale criteria, based on full-time employment, ...",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - Executive Board, Vice Presidents and Further Members",
    "url": "https://www.dfg.de/en/about-us/statutory-bodies/executive-committee/members",
    "snippet": "Vice President Elected on 2 July 2025 Inauguration on 1 January 2026 · President of the Stifterverband · Our website uses cookies that are strictly necessary for its technical functionality and cookies for the collection of statistical information (analytical cookies).",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - Information for Researchers | 2025",
    "url": "https://www.dfg.de/en/news/news-topics/announcements-proposals/2025",
    "snippet": "The DFG’s announcements/calls are generally published in German. Depending on the content, this information may also be published in English, which would then be available on this page. For a complete listing of all announcements/calls, please refer to · Ausschreibungen - Informationen für ...",
    "published": null
  },
  {
    "title": "Lead a Research Group in Germany",
    "url": "https://www.research-in-germany.org/en/your-goal/postdoc/career-options-and-dual-careers/research-group-leader.html",
    "snippet": "For example, the Helmholtz Association supports its Investigators Groups for periods of five years with at least 1.5 million euros, while Fraunhofer Attract provides up to 2.5 million euros over five years for a group leader position with three to four new members of staff, materials and other investments. The largest funding programme for research groups is the Emmy Noether Programme run by the Deutsche Forschungsgemeinschaft. In 2023, 500 research groups at universities and research institutions were funded by the DFG through this programme.",
    "published": null
  }
]