[
  {
    "title": "Chancellor | Western Sydney University",
    "url": "https://www.westernsydney.edu.au/about_uws/leadership/chancellor",
    "snippet": "Jennifer has rejoined KPMG as a <strong>Special Advisor to client teams</strong>.",
    "published": null
  },
  {
    "title": "Jennifer Westacott AC - KPMG Australia | LinkedIn",
    "url": "https://www.linkedin.com/in/jennifer-westacott-ac-9aa853146/",
    "snippet": "NEC’s Andrew Peter Thompson MAICD ... speaker Jennifer Westacott AO, who is both <strong>Chair of Western Parkland City Authority and the Chancellor of Western Sydney University (WSU).</strong>...",
    "published": "November 17, 2021"
  },
  {
    "title": "Jennifer Westacott AO - Institute of Public Administration Australia (ACT) Limited | Institute of Public Administration Australia (ACT) Limited",
    "url": "https://act.ipaa.org.au/ipaa-people/jennifer-westacott-ao/",
    "snippet": "She is a prominent Australian business executive and public policy expert who has made significant contributions to various sectors, including public administration, education, and business. She is currently the <strong>Chancellor of Western Sydney University</strong> and serves as a Non-Executive Director ...",
    "published": "March 26, 2025"
  },
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Following a career in the NSW and Victorian public sectors, she was a <strong>senior partner at KPMG in Sydney, Australia from 2005 to 2011, before assuming the role of chief executive of the Business Council of Australia</strong>. She is also a non-executive director of Wesfarmers.",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "<strong>In July 2024 Jennifer was appointed as a Special Advisor to KPMG</strong>. She has extensive experience in critical leadership positions in the NSW and Victorian governments. She is Chair of Bradfield Development Authority (formerly the Western Parkland City Authority), Studio Schools of Australia and ...",
    "published": null
  }
]