[
  {
    "title": "Politics of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Saudi_Arabia",
    "snippet": "Decisions are, to a large extent, ... have characterized the government of <strong>Mohammed bin Salman as totalitarian. The Crown Prince and Prime Minister of Saudi Arabia, Mohammed bin Salman, is the de facto ruler of Saudi Arabia</strong>....",
    "published": "November 2, 2025"
  },
  {
    "title": "List of Saudi rulers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Saudi_rulers",
    "snippet": "This is a list of rulers of Saudi Arabia, a kingdom on the Arabian Peninsula. ... The Royal Standard consists of a green flag, with an Arabic inscription and a sword featured in white, and with the national emblem embroidered in gold in the lower right canton of the year 1973.",
    "published": "September 21, 2025"
  },
  {
    "title": "Rulers of Saudi Arabia (1932-Present)",
    "url": "https://www.jewishvirtuallibrary.org/rulers-of-saudi-arabia-1932-present",
    "snippet": "Memo for President Nixon from the Secretary of Defense Regarding Sale of F-4s to Saudi Arabia (5/18/73) ... Saudis Warn European Community to Pressure U.S. to Change its Policies Regarding Israel or Face Oil Restrictions (10/16/73) President Kennedy&#x27;s conversation with Crown Prince Faysal (October 5, 1962) ... U.S. Ambassadors to Saudi Arabia",
    "published": null
  },
  {
    "title": "Saudi Arabia Leaders – Saudi Arabia Tours",
    "url": "https://saudiarabiatours.net/saudi-arabia-leaders/",
    "snippet": "His leadership has been marked by efforts to diversify the economy, empower women, and position the Kingdom as a hub for innovation and investment. The leaders of Saudi Arabia, <strong>from the visionary founder King Abdulaziz to the dynamic Crown Prince Mohammed bin Salman</strong>, have played pivotal roles ...",
    "published": null
  },
  {
    "title": "Saudi Leadership",
    "url": "https://www.mofa.gov.sa/en/ksa/Pages/leadership.aspx",
    "snippet": "الموقع الرسمي لوزارة الخارجية للمملكة العربية السعودية والذي من خلاله يمكنك الإطلاع على كافة الأحداث الدولية والإقليمية والسياسية والدبلوماسية المتعلقة بالمملكة",
    "published": null
  }
]