[
  {
    "title": "Viktor Yanukovych - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Viktor_Yanukovych",
    "snippet": "He also served as the prime minister of Ukraine several times between 2002 and 2007 and was a member of the Verkhovna Rada (parliament) from 2006 to 2010. Yanukovych was removed from the presidency during the <strong>2014 Revolution of Dignity</strong>, which followed months of protests against him.",
    "published": "1 week ago"
  },
  {
    "title": "r/chomsky on Reddit: The 2014 removal of Viktor Yanukovych was explicitily constitutional. Anyone saying it was illegal is either ignorant or lying to you.",
    "url": "https://www.reddit.com/r/chomsky/comments/y5oxyv/the_2014_removal_of_viktor_yanukovych_was/",
    "snippet": "The Verkhovna Rada Committee voted on <strong>February 22, 2014</strong> MPs voted to &quot;remove Viktor Yanukovych from the post of president of Ukraine&quot; on the grounds that he was unable to fulfill his duties and to hold early presidential elections on May 25.[2] ...",
    "published": "October 19, 2022"
  },
  {
    "title": "Assessing the legality of the power changes in Ukraine - Nederlandse Grondwet",
    "url": "https://www.denederlandsegrondwet.nl/id/vjicc5jt4ayk/nieuws/assessing_the_legality_of_the_power",
    "snippet": "On <strong>22 February 2014</strong> altogether 328 deputies of Ukraine’s 450-seat national parliament, the Verkhovna Rada, voted to remove President Viktor Yanukovych from office. The decision referred to the facts that Yanukovich had abandoned his office and was responsible for the deaths of more than 80 ...",
    "published": null
  },
  {
    "title": "Impeachment in Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Impeachment_in_Ukraine",
    "snippet": "There were no articles of impeachment brought against Yanukovych, as the impeachment process laid out in the Ukrainian Constitution was not designed to deal with the president abandoning their post without warning. Instead, the Verkhovna Rada voted on <strong>February 22, 2014</strong> to &quot;remove Viktor Yanukovych ...",
    "published": "October 13, 2025"
  },
  {
    "title": "Ukraine After Yanukovych | YaleGlobal Online",
    "url": "https://archive-yaleglobal.yale.edu/content/ukraine-after-yanukovych",
    "snippet": "Most importantly, on <strong>February 22, after noting that Yanukovych had fled to eastern Ukraine during the night, the parliament voted to remove him from office for neglecting his constitutional duties</strong> and scheduled an early presidential election for May 25.",
    "published": null
  }
]