[
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "Mahathir bin Mohamad (Jawi: محاضر بن محمد; IPA: [mahaðɪ(r) bɪn mohamad]; born 10 July 1925) is a Malaysian politician, author and doctor who served as the fourth and seventh prime minister of Malaysia from 1981 to 2003 and again from 2018 to 2020.",
    "published": "1 day ago"
  },
  {
    "title": "Mahathir bin Mohamad | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mahathir-bin-Mohamad",
    "snippet": "He was first elected to parliament in 1964 as a member of the <strong>United Malays National Organization (UMNO),</strong> the dominant party within the ruling governmental coalition. In 1969, however, Mahathir was expelled from UMNO after his forceful advocacy ...",
    "published": "July 20, 1998"
  },
  {
    "title": "Malaysia’s ex-PM Mahathir quits Pejuang party he founded, picks GTA as new political platform | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/malaysia-ex-pm-mahathir-quits-the-pejuang-party-he-founded-chooses-gta-as-new-political-platform",
    "snippet": "KUALA LUMPUR - Malaysia’s former premier Mahathir Mohamad has quit <strong>Parti Pejuang Tanah Air</strong>, a Malay party he founded just over two years ago, indicating a split in political direction with his son Mukhriz Mahathir, who currently heads the party.",
    "published": "November 22, 2024"
  },
  {
    "title": "Tun Dr Mahathir Mohamad – Perdana Leadership Foundation",
    "url": "https://www.perdana.org.my/pms-of-malaysia/tun-dr-mahathir-mohamad/",
    "snippet": "For the first time since Independence, Malaysia had a change of government, and Tun Dr Mahathir Mohamad became Malaysia’s 7th Prime Minister. In February 2020, his party, Bersatu, made the decision to leave <strong>Pakatan Harapan</strong>, and Tun stepped down as Prime Minister.",
    "published": null
  },
  {
    "title": "A century of Mahathir Mohamad | Malay Mail",
    "url": "https://www.malaymail.com/news/opinion/2025/07/10/a-century-of-mahathir-mohamad/183405",
    "snippet": "Yet, and this is moving into the deep blue sea zone, he resurfaces for Act II. Incensed by developments, he starts a new party and joins forces with former foes to beat the system he helped build, when <strong>Pakatan Harapan</strong> ousts Barisan Nasional in 2018.",
    "published": "July 10, 2025"
  }
]