[
  {
    "title": "Arnon Milchan",
    "url": "https://www.forbes.com/profile/arnon-milchan/",
    "snippet": "<strong>Arnon Milchan owns film and TV production company New Regency Enterprises</strong>.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: one to do business in the United States and legally named Regency Entertainment (USA), Inc., one to do business overseas and legally named Monarchy Enterprises S.á.r.l.",
    "published": "2 days ago"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "Yariv Milchan (PRODUCER) is the <strong>Chairman and CEO of the Academy Award®-winning New Regency Productions</strong> where he oversees the day-to-day management, creative direction, and overall growth strategy of the company.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between Arnon Milchan, Scriba &amp; Deyle and Canal+ to finance 20 films in five years, with New Regency Productions acting as its production and sales arm. The company was originally known as Embassy International Pictures from 1982 until 1991.",
    "published": "2 weeks ago"
  },
  {
    "title": "Regency Enterprises",
    "url": "https://grokipedia.com/page/Regency_Enterprises",
    "snippet": "The company produced Oscar winners ... of Brad Weston as president amid discussions of increased film output, <strong>Arnon Milchan retained control</strong>, with his son Yariv Milchan assuming the role of Chairma...",
    "published": null
  }
]