[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first <strong>Simonyi Professor for the Public Understanding of Science</strong>, a position he held until 2008, and ...",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins: A Biography | Discovery Institute",
    "url": "https://www.discovery.org/a/10291/",
    "snippet": "The most readily recognizable figure in the Darwin debate, Dawkins retired in 2008 as <strong>Professor for Public Understanding of Science</strong> at Oxford University, a position he held from 1995, by which time he had effectively discontinued his career ...",
    "published": "October 15, 2024"
  },
  {
    "title": "Biography:Richard Dawkins - HandWiki",
    "url": "https://handwiki.org/wiki/Biography:Richard_Dawkins",
    "snippet": "In 1995, he was appointed Simonyi Professor for the Public Understanding of Science at Oxford, a position that had been endowed by Charles Simonyi with the express intention that the holder &quot;be expected to make important contributions to the public understanding of some scientific field&quot;,[32] and that its first holder should be Richard Dawkins.[33] He held that professorship from 1995 until 2008.[34]",
    "published": "March 9, 2024"
  },
  {
    "title": "Richard Dawkins | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/richarddawkins/",
    "snippet": "One of the most respected scientists ... the catalyst who galvanizes it. From 1995 to 2008 Richard Dawkins was the <strong>Charles Simonyi Professor of the Public Understanding of Science at Oxford University</strong>....",
    "published": "April 21, 2022"
  },
  {
    "title": "Richard Dawkins: everything you need to know about the world’s most famous atheist | The Standard",
    "url": "https://www.standard.co.uk/culture/richard-dawkins-professor-atheist-free-speech-b1100953.html",
    "snippet": "He became a fellow of New College in the city in 1970 and has led a predominantly academic life. He became the <strong>Simonyi Professor for the Public Understanding of Science</strong> at Oxford in 1995, a position which he held until 2008.",
    "published": "August 16, 2023"
  }
]