[
  {
    "title": "Longview Aviation Capital Portfolio Investments, Longview Aviation Capital Funds, Longview Aviation Capital Exits",
    "url": "https://www.cbinsights.com/investor/longview-aviation-capital",
    "snippet": "Their latest acquisition was <strong>Bombardier - Dash 8 &amp; De Havilland Businesses</strong> on June 11, 2019. ... Longview Aviation Capital has 1 strategic partners and customers.",
    "published": null
  },
  {
    "title": "Longview Aviation revenue set to take off with Bombardier Q400 turboprop acquisition - The Globe and Mail",
    "url": "https://www.theglobeandmail.com/business/article-longview-aviation-revenue-set-to-take-off-with-bombardier-q40/",
    "snippet": "Victoria-based Longview Aviation Capital Corp. is set to become the continent’s largest commercial turboprop-aircraft manufacturer with the <strong>$300-million acquisition of Bombardier Inc.</strong>’s Q400 turboprop business and the storied de Havilland brand.",
    "published": "November 8, 2018"
  },
  {
    "title": "Viking Air - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Viking_Air",
    "snippet": "The company is a subsidiary of Longview Aviation Capital, which is owned by <strong>Sherry Brydson</strong>, granddaughter of deceased newspaper magnate Roy Thomson and cousin of David Thomson, parties of the largest family fortune in Canada. In May 2005, the company subsequently purchased the parts and service ...",
    "published": "October 25, 2025"
  },
  {
    "title": "Longview Aviation – Canadian Aviation News",
    "url": "https://canadianaviationnews.wordpress.com/tag/longview-aviation/",
    "snippet": "But the bottom line is, if they’re ... career working at the Downsview plant in the 1970s. <strong>Longview bought the turboprop program from Bombardier for $300 million in June 2019</strong> and formed a holding company called De Havilland Aircraft ...",
    "published": null
  },
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "<strong>DHC was eventually acquired by Montreal-based Bombardier Aerospace in 1992</strong> after cumulative losses of US$636 million over five years under Boeing. In 2006, Viking Air of Victoria, British Columbia, purchased the type certificates for all the original out-of-production de Havilland Canada designs ...",
    "published": "1 month ago"
  }
]