[
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "<strong>Fabien Galthié</strong> (French pronunciation: [fabjɛ̃ ɡaltie]; born 20 March 1969) is a French rugby union coach and former player, currently the head coach of the France national team.",
    "published": "3 weeks ago"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "After the 2023 Rugby World Cup, Ghezal, Labit and Giroud left the France coaching staff and were replaced respectively by Stade Français forwards coach <strong>Laurent Sempéré</strong>, former international centre Patrick Arlettaz and Nicolas Jeanjean, who became the head of high performance.",
    "published": "1 week ago"
  },
  {
    "title": "France rugby union team: Fixtures, squad and head coach",
    "url": "https://news.bet365.com/en-gb/article/france-rugby-union-team-profile/2025012409221201023",
    "snippet": "A distinguished former player himself, receiving 64 international caps for Les Bleus as a scrum-half between 1991 and 2003, <strong>Fabien Galthie</strong> became France head coach in 2019. Galthie led France to the Six Nations Grand Slam in 2022 with his coaching philosophy for the team revolving around an ...",
    "published": null
  },
  {
    "title": "Shaun Edwards OBE",
    "url": "https://shaunedwardsrugby.com/",
    "snippet": "Antoine Dupont Captain, France National Rugby Team · <strong>Shaun Edwards</strong> is currently the Defence Coach for the French National Rugby union team. Shaun joined L’equipe de France in 2019 and they went on to win a Grand Slam in 2022.",
    "published": null
  },
  {
    "title": "France national rugby union team coaches - FamousFix.com list",
    "url": "https://m.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "Overview: <strong>Fabien Galthié</strong> (born 20 March 1969) is a French rugby union coach and former player, he is currently the head coach of the French national team. His usual position was at scrum-half.",
    "published": null
  }
]