[
  {
    "title": "Mauricio Pochettino leaves Chelsea after 1 season in charge - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/39463151/mauricio-pochettino-chelsea-manager-leaves-1-season",
    "snippet": "Sources told ESPN that there has been a split for some time within the Chelsea hierarchy over whether to persist with Pochettino after a disappointing campaign in which they were languishing in midtable despite spending £1 billion ($1.27 billion) on new players since the Boehly-Clearlake Capital takeover of May 2022. Sources told ESPN that Boehly was keen on retaining Pochettino but Eghbali wanted to replace him with a new coach.",
    "published": "May 21, 2024"
  },
  {
    "title": "Mauricio Pochettino to become Chelsea head coach | News | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/news/article/mauricio-pochettino-to-become-chelsea-head-coach",
    "snippet": "We are delighted that Mauricio will be joining Chelsea. Mauricio is a world-class coach with an outstanding track record. We are all looking forward to having him on board.&#x27; Pochettino is a coach renowned for his sides’ high-energy and eye-catching style and he has built a reputation for ...",
    "published": null
  },
  {
    "title": "Chelsea FC can confirm that the Club and Mauricio Pochettino have mutually agreed to part ways.",
    "url": "https://www.chelseafc.com/en/news/article/club-statement-mauricio-pochettino",
    "snippet": "Sporting Directors Laurence Stewart and Paul Winstanley said: &#x27;On behalf of everyone at Chelsea, we would like to express our gratitude to Mauricio for his service this season. He will be welcome back to Stamford Bridge any time and we wish him all the very best in his future coaching career.&#x27; Mauricio Pochettino said: &#x27;Thank you to the Chelsea ownership group and Sporting Directors for the opportunity to be part of this football club&#x27;s history.",
    "published": null
  },
  {
    "title": "Why Pochettino left Chelsea, and what it reveals about the club - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/40193855/why-chelsea-mauricio-pochettino-split-reveals-club",
    "snippet": "In the end, Chelsea offered £42.5m -- only £2.5m of which were performance-related add-ons -- to land <strong>Palmer</strong> on deadline day, Sept. 1. Nobody can doubt the success of <strong>Palmer</strong>&#x27;s signing, but the methodology reveals a working practice to formulating ...",
    "published": "May 22, 2024"
  },
  {
    "title": "Chelsea: Ruben Amorim, Vincent Kompany, Kieran McKenna to replace Mauricio Pochettino? - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/crggxgqd2keo",
    "snippet": "Chelsea are known to have had a long-term interest in Amorim. An early favourite with some bookmakers. The German, 59, is available and ready to return to management having been out of work since he was sacked by Germany in September 2023. Before that, Flick won 70 of his 86 games in charge of Bayern Munich from November 2019 to June 2021. Under Flick, Bayern won a treble of the domestic league and cup, and the Champions League in the 2019-20 season.",
    "published": "May 21, 2024"
  }
]