[
  {
    "title": "UC Riverside Provost Cynthia K. Larive to become UC Santa Cruz’s 11th chancellor | University of California",
    "url": "https://www.universityofcalifornia.edu/press-room/uc-riverside-provost-cynthia-k-larive-become-uc-santa-cruzs-11th-chancellor",
    "snippet": "Larive has been the <strong>provost and executive vice chancellor</strong> at UC Riverside since 2017. Since 2005, she has held a variety of increasingly important, wide-ranging roles on the campus, including chair of the department of chemistry, divisional ...",
    "published": "November 8, 2021"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Larive came to UC Santa Cruz from UC Riverside, where she was <strong>provost and executive vice chancellor</strong>. As provost, she was responsible for the academic enterprise, managing large-scale initiatives as well as the academic operations of the Riverside campus. Over her career at UCR, she served in ...",
    "published": null
  },
  {
    "title": "Provost Cynthia K. Larive | Inside UCR",
    "url": "https://insideucr.ucr.edu/tag/provost-cynthia-k-larive",
    "snippet": "UC Riverside paid tribute to departing Provost and <strong>Executive Vice Chancellor</strong> Cynthia K. Larive at a farewell reception June 10 at the Alumni and Visitors Center packed with well-wishers. Larive has been appointed as UC Santa Cruz chancellor effective July 1.",
    "published": null
  },
  {
    "title": "Cynthia Larive to become 11th chancellor of UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2019/05/chancellor-designate/",
    "snippet": "Cynthia K. Larive as the eleventh chancellor of UC Santa Cruz. Currently the <strong>provost and executive vice chancellor</strong> at UC Riverside, Larive has served the UC community for nearly a decade and a half as a faculty member, administrator ...",
    "published": "May 13, 2025"
  },
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "In February 2017, Larive was appointed <strong>interim provost and executive vice chancellor</strong> for University of California, Riverside, and the appointment was made permanent in October.",
    "published": "July 15, 2025"
  }
]