[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "<strong>Pierre Trudeau</strong> and his sons returned to the prime minister&#x27;s official residence after the February 1980 election that returned him to the Prime Minister&#x27;s Office. His father had intended Trudeau to begin his formal education at a French-language lycée, but Trudeau&#x27;s mother convinced his father ...",
    "published": "4 days ago"
  },
  {
    "title": "List of prime ministers of Canada by academic degrees - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Canada_by_academic_degrees",
    "snippet": "This is a list of the prime ministers of Canada by their academic degrees. The following list does not include honorary degrees conferred to the prime minister. Four future prime ministers attended the University of Toronto, three prime ministers the University of British Columbia, Université ...",
    "published": "July 27, 2025"
  },
  {
    "title": "Prime Ministers of Canada | Historica Canada Education Portal",
    "url": "http://education.historicacanada.ca/en/tools/255",
    "snippet": "We welcome feedback regarding the content that may be linked to or included in these learning tools; email us at education@HistoricaCanada.ca. The student will identify Canada’s Prime Ministers since Confederation and place the Prime Ministers along a time line.",
    "published": null
  },
  {
    "title": "Prime Minister of Canada Justin Trudeau | UN Office for Partnerships",
    "url": "https://unpartnerships.un.org/prime-minister-canada-justin-trudeau",
    "snippet": "This background helped spark his passion for public service and shaped his conviction that diversity is Canada’s strength. Justin <strong>studied literature at McGill University, graduating with a Bachelor of Arts (B.A.) in 1994</strong>.",
    "published": null
  },
  {
    "title": "Canadian PMs’ Higher Education Experiences | HESA",
    "url": "https://higheredstrategy.com/canadian-pms-higher-education-experiences/",
    "snippet": "Eighteen: The number of Prime Ministers with university degrees. Of the five who did not have one, three were the aforementioned lawyers. The other two were Alexander Mackenzie, who apprenticed in Stonemasonry, and Mackenzie Bowell who had a teaching diploma (not a higher education credential back then) from a long-defunct Normal School in Hastings, Ontario.",
    "published": "December 1, 2015"
  }
]