[
  {
    "title": "HEM : The first Higher School of Management, Business, and Technology - Engineering in Morocco",
    "url": "https://hem.lcieducation.com/en",
    "snippet": "<strong>HEM Business &amp; Engineering School has earned top recognition in the Eduniversal Best Masters 2025 ranking</strong>, achieving first place in Morocco and Africa in the General Management and Finance categories.",
    "published": null
  },
  {
    "title": "Com Hem AB - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn",
    "url": "https://tracxn.com/d/companies/com-hem-ab/__C72ILG9J1X0WjTdDonjKDs7MlEgXfBRoW-3D_-KNVmk",
    "snippet": "Com Hem AB&#x27;s latest funding was a $215M Conventional Debt round on Jun 10, 2016, with participation from .",
    "published": "November 11, 2025"
  },
  {
    "title": "Com Hem repeats guidance as Q2 core profit just beats forecast | Reuters",
    "url": "https://www.reuters.com/article/com-hem-results-idUSL8N19Y0VI/",
    "snippet": "* CEO on consolidation in Sweden: &quot;For a long time, one thought that Sweden was immune to consolidation, but that&#x27;s not the case, we have seen that now,&quot; as <strong>Com Hem is buying Boxer</strong>, Tele2 is buying the Swedish business of TDC",
    "published": "July 12, 2016"
  },
  {
    "title": "Future Homes Standard 2025 Round-Up: SAP, HEM and What’s Coming Next - Elmhurst Energy",
    "url": "https://www.elmhurstenergy.co.uk/blog/2025/12/10/future-homes-standard-2025-round-up-sap-hem-and-whats-coming-next/",
    "snippet": "<strong>SAP 10.3 uses the Future Home Standard notional dwelling, revised primary energy and carbon factors to calculate compliance with the Future Home Standard</strong>. Our updated Design SAP 10 application, with SAP 10.3 changes incorporated, will be released ...",
    "published": "2 weeks ago"
  },
  {
    "title": "All About Hem",
    "url": "https://allabouthem.com/",
    "snippet": "Your source for news, discography, lyrics, tour dates, interviews, and more all about the band Hem",
    "published": null
  }
]