[
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "The French interpretation of the agreement made with the installation of Wim Duisenberg as ECB President was that Duisenberg would resign after just four years of his eight-year term, and would be replaced by the Frenchman Jean-Claude Trichet.",
    "published": "September 25, 2025"
  },
  {
    "title": "European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Central_Bank",
    "snippet": "The ECB Supervisory Board meets twice a month to discuss, plan and carry out the ECB&#x27;s supervisory tasks. It proposes draft decisions to the Governing Council under the non-objection procedure. It is composed of Chair (appointed for a non-renewable term of five years), Vice-chair (chosen from ...",
    "published": "2 days ago"
  },
  {
    "title": "England and Wales Cricket Board - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/England_and_Wales_Cricket_Board",
    "snippet": "The ECB is run by an executive management team that reports directly to the chief executive officer (CEO). <strong>Richard Gould took over as permanent CEO in February 2023, replacing Clare Connor, who had held the office on an interim basis since May 2022</strong>. He in turn reports to the Chairman of the ...",
    "published": "1 week ago"
  },
  {
    "title": "Executive Board",
    "url": "https://www.ecb.europa.eu/ecb/decisions/eb/html/index.en.html",
    "snippet": "to manage the day-to-day business of the ECB; to exercise certain powers delegated to it by the Governing Council. These include some of a regulatory nature. Christine Lagarde · President of the ECB · Luis de Guindos · Vice-President of the ECB · Piero Cipollone ·",
    "published": "November 13, 2023"
  },
  {
    "title": "England and Wales Cricket Board (ECB) - The Official Website of the ECB",
    "url": "https://www.ecb.co.uk/about/who-we-are/our-board",
    "snippet": "He is currently Chief Executive Officer of the British American Football Association, and Chair of Trustees of Wembley National Stadium Trust. Other previous roles include Head of Participation for the Football Association. Pete is the ECB Board Lead for Welfare.",
    "published": null
  }
]