[
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The International Mathematical Union (IMU) is an international organization devoted to international cooperation in the field of mathematics across the world. It is a member of the International Science Council (ISC) and supports the International Congress of Mathematicians (ICM).",
    "published": "February 24, 2025"
  },
  {
    "title": "| International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/",
    "snippet": "Since 2013, the IMU has received very generous funding from the Simons Foundation for several travel research programs, crucial for our colleagues from developing countries, including the current IMU Simons Research Fellowship Program. ICM 2026 Program Committee Chair <strong>Claire Voisin</strong> (CNRS, Institut ...",
    "published": null
  },
  {
    "title": "IMU Executive Committee | International Mathematical Union Leadership 2023-2026",
    "url": "https://www.mathunion.org/organization/imu-executive-committee",
    "snippet": "Meet the IMU Executive Committee members leading the International Mathematical Union for 2023-2026. Learn about their roles and bios.",
    "published": null
  },
  {
    "title": "International Mathematical Union (IMU) - International Science Council",
    "url": "https://council.science/member/imu-international-mathematical-union/",
    "snippet": "The International Mathematical Union (IMU) was founded in 1920 and has existed in its current form since 1951. It is an international non-governmental and non-profit scientific organization, with the purpose of promoting international cooperation in mathematics, supporting and assisting the ...",
    "published": "March 10, 2025"
  },
  {
    "title": "IMU Secretariat | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/organization/imu-secretariat",
    "snippet": "Under the supervision of the IMU ... for the International Commission on Mathematical Instruction (ICMI) and the Commission for Developing Countries (CDC). The IMU Secretariat also hosts the IMU archive. ... The Secretary General is responsible for conducting the ordinary business of the Union and for keeping ...",
    "published": null
  }
]