[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Among the key activities of the IAU is serving as a forum for scientific conferences. It sponsors nine annual symposia and holds a triannual General Assembly that sets policy and includes various scientific meetings. The Union is best known for being the leading authority in assigning official names and designations to astronomical objects, and for setting uniform definitions for astronomical principles.",
    "published": "3 weeks ago"
  },
  {
    "title": "IAU represented at events - IAU",
    "url": "https://www.iau-aiu.net/IAU-at-events",
    "snippet": "16 December Higher Education at a Crossroads: Envisioning Future Scenarios for the Field and for Society IAU Secretary General Hilligje van’t Land was invited to be the first speaker opening the Tokyo College series Higher Education at a Crossroads: Envisioning Future Scenarios for the Field and for Society on 16 December 2022.",
    "published": null
  },
  {
    "title": "IAEA Board of Governors Elects New Chairperson for 2025",
    "url": "https://www.iaea.org/newscenter/news/iaea-board-of-governors-elects-new-chairperson-for-2025",
    "snippet": "In a special meeting today the IAEA Board of Governors elected Ambassador <strong>Matilda Aku Alomatu Osei-Agyeman</strong> of Ghana as its Chairperson for 2025.",
    "published": "March 18, 2025"
  },
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "Dr. Hilligje van’t Land serves the global higher education community as Secretary General of the International Association of Universities (IAU) - a global NGO with UNESCO Associate Status. The IAU will celebrate its 75th Anniversary in 2025.",
    "published": null
  },
  {
    "title": "Homepage - IAU General Assembly 2024 - Cape Town",
    "url": "https://astronomy2024.org/",
    "snippet": "https://astronomy2024.org/wp-content/uploads/2024/02/IMG_20230731_103032-1.jpg 1080 1920 ramv https://astronomy2024.org/wp-content/uploads/2024/02/IAU-logo-date-transparent.png ramv2025-02-05 12:58:292025-02-05 13:05:34Inspire the Future of Astronomy and STEM in South Africa! ... https://astronomy2024.org/wp-content/uploads/2025/01/41550_2024_2448_Fig1_HTML.webp 301 685 ramv https://astronomy2024.org/wp-content/uploads/2024/02/IAU-logo-date-transparent.png ramv2025-01-07 15:40:452025-01-23 14:15:32Nature Comment: Accessible hybrid conferences are possible and affordable at large scale",
    "published": "July 4, 2025"
  }
]