[
  {
    "title": "New Athletes' Commission members announced | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/athletes-commission-members-2025-2029",
    "snippet": "The six seats that were available for election in 2025 include the Deputy Chair position, which will be voted on by the Athletes’ Commission now the elections have been held. The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December 2016. Since 2019, the Chairperson ...",
    "published": null
  },
  {
    "title": "Candidates announced for 2025 Athletes' Commission elections | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/candidates-2025-athletes-commission-elections",
    "snippet": "The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December 2016. Since 2019, the Chairperson and one other member of the Athletes’ Commission – one man ...",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "British former athlete and businessman Jon Ridgeon was appointed to the role in December 2018. Olivier Gers was the first person to officially hold the position in 2016, succeeding the interim CEO/General Secretary Jean Gracia. In order to give active athletes a voice in the governance of the sport, World Athletics created the Athletes&#x27; Commission. Athletes are elected to the commission by other athletes, typically held at the Congress attached to the World Athletics Championships. The commission chairperson and one other athlete of the opposite sex are given voting rights on the Council.",
    "published": "1 week ago"
  },
  {
    "title": "‘Your column was very unfair’: what happened when I met World Athletics CEO | Athletics | The Guardian",
    "url": "https://www.theguardian.com/sport/2025/dec/02/athletics-joining-sports-goliaths-long-way-to-go",
    "snippet": "And the biggest sporting event in the world in 2025 was our event in Tokyo. I don’t say this complacently, but it says growth, right?” · He’s not finished. “And we’re not just sitting passively back going: ‘Gen Z is tough – let’s rely on our middle-aged audience!’” · But there is a glint in his eye when Ridgeon talks and explains that World Athletics had 700 million video views on its social media channels at the world championships in September – double that of Budapest two years ago.",
    "published": "2 weeks ago"
  },
  {
    "title": "World Athletics aims to build on successful year and forge lasting geopolitical relationships during unprecedented 2026 | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/successful-year-lasting-geopolitical-relationships-unprecedented-2026",
    "snippet": "World Athletics President <strong>Sebastian Coe</strong> reflected on a successful year for the organisation at the 239th World Athletics Council Meeting in Monaco and reinforced how 2026 offers an unprecedented opportunity to build lasting geopolitical and ...",
    "published": null
  }
]