[
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "Although he was a political novice, ... into a solid electoral base. <strong>He won a landslide victory over incumbent Petro Poroshenko in the second round of the 2019 presidential election</strong>....",
    "published": "September 27, 2019"
  },
  {
    "title": "The Three Ages of Zelensky’s Presidency | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/three-ages-zelenskys-presidency",
    "snippet": "The program of Zelensky and his ... Poroshenko (2014–2019) and its taint of corruption, <strong>to vest their hopes for the future in a person who had no connection to the</strong> ......",
    "published": null
  },
  {
    "title": "2019 Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2019_Ukrainian_presidential_election",
    "snippet": "The Central Election Commission (CEC) announced that Zelenskyy won the second round with 73.22% of the total vote (or 74.96% of the valid vote). The elections were recognized as free and fair by the Organization for Security and Co-operation in Europe. Poroshenko became the third incumbent Ukrainian president to directly lose reelection, after Viktor Yushchenko in 2010 and Leonid Kravchuk in 1994 (only Leonid Kuchma has ever won reelection, in 1999).",
    "published": "1 week ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "After months of ambiguous statements, on 31 December, less than four months from the election, Zelenskyy announced his candidacy for president of Ukraine on the New Year&#x27;s Eve evening show on the TV channel 1+1. His announcement up-staged the New Year&#x27;s Eve address of incumbent president Petro Poroshenko on the same channel, which Zelenskyy said was unintentional and attributed to a technical glitch.",
    "published": "4 days ago"
  },
  {
    "title": "r/ukraine on Reddit: People should never forget that Poroshenko was equally as great of a president as Zelensky",
    "url": "https://www.reddit.com/r/ukraine/comments/tksjen/people_should_never_forget_that_poroshenko_was/",
    "snippet": "Poroshenko&#x27;s government was instrumental in many important reforms, yes, but he also tried to sit on two chairs at once, with little action against oligarchs and corruption. He was a much better president than any before him, but I believe he could&#x27;ve done significantly better. ... it sounds like ukraine needed him and zelenskyy back to back....",
    "published": "March 23, 2022"
  }
]