[
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "<strong>Jawaharlal Nehru</strong> was India&#x27;s first prime minister, serving as prime minister of the Dominion of India from 15 August 1947 until 26 January 1950, and thereafter of the Republic of India until his death in May 1964. (India conducted its first post-independence general elections in 1952).",
    "published": "1 day ago"
  },
  {
    "title": "Former Prime Ministers | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former-prime-ministers/",
    "snippet": "Shri H. D. <strong>Deve Gowda</strong>, a staunch crusader of socio-economic development and an ardent admirer of the rich cultural heritage of India, was born on May 18, 1933 in Haradanahalli village of Holenarasipura taluk, Hassan District in Karnataka. A Civil Engineering Diploma holder, Shri <strong>Deve Gowda</strong> ...",
    "published": null
  },
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "The prime minister controls the selection and dismissal of members of the Union Council of Ministers and allocation of posts to members within the government. The longest-serving prime minister was the first prime minister, <strong>Jawaharlal Nehru</strong>, whose tenure lasted 16 years and 286 days.",
    "published": "3 days ago"
  },
  {
    "title": "PM Sangrahlaya - a Tribute to India's Prime Ministers",
    "url": "https://www.pmsangrahalaya.gov.in/prime-ministers-of-india",
    "snippet": "The Pradhanmantri Sangrahalaya in New Delhi is a tribute by our nation to the Prime Ministers who rebuilt India after Independence",
    "published": null
  },
  {
    "title": "Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/",
    "snippet": "BBBP addresses the declining Child Sex Ratio (CSR) and related issues of women empowerment over a life-cycle continuum. It is a tri-ministerial effort of Ministries of Women and Child Development, Health &amp; Family ... View More · Dynamic, dedicated and determined, <strong>Narendra Modi</strong> arrives as a ...",
    "published": "6 hours ago"
  }
]