[
  {
    "title": "All change or small change? Ukrainian government reshuffle – DW – 07/17/2025",
    "url": "https://www.dw.com/en/why-did-ukrainian-president-volodymyr-zelenskyy-reshuffle-the-government/a-73314326",
    "snippet": "His deputy Yulia Svyrydenko, who played a part in closing a minerals deal with the US, is Ukraine&#x27;s new prime minister · https://p.dw.com/p/4xcP8 · <strong>Yulia Svyrydenko was approved as prime minister on July 17, 2025</strong> · Advertisement · Rumors ...",
    "published": "July 17, 2025"
  },
  {
    "title": "Ukraine’s government reshuffle aims to boost national resilience – and repair relations with Trump",
    "url": "https://www.chathamhouse.org/2025/07/ukraines-government-reshuffle-aims-boost-national-resilience-and-repair-relations-trump",
    "snippet": "<strong>On 17 July the Ukrainian Parliament approved Yulia Svyrydenko – previously first deputy prime minister and economy minister – as prime minister, alongside a new cabinet</strong>. In part, the reshuffle is an attempt to maintain Western military and ...",
    "published": "August 14, 2025"
  },
  {
    "title": "Ukraine's prime minister resigns, opening the door to a broad government reshuffle - The Washington Post",
    "url": "https://www.washingtonpost.com/business/2025/07/15/russia-ukraine-war-government-reshuffle/7e7ba70e-6193-11f0-bf70-56d8888ebb94_story.html",
    "snippet": "Ukrainian President Volodymyr Zelenskyy, left, and United States Special Envoy for Ukraine and Russia, Joseph Keith Kellogg pose for a photo in Kyiv, Ukraine, Monday, July 14, 2025. (Ukrainian Presidential Press Office via AP) (Uncredited/Ukrainian Presidential Press Office) ... KYIV, Ukraine — Ukraine’s prime minister announced his resignation Tuesday in the first formal step of what is expected to be a significant reshuffle of President Volodymyr Zelenskyy’s government, which could also see the country’s ambassador to Washington replaced.",
    "published": "July 15, 2025"
  },
  {
    "title": "Ukraine’s new Cabinet eliminates ministries, consolidates under Svyrydenko's leadership / The New Voice of Ukraine",
    "url": "https://english.nv.ua/nation/ukraine-s-new-cabinet-eliminates-ministries-consolidates-under-svyrydenko-s-leadership-50531356.html",
    "snippet": "This restructuring follows the Ukrainian parliament’s dismissal of Denys Shmyhal as prime minister on July 16. Shmyhal had held the post for over five years — the longest tenure of any Ukrainian prime minister since independence. He was succeeded by Yuliia Svyrydenko, who previously served as first deputy prime minister and economy minister.",
    "published": "July 21, 2025"
  },
  {
    "title": "What Will a Change of Prime Minister Mean for Ukraine? | Carnegie Endowment for International Peace",
    "url": "https://carnegieendowment.org/russia-eurasia/politika/2025/07/ukraine-government-reshuffle?lang=en",
    "snippet": "Since then, the cabinet’s composition has changed several times: <strong>half of the ministers were replaced last summer alone</strong>. Shmyhal somehow survived that purge, but by July 2025, he was one of just three “old-timers” left.",
    "published": null
  }
]