[
  {
    "title": "Jonathan Kodjia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jonathan_Kodjia",
    "snippet": "Jonathan Adjo Kodjia (born 22 October 1989) is a professional footballer who plays as a forward for Championnat National club <strong>Versailles</strong>.",
    "published": "October 3, 2025"
  },
  {
    "title": "Jonathan Kodjia",
    "url": "https://grokipedia.com/page/Jonathan_Kodjia",
    "snippet": "Kodjia played amateur football in the Paris suburbs at a district level, including for local clubs such as Stains, and had an unsuccessful trial at the prestigious INF Clairefontaine academy.[12] At age 17 in 2007, he nearly quit the sport to focus on his studies, having earned a baccalaureate in accountancy.[10][12] Following intervention from his mother, he joined Noisy-le-Sec, a club at national level, which led to a trial and signing of his first semi-professional contract with Reims&#x27; youth setup in March 2008 at age 17.5, where he trained full-time while balancing part-time work.[12][10]",
    "published": null
  },
  {
    "title": "Jonathan Kodjia Stats, Goals, Records, Assists, Cups and more | FBref.com",
    "url": "https://fbref.com/en/players/ecf44e09/Jonathan-Kodjia",
    "snippet": "Check out the latest domestic and international stats, match logs, goals, height, weight and more for Côte d&#x27;Ivoire men&#x27;s national team, <strong>Aston Villa FC and Bristol City FC</strong> playing for Jonathan Kodjia in the Africa Cup of Nations, Premier League ...",
    "published": null
  },
  {
    "title": "Jonathan Kodjia - Everything for Football ⚽",
    "url": "https://everythingforfootball.co.uk/player/jonathan-kodjia/",
    "snippet": "Jonathan Kodjia. Ivory Coast. Umm-Salal. Updated information and stats about Jonathan Kodjia. History, latest matches played, goals, injuries and most important transfers.",
    "published": null
  },
  {
    "title": "Jonathan Kodjia's Ultimate Team History | FUTWIZ",
    "url": "https://www.futwiz.com/en/player/history/189099",
    "snippet": "In total, Jonathan Kodjia has played for <strong>4 different clubs</strong> in Ultimate Team.",
    "published": null
  }
]