[
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Jennifer Westacott AC is an <strong>Australian business executive</strong>. She served as the chief executive of the Business Council of Australia (BCA) from 2011 to 2023. She is the current chancellor of Western Sydney University. She grew up in Springfield in New South Wales, Australia and completed her secondary ...",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "She is Chair of Bradfield Development Authority (formerly the Western Parkland City Authority), Studio Schools of Australia and Future Generation Global. Jennifer is a <strong>director of Atco Australia and Patron of The Pinnacle Foundation</strong>. She is Chancellor of Western Sydney University and a member ...",
    "published": null
  },
  {
    "title": "Jennifer Anne Westacott, Business Council of Australia: Profile and Biography - Bloomberg Markets",
    "url": "https://www.bloomberg.com/profile/person/18010862",
    "snippet": "Jennifer Anne Westacott is <strong>Chief Executive Officer at Business Council of Australia</strong>. See Jennifer Anne Westacott&#x27;s compensation, career history, education, &amp; memberships.",
    "published": null
  },
  {
    "title": "Jennifer Westacott - Chancellor @ Western Sydney University - Crunchbase Person Profile",
    "url": "https://www.crunchbase.com/person/jennifer-westacott",
    "snippet": "Jennifer Westacott currently works as a <strong>Chancellor for Western Sydney University</strong>. She previously worked at Business Council of Australia as a Chief Executive.",
    "published": null
  },
  {
    "title": "Dr Jennifer Westacott AO | Celebrating UNSW Women",
    "url": "https://www.celebratingwomen.unsw.edu.au/profile/dr-jennifer-westacott-ao",
    "snippet": "Dr Jennifer Westacott AO has served as <strong>Chief Executive of the Business Council of Australia since 2011.</strong> She completed a Bachelor of Arts (Honours) in 1982 at UNSW and later received an Honorary Doctor of Letters, in 2017.",
    "published": null
  }
]