[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "World Athletics Gender Leadership Taskforce (2018-present) Athletes’ Commission Member (2001-2003) World Athletics Human Rights Working Group Member (2020-2021) World Athletics Bid Evaluation Panel Member (2021-present) World Athletics Risk Committee Member (2020-present) Atletismo Suramericano Board Member (2019-present) ConSudAtle Athletes’ Commission Member (2017-2023) Universidad Catolica track and field Team head coach (2006-2011) Club Deportivo Universidad Católica Track and Field Board Member (2011-present) Organising Committee of Santiago 2023 Pan-American Games Technical Director ·",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "However, the organization retained the word amateur in its name until its 2001 congress, at which it changed its name to the International Association of Athletics Federations. In June 2019 the organization chose to rebrand as World Athletics, with a rollout beginning after the 2019 World Championships in Doha.",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Honorary President of the Association of the Balkan Athletics Federations (since 2021) Lecturer at the National Sports Academy in Sports Management since 1994 ... Served as Secretary for Uganda Sports Women Association, (1998-2000) an organisation whose functions were later mainstreamed in National Olympic Committee and National Federations for purposes of sustainability · Chef de Mission XXI Commonwealth Games, Gold Coast 2018, Australia ... Secretary LOC, IAAF World Cross Country Kampala 2017 for a period of three years (2014-2017) from bid process to implementation of the project;",
    "published": null
  },
  {
    "title": "The Past Presidents of the IAAF | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/the-past-presidents-of-the-iaaf",
    "snippet": "He was also head of England&#x27;s Amateur Athletic Association from <strong>1936 to 1976</strong>. After service during World War II as the governor of Bermuda, Burghley was an instrumental part of the organisation of the 1948 Olympic Games in London.",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "He was among the organisers of ... Congress on 17 July 1912, which lead to the formation of the IAAF. The hallmark of his <strong>34 years</strong> as president was a staunch defence of amateurism but his highly skilful leadership...",
    "published": null
  }
]