[
  {
    "title": "DFG, German Research Foundation - Professor Dr. Katja Becker - President of the DFG",
    "url": "https://www.dfg.de/en/about-us/statutory-bodies/executive-committee/members/becker",
    "snippet": "<strong>President of the DFG</strong>, Professor Dr. Katja Becker",
    "published": null
  },
  {
    "title": "Katja Becker elected DFG President for another four years",
    "url": "https://idw-online.de/de/news816847",
    "snippet": "Katja Becker will continue to hold the position of <strong>President of the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) for another four years</strong>. The General Assembly of the largest research funding organisation and central self-governing organisation for science and the humanities ...",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - Katja Becker elected DFG President for another four years",
    "url": "https://www.dfg.de/en/service/press/press-releases/2023/press-release-no-22",
    "snippet": "Katja Becker will continue to hold the position of <strong>President of the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) for another four years</strong>. The General Assembly of the largest research funding organisation and central ...",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - Katja Becker Elected President of the DFG",
    "url": "https://www.dfg.de/en/service/press/press-releases/2019/press-release-no-24",
    "snippet": "The Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) has elected its <strong>first female president</strong>. On 3 July 2019, biochemist and medical scientist Prof. Dr. Katja Becker from Justus Liebig University Giessen was elected by the DFG’s ...",
    "published": null
  },
  {
    "title": "Katja Becker | Global Research Council",
    "url": "https://globalresearchcouncil.org/about/governing-board/katja-becker/",
    "snippet": "Professor Katja Becker is the <strong>President of the Deutsche Forschungsgemeinschaft</strong> (DFG, German Research Foundation). She studied medicine at Heidelberg University, where she also obtained her doctoral degree and habilitation. After a position at the Center for Infectious Diseases, Würzburg ...",
    "published": null
  }
]