[
  {
    "title": "IRI - Wikipedia",
    "url": "https://it.wikipedia.org/wiki/IRI",
    "snippet": "L&#x27;operazione fu l&#x27;applicazione in larga scala di quanto era già stato abbozzato con l&#x27;INA, ovvero l&#x27;organizzazione del piccolo risparmio che le banche, vincolate in legami a doppio filo con il sistema industriale, non riuscivano ad impiegare in reali processi di sviluppo. In questo modo l&#x27;IRI, e quindi lo Stato, smobilizzò le banche miste, diventando contemporaneamente proprietario di oltre il 20% dell&#x27;intero capitale azionario nazionale e di fatto il maggiore imprenditore italiano con aziende come Ansaldo, Terni, Ilva, SIP, SME, Alfa Romeo, Navigazione Generale Italiana, Lloyd Triestino di Navigazione, Cantieri Riuniti dell&#x27;Adriatico.",
    "published": "3 weeks ago"
  },
  {
    "title": "Alfa Romeo SpA | luxury cars, performance vehicles, Italian design | Britannica Money",
    "url": "https://www.britannica.com/money/Alfa-Romeo-SpA",
    "snippet": "Alfa Romeo SpA, Italian manufacturer ... company was <strong>operated by the Italian government through its state holding company, IRI (Istituto per la Ricostruzione Industriale), until 1986, when it was sold to Fiat SpA</strong>....",
    "published": null
  },
  {
    "title": "Istituto per la Ricostruzione Industriale - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Istituto_per_la_Ricostruzione_Industriale",
    "snippet": "IRI invested very large amounts in southern Italy, such as in the construction of Italsider in Taranto, Alfasud Pomigliano d&#x27;Arco and Pratola Serra in Irpinia. Others were planned but never carried out, such as the steelworks of Gioia Tauro.",
    "published": "November 14, 2025"
  },
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Under the control of the industrial ... (IRI), <strong>Alfa Romeo initially continued making its signature custom luxury vehicles, but following the financial hardship of World War II, shifted to mass-producing small vehicles</strong>...",
    "published": "3 weeks ago"
  },
  {
    "title": "Istituto per la Ricostruzione Industriale S.p.A. | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/books/politics-and-business-magazines/istituto-la-ricostruzione-industriale-spa",
    "snippet": "In any case where the private entrepreneur is able to do it, we should study the opportunity for privatization.” Prodi did more than study the opportunity; <strong>by 1988, he had privatized 29 different companies, including the car maker Alfa Romeo and the commercial bank Mediobanca</strong>.",
    "published": null
  }
]