[
  {
    "title": "Unai Emery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Unai_Emery",
    "snippet": "<strong>Unai Emery Etxegoien</strong> (born 3 November 1971) is a Spanish football manager and former player who is the head coach of Premier League club Aston Villa. He is widely regarded as one of the best managers in the world. Since 2021, he is also the majority shareholder of fourth-tier Spanish club Real ...",
    "published": "1 day ago"
  },
  {
    "title": "Unai Emery Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/7247/unai-emery/overview",
    "snippet": "His time in north London would come to an end in November 2019 and Emery would take over at Villarreal in 2020, winning the Europa League again, this time with a penalty shootout victory over Manchester United. He returned to the Premier League in October 2022, replacing Steven Gerrard at Aston Villa, who were 16th at the time.",
    "published": null
  },
  {
    "title": "Aston Villa Coaching Staff - Aston Villa News",
    "url": "https://www.astonvilla.news/club/coaching-staff/",
    "snippet": "In the following season, the Spaniard’s side did remarkably well to qualify for the Champions League, seeing off Tottenham for fourth position in the table. <strong>Pako Ayestaran</strong> joined the coaching staff at Aston Villa following Emery’s arrival ...",
    "published": "September 2, 2024"
  },
  {
    "title": "List of Aston Villa F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Aston_Villa_F.C._managers",
    "snippet": "The most successful person to manage the club was <strong>George Ramsay</strong>, who won six FA Cups and six First Division championships in his 42-year reign as secretary. Jimmy McMullan became the first full-time manager in 1934. Aston Villa were the first top-tier club to appoint a manager from outside ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Aston Villa appoint Unai Emery as new head coach | Premier League | NBC Sports - YouTube",
    "url": "https://www.youtube.com/watch?v=kSaXfBcNOPg",
    "snippet": "Danny Higginbotham and Robbie Earle share their instant reactions to Aston Villa&#x27;s decision to tab <strong>Unai Emery</strong> as Steven Gerrard&#x27;s successor. #NBCSports #Prem...",
    "published": "October 24, 2022"
  }
]