[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The paper was founded with the 1897 merger of the Summit Beacon, first published in 1839, and the Akron Evening Journal, founded in 1896. In 1903, the Beacon Journal was purchased by <strong>Charles Landon Knight</strong>. His son John S. Knight inherited the paper, in 1933, on Charles&#x27; death.",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "<strong>The Akron paper was owned by the Knight family for nearly seven decades starting in 1907, and then the Knight Ridder company beginning in 1974</strong>. That company sold the Beacon Journal to McClatchy Co.",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media | Crain's Cleveland Business",
    "url": "https://www.crainscleveland.com/article/20180411/news/157966/akron-beacon-journal-sold-gatehouse-media",
    "snippet": "The Beacon was founded in 1839 as the Summit Beacon. When the paper merged with the Akron Evening Journal in 1897, the Akron Beacon Journal was born. <strong>The Knight family later purchased the paper</strong>, which has won several Pulitzer Prizes.",
    "published": "April 11, 2018"
  },
  {
    "title": "Those were the days in Rubber City … but they had to end – Plain Dealing: Cleveland Journalists Tell Their Stories",
    "url": "https://pressbooks.ulib.csuohio.edu/plain-dealing/chapter/stuart-warner-on-the-glory-days-of-the-akron-beacon-journal/",
    "snippet": "But perhaps the good intentions of the newspaper’s patriarch, John S. Knight, had indirectly created the monster that was devouring the Beacon. Akron was the first of Knight’s newspapers. <strong>He inherited it from his father, and then he and his brother James</strong> transformed his family’s hometown ...",
    "published": "July 31, 2018"
  },
  {
    "title": "Knight Foundation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Knight_Foundation",
    "snippet": "In its first decade, the majority of the Foundation&#x27;s financial resources were provided by contributions from Knight Newspapers, such as the Akron Beacon Journal and the Miami Herald, including gifts from John and James Knight. Other Knight Newspapers also contributed, resulting in a limited number of grants being awarded to those cities. Despite several family ties, the foundation was legally independent of Knight Newspapers.",
    "published": "5 days ago"
  }
]