[
  {
    "title": "Apple Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Apple_Inc.",
    "snippet": "Founded in 1976 as Apple Computer Company by <strong>Steve Jobs, Steve Wozniak and Ronald Wayne</strong>, the company was incorporated by Jobs and Wozniak as Apple Computer, Inc. the following year. It was renamed to its current name in 2007 as the company had expanded its focus from computers to consumer ...",
    "published": "4 hours ago"
  },
  {
    "title": "History of Apple Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Apple_Inc.",
    "snippet": "Apple&#x27;s core product lines are the iPhone smartphone, iPad tablet computer, and the Mac personal computer. The company offers its products online and has a chain of retail stores known as Apple Stores. Founders <strong>Steve Jobs, Steve Wozniak, and Ronald Wayne</strong> created Apple Computer Co.",
    "published": "2 weeks ago"
  },
  {
    "title": "The Founding of Apple Computer, Inc. - This Month in Business History - Research Guides at Library of Congress",
    "url": "https://guides.loc.gov/this-month-in-business-history/april/apple-computer-founded",
    "snippet": "Apple Computer, Inc. was founded on April 1, 1976, by college dropouts <strong>Steve Jobs and Steve Wozniak</strong>, who brought to the new company a vision of changing the way people viewed computers.",
    "published": null
  },
  {
    "title": "Apple Inc. | History, Products, Headquarters, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Apple-Inc",
    "snippet": "<strong>Jobs and Wozniak</strong> each held a 45% stake in the company; Wayne had a 10% partnership stake. To fund their venture with working capital, Jobs sold his Volkswagen minibus and Wozniak his programmable calculator.",
    "published": null
  },
  {
    "title": "Ron Wayne - The third Apple founder - Mac History",
    "url": "https://www.mac-history.net/2022/09/19/ron-wayne-the-third-apple-founder/",
    "snippet": "When you talk about the founders of Apple, you first think of <strong>Steve Jobs and Steve Wozniak</strong>. But there was a third founder: Ronald G. &quot;Ron&quot; Wayne.",
    "published": "November 23, 2022"
  }
]