[
  {
    "title": "1. FC Union Berlin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/1._FC_Union_Berlin",
    "snippet": "The club&#x27;s origins can be traced to 1906, when its predecessor FC Olympia Oberschöneweide was founded. During the Cold War, Union was based in East Berlin, joining the German league structure upon the reunification of the city and country in 1990. From 2009 until 2019, they competed in the 2.",
    "published": "3 weeks ago"
  },
  {
    "title": "Union Berlin: Inside the Rise of a Truly Unique Bundesliga Club | Jobs In Football",
    "url": "https://jobsinfootball.com/blog/union-berlin-inside-the-rise-of-a-truly-unique-bundesliga-club/",
    "snippet": "In a footballing world that&#x27;s been ... <strong>state ownership</strong>, this is a tale of community togetherness and triumph that encapsulates what the sport is all about. Situated in Köpenick, a leafy suburb in East Berlin that was part of communist East ...",
    "published": null
  },
  {
    "title": "Union Berlin’s Stadium Holding Company Expands with 10,000 Shareholders and €30 Million Capital.",
    "url": "https://www.footballbusinessjournal.com/post/union-berlin-s-stadium-holding-company-expands-with-10-000-shareholders-and-30-million-capital",
    "snippet": "During this process, approximately 49,000 new shares were applied for. The club itself subscribed to <strong>40,000 shares</strong>, reinforcing its majority ownership stake, which had already included 6,847 shares.",
    "published": "February 17, 2025"
  },
  {
    "title": "1. FC Union Berlin - Constitution",
    "url": "https://www.fc-union-berlin.de/en/Club/constitution/",
    "snippet": "From the membership of the club in the league, regional and state associations, which for their part are members of the DFB, and from the provisions contained in the statutes of these associations concerning the authority of the DFB statutes and the DFB regulations, it follows that the association and its members acquire the obligations of these provisions of the DFB in their current version.",
    "published": null
  },
  {
    "title": "Union Berlin — the anti-establishment club - Bavarian Football Works",
    "url": "https://www.bavarianfootballworks.com/2022/9/12/23347757/union-berlin-the-anti-establishment-club-bundesliga-champions-league-germany-bayern-munich-city-psg",
    "snippet": "It’s become a world where only the traditional European football powerhouses or the newly bought billionaires’ clubs can compete at the highest level. The European football market is thriving. There’s been an increase in investments after the pandemic — partly due to the economic and political profits for the owners. Football has continued its ‘hyper-capitalistic’ path, and only a few stakeholders can be at the top. It’s this rather dull and annoyingly predictable situation that makes you appreciate teams like Union Berlin even more.",
    "published": "September 11, 2022"
  }
]