[
  {
    "title": "Juliette Binoche - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juliette_Binoche",
    "snippet": "Juliette Binoche (French: [ʒyljɛt binɔʃ]; born 9 March 1964) is a French actress. She has appeared in more than 60 films, particularly in French and English, and has been the recipient of numerous accolades, including an Academy Award, a BAFTA Award, Volpi Cup and a César Award.",
    "published": "1 month ago"
  },
  {
    "title": "Juliette Binoche - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm0000300/bio/",
    "snippet": "<strong>Daniel Auteuil</strong> and Juliette Binoche embody a Parisian couple whose life becomes a nightmare through anonymously sent videos. Privately, Binoche settled in Paris with her two children, Raphael and Hannah.",
    "published": null
  },
  {
    "title": "Juliette Binoche to be the new President ...",
    "url": "https://www.europeanfilmacademy.org/press/juliette-binoche-to-be-the-new-president-european-film-academy/",
    "snippet": "<strong>Wim Wenders</strong> succeeded him in 1996 and he served until 2020, followed by Holland, as the Academy’s first female President. The in January newly revamped Academy Board has now unequivocally proposed Juliette Binoche as new Academy President ...",
    "published": "March 14, 2024"
  },
  {
    "title": "Cannes 2025: Who is on the jury headed by Juliette Binoche? | Reuters",
    "url": "https://www.reuters.com/business/media-telecom/cannes-2025-who-is-jury-headed-by-juliette-binoche-2025-05-13/",
    "snippet": "[1/6]Juliette Binoche, Jury President of the 78th Cannes Film Festival and Jury members <strong>Carlos Reygadas</strong>, Payal Kapadia, Leila Slimani, Halle Berry, Jeremy Strong, Dieudo Hamadi, Alba Rohrwacher and Hong Sang-soo pose during a photocall before ...",
    "published": "May 13, 2025"
  },
  {
    "title": "Juliette Binoche Biography, Celebrity Facts and Awards - TV Guide",
    "url": "https://www.tvguide.com/celebrities/juliette-binoche/bio/3000000038/",
    "snippet": "Unable to make a trip to visit former president <strong>Bill Clinton</strong> during his presidency after an invitation to the White House due to the success of the 2000 film &quot;Chocolat,&quot; the Clintons came to New York to meet her",
    "published": null
  }
]