[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Many professional wrestling ... ran for governor of Minnesota in 1998 as the Reform Party of Minnesota nominee (he later joined the <strong>Independence Party of Minnesota</strong> when the Reform Party broke from its association with the Reform Party of the United States of ...",
    "published": "3 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Ventura (<strong>Green Party of Alaska, Unaffiliated) ran for election for President of the United States. Ventura (Green Party of Alaska) lost in the general election on November 3, 2020. ... Ventura ran for governor of Minnesota in 1998. Ventura was elected as a member of the Reform Party, but later left and reorganized the Minnesota Reform Party as the Independence Party</strong>...",
    "published": null
  },
  {
    "title": "Governorship of Jesse Ventura | MNopedia",
    "url": "https://www.mnhs.org/mnopedia/search/index/event/governorship-jesse-ventura",
    "snippet": "Afterward, he built a career as a professional wrestler (for which he adopted the name Jesse Ventura), television wrestling commentator, and movie actor that brought him national fame. Upon returning to Minnesota in 1987 he worked as a talk radio personality. He got his first political experience as nonpartisan mayor of Brooklyn Park, 1991–1995. In 1997 Ventura joined the Minnesota chapter of Ross Perot’s national Reform Party.",
    "published": "April 14, 2025"
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "Citing political infighting and poor leadership, Ventura left the Reform Party in 2000 and subsequently joined the Independence Party. He decided not seek a second term as governor. After leaving office, Ventura worked as a political commentator, continuing to challenge mainstream politics and offering often controversial takes on current events. He advanced his various ideas as host of such television shows as Conspiracy Theory with Jesse Ventura (2009–12) and The World According to Jesse (2017–22); the latter aired on Russian state TV.",
    "published": "January 14, 2009"
  },
  {
    "title": "Jesse Ventura | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/jesse-ventura",
    "snippet": "During the 1990s, Ventura became increasingly involved in state politics. He joined the <strong>Minnesota Independence Party</strong> (later affiliated with H. Ross Perot as the Minnesota Reform Party) and supported MIP candidate Dean Barkley for the US Senate.",
    "published": null
  }
]