[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "At the 2023 FIFA Women&#x27;s World ... of the Year Award. She previously played for WSL clubs <strong>Manchester United, Bristol Academy, Birmingham City, Doncaster Belles, and Reading, and in the Bundesliga with VfL Wolfsburg</strong>....",
    "published": "8 hours ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "Before arriving at Manchester United, Earps spent time playing for hometown club <strong>Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg</strong>. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in ...",
    "published": null
  },
  {
    "title": "Who is Mary Earps? Everything you need to know about the England goalkeeper",
    "url": "https://www.fourfourtwo.com/features/mary-earps-everything-you-need-to-know",
    "snippet": "During Earps&#x27; youth career she played for <strong>West Bridgford Colts, Tottenham and Leicester City</strong>. She started playing regular first team football in the 2009/10 season with Leicester and she signed for Nottingham Forest the following season.",
    "published": "October 18, 2024"
  },
  {
    "title": "Mary Earps on her journey from West Bridgford Colts to starring for England at UEFA Women's EUROs",
    "url": "https://www.englandfootball.com/articles/2022/Jul/25/mary-earps-grassroots-story-20220725",
    "snippet": "England goalkeeper Mary Earps talks about her journey from <strong>West Bridgford Colts to Leicester City, Nottingham Forest, Doncaster Rovers</strong> and beyond.",
    "published": null
  },
  {
    "title": "Local Legends: Mary Earps MBE - From Nottingham To National Icon - Impact Magazine",
    "url": "https://impactnottingham.com/2025/12/local-legends-mary-earps-mbe-from-nottingham-to-national-icon/",
    "snippet": "Mary Earps’ story is a fascinating tale which showcases the importance of resilience and relentless dedication. Born in Nottingham, she very quickly discovered her potential to be a goalkeeper whilst playing for local side <strong>West Bridgford Colts</strong>.",
    "published": "2 weeks ago"
  }
]