[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Following a steady decline in popular ... resign as prime minister and leader of the Liberal Party. He advised the Governor General to prorogue Parliament until March 24, while the party held a leadership election. <strong>Trudeau remained Liberal leader until Mark Carney was elected as</strong> ...",
    "published": "5 days ago"
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "The Right Honourable Mark Carney, Prime Minister of CanadaMark Carney is Canada’s 24th Prime Minister. He was elected Leader of the Liberal Party of Canada and sworn in as Prime Minister in March 2025. He leads a government that will take action to unite Canadians, defend Canada’s sovereignty, ...",
    "published": null
  },
  {
    "title": "Mark Carney - Prime Minister of Canada | Prime Minister of Canada",
    "url": "https://www.pm.gc.ca/en",
    "snippet": "Home Page of the Right Honourable Mark Carney",
    "published": null
  },
  {
    "title": "Mark Carney wins Liberal Party vote to replace Trudeau as Canada’s prime minister | PBS News",
    "url": "https://www.pbs.org/newshour/world/mark-carney-wins-liberal-party-vote-to-replace-trudeau-as-canadas-prime-minister",
    "snippet": "TORONTO (AP) — Former central ... trade war and annexation threat, and a federal election looms. <strong>Carney, 59, replaces Prime Minister Justin Trudeau</strong>, who announced his resignation in January but remains prime minister until ...",
    "published": "March 9, 2025"
  },
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "From 2020, Carney was the United ... and Finance. <strong>Carney was also an informal advisor to Canadian prime minister Justin Trudeau at the start of the COVID-19 pandemic, before returning to the private sector</strong>....",
    "published": "1 day ago"
  }
]