[
  {
    "title": "Eleven professors appointed | ETH Zurich",
    "url": "https://ethz.ch/en/news-and-events/eth-news/news/2025/12/eleven-professors-appointed.html",
    "snippet": "At its meeting of 3 and 4 December 2025 and upon application of <strong>Joël Mesot</strong>, President of ETH Zurich, the ETH Board appointed eleven professors. In addition, seven adjunct professorships were awarded.",
    "published": null
  },
  {
    "title": "President of ETH Zurich Joël Mesot to hand over the baton at the end of 2026 after two successful terms of office - ETH-Rat",
    "url": "https://ethrat.ch/en/president-of-eth-zurich-joel-mesot-to-hand-over-the-baton-at-the-end-of-2026-after-two-successful-terms-of-office/",
    "snippet": "He has been a member of the ETH ... 2018, and as President of ETH Zurich since 2019. At its meeting, the ETH Board allocated the federal funding for 2026 and considered the outlook for the years 2027–2029, as well as the supplementary allocation for 2025....",
    "published": "April 1, 2025"
  },
  {
    "title": "Eight professors appointed | ETH Zurich",
    "url": "https://ethz.ch/en/news-and-events/eth-news/news/2025/09/eight-professors-appointed.html",
    "snippet": "At its meeting of 17 and 18 September 2025 and upon application of <strong>Joël Mesot</strong>, President of ETH Zurich, the ETH Board appointed eight professors. The Board also awarded the title of",
    "published": null
  },
  {
    "title": "Serving as ETH President “still deeply fulfilling” – Staffnet | ETH Zurich",
    "url": "https://ethz.ch/staffnet/en/news-and-events/internal-news/archive/2025/03/serving-as-eth-president-still-deeply-fulfilling.html",
    "snippet": "The ETH Board announced today that <strong>Joël Mesot</strong> will step down as ETH President at the end of 2026, following the completion of his second term. In this interview, Mesot explains his decision and outlines what he has planned for his final two years.",
    "published": null
  },
  {
    "title": "President of ETH Zurich Joël Mesot to hand over the baton ...",
    "url": "https://www.news.admin.ch/en/nsb?id=104396",
    "snippet": "Berne/Zurich, 6.3.2025 - At its meeting of 5/6 March, the ETH Board took note of the decision of the President of ETH Zurich, <strong>Joël Mesot</strong>, not to stand for a third term of office.",
    "published": null
  }
]