[
  {
    "title": "Jupp Heynckes - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jupp_Heynckes",
    "snippet": "However, the lack of domestic success – finishing fourth, eleven points behind champions Barcelona – saw his tenure terminated at the end of the season. After his dismissal by Real Madrid, Heynckes took a year out of football before joining Portuguese club Benfica for the 1999–2000 season.",
    "published": "2 weeks ago"
  },
  {
    "title": "Jupp Heynckes - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/heynckes-jupp/profil/trainer/90",
    "snippet": "Avg. term as coach : <strong>2.00 Years</strong>",
    "published": null
  },
  {
    "title": "Jupp Heynckes | DFL Deutsche Fußball Liga",
    "url": "https://www.dfl.de/en/profiles/jupp-heynckes/",
    "snippet": "Honorary laureate of the DFL and former head coach of FC Bayern Munich",
    "published": "April 8, 2024"
  },
  {
    "title": "Jupp Heynckes: a defining Bundesliga figure at Bayern Munich and Borussia Mönchengladbach | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/jupp-heynckes-a-defining-figure-at-bayern-munich-gladbach-treble-20144",
    "snippet": "When Jupp Heynckes oversaw his last match as a coach in the 2018 DFB Cup final, it brought down the curtain on a footballing career that spanned over half a century and took in teams across Germany, Spain and Portugal. Most remembered for guiding Bayern Munich to the 2013 treble, the Mönchengladbach native was also one of the most formidable strikers in German history for his hometown club Borussia.",
    "published": "May 9, 2025"
  },
  {
    "title": "Jupp Heynckes Biography - Facts, Childhood, Family Life & Achievements",
    "url": "https://www.thefamouspeople.com/profiles/jupp-heynckes-13550.php",
    "snippet": "After completing a <strong>two-year tenure</strong> there, he returned to Bayern for the third time in 2011. The 2012-13 season was the most successful one in Heynckes’ career. With him as the manager, Bayern won the Bundesliga, DFB-Pokal, DFL-Supercup, and ...",
    "published": null
  }
]