[
  {
    "title": "Who owns Borussia Dortmund (BVB)? Owners' net worth, source of wealth and ownership history",
    "url": "https://www.interestingfootball.com/2025/05/who-owns-borussia-dortmund-bvb-owners.html",
    "snippet": "Borussia Dortmund is currently owned by <strong>a publicly traded company with major shareholders including Bernd Geske, Evonik Industries AG, Signal Iduna, Ralph Dommermuth Beteiligungen GmbH and Puma SE</strong>.",
    "published": null
  },
  {
    "title": "Borussia Dortmund - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Borussia_Dortmund",
    "snippet": "The organisation Borussia Dortmund GmbH is the partner with unlimited liability and is responsible for the management and representation of Borussia Dortmund GmbH &amp; Co. KGaA. Borussia Dortmund GmbH is <strong>fully owned by the sports club, Borussia Dortmund e.V.</strong> This organizational structure was designed ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Shareholder Structure / BVB Share / Aktie Borussia Dortmund",
    "url": "https://aktie.bvb.de/eng/BVB-Share/Shareholder-Structure",
    "snippet": "The shareholder structure of Borussia Dortmund GmbH &amp; Co.",
    "published": null
  },
  {
    "title": "Ownership of Borussia Dortmund | Download Scientific Diagram",
    "url": "https://www.researchgate.net/figure/Ownership-of-Borussia-Dortmund_fig5_344375289",
    "snippet": "Ownership Landscape: an RBV perspective of football leagues’ configurations diversity · Article · Feb 2025 · Ricardo Gúdel · View · ... Members&#x27; associations, also known as supporter-owned or community-owned clubs, are primarily found in Germany (e.g., FC Bayern Munich and BV Borussia Dortmund) and, to some extent, in Spain (e.g., Real Madrid CF and FC Barcelona) [16]. These clubs operate under models where the majority of voting rights are held by the club&#x27;s members, who are typically fans [17]. ...",
    "published": null
  },
  {
    "title": "Borussia Dortmund GmbH : Shareholders, Shareholding Structure - MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/BORUSSIA-DORTMUND-GMBH-435951/company-shareholders/",
    "snippet": "Borussia Dortmund GmbH &amp; Co KGaA is a Germany-based company engaged in the operation of Ballspielverein Borussia (BVB), a professional football club based in Dortmund, Germany. The Company has around 8 functional areas such as sports, communications, human resources, organization, finance, legal and IR, marketing and digitalization, commercial partnerships.",
    "published": null
  }
]