[
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "19 December 2025 - 16:45 · The First Lady of Ukraine, <strong>Olena Zelenska</strong>, summarized this year’s results of implementing the All-Ukrainian Mental Health Program “How Are You?”. 19 December 2025 - 16:07 · The Head of State honored the memory ...",
    "published": "4 days ago"
  },
  {
    "title": "Ukraine’s government reshuffle aims to boost national resilience – and repair relations with Trump",
    "url": "https://www.chathamhouse.org/2025/07/ukraines-government-reshuffle-aims-boost-national-resilience-and-repair-relations-trump",
    "snippet": "Ukraine’s new prime minister, <strong>Yulia Svyrydenko</strong>, is well placed to communicate with Washington. But Zelenskyy’s government must not let wartime conditions fuel democratic backsliding at home.",
    "published": "August 14, 2025"
  },
  {
    "title": "Ukraine: new government led by Yuliia Svyrydenko | OSW Centre for Eastern Studies",
    "url": "https://www.osw.waw.pl/en/publikacje/analyses/2025-07-18/ukraine-new-government-led-yuliia-svyrydenko",
    "snippet": "In December 2020, she became deputy to Andrii Yermak, head of the Office of the President of Ukraine, with responsibility for economic policy. From November 2021, she served as First Deputy Prime Minister and Minister of Economy in Denys Shmyhal’s government. In 2025, she led negotiations with the United States on the terms of the raw materials agreement.",
    "published": "July 18, 2025"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "Main | Cabinet of Ministers of Ukraine",
    "url": "https://www.kmu.gov.ua/en",
    "snippet": "All Topics Anticorruption activities Commemorative events Construction Culture Defense Ecology Economy Education and science Emergency Energy security European integration Finances Government session Healthcare Humanitarian aid Information policy Infrastructure Innovations International activity Investments IT Land and agricultural sector Law and order News of regions Policy Prime Minister Privatization Reforms Social policy Sports Supervision and control Transport ІТ · more topics · RSS · 15:23, 20 December 2025 ·",
    "published": null
  }
]