[
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "During a second tenure as prime minister, he pledged to investigate the 1MDB scandal, combat corruption, and cut spending on large infrastructure projects. He also secured the pardon and release of Anwar Ibrahim. Mahathir resigned in 2020 amidst a political crisis. Despite losing his parliamentary seat in the 2022 general election, he remained active in politics and shifted party affiliation several times.",
    "published": "3 days ago"
  },
  {
    "title": "Mahathir bin Mohamad | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mahathir-bin-Mohamad",
    "snippet": "During the election campaign, Mahathir ... soon resumed his political career. ... BBC - The Interview - Mahathir Mohamad, <strong>Prime Minister of Malaysia</strong> (Dec. 03, 2025) (Show more)...",
    "published": "July 20, 1998"
  },
  {
    "title": "Mahathir Mohamad Fast Facts | KRDO",
    "url": "https://krdo.com/news/national-world/cnn-world/2025/12/10/mahathir-mohamad-fast-facts-2/",
    "snippet": "He became the oldest elected world leader at 92 when he was sworn into office as prime minister of Malaysia in 2018, a decade-and-a-half after retirement. Mahathir was also prime minister of Malaysia from July 1981 to October 2003.",
    "published": "1 week ago"
  },
  {
    "title": "Mahathir Mohamad and Malaysia’s Political Transition",
    "url": "https://insamer.com/en/mahathir-mohamad-and-malaysias-political-transition-_3300.html",
    "snippet": "Mohamad has resigned from both premiership of the country and chairmanship of the “<strong>Malaysian United Indigenous Party (Bersatu)</strong>” that was part of the ruling coalition. He cited corruption inside the party as his reason behind his resignation.",
    "published": null
  },
  {
    "title": "Political positions of Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Political_positions_of_Mahathir_Mohamad",
    "snippet": "In 2020, Mahathir expressed support for Joe Biden in the 2020 United States presidential election, saying that the re-election of Donald Trump would be a &quot;disaster&quot;. In a July 2025 interview with Al Jazeera, Mahathir said that Israel&#x27;s killing of the Palestinian people during the Gaza war would ...",
    "published": "October 5, 2025"
  }
]