[
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "<strong>The president of Portugal</strong>, officially the president of the Portuguese Republic (Portuguese: Presidente da República Portuguesa, pronounced [pɾɨziˈðẽtɨ ðɐ ʁɛˈpuβlikɐ puɾtuˈɣezɐ]), is the head of state and highest office of Portugal.",
    "published": "1 week ago"
  },
  {
    "title": "Head of State - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/duties-of-the-president/head-of-state/",
    "snippet": "<strong>The President of the Republic</strong> is the Head of State. Thus, under the Constitution, he “represents the Portuguese Republic”, “is the guarantor national independence, the unity of the State and the proper working of the democratic institutions” and “is the Supreme Commander of the Armed ...",
    "published": null
  },
  {
    "title": "List of presidents of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Portugal",
    "snippet": "Teófilo Braga served as the first and sole president of the Provisional Government, and therefore is not considered to be the first president, although he would serve again as head of state and be the second president after the resignation of Manuel de Arriaga. However, Bernardino Machado served two non-consecutive terms, and he is counted as both the third and the eighth presidents. Because of this, the list below contains 20 presidencies, but only 19 presidents. Under the Constitution of Portugal adopted in 1976, in the wake of the 1974 Carnation Revolution, the president is elected to a five-year term with the possibility of running for a second consecutive term; there is no limit to the number of terms a president may serve, but a president who serves two consecutive terms may not serve again in the next five years after the second term finishes.",
    "published": "2 weeks ago"
  },
  {
    "title": "IFES Election Guide | Elections: Portuguese Presidency 2021 General",
    "url": "https://www.electionguide.org/elections/id/2901/",
    "snippet": "Chief of State: President <strong>Marcelo Rebelo de Sousa</strong> (since 9 March 2016) Head of Government: Prime Minister Antonio Luis Santos da COSTA (since 24 November 2015) Assembly: Portugal has a unicameral Assembly of the Republic (Assembleia da República) with 230 seats.",
    "published": null
  },
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "He is a Catholic and has 2 children and 5 grandchildren. A Law Graduate, he received a Doctorate in Legal and Political Science in 1984. He was a tenured professor at the Faculty of Law of Lisbon University, and has taught throughout his career in various institutions of further education, in Portugal ...",
    "published": null
  }
]