[
  {
    "title": "Nadia Calviño - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nadia_Calvi%C3%B1o",
    "snippet": "Nadia María Calviño Santamaría (Spanish: [ˈnaðja kalˈβiɲo]; born 3 October 1968) is a Spanish economist and civil servant serving as the President of the European Investment Bank since January 2024. From June 2018 to December 2023, Calviño was part of the cabinets led by prime minister ...",
    "published": "2 weeks ago"
  },
  {
    "title": "La vida personal de Nadia Calviño: su marido economista, sus cuatro hijos, su sueldo y su polémica casa de 1,5 millones | Vozpópuli",
    "url": "https://www.vozpopuli.com/dolcevita/la-vida-personal-de-nadia-calvino-su-marido-economista-sus-cuatro-hijos-su-sueldo-y-su-polemica-casa-de-15-millones.html",
    "snippet": "La discreción ha sido una máxima en su vida privada, algo que no ha impedido que detalles de su intimidad acaparen los titulares. Nadia Calviño está casada con <strong>Ignacio Manrique de Lara</strong>, licenciado en Económicas en la Universidad Complutense ...",
    "published": "1 month ago"
  },
  {
    "title": "Nadia Calviño Santamaría | CIDOB,",
    "url": "https://www.cidob.org/lider-politico/nadia-calvino-santamaria",
    "snippet": "Calviño tomaba el relevo al finlandés Jyrki Katainen, vicepresidente de la Comisión Europea, y ocuparía el cargo durante un año. Nadia Calviño y su esposo, <strong>Ignacio Manrique de Lara</strong>, también economista pero en su caso profesional del sector privado, han tenido cuatro hijos.",
    "published": null
  },
  {
    "title": "El lado más desconocido de Nadia Calviño: de su controvertido padre a su inseparable marido",
    "url": "https://www.eldebate.com/gente/20231209/lado-desconocido-nadia-calvino-controvertido-padre-inseparable-marido_159246.html",
    "snippet": "Los ministros de Economía y Finanzas de la Unión Europea tomaron la decisión el pasado viernes 8 de diciembre, así que es un buen momento para hacer un repaso a la faceta más desconocida de Nadia. Nació en La Coruña en 1968, pero cuando era muy pequeña su familia se mudó a Madrid. Sus padres tuvieron dos hijos, así que tiene un hermano llamado Iván con el que mantiene una relación estupenda. Su padre es el abogado José María Calviño Iglesias, el primer secretario general de Acción Republicana Democrática Española tras la legalización del partido.",
    "published": "December 11, 2023"
  },
  {
    "title": "Nadia Calviño, al descubierto: su familia, su pareja, sus hijos, su pasado, su sueldo y más | Vozpópuli",
    "url": "https://www.vozpopuli.com/dolcevita/nadia-calvino-pareja-hijos-sueldo_0_1344765695.html",
    "snippet": "En 1980 fue designado vocal del Consejo de Administración de RTVE, ente público que acabó dirigiendo dos años más tarde por decisión de Felipe González. Calviño estuvo en el cargo hasta 1986. Desde entonces, decidió permanecer alejado de la vida pública y continuó su labor en su propio bufete de abogados. Nadia siempre ha sido muy familiar.",
    "published": "April 12, 2020"
  }
]