[
  {
    "title": "MS NOW - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/MS_NOW",
    "snippet": "MS NOW (formerly MSNBC) is an American cable news channel owned by <strong>Versant, a subsidiary of Comcast</strong> pending its spin-off to their shareholders in 2026. The channel primarily broadcasts rolling news coverage and modern liberal-leaning political commentary; its headquarters are based at 229 West ...",
    "published": "5 days ago"
  },
  {
    "title": "MSNBC to change name to MS NOW amid spinoff from NBCUniversal",
    "url": "https://www.nbcnews.com/business/media/msnbc-change-name-ms-now-spinoff-nbcuniversal-rcna225563",
    "snippet": "MSNBC will change its name to MS Now, for My Source News Opinion World, and unveil a new logo this year as part of the cable news channel’s spinoff from the Comcast-owned media company NBCUniversal",
    "published": "August 19, 2025"
  },
  {
    "title": "MSNBC to change its name to MS NOW and drop the peacock logo - CBS News",
    "url": "https://www.cbsnews.com/news/msnbc-name-change-ms-now-nbc-universal-versant-spinoff-peacock/",
    "snippet": "MSNBC and several other cable channels owned by <strong>NBC Universal</strong> are spinning off into a new business called Versant, which will also include financial news channel CNBC and entertainment networks such as USA, Oxygen, E!",
    "published": "August 19, 2025"
  },
  {
    "title": "MSNBC will change its name after Comcast split - Los Angeles Times",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2025-08-18/msnbc-will-have-a-new-name-later-this-year",
    "snippet": "In a memo obtained by The Times, Versant Chief Executive Mark Lazarus indicated it was NBCUniversal’s decision to remove NBC and its famous peacock logo from the MSNBC name. The MS NOW acronym — standing for “my source, news, opinion and world” — is intended to convey that the channel has a point of view. “The peacock is synonymous with NBCUniversal, and it is a symbol they have decided to keep within the NBCU family,” Lazarus wrote. “This gives us the opportunity to chart our own path forward, create distinct brand identities, and establish an independent news organization following the spin.”",
    "published": "August 18, 2025"
  },
  {
    "title": "MSNBC to rebrand to MS NOW",
    "url": "https://www.axios.com/2025/08/18/msnbc-rebrand-ms-now-versant",
    "snippet": "MSNBC, the progressive cable network owned by <strong>NBCUniversal</strong>, is rebranding to MS NOW, an acronym that stands for My Source for News, Opinion and the World.",
    "published": "August 18, 2025"
  }
]