[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "<strong>Christopher Ruddy</strong> started Newsmax.com on September 16, 1998, supported by a group of investors including the family of former Central Intelligence Agency Director William J. Casey. Later, Richard Mellon Scaife, Ruddy&#x27;s former employer at the Pittsburgh Tribune-Review, invested in the fledgling ...",
    "published": "1 week ago"
  },
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "Ruddy has been both a &quot;Patron&quot; and a &quot;Sustaining Donor&quot; to the Wikimedia Foundation. He is an alumnus of the American Swiss Foundation. Following Ruddy&#x27;s work at the Pittsburgh Tribune-Review, he started Newsmax with the owner of the Tribune-Review, <strong>Richard Mellon Scaife</strong>, and a $25,000 investment ...",
    "published": "5 days ago"
  },
  {
    "title": "Chris Ruddy '87C | St. John's University",
    "url": "https://www.stjohns.edu/news-media/success-stories/chris-ruddy-87c",
    "snippet": "As the Founder, Chief Executive Officer, and President of Newsmax Media Inc., Mr. Ruddy today presides over the burgeoning success of the media company that includes the news website known as Newsmax.com. The site boasts an estimated 20–30 million monthly visitors and is the third-most viewed political website in the country.",
    "published": null
  },
  {
    "title": "Newsmax | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/business-and-management/newsmax",
    "snippet": "Newsmax is an American media outlet that encompasses both a website and a television network, catering primarily to a conservative audience. Founded in 1998 by <strong>Christopher Ruddy</strong>, a former investigative journalist, Newsmax initially gained traction ...",
    "published": null
  },
  {
    "title": "Chris Ruddy - EarthX",
    "url": "https://earthx.org/speaker/chris-ruddy/",
    "snippet": "<strong>Christopher Ruddy</strong> founded Newsmax Media, Inc. in 1998 and serves as its CEO. Newsmax today is one of the nation’s leading broadcasting and digital media companies. The Company includes the Newsmax network, the 4th highestrated cable news channel ...",
    "published": "September 25, 2025"
  }
]