[
  {
    "title": "Tele2 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tele2",
    "snippet": "International growth came in the form of acquisitions in Estonia, Lithuania, Latvia, Russia, and France. In June 2016 Tele2 acquired the B2B services provider TDC Sweden AB from Danish TDC Group. <strong>In November 2018, Tele2 was merged with telecom operator Com Hem</strong>, which delivered, among other ...",
    "published": "November 2, 2025"
  },
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "Com Hem was a Swedish brand owned by <strong>Tele2 AB</strong> which supplied Triple Play services that included cable television, broadband internet and fixed-line telephone. Founded in 1983 as Televerket Kabel-TV as part of the former state-owned Televerket, the company was successively named Svenska Kabel-TV ...",
    "published": "June 6, 2025"
  },
  {
    "title": "Tele2 and Com Hem combining to create leading integrated connectivity provider - Tele2",
    "url": "https://www.tele2.com/media/news/2018/tele2-and-com-hem-combining-to-create-leading-integrated-connectivity-provider/",
    "snippet": "Com Hem’s shareholders will receive as merger consideration SEK 37.02 in cash plus 1.0374x B shares in Tele2 for each share in Com Hem outstanding as at completion of the Merger. Hence, Com Hem’s shareholders will receive approximately 26.9 percent economic ownership in Enlarged Tele2 and a total cash consideration of SEK 6.6 billion[2]",
    "published": null
  },
  {
    "title": "The merger between Tele2 and Com Hem is completed - Tele2",
    "url": "https://www.tele2.com/media/news/2018/the-merger-between-tele2-and-com-hem-is-completed/",
    "snippet": "Stockholm – The Swedish Companies Registration Office (“SCRO”) has today registered the merger between Tele2 AB (publ) (”Tele2”) (Nasdaq Stockholm: TEL2 A and TEL2 B) and <strong>Com Hem Holding AB (publ) (“Com Hem Holding”).</strong> The merger ...",
    "published": null
  },
  {
    "title": "Tele2 and Com Hem merger - Tele2",
    "url": "https://www.tele2.com/investors/tele2-and-com-hem-merger",
    "snippet": "The merger between Tele2 and Com Hem was completed on 5 November 2018. Com Hem Holding was dissolved and all of its assets and liabilities were transferred to Tele2.",
    "published": null
  }
]