[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She and Paris Saint-Germain lost 5–2 on aggregate to Juventus in the 2024–25 UEFA Women&#x27;s Champions League qualifying rounds. On 12 November 2025, Earps returned to <strong>Manchester United</strong> in the Champions League for the first time since her move, where they lost 2-1.",
    "published": "1 month ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in 2024, Mary took on a new challenge by joining French giants <strong>Paris Saint-Germain</strong>. Earps called time on her spell with the Lionesses in May 2025, after collecting a total of 53 caps.",
    "published": null
  },
  {
    "title": "Mary Earps’ Manchester United return: Jeers, cheers, selfies and a painful defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6802703/2025/11/13/mary-earps-manchester-united-psg/",
    "snippet": "13, 2025 ... Sporting a bright yellow <strong>Paris Saint-Germain</strong> goalkeeping kit, hips swaying from side to side, Mary Earps looked up towards Old Trafford’s Sir Bobby Charlton Stand. Game mode was activated for the return of the ‘Mearps’ in ...",
    "published": "November 13, 2025"
  },
  {
    "title": "Local Legends: Mary Earps MBE - From Nottingham To National Icon - Impact Magazine",
    "url": "https://impactnottingham.com/2025/12/local-legends-mary-earps-mbe-from-nottingham-to-national-icon/",
    "snippet": "At the end of the 2023/24 season, Earps left <strong>Manchester United</strong> and English football behind in order to pursue a new challenge and sign for French side PSG, where she established herself as the No.",
    "published": "2 weeks ago"
  },
  {
    "title": "Women's EURO champion Mary Earps announces retirement from international football",
    "url": "https://www.olympics.com/en/news/womens-euro-champion-mary-earps-announces-international-retirement",
    "snippet": "The 32-year-old, who plays her club football in France for <strong>Paris Saint-Germain</strong>, was named goalkeeper of the tournament at both the UEFA Women&#x27;s EURO 2022 tournament, which England won on home soil, as well as the 2023 FIFA Women&#x27;s World Cup, ...",
    "published": "July 24, 2025"
  }
]