[
  {
    "title": "Salome Zourabichvili | Warsaw Security Forum",
    "url": "https://warsawsecurityforum.org/profile/salome-zourabichvili-2025/",
    "snippet": "Salome Zourabichvili is a Georgian politician and former diplomat who currently serves as the <strong>President of Georgia</strong>, in office since December 2018.",
    "published": "September 11, 2025"
  },
  {
    "title": "Salomé Zourabichvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salom%C3%A9_Zourabichvili",
    "snippet": "On 13 February, the European Parliament ... after the rigged 26 October elections. MEPs declared that Salome Zourabichvili continued to be <strong>Georgia&#x27;s legitimate president</strong> and urged European Council President António Costa to invite her to represent Georgia in key EU ...",
    "published": "5 days ago"
  },
  {
    "title": "The support of our partners is crucial - Salome Zourabichvili",
    "url": "https://bm.ge/en/news/the-support-of-our-partners-is-crucial-salome-zourabichvili",
    "snippet": "<strong>Georgia&#x27;s fifth president</strong> addresses the EU High Representative for Foreign Affairs and Security Poli...",
    "published": "April 3, 2025"
  },
  {
    "title": "Presidency of Salome Zourabichvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Presidency_of_Salome_Zourabichvili",
    "snippet": "<strong>President-elect</strong> Salome Zourabichvili met sitting President Giorgi Margvelashvili on 3 December, inaugurating the first cordial transition of power between two Georgian presidents.",
    "published": "June 22, 2025"
  },
  {
    "title": "bne IntelliNews - INTERVIEW: Salome Zourabichvili, Georgia’s fifth president",
    "url": "https://www.intellinews.com/interview-salome-zourabichvili-georgia-s-fifth-president-371500/",
    "snippet": "When Salome Zourabichvili left Georgia’s presidential palace to make way for her successor, the country’s fifth president said she was “taking legitimacy with her”. The end of Zourabichvili’s term came amid a period of ongoing mass unrest in the Caucasus country which began when the ruling Georgia Dream party — re-elected in a vote marred by allegations of mass electoral violations — suspended EU accession negotiations in November 2024.",
    "published": "March 14, 2025"
  }
]