[
  {
    "title": "Chase Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chase_Center",
    "snippet": "<strong>Chase Center</strong> is an indoor arena in the Mission Bay neighborhood of San Francisco, California, United States. It is the home of the Golden State Warriors of the National Basketball Association (NBA), Golden State Valkyries of the Women&#x27;s National Basketball Association (WNBA), and occasionally ...",
    "published": "1 day ago"
  },
  {
    "title": "Home | Chase Center",
    "url": "https://www.chasecenter.com/",
    "snippet": "<strong>Chase Center</strong>, a state-of-the-art sports and entertainment arena in San Francisco, is home to the Golden State Warriors and nearly 200 events per year.",
    "published": null
  },
  {
    "title": "Where Do The Golden State Warriors Play?",
    "url": "https://www.elitesportstours.ca/where-do-the-golden-state-warriors-play-basketball",
    "snippet": "<strong>Chase Center</strong> is a multi-purpose arena in the Mission Bay neighbourhood of San Francisco. The building cost $1.4 billion to construct and is the current home for the Golden State Warriors of the National Basketball Association (NBA).",
    "published": null
  },
  {
    "title": "Chase Center is the Golden State Warriors’ Dramatic Home | Visit California",
    "url": "https://www.visitcalifornia.com/experience/chase-center/",
    "snippet": "Along the bayfront, the spectacular and modern <strong>Chase Center</strong> is the Golden State Warriors’ new homecourt in San Francisco and also hosts concerts.",
    "published": "October 1, 2024"
  },
  {
    "title": "History of Golden State Warriors Franchise - Archived Information and Materials Pertaining to The Warriors Piers 30-32 Project | SFGOV",
    "url": "https://www.sfgov.org/sfc/mbs-pavilion/history-golden-state-warriors-franchise-archived-information-and-materials-pertaining-warriors-piers",
    "snippet": "To secure a more permanent facility, the Warriors officially moved to the <strong>Oracle Arena</strong> in Oakland in 1971 and changed their name from the San Francisco Warriors to the Golden State Warriors. The Golden State Warriors (GSW) acquired from Salesforce.com Inc.; 12 acres of vacant property, located ...",
    "published": null
  }
]