[
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - <strong>The Carlyle Group and Providence Equity Partners today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT</strong>. Financial details were not disclosed. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  },
  {
    "title": "The Carlyle Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Carlyle_Group",
    "snippet": "Carlyle is mainly owned by <strong>institutional investors, who hold around 63% of all shares</strong>. The 10 largest shareholders in early 2025 were:",
    "published": "November 13, 2025"
  },
  {
    "title": "The Carlyle Group Inc. (CG): history, ownership, mission, how it works & makes money – DCFmodeling.com",
    "url": "https://dcfmodeling.com/blogs/history/cg-history-mission-ownership",
    "snippet": "(CG) operates with a <strong>hybrid ownership structure</strong>, being a publicly traded global investment firm, but with a significant portion of its equity still controlled by its founders and current and former employees, aligning management and shareholder ...",
    "published": "June 6, 2024"
  },
  {
    "title": "The Carlyle Group - 2025 Investor Profile, Portfolio, Team & Exits - Tracxn",
    "url": "https://tracxn.com/d/private-equity/the-carlyle-group/__DhioqtmvYosLkWQKi3jVcKH6tIoBtaZJQJ8fEY_ln38",
    "snippet": "<strong>Most recently it acquired stakes in The Very Group on Nov 10, 2025</strong>. A lot of funds co-invest with The Carlyle Group, with names like Riverstone Holdings sharing a substantial percentage of its portfolio.",
    "published": "1 week ago"
  },
  {
    "title": "Investor FAQs | The Carlyle Group",
    "url": "https://ir.carlyle.com/investor-faqs",
    "snippet": "The Carlyle Group manages <strong>$474 billion in assets under management investing in Global Private Equity, Global Credit and Carlyle AlpInvest</strong> as of September 30, 2025. Carlyle combines global vision with local insight, relying on a top-flight team of more than 2,400 people operating out of 27 offices ...",
    "published": null
  }
]