[
  {
    "title": "Borussia Dortmund keen to keep Emre Can beyond 2026",
    "url": "https://bulinews.com/borussia-dortmund-preparing-contract-offer-for-emre-can",
    "snippet": "<strong>Out of contract in the summer of 2026, Borussia Dortmund captain Emre Can looks set to be offered a new contract by the club</strong>. According to Sport Bild, Can’s current deal includes a clause that could automatically extend his contract by a further ...",
    "published": "November 12, 2025"
  },
  {
    "title": "Emre Can postpones Dortmund future talks",
    "url": "https://bulinews.com/emre-can-postpones-dortmund-future-talks",
    "snippet": "Emre Can has just one year left on his contract with Borussia Dortmund, but <strong>he&#x27;s not focusing on his future at the moment</strong>.",
    "published": null
  },
  {
    "title": "Borussia Dortmund Set to Retain Emre Can for 2026/27 Season Despite Extension Clause Uncertainty - Sportingpedia - Latest Sports News From All Over the World",
    "url": "https://www.sportingpedia.com/2025/11/12/borussia-dortmund-set-to-retain-emre-can-for-2026-27-season-despite-extension-clause-uncertainty/",
    "snippet": "Key Takeaways: <strong>Borussia Dortmund have formed plans to keep Emre Can for next season</strong>, as indicated by recent reports Can’s contract extension until 2027 hinges on appearance-related criteria, which he may not meet due to an early injury this ...",
    "published": "November 12, 2025"
  },
  {
    "title": "Besiktas, Fenerbahce, Galatasaray to race for Dortmund's Emre Can: Report - Türkiye Today",
    "url": "https://www.turkiyetoday.com/sports/besiktas-fenerbahce-galatasaray-to-race-for-dortmunds-emre-can-report-3211118",
    "snippet": "<strong>Dortmund reportedly plans to keep German international beyond 2026</strong>, citing his leadership role and squad stability ahead of a cautious summer reshuffle",
    "published": "1 week ago"
  },
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "<strong>On 31 January 2020, Borussia Dortmund announced Can&#x27;s signing on loan until the end of the 2019–20 season, with an obligation to buy</strong>. On 8 February, Can made his debut for Dortmund, also scoring a goal in a 4–3 away loss to Bayer Leverkusen.",
    "published": "5 days ago"
  }
]