[
  {
    "title": "Welcome to WBD Sports",
    "url": "https://wbdsports.com/",
    "snippet": "The latest company news and press releases from WBD Sports Europe - home of the Olympics in Europe - including Eurosport, TNT Sports, GCN, GMBN and Golf Digest plus sports on Max and discovery+.",
    "published": null
  },
  {
    "title": "Welcome to WBD Sports",
    "url": "https://media.wbdsports.com/",
    "snippet": "The Home of the Olympics celebrates ... partner to appear across TNT Sports’ season-long Gallagher PREM rugby coverage and content. ... <strong>New agreement between Warner Bros</strong>....",
    "published": null
  },
  {
    "title": "Welcome - Warner Bros. Discovery",
    "url": "https://www.wbd.com/",
    "snippet": "Warner Bros. Discovery inspires, informs and entertains audiences worldwide through its iconic brands and products including: Discovery Channel, HBO Max, discovery+, CNN, DC, Eurosport, HBO, HGTV, Food Network, OWN, Investigation Discovery, TLC, Magnolia Network, TNT, TBS, truTV, Travel Channel, ...",
    "published": null
  },
  {
    "title": "WARNER BROS. DISCOVERY TO SHOW SEASON DEFINING RACES FROM LA VUELTA AND WORLD CHAMPIONSHIPS | Welcome to WBD Sports",
    "url": "https://media.wbdsports.com/post/warner-bros-discovery-to-show-season-defining-races-from-la-vuel",
    "snippet": "Warner Bros. Discovery (WBD) will produce more than 125 hours of live cycling coverage for millions of fans across Europe over the next five weeks · Every stage of La Vuelta a España will be available on Eurosport, TNT Sports, HBO Max and discovery+* from 23 August to 14 September",
    "published": null
  },
  {
    "title": "WARNER BROS. DISCOVERY BOLSTERS LIVE WINTER SPORTS OFFER IN EUROPE WITH EXTENDED LUGE COVERAGE | Welcome to WBD Sports",
    "url": "https://media.wbdsports.com/post/warner-bros-discovery-bolsters-live-winter-sports-offer-in-europ",
    "snippet": "Discovery (WBD) Sports Europe has <strong>agreed a new partnership with the International Luge Federation (FIL)</strong> that will bring the world’s greatest luge events to millions of fans across Europe during the 2025-2026 season.",
    "published": null
  }
]