[
  {
    "title": "New York Knicks 2025-2026 Home Game Schedule & Tickets | Ticketmaster",
    "url": "https://www.ticketmaster.com/new-york-knicks-tickets/artist/805988?home_away=home",
    "snippet": "Find TicketsNew York, NY, <strong>Madison Square Garden</strong>, New York Knicks vs. Phoenix Suns1/17/26, 7:30 PM ... Saturday 07:30 PMSat7:30 PMOpen additional information for New York, NY, <strong>Madison Square Garden</strong>, NY Knicks v. Phoenix Suns Premium Seating1/17/26, ...",
    "published": "1 week ago"
  },
  {
    "title": "New York Knicks - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_York_Knicks",
    "snippet": "The Knicks compete in the National Basketball Association (NBA) as a member of the Atlantic Division of the Eastern Conference. The team plays its home games at <strong>Madison Square Garden</strong>, an arena they share with the New York Rangers of the National Hockey League (NHL).",
    "published": "5 days ago"
  },
  {
    "title": "Where Do The New York Knicks Play?",
    "url": "https://www.elitesportstours.ca/where-do-the-new-york-knicks-play-basketball",
    "snippet": "Where Do The New York Knicks Play? <strong>Madison Square Garden</strong>, known as The Garden or as MSG, is a legendary multi-purpose indoor arena in New York City.",
    "published": null
  },
  {
    "title": "Madison Square Garden | Official Site | New York City",
    "url": "https://www.msg.com/madison-square-garden",
    "snippet": "<strong>Madison Square Garden</strong> is &quot;The World&#x27;s Most Famous Arena.&quot; Experience the unforgettable at The Garden, where history happens. Here are events coming to MSG.",
    "published": null
  },
  {
    "title": "Madison Square Garden - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Madison_Square_Garden",
    "snippet": "It is close to other midtown Manhattan landmarks, including the Empire State Building, Koreatown and Macy&#x27;s at Herald Square. It is home to the New York Rangers of the National Hockey League (NHL), the New York Knicks of the National Basketball Association (NBA) and was home to the New York Liberty of the Women&#x27;s National Basketball Association (WNBA) from 1997 to 2017.",
    "published": "2 weeks ago"
  }
]