[
  {
    "title": "Nalini Anantharaman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nalini_Anantharaman",
    "snippet": "Nalini Anantharaman (born 26 February 1976) is a French mathematician known for her work in mathematical physics and analysis. She is currently a <strong>professor at the University of Strasbourg</strong>. She has won major prizes for her work, including the Henri Poincaré Prize in 2012.",
    "published": "August 7, 2025"
  },
  {
    "title": "Mathematician Nalini Anantharaman is breaking all ...",
    "url": "https://www.globalindian.com/story/global-indian-exclusive/mathematician-nalini-anantharaman-is-changing-the-world-of-numbers/",
    "snippet": "In 2013, Nalini received the CNRS Silver Medal and two years later was elected as a member of the Academia Europaea, and was the plenary speaker at the 2018 International Congress of Mathematicians. Now a mother of two, the mathematician is a vocal advocate of women’s rights. Encouraging young girls to take up a career in maths, she added, “I would tell a young woman that the career of a mathematician is rather well suited for a woman; of course, it requires a lot of work but it provides some flexibility since one can organise one’s work.",
    "published": "September 22, 2022"
  },
  {
    "title": "Nalini Anantharaman - USIAS - University of Strasbourg",
    "url": "https://www.usias.fr/en/chairs/nalini-anantharaman/",
    "snippet": "Nalini Anantharaman is a <strong>French mathematician who has won major prizes, including the Henri Poincaré Prize in 2012.</strong> She attended the Ecole normale supérieure (ENS) and stayed in Paris to go on to complete her PhD at the Pierre and Marie Curie University in 2000, under the supervision of François ...",
    "published": null
  },
  {
    "title": "Nalini Anantharaman | Académie des sciences",
    "url": "https://www.academie-sciences.fr/en/nalini-anantharaman",
    "snippet": "Nalini Anantharaman is a <strong>professor at the IRMA Institute for Advanced Mathematical Research (CNRS/Université de Strasbourg).</strong> After a thesis in mathematics defended in 2000, Nalini Anantharaman became a lecturer at ENS Lyon, then a research fellow at CNRS and a professor at Université Paris-Sud.",
    "published": null
  },
  {
    "title": "Nalini Anantharaman | Collège de France",
    "url": "https://www.college-de-france.fr/en/person/nalini-anantharaman",
    "snippet": "Nalini Anantharaman&#x27;s research focuses on the geometric description of wave propagation. It combines dynamical systems theory, partial differential equations, symplectic and Riemannian geometry, and probability theory.",
    "published": "February 19, 2025"
  }
]