[
  {
    "title": "Nadia Calviño",
    "url": "https://www.eib.org/en/about/governance-and-structure/statutory-bodies/management-committee/members/nadia-calvino",
    "snippet": "Calviño served as First Vice-President of Spain and Minister of Economy, Trade and Enterprise until December 2023. Prior to that role, she held various positions, including Second Vice-President and Minister for Economy and Digitalization (March-July 2021), Third Vice-President and Minister for Economy and Digitalization (2020-2021) and Minister for Economy and Business (2018-2020). Additionally, she chaired the International Monetary and Financial Committee (IMFC) of the International Monetary Fund from 2022 to 2023.",
    "published": "3 weeks ago"
  },
  {
    "title": "Nadia Calviño - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nadia_Calvi%C3%B1o",
    "snippet": "European Bank for Reconstruction and Development (EBRD), Ex-Officio Member of the Board of Governors (2018–2023)",
    "published": "6 days ago"
  },
  {
    "title": "La Moncloa. 08/05/2019. Nadia Calviño to become chair of European Bank of Reconstruction and Development's board of governors [Government/News]",
    "url": "https://www.lamoncloa.gob.es/lang/en/gobierno/news/Paginas/2019/20190508chair-ebrd.aspx",
    "snippet": "08 May 2019. The board of governors of the European Bank for Reconstruction and Development (EBRD) has officially appointed the Acting Minister for Economy and Business of Spain, Nadia Calviño, as its new chair.",
    "published": null
  },
  {
    "title": "Nadia Calviño takes over as EIB President",
    "url": "https://www.eib.org/en/press/news/nadia-calvino-takes-over-as-eib-president",
    "snippet": "Calviño takes over from <strong>Werner Hoyer</strong>, who had been president of the Bank since 2012.",
    "published": null
  },
  {
    "title": "Nadia Calviño, President of the European Investment Bank Group — SAIS Foreign Policy Institute",
    "url": "https://www.fpi.sais.jhu.edu/upcoming-events/nadia-calvio-president-of-the-european-investment-bank-group",
    "snippet": "Calviño served as First Vice-President of Spain and Minister of Economy, Trade, and Enterprise until December 2023. Prior to that role, she held various positions, including Second Vice-President and Minister for Economy and Digitalization (March-July 2021), Third Vice-President and Minister for Economy and Digitalization (2020-2021), and Minister for Economy and Business (2018-2020). Additionally, she chaired the International Monetary and Financial Committee (IMFC) of the International Monetary Fund from 2022 to 2023.",
    "published": null
  }
]