[
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "Robert Nicholas Burns (born January ... States ambassador to China from 2022 to 2025. He is now <strong>Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations at Harvard John F</strong>....",
    "published": "September 26, 2025"
  },
  {
    "title": "Biography: Amb. R. Nicholas Burns",
    "url": "https://1997-2001.state.gov/about_state/biography/burns.html",
    "snippet": "R. Nicholas Burns is <strong>United States Ambassador to Greece</strong>. Appointed by President Clinton, he was sworn into office by Secretary of State Madeleine Albright on November 10, 1997. As Ambassador, he oversees all U.S. government programs at the U.S. Embassy in Athens and at the Consulate General ...",
    "published": null
  },
  {
    "title": "R. Nicholas Burns - Former Under Secretary of State for Political Affairs",
    "url": "https://georgewbush-whitehouse.archives.gov/government/nburns-bio.html",
    "snippet": "Ambassador R. Nicholas Burns was the <strong>Under Secretary of State for Political Affairs</strong>, the Department of State’s third ranking official. Appointed by President Bush, he was confirmed by the U.S. Senate on March 17, 2005 and was sworn into office by Secretary of State Condoleezza Rice.",
    "published": null
  },
  {
    "title": "Nicholas Burns | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty/nicholas-burns",
    "snippet": "Ambassador Nicholas Burns is the ... Harvard University’s Kennedy School of Government. He is the <strong>Founder and Faculty Chair of the Future of Diplomacy Project</strong>. He is also a Faculty Affiliate at Harvard’s Fairbank Center for ...",
    "published": null
  },
  {
    "title": "R. Nicholas Burns - Under Secretary of State for Political Affairs (Text Only)",
    "url": "https://georgewbush-whitehouse.archives.gov/government/text/nburns-bio.html",
    "snippet": "Ambassador R. Nicholas Burns is the <strong>Under Secretary of State for Political Affairs</strong>, the Department of State’s third ranking official. Appointed by President Bush, he was confirmed by the U.S. Senate on March 17, 2005 and was sworn into office by Secretary of State Condoleezza Rice.",
    "published": null
  }
]