[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "In 1948 they relocated to Amritsar, where he studied at Hindu College, Amritsar. He attended <strong>Panjab University, then in Hoshiarpur, Punjab</strong>, studying Economics and got his bachelor&#x27;s and master&#x27;s degrees in 1952 and 1954, respectively, standing first throughout his academic career.",
    "published": "2 days ago"
  },
  {
    "title": "Manmohan Singh Education: Former PM Schooling, Colleges, Degrees and Academic Achievements",
    "url": "https://www.jagranjosh.com/articles/manmohan-singh-education-qualification-1735280163-1",
    "snippet": "Dr. Singh completed his Master’s degree in Economics from <strong>Punjab University</strong> in 1954 with excellent results. Dr Manmohan Singh&#x27;s hunt for knowledge took him to the University of Cambridge in the United Kingdom, where he enrolled at St.",
    "published": "December 27, 2024"
  },
  {
    "title": "The Education of Manmohan Singh - The Wire",
    "url": "https://m.thewire.in/article/economy/the-education-of-manmohan-singh",
    "snippet": "When I had the chance, in a memorable ... thoroughgoing attack on the economic verities of the day. From <strong>Oxford, left for the UN in New York, and the Delhi School of Economics</strong> after that. By 1971, he had entered government service, never ...",
    "published": "December 28, 2024"
  },
  {
    "title": "Dr Manmohan Singh’s Education: Alumnus of Panjab University, Oxford, and Cambridge",
    "url": "https://bestcolleges.indiatoday.in/news-detail/dr-manmohan-singhs-education-alumnus-of-panjab-university-oxford-and-cambridge",
    "snippet": "Dr Manmohan Singh’s illustrious academic journey spans <strong>Panjab University, Oxford, and Cambridge</strong>, reflecting his brilliance as a scholar and economist",
    "published": "December 27, 2024"
  },
  {
    "title": "Passing of alumnus Prime Minister Manmohan Singh | Faculty of Economics",
    "url": "https://www.econ.cam.ac.uk/news/2025/passing-alumnus-prime-minister-manmohan-singh",
    "snippet": "Manmohan Singh was born in 1932, in a village in the Punjab province of the then undivided India. Dr. Singh’s academic credentials were burnished by the years he spent on the faculty of <strong>Punjab University and the prestigious Delhi School of Economics</strong>. He had a brief stint at the UNCTAD Secretariat ...",
    "published": null
  }
]