[
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Kaptur was one of the 53 Democrats in the House to sign the letter.[39][40] ... Ballotpedia monitors legislation that receives a vote and highlights the ones that we consider to be key to understanding where elected officials stand on the issues. To read more about how we identify key votes, click here. The 118th United States Congress began on January 3, 2023, and ended on January 3, 2025.",
    "published": null
  },
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "She later supported the measure, voting in favor of the DREAM Act in 2021. Kaptur voted against the Equal Representation Act in 2024, which proposed excluding noncitizens ineligible to vote from the population counts used to determine congressional representation. In February 2025, Kaptur raised ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Congresswoman Marcy Kaptur |Representing the 9th District of Ohio",
    "url": "https://kaptur.house.gov/",
    "snippet": "Kaptur Statement On Federal Inaction From HHS And Impact On Toledo Teachers, Students, And Head Start Program · December 1, 2025 | Press Release · Toledo, OH – Today, Congresswoman Marcy Kaptur (OH-09) released the following statement after the Department of Health and Human Services (HHS) failed to provide funding for Toledo Public Schools Head Start Program, causing the closure of the program effective immediately, today December 1st.",
    "published": null
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "BILL 1. H.R.6198 — 119th Congress (2025-2026) <strong>Rear Admiral</strong> Alene Duerk Ship Renaming Act of 2025 Sponsor: Kaptur, Marcy [Rep.-D-OH-9] (Introduced 11/20/2025) Cosponsors: (3) Committees: House - Armed Services Latest Action: House - 11/20/2025 ...",
    "published": null
  },
  {
    "title": "KAPTUR, MARCY HON. M.C. - Candidate overview - FEC.gov",
    "url": "https://www.fec.gov/data/candidate/H2OH09031/",
    "snippet": "› KAPTUR, MARCY HON. M.C. Candidate for House Ohio - 09 ID: H2OH09031 DEMOCRATIC PARTY · Election · 2026 · 2024 · 2022 · 2020 · 2018 · 2016 · 2014 · 2012 · 2010 · 2008 · 2006 · 2004 · 2002 · 2000 · 1998 · 1996 · 1994 · 1992 · 1990 · 1988 · 1986 · 1984 · 1982 Data is included from these committees: KAPTUR FOR CONGRESS (C00154625) Browse receipts · Coverage dates: 01/01/2025 to 09/30/2025 ·",
    "published": null
  }
]