[
  {
    "title": "List of Chelsea F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Chelsea_F.C._managers",
    "snippet": "The first manager of Chelsea Football Club was <strong>John Robertson</strong>, appointed player-manager in 1905. The current head coach is Enzo Maresca. Chelsea have had 32 permanent managers/head coaches (of whom four also served as player-manager), six interim ...",
    "published": "3 days ago"
  },
  {
    "title": "Enzo Maresca - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Enzo_Maresca",
    "snippet": "On 3 June 2024, Premier League club Chelsea announced that <strong>Maresca</strong> would be joining as head coach on 1 July, signing a five-year deal with an option to extend for a further year.",
    "published": "3 days ago"
  },
  {
    "title": "Chelsea Coaching Staff - The Chelsea Chronicle",
    "url": "https://www.thechelseachronicle.com/club/coaching-staff/",
    "snippet": "While Maresca took over from <strong>Mauricio Pochettino</strong> effective July 1, 2024. Maresca is the club’s fifth manager since Todd Boehly led a consortium in becoming the owners of Chelsea in 2022.",
    "published": "June 4, 2024"
  },
  {
    "title": "Chelsea Football Club is delighted to announce the appointment of Enzo Maresca as new head coach of the men’s team.",
    "url": "https://www.chelseafc.com/en/news/article/enzo-maresca-to-become-chelsea-mens-head-coach",
    "snippet": "Chelsea Football Club is delighted to announce the appointment of <strong>Enzo Maresca</strong> as new head coach of the men’s team. The Italian will begin his new role on 1 July 2024 on a five-year contract, with a club option of a further year.",
    "published": null
  },
  {
    "title": "Chelsea appoint Enzo Maresca as head coach",
    "url": "https://www.premierleague.com/en/news/4030968",
    "snippet": "Italian signs five-year deal as he leaves Leicester City to replace Mauricio Pochettino at Stamford Bridge · Chelsea have announced the appointment of <strong>Enzo Maresca</strong> as their new head coach.",
    "published": null
  }
]