[
  {
    "title": "Zaza Pachulia Stats, Height, Weight, Position, Draft Status and more | Basketball-Reference.com",
    "url": "https://www.basketball-reference.com/players/p/pachuza01.html",
    "snippet": "Checkout the latest stats of Zaza Pachulia. Get info about his position, age, height, weight, draft status, shoots, school and more on Basketball-Reference.com",
    "published": null
  },
  {
    "title": "Ex-Warriors center Zaza Pachulia excited to unite Bay Area via sports – NBC Sports Bay Area & California",
    "url": "https://www.nbcsportsbayarea.com/nba/golden-state-warriors/all-star-weekened-super-bowl-world-cup-zaza-pachulia/1824987/",
    "snippet": "Former Warriors center Zaza Pachulia sits down with Fetsus Ezeli on NBC Sports Bay Area’s “Uniting the Bay Through Sport” to discuss the reason why he decided to be apart of the Bay Area Host Committee as <strong>San Francisco</strong> hosts the 2025 NBA ...",
    "published": "February 11, 2025"
  },
  {
    "title": "Zaza Pachulia Player Profile, Detroit Pistons - RealGM",
    "url": "https://basketball.realgm.com/player/Zaza-Pachulia/Summary/311",
    "snippet": "Zaur Pachulia · Height: 6-11 (211cm) Weight: 270 lbs (122kg) Born: Feb 10, 1984 (41 years old) Hometown: Tbilisi, Georgia · Nationality: Georgia · Current NBA Status: Unrestricted Free Agent · Agent: Mark Bartelstein · NBA Draft: 2003 Round 2, Pick 13, Orlando Magic · Pre-Draft Team: Alpella B.K. (Turkey) 2x NBA Champion · More Zaza Pachulia Game Logs » ·",
    "published": null
  },
  {
    "title": "Zaza Pachulia | Center | Atlanta Hawks",
    "url": "https://www.nba.com/player/2585/zaza-pachulia",
    "snippet": "Follow the action on NBA scores, schedules, stats, news, teams, and players. Buy tickets or watch the games anywhere with NBA League Pass.",
    "published": null
  },
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "Zaza Pachulia (Georgian: ზაზა ფაჩულია; Georgian pronunciation: [zaza patʃʰulia] born Zaur Pachulia; 10 February 1984) is a Georgian professional basketball executive and former player who is a basketball operations consultant for the Golden State Warriors of the National Basketball Association (NBA). Beginning his professional career in Turkey as a teenager, Pachulia was drafted in the second round of the 2003 NBA draft by the Orlando Magic. He played for seven teams in his 16-year NBA career, winning two championships with the Warriors in 2017 and 2018.",
    "published": "November 6, 2025"
  }
]