[
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "Born 27 March 1955 in Santiago de Compostela, in the Galician province of A Coruña, in Spain, Rajoy is the grandson of Enrique Rajoy Leloup, one of the architects of the Galician Statute of Autonomy (1936) (Estatuto de autonomía de Galicia), who was removed from university teaching by the Franco dictatorship in the early 1950s. He is the son of Olga Brey López and Mariano Rajoy Sobredo, a jurist, and president of the Provincial Court of Pontevedra, the city where he grew up.",
    "published": "March 8, 2004"
  },
  {
    "title": "La Moncloa. 26/09/2018. Mariano Rajoy Brey [Presidents since 1978]",
    "url": "https://www.lamoncloa.gob.es/lang/en/presidente/presidents/Paginas/marianorajoy_BIO.aspx",
    "snippet": "26 September 2018. Place of birth: Santiago de Compostela (A Coruña)Date of birth: 27 March 1955Education: <strong>Bachelor of Law from the University of Santiago de Compostela</strong>Married with two children",
    "published": null
  },
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "Mariano Rajoy, Spanish politician who served as prime minister of Spain from 2011 to 2018. He took office amid the European debt crisis and implemented harsh but effective austerity measures. A corruption scandal involving his party’s misuse of campaign funds led to his removal by a vote ...",
    "published": "December 6, 2011"
  },
  {
    "title": "Mariano Rajoy - the patient man of Spanish politics - BBC News",
    "url": "https://www.bbc.com/news/world-europe-15781440",
    "snippet": "Born the Roman Catholic son of a lawyer in 1955, Mr Rajoy was brought up in Santiago de Compostela, north-western Spain, and after <strong>studying law became a land registrar</strong>.",
    "published": "June 1, 2018"
  },
  {
    "title": "Mariano Rajoy - Netex",
    "url": "https://marketplace.netexlearning.com/en/speaker/mariano-rajoy/",
    "snippet": "Mariano Rajoy es <strong>Licenciado en Derecho por la Universidad de Pontevedra</strong> y fue registrador de la propiedad. Presidente de la Diputación de Pontevedra de (1983 -1986) y vicepresidente de la Xunta de Galicia.",
    "published": "December 11, 2023"
  }
]