[
  {
    "title": "Governance Structure - IAU",
    "url": "https://www.iau-aiu.net/Governance-Structure",
    "snippet": "The General Conference decides on the main strategic goals of the association, approves its four year plans, any policy statements or positions elaborated. It elects the President and members of the Administrative Board. ... Elected for a 4-year non-renewable term, the IAU President is elected from among members of the Administrative Board by the General Conference. He/She chairs the Administrative Board and the Executive Committee.",
    "published": null
  },
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "The IAU is composed of individual members, who include both professional astronomers and junior scientists, and national members, such as professional associations, national societies, or academic institutions. Individual members are organised into divisions, committees, and working groups centered on particular subdisciplines, subjects, or initiatives.",
    "published": "5 days ago"
  },
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "The IAU will celebrate its 75th Anniversary in 2025. Dr van’t Land fosters the key role of higher education in societal transformation. She supervises the overall programme activities of the IAU, develops the Association’s strategic plans and oversees the everyday work of the secretariat. She positioned the IAU as partner in UNESCO work on Education for sustainable development and in the UNESCO Futures of Education initiative, and higher education as a key stakeholder for the UN Agenda 2030 – Transforming our world.",
    "published": null
  },
  {
    "title": "U.S. National Committee for the International Astronomical Union (IAU)",
    "url": "https://www.nationalacademies.org/units/PGA-BISO-18-P-52",
    "snippet": "He currently serves on the steering committee for the IAU Office for Young Astronomers (OYA). <strong>Christine Jones Forman</strong>’s present position is Senior Astrophysicist, Center for Astrophysics, Harvard &amp; Smithsonian.",
    "published": null
  },
  {
    "title": "Election results of the IAU Executive Council and Area Representatives for 2021-2025 - IAU - International Association of Ultrarunners",
    "url": "https://iau-ultramarathon.org/election-results-of-the-iau-executive-council-and-area-representatives-for-2021-2025.html",
    "snippet": "After the congress the 2021 election of the IAU Executive Council and Area Representatives for 2021-2025 period took place. The voting process was done online in a period of 5 consecutive days. The voting was done in line with the IAU Constitution and each ballot remained open for 24h time frame. ... There was only one candidate for IAU President and Nadeem Khan (CAN) was declared IAU President during congress. ... There were 3 candidates for the position of IAU Vice-President.",
    "published": "May 27, 2021"
  }
]