[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The paper was founded with the 1897 merger of the Summit Beacon, first published in 1839, and the Akron Evening Journal, founded in 1896. In 1903, the Beacon Journal was purchased by <strong>Charles Landon Knight</strong>. His son John S. Knight inherited the paper, in 1933, on Charles&#x27; death.",
    "published": "1 week ago"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media | Crain's Cleveland Business",
    "url": "https://www.crainscleveland.com/article/20180411/news/157966/akron-beacon-journal-sold-gatehouse-media",
    "snippet": "The award-winning paper had long been owned by <strong>Knight Ridder</strong>, but was sold to Black Press when <strong>Knight Ridder</strong> was McClatchy Co. Rick O&#x27;Connor, president and chief executive officer of Black Press, told Ohio.com that the company, based in British ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "The Akron paper was owned by <strong>the Knight family</strong> for nearly seven decades starting in 1907, and then the Knight Ridder company beginning in 1974. That company sold the Beacon Journal to McClatchy Co.",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal Sold to GateHouse Media, Owner of Columbus Dispatch, Canton Repository",
    "url": "https://www.clevescene.com/news/akron-beacon-journal-sold-to-gatehouse-media-owner-of-columbus-dispatch-canton-repository-17221068/",
    "snippet": "The Akron Beacon Journal has been sold to Gatehouse Media, the largest publisher of daily newspapers in the United States and the owner of the Columbus Dispatch, the Canton Repository and a preponderance of smaller-town dailies.",
    "published": "June 2, 2025"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media, owner of Canton and Columbus papers | wkyc.com",
    "url": "https://www.wkyc.com/article/news/local/akron/akron-beacon-journal-sold-to-gatehouse-media-owner-of-canton-and-columbus-papers/95-537352145",
    "snippet": "<strong>Black Press</strong> bought the Akron Beacon Journal in 2006 following the sale of the Beacon Journal’s former corporate parent Knight Ridder to California-based newspaper chain McClatchy Co.",
    "published": null
  }
]