[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "In 2012, <strong>Discovery Communications</strong> began to take an ownership in Eurosport, eventually leading to a full buyout in 2015. Eurosport is the main rights holder of the Olympic Games in most of Europe, as well as, with some exceptions, the tennis Grand Slam tournaments.",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport | Warner Bros. Entertainment Wiki | Fandom",
    "url": "https://warnerbros.fandom.com/wiki/Eurosport",
    "snippet": "In 2012, <strong>Discovery Communications</strong> began to take an ownership in Eurosport, eventually leading to a full buyout in 2015. Eurosport is the main rights holder of the Olympic Games in most of Europe, as well as (with some exceptions) the tennis ...",
    "published": null
  },
  {
    "title": "Discovery takes full ownership of Eurosport | Reuters",
    "url": "https://www.reuters.com/article/business/discovery-takes-full-ownership-of-eurosport-idUSL3N1024U6/",
    "snippet": "July 22 (Reuters) - Discovery Communications Inc said on Wednesday it would take full ownership of sports broadcaster Eurosport for 491 million euros ($534 million) from French media group <strong>TF1 Group</strong>.",
    "published": "July 22, 2015"
  },
  {
    "title": "Eurosport International 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/63601-30",
    "snippet": "Information on acquisition, funding, investors, and executives for Eurosport International. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "The channel is available in 73 countries, in 21 languages providing viewers with European and international sporting events. Eurosport first launched on European satellites on 5 February 1989. On 13 November 2015 Eurosport changed the name of its main channel into Eurosport 1.",
    "published": "October 31, 2025"
  }
]