[
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "World Athletics Council Vice-President (2023-present) ... Keynote in several masters, graduate schools, seminars, workshops, universities, Federations, NOC, etc. Promotional campaigns of several products and brands ... Development Commission: Chair – Kids&#x27; Athletics work stream, Member – ...",
    "published": null
  },
  {
    "title": "World Athletics President Coe discusses sport’s path with Future Leaders in Apeldoorn | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/sebastian-coe-sport-path-future-leaders-apeldoorn",
    "snippet": "World Athletics President <strong>Sebastian Coe</strong> held a wide-ranging discussion with members of the European Athletics Future Leaders Forum in Apeldoorn, the Netherlands, on Friday (7).",
    "published": null
  },
  {
    "title": "Coe re-elected and will preside over historic gender equal Council | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/sebastian-coe-president-congress-2023-gender-equal-council",
    "snippet": "World Athletics President <strong>Sebastian Coe</strong> was elected for a third term at the 54th World Athletics Congress in Budapest on Thursday (17).",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "He was the director of the Dutch Olympic Committee between 1965 and 1970 but retained an extensive involvement with athletics, becoming the European Athletics Association president upon its formation in 1970 until 1976, when he was elected as the third IAAF president. Curiously, at the age of 73, he was two years older than the man he was succeeding but Paulen was active in addressing many of the relevant issues of the changing times. The first IAAF World Cup in 1977 was contested during his brief presidency and he set in motion events that lead to the first IAAF World Championships in 1983.",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "The last election was held in October 2019 at the 2019 World Athletics Championships. Following doping and corruption issues, a Code of Ethics was agreed in 2013 and an Ethics Commission was appointed in 2014. The Council appoints the chairperson from the elected members, and in turn, the chairperson appoints a deputy chair.",
    "published": "1 week ago"
  }
]