[
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "Founded in 2006 by Richard Dawkins, the foundation’s mission is to realize Richard’s vision to remove the influence of religion in science education and public policy, and eliminate the stigma that surrounds atheism and non-belief.",
    "published": "July 17, 2025"
  },
  {
    "title": "Richard Dawkins Foundation for Reason and Science - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins_Foundation_for_Reason_and_Science",
    "snippet": "The Richard Dawkins Foundation for Reason and Science (RDFRS or RDF) is a division of Center for Inquiry (CFI) founded by British biologist Richard Dawkins in 2006 to <strong>promote scientific literacy and secularism</strong>.",
    "published": "September 22, 2025"
  },
  {
    "title": "What We Do | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/aboutus/",
    "snippet": "My greatest hope is that together ... mission is to realize Richard’s vision to <strong>remove the influence of religion in science education and public policy, and eliminate the stigma that surrounds atheism and non-belief</strong>....",
    "published": "February 4, 2021"
  },
  {
    "title": "Homepage | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/home/",
    "snippet": "From the Richard Dawkins Foundation Newsletter. Subscribe here. Hello! The Richard Dawkins Foundation for Reason &amp; Science’s mission is to <strong>promote scientific literacy and a secular worldview</strong>.",
    "published": "November 8, 2023"
  },
  {
    "title": "Richard Dawkins | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/richarddawkins/",
    "snippet": "From 1995 to 2008 Richard Dawkins was the <strong>Charles Simonyi Professor of the Public Understanding of Science at Oxford University</strong>. He is an internationally best-selling author.",
    "published": "April 21, 2022"
  }
]