[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "Joachim-Friedrich Martin Josef Merz was born on 11 November 1955 to <strong>Joachim Merz and Paula Sauvigny</strong> in Brilon in the state of North Rhine-Westphalia in West Germany. His father was a judge and a member of the CDU. The Sauvigny family was a locally prominent patrician family in Brilon, of French ...",
    "published": "1 week ago"
  },
  {
    "title": "Disinfo: Friedrich Merz is a descendant of Nazis",
    "url": "https://euvsdisinfo.eu/report/friedrich-merz-is-a-descendant-of-nazis/",
    "snippet": "Friedrich Merz is a descendant of Nazis; <strong>his grandfather, Josef Paul Souvigny</strong>, while mayor of Brilon during the Third Reich, named streets after Hitler and Goebbels. He was a member of the Nazi Party and a member of the SS.",
    "published": null
  },
  {
    "title": "The Nazi Heritage of Germany’s Chancellor | Countercurrents",
    "url": "https://countercurrents.org/2025/06/the-nazi-heritage-of-germanys-chancellor/",
    "snippet": "Share:Share on WhatsAppShare on FacebookShare on X (Twitter)Share on TelegramShare on RedditShare on EmailGermany’s new chancellor Friedrich Merz has a history, one that he does not like to highlight. His Opa or grandfather was a Nazi and it is this Nazi past that he is trying to keep extremely quiet about.",
    "published": "June 18, 2025"
  },
  {
    "title": "Friedrich Merz (b. 1950s) | WikiTree FREE Family Tree",
    "url": "https://www.wikitree.com/wiki/Merz-448",
    "snippet": "Joachim-Friedrich Martin Josef ... Union (CDU). His mother, Paula Merz (née Sauvigny, b. 1928), originates from the <strong>Briloner Sauvigny-family</strong>....",
    "published": null
  },
  {
    "title": "Friedrich Merz Family History & Historical Records - MyHeritage",
    "url": "https://www.myheritage.com/names/friedrich_merz",
    "snippet": "They had <strong>2 children: Karl Merz and one other child</strong>. ... His occupation was a occupation. ... Friedrich passed away on month day 1944, at age 79 in death place.",
    "published": null
  }
]