[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "In 2021, Pochettino joined Paris Saint-Germain, where he won the Ligue 1 title and Coupe de France but left one year later. He took over as the manager of Chelsea for the <strong>2023–24 season</strong>, mutually agreeing to part ways with the club after just one season. The same year he was appointed as ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Mauricio Pochettino to become Chelsea head coach | News | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/news/article/mauricio-pochettino-to-become-chelsea-head-coach",
    "snippet": "The 51-year-old has <strong>several seasons of Premier League experience in addition to coaching in Spain and France</strong>. He was most recently in charge at Paris Saint-Germain and guided the club to a Ligue 1 title and the Coupe de France.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/mauricio-pochettino",
    "snippet": "Welcome to the official Chelsea FC website. All the latest news, videos and ticket information as well as player profiles and information about Stamford Bridge, the home of the Blues. Browse the online shop for Chelsea FC products and merchandise.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/4632/Mauricio-Pochettino/overview",
    "snippet": "Mauricio Pochettino has taken charge of three Premier League clubs: Southampton, Tottenham Hotspur and Chelsea.",
    "published": null
  },
  {
    "title": "\"Things happen\" - Mauricio Pochettino opens up on 'different reasons' for Chelsea exit",
    "url": "https://www.si.com/onsi/soccer/chelsea/news/things-happen-mauricio-pochettino-opens-up-on-different-reasons-for-chelsea-exit-01jp8dyd67s7",
    "snippet": "The 53-year-old, who is now the manager of the United States Men&#x27;s National Team (USMNT), <strong>spent just one year at Stamford Bridge under the Todd Boehly-Clearlake Capital ownership before he was eventually replaced by current head coach Enzo Maresca</strong>.",
    "published": "March 14, 2025"
  }
]