[
  {
    "title": "Who owns Borussia Dortmund (BVB)? Owners' net worth, source of wealth and ownership history",
    "url": "https://www.interestingfootball.com/2025/05/who-owns-borussia-dortmund-bvb-owners.html",
    "snippet": "Borussia Dortmund is currently owned by a publicly traded company with major shareholders including <strong>Bernd Geske, Evonik Industries AG, Signal Iduna, Ralph Dommermuth Beteiligungen GmbH and Puma SE</strong>.",
    "published": null
  },
  {
    "title": "Who Owns Borussia Dortmund? BVB Shareholders - Investing.com",
    "url": "https://www.investing.com/equities/borussia-dortmund-gmbh-co-kgaa-ownership",
    "snippet": "Discover who owns Borussia Dortmund. Access the ownership overview, view the top Borussia Dortmund shareholders, institutional holders, and leading mutual fund investors.",
    "published": null
  },
  {
    "title": "Borussia Dortmund 2025 Company Profile: Stock Performance & Earnings | PitchBook",
    "url": "https://pitchbook.com/profiles/company/59881-15",
    "snippet": "As of 29-Sep-2025 the stock price of Borussia Dortmund is $4.15. The current market capitalization of Borussia Dortmund is <strong>$458M</strong>.",
    "published": null
  },
  {
    "title": "Borussia Dortmund GmbH & Co. Kommanditgesellschaft auf Aktien's (ETR:BVB) top owners are retail investors with 56% stake, while 16% is held by private companies",
    "url": "https://finance.yahoo.com/news/borussia-dortmund-gmbh-co-kommanditgesellschaft-044857729.html",
    "snippet": "The company&#x27;s largest shareholder is <strong>Bernd Geske, with ownership of 8.3%</strong>. For context, the second largest shareholder holds about 8.2% of the shares outstanding, followed by an ownership of 6.0% by the third-largest shareholder.",
    "published": "October 31, 2025"
  },
  {
    "title": "Borussia Dortmund GmbH & Co. KGaA | Info - EQS News",
    "url": "https://www.eqs-news.com/company/borussia-dortmund-gmbh-co-kgaa/info/5b767315-ea7c-11e8-902f-2c44fd856d8c",
    "snippet": "... <strong>Carsten Cramer</strong>, born on December 23, 1968 in Münster, began his professional career as Managing Director and Head of Marketing at the traditional football club “Preußen Münster”. He then moved to sports rights marketing agency “Ufa” (later “Sportfive”).",
    "published": null
  }
]