[
  {
    "title": "Sam Mostyn - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sam_Mostyn",
    "snippet": "On 3 April 2024, Prime Minister Anthony Albanese announced that King Charles III had approved the appointment of Mostyn as the next governor-general of Australia, succeeding <strong>David Hurley</strong>, and that she would be sworn in on 1 July 2024.",
    "published": "1 week ago"
  },
  {
    "title": "Governor-General of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Governor-General_of_Australia",
    "snippet": "From Federation in 1901 until 1965, 11 out of the 15 governors-general were British aristocrats; however, all since then have been Australian citizens. The current governor-general, Samantha Mostyn, is the second woman to hold the post, after <strong>Dame Quentin Bryce</strong> (2008–2014).",
    "published": "5 days ago"
  },
  {
    "title": "The Governor-General's biography | Governor-General of the Commonwealth of Australia",
    "url": "https://www.gg.gov.au/about-governor-general/governor-generals-biography",
    "snippet": "Her Excellency the Honourable Ms Sam Mostyn ACGovernor-General of the Commonwealth of Australia",
    "published": null
  },
  {
    "title": "About the Governor-General | Governor-General of the Commonwealth of Australia",
    "url": "https://www.gg.gov.au/about-governor-general",
    "snippet": "The Governor-General of the Commonwealth of Australia is Her Excellency the Honourable Ms Sam Mostyn AC.",
    "published": null
  },
  {
    "title": "Samantha Mostyn: Australia's last governor-general?",
    "url": "https://www.crikey.com.au/2024/07/03/samantha-mostyn-australias-last-governor-general/",
    "snippet": "Watching the governor-general’s swearing in, I found myself deeply unsettled as an advocate for an Australian head of state — and also, more than a little bit proud. What did we see on Monday? After a smoking ceremony by Ngunnawal-Wiradjuri Elder Aunty Serena Williams, then a brief military salute from the Australian Federation Guard, “the commission from his majesty the king appointing Ms Samantha Joy Mostyn AC to be the governor-general of the Commonwealth of Australia”. Appointed, that is, with the words of Charles III: “By the grace of God” and “during our pleasure …",
    "published": "July 2, 2024"
  }
]