[
  {
    "title": "Governor Brian P. Kemp Office of the Governor - Georgia.gov",
    "url": "https://gov.georgia.gov/",
    "snippet": "Governor <strong>Brian P.</strong>",
    "published": null
  },
  {
    "title": "Brian Kemp - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Brian_Kemp",
    "snippet": "There was speculation that he would run in the 2026 United States Senate election in Georgia to challenge incumbent senator Jon Ossoff; in May 2025, he declined to run and endorsed <strong>Derek Dooley</strong>. Kemp was inaugurated as governor in a public ceremony in Atlanta on January 14, 2019.",
    "published": "2 weeks ago"
  },
  {
    "title": "2026 Georgia gubernatorial election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2026_Georgia_gubernatorial_election",
    "snippet": "Republicans also control both the state senate and house of representatives, together with Kemp&#x27;s governorship establishing a government trifecta, alongside complete Republican pick on the state&#x27;s supreme court. A year prior to the elections, the 2025 Georgia Public Service Commission special election resulted in two Democrats being elected to the Commission.",
    "published": "2 weeks ago"
  },
  {
    "title": "They want to be Georgia's next governor. Candidates make pitches in forum a year ahead of election | Georgia Public Broadcasting",
    "url": "https://www.gpb.org/news/2025/11/06/they-want-be-georgias-next-governor-candidates-make-pitches-in-forum-year-ahead-of",
    "snippet": "Current Georgia Gov. <strong>Brian Kemp</strong> is term-limited and cannot run for reelection. Tags: Georgia Georgia Politics Governor&#x27;s Race Election 2026 GPB News",
    "published": "November 6, 2025"
  },
  {
    "title": "Governor Brian Kemp | Facebook",
    "url": "https://www.facebook.com/GovKemp/",
    "snippet": "Governor <strong>Brian Kemp</strong>. 201,348 likes · 6,772 talking about this. Georgia Governor Brian P. Kemp is a husband, father, businessman, and public servant.",
    "published": null
  }
]