[
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The current president is <strong>Hiraku Nakajima</strong>. At the 16th meeting of the IMU General Assembly in Bangalore, India, in August 2010, Berlin was chosen as the location of the permanent office of the IMU, which was opened on January 1, 2011, and is hosted by the Weierstrass Institute for Applied Analysis ...",
    "published": "February 24, 2025"
  },
  {
    "title": "| International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/",
    "snippet": "The book &quot;Mathematicians of the World, Unite!&quot; by G. Curbera is now electronically available on the IMU website. For more information click here · If you want to subscribe to IMU News, please click on the button. ... In preparation for the IMU General Assembly in July 2026, the Adhering Organizations of IMU Members are asked to appoint and certify their delegations to the Secretary General. See AO CL 9/2025.",
    "published": null
  },
  {
    "title": "IMU News 132: July 2025 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/imu-news/archive/2025/imu-news-132-july-2025",
    "snippet": "The framed photograph is from 2002, when Chairman Jiang Zemin and Vice-Premier Li Lanqing received mathematicians during the ICM in Beijing, including Palis, then the President of the IMU. Photo credit: Paula Dugin · <strong>Jacob Palis</strong> passed away on May 7, 2025, at the age of 85, in Rio de Janeiro, ...",
    "published": null
  },
  {
    "title": "ICMI Newsletter - March 2025 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/icmi/icmi-newsletter-march-2025",
    "snippet": "I am especially thankful that <strong>Frederick Leung</strong> remains on the EC (ex officio) as past President, so that I can draw on his advice and example of wise leadership over the past four years. With this Editorial, then, I want to send my warmest greetings to our international mathematics education ...",
    "published": null
  },
  {
    "title": "Home | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/?id=1009",
    "snippet": "IMU President <strong>Carlos E. Kenig&#x27;s</strong> article The International Mathematical Union (IMU) at 100 appeared in Notices of the American Mathematical Society Volume 67, Number 3, pages 404–407 published in March 2020.",
    "published": null
  }
]