[
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "The ultra-conservative former congressman José Antonio Kast has been elected as Chile’s next president.",
    "published": "13 hours ago"
  },
  {
    "title": "Kast’s Victory in Chile Is Another Win for Global Right-Wing Movement - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/americas/chile-kast-right-wing-movement.html",
    "snippet": "Kast was elected as Chile’s president on his third try, scoring a resounding victory against his leftist opponent and pushing the country decidedly to the right as Chileans sought iron-fisted solutions to increased violence and illegal immigration. Mr. Kast, a stern father of nine with deep ideological roots in conservative Catholicism and economic neoliberalism, belongs to a global right-wing movement that has risen to power around the world by prioritizing strict law and order and sealing borders.",
    "published": "19 hours ago"
  },
  {
    "title": "Chile's New Rightwing President Jose Antonio Kast Makes Liberty Advance Over Socialism in Latin America | The Gateway Pundit | by Paul Serran",
    "url": "https://www.thegatewaypundit.com/2025/12/chiles-new-rightwing-president-jose-antonio-kast-makes/",
    "snippet": "Pro-life, pro-family Catholic politician José Antonio Kast, a father of nine, has won Chile’s presidential election, defeating his communist rival. pic.twitter.com/ADiYQYn2Te · — Sachin Jose (@Sachinettiyil) December 14, 2025",
    "published": "1 day ago"
  },
  {
    "title": "Chile elects Kast as president in sharp rightward shift | Reuters",
    "url": "https://www.reuters.com/world/americas/chile-votes-presidential-race-expected-lurch-country-right-2025-12-14/",
    "snippet": "[1/3]Jose Antonio Kast, presidential ... to their supporters as they celebrate after <strong>Kast won Chile&#x27;s presidency in a presidential runoff election, in Santiago, Chile, December 14, 2025</strong>....",
    "published": "1 day ago"
  },
  {
    "title": "Far-right José Antonio Kast wins Chile's presidential vote | AP News",
    "url": "https://apnews.com/article/chile-elections-kast-jara-president-boric-trump-e9ef32b53359f3152ee80d62c106c5f6",
    "snippet": "Presidential candidate Jose Antonio Kast, of the opposition Republican Party, and his wife Maria Pia Adriasola wave to supporters after <strong>winning the presidential runoff election in Santiago, Chile, Sunday, Dec. 14, 2025</strong>.",
    "published": "2 days ago"
  }
]