[
  {
    "title": "François Bayrou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fran%C3%A7ois_Bayrou",
    "snippet": "François Bayrou (French: [fʁɑ̃swa bajʁu] ⓘ; born 25 May 1951) is a French politician who served as Prime Minister of France from <strong>December 2024 to September 2025</strong>. He has presided over the European Democratic Party (EDP) since 2004 and the Democratic Movement (MoDem) since 2007.",
    "published": "1 week ago"
  },
  {
    "title": "Bayrou government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bayrou_government",
    "snippet": "He is also considered a loyal supporter of President Macron, whom he supported in 2017 presidential election. He was nominated Minister of State and Justice in the first Philippe Government, <strong>between May and June 2017.</strong> François Bayrou was supported by the Macronist bloc, while being rejected ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Resignation of French PM François Bayrou: Causes & Implications",
    "url": "https://www.paradigmshift.com.pk/french-pm-resignation/",
    "snippet": "When Prime Minister François Bayrou gave his resignation as leader of the government to President Emmanuel Macron at the beginning of September 2025, it caused a lot of political turmoil in France. With just <strong>nine months</strong> in government, Bayrou, ...",
    "published": "September 21, 2025"
  },
  {
    "title": "From farmer to premier: who is François Bayrou, the new French prime minister? | France | The Guardian",
    "url": "https://www.theguardian.com/world/2024/dec/13/from-farmer-to-premier-who-is-francois-bayrou-the-new-french-prime-minister",
    "snippet": "He was education minister during presidencies of the Socialist François Mitterrand and the rightwing Jacques Chirac. He gained notoriety during his 2002 campaign for president when, on a walkabout in a neighbourhood of Strasbourg, a child allegedly tried to pick his pocket and he slapped him in the face. The incident led to a rise in his poll ratings. Bayrou is head of the centrist MoDem party, which has been part of Macron’s centrist alliance since 2017.",
    "published": "December 15, 2024"
  },
  {
    "title": "Macron appoints centrist ally François Bayrou as France's fourth prime minister in 2024",
    "url": "https://www.lemonde.fr/en/france/article/2024/12/13/macron-appoints-francois-bayrou-as-france-s-fourth-prime-minister-in-2024_6736030_7.html",
    "snippet": "French President Emmanuel Macron appointed François Bayrou as prime minister on <strong>Friday, December 13,</strong> over a week after lawmakers voted to oust conservative ex-prime minister Michel Barnier.",
    "published": "December 13, 2024"
  }
]