[
  {
    "title": "Washington Commanders Ownership Group",
    "url": "https://www.commanders.com/team/front-office-roster/ownership-group",
    "snippet": "Learn more about the Washington Commanders ownership group.",
    "published": null
  },
  {
    "title": "Washington Commanders - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Washington_Commanders",
    "snippet": "Sister NBC owned-and-operated station ... With the sale of NBC Sports Washington by NBCUniversal to Washington Capitals and Washington Wizards owner <strong>Ted Leonsis</strong>, the network declined to renew its rights to the team. Most regular season Commanders games are carried by NFL ...",
    "published": "1 week ago"
  },
  {
    "title": "Controlling owner Josh Harris says Washington Commanders name is not changing",
    "url": "https://www.nfl.com/news/controlling-owner-josh-harris-says-washington-commanders-name-is-not-changing",
    "snippet": "Washington Commanders controlling owner <strong>Josh Harris</strong> said Monday the team name is not changing. Harris said the name is here to stay after inheriting it when he and his group bought the team from longtime owner Dan Snyder in 2023.",
    "published": "February 3, 2025"
  },
  {
    "title": "Who Is Josh Harris, the Washington Commanders’ Owner?",
    "url": "https://www.sportico.com/feature/josh-harris-washington-commanders-owner-1234744099/",
    "snippet": "In purchasing the Commanders for an NFL record $6 billion, Harris teamed up with Blitzer, local billionaire Mitchell Rales and Los Angeles Lakers legend Magic Johnson. Harris’ ownership group also includes Washington Open chairman Mark Ein, Los Angeles Sparks managing partner Eric Holoman, Maverick Capital managing partner Lee Ainslie, former Google CEO Eric Schmidt, Blue Owl Capital co-CEO Marc Lipschultz and the Santo Domingo family.",
    "published": "January 17, 2025"
  },
  {
    "title": "Who owns the Commanders? Full list of Washington's owernship group, from Josh Harris to Magic Johnson | Sporting News",
    "url": "https://www.sportingnews.com/us/nfl/washington-commanders/news/who-owns-commanders-washington-josh-harris-magic-johnson/b56f31c1092974179eda6b6a",
    "snippet": "In 2023, NFL owners unanimously approved the sale of the Commanders to an ownership group led by private equity investor <strong>Josh Harris</strong>, shoving Snyder out of the door. Who else was involved in the purchase of Washington&#x27;s football team?",
    "published": "January 26, 2025"
  }
]