[
  {
    "title": "Agency",
    "url": "https://www.usgovernmentmanual.gov/Agency?EntityId=kekueV+zvXk%3D&ParentEId=+klubNxgV0o%3D&EType=jY3M4CTKVHY%3D",
    "snippet": "The Administration does not operate on funds appropriated by Congress: It derives income from assessments collected from the institutions that it regulates and examines. In addition to its headquarters in <strong>McLean, VA</strong>, the Administration maintains four field offices located in Bloomington, MN; ...",
    "published": null
  },
  {
    "title": "Financial Conduct Authority - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Financial_Conduct_Authority",
    "snippet": "Specifically, the Act gave the Bank of England responsibility for financial stability, bringing together macro and micro prudential regulation, and created a new regulatory structure consisting of the Bank of England&#x27;s Financial Policy Committee, the Prudential Regulation Authority and the Financial Conduct Authority. On 26 October 2015, the FCA brought in rules banning regulated financial services firms from offering premium rate 084, 087 or 09 telephone numbers for customer contact.",
    "published": "2 weeks ago"
  },
  {
    "title": "Farm Credit Administration",
    "url": "https://www.fca.gov/utility-pages",
    "snippet": "On Route 123 North, move immediately to one of the two left-turn lanes. Turn left at the stop light onto Lewinsville Road. Turn left at the second stop light onto Farm Credit Drive. FCA headquarters are located on the left at <strong>1501 Farm Credit Drive</strong>.",
    "published": null
  },
  {
    "title": "FCA US LLC Company Profile - Overview - GlobalData",
    "url": "https://www.globaldata.com/company-profile/fca-us-llc/",
    "snippet": "In addition to this, the company ... Caribbean Islands. The company is a subsidiary of Fiat Chrysler Automobiles NV. FCA US is headquartered in <strong>Auburn Hills, Michigan</strong>, the US....",
    "published": null
  },
  {
    "title": "About us | Farm Credit Administration",
    "url": "https://www.fca.gov/about/about-fca",
    "snippet": "FCA’s mission is to ensure that ... the agency derives its authority from the Farm Credit Act of 1971, as amended. Our headquarters are located in <strong>McLean, Virginia</strong>....",
    "published": null
  }
]