[
  {
    "title": "President of Ethiopia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ethiopia",
    "snippet": "The president of Ethiopia is the head of state of Ethiopia. The position is largely ceremonial with executive power vested in the Council of Ministers chaired by the prime minister. The current president is <strong>Taye Atske Selassie</strong>, who took office on 7 October 2024.",
    "published": "1 month ago"
  },
  {
    "title": "List of presidents of Ethiopia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ethiopia",
    "snippet": "After the fall of the Derg and the establishment of the Transitional Government of Ethiopia in 1991, the first immediate president (Meles Zenawi) has to be considered an Interim President.",
    "published": "October 22, 2025"
  },
  {
    "title": "Ethiopia's new president: Taye Atske Selassie replaces Sahle-Work Zewde",
    "url": "https://www.bbc.com/news/articles/c4g401e086no",
    "snippet": "Ethiopia&#x27;s parliament has approved the appointment of a new president to replace the country&#x27;s first female head of state, <strong>Sahle-Work Zewde</strong>.",
    "published": "October 7, 2024"
  },
  {
    "title": "Ethiopia picks diplomat as new president",
    "url": "https://www.voanews.com/a/ethiopia-picks-diplomat-as-new-president-/7814398.html",
    "snippet": "The parliament elects the president and the prime minister&#x27;s ruling party has a majority in the parliament. The appointment was confirmed following a joint session Monday by Ethiopia’s two houses of parliament, the House of People’s Representatives and the House of Federation, after returning from a two-month recess.",
    "published": "October 8, 2024"
  },
  {
    "title": "Sahle-Work Zewde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sahle-Work_Zewde",
    "snippet": "President Mulatu Teshome resigned suddenly on 24 October 2018, and <strong>Prime Minister Abiy Ahmed chose Sahle-Work as Teshome&#x27;s successor</strong>. This appointment was one of several by Abiy to seek gender equality on the government, as he believed that ...",
    "published": "September 26, 2025"
  }
]