[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Since Alfa Romeo was controlled by the <strong>Italian government owned Istituto per la Ricostruzione Industriale (IRI),</strong> a deal was made where about a quarter of worker&#x27;s salaries were paid through state unemployment agencies to allow Alfa&#x27;s plants to idle for two weeks every two months.",
    "published": "1 week ago"
  },
  {
    "title": "Who owns alfa romeo? - HotBot",
    "url": "https://www.hotbot.com/answers/who-owns-alfa-romeo",
    "snippet": "To save the company, <strong>the Italian government, through the state-controlled entity Istituto per la Ricostruzione Industriale (IRI), took over Alfa Romeo in 1933</strong>. This period saw Alfa Romeo producing not just automobiles, but also aircraft engines and other industrial products.",
    "published": null
  },
  {
    "title": "History of Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Alfa_Romeo",
    "snippet": "In this context, <strong>in 1933, the Italian government decided to take over the shares of Alfa Romeo that were owned by banks, officially acquiring control of the company, which thus became state-owned</strong>. In this situation, as the finances continued to worsen, some members of the Treasury Ministry ...",
    "published": "October 20, 2025"
  },
  {
    "title": "Alfa Romeo SpA | luxury cars, performance vehicles, Italian design | Britannica Money",
    "url": "https://www.britannica.com/money/Alfa-Romeo-SpA",
    "snippet": "Alfa Romeo SpA, Italian manufacturer ... company, IRI (Istituto per la Ricostruzione Industriale), until 1986, when it was sold to <strong>Fiat SpA</strong>....",
    "published": null
  },
  {
    "title": "The History of Alfa Romeo - Jeff D'Ambrosio Alfa Romeo Blog",
    "url": "https://www.alfaromeousaofdowningtown.com/blogs/5783/the-history-of-alfa-romeo",
    "snippet": "However, <strong>with the assistance of the Italian government and the support of the Red Cross, Alfa Romeo was able to rebuild and resume production under the ownership of IRI</strong>. In 1945, a new company called “Alfa Romeo ...",
    "published": "June 7, 2024"
  }
]