[
  {
    "title": "Marcelo Ebrard - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Ebrard",
    "snippet": "Marcelo Luis Ebrard Casaubón (Spanish: [maɾˈselo eˈβɾaɾð]; born 10 October 1959) is a Mexican politician and internationalist who has served as the <strong>secretary of economy</strong> since 2024. A member of the National Regeneration Movement (Morena), he previously served as secretary of foreign ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Marcelo Ebrard: Jugadores del Sistema Económico 2025 - Líder Empresarial",
    "url": "https://www.liderempresarial.com/marcelo-ebrard-jugadores-del-sistema-economico-2025/",
    "snippet": "Durante la pandemia de COVID-19, ... sanitaria. En 2025, Marcelo Ebrard <strong>encabeza una secretaría y opera como uno de los arquitectos del modelo económico que México busca consolidar</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "Cabinet Profile: Marcelo Ebrard, Secretary of the Economy | Mexico News Report",
    "url": "https://mexiconewsreport.com/index.php/2025/02/19/cabinet-profile-marcelo-ebrard-secretary-of-the-economy/",
    "snippet": "Marcelo Ebrard serves as <strong>Secretary of the Economy</strong> (Secretario de Economía) in the cabinet of President Claudia Sheinbaum.",
    "published": null
  },
  {
    "title": "Marcelo Ebrard in EL PAÍS English",
    "url": "https://english.elpais.com/news/marcelo-ebrard/",
    "snippet": "Foreign Affairs Minister Marcelo Ebrard is testing whether his work on the world stage will translate into votes as he competes for the leftist ruling party nomination for next year’s presidential elections ... The conservative political establishment in the United States has capitalized on a massive public health crisis, betting on the demonization of Mexico as a strategy to win the 2024 presidential and legislative elections",
    "published": "October 23, 2025"
  },
  {
    "title": "Who is Marcelo Ebrard? A video guide",
    "url": "https://mexiconewsdaily.com/business/a-video-guide-to-who-is-marcelo-ebrard/",
    "snippet": "The <strong>second-most senior politician in the ruling Morena party</strong>, Economy Minister Marcelo Ebrard will help President Claudia Sheinbaum to formulate a solution that will safeguard jobs, promote growth and protect Mexico from retaliation by its largest ...",
    "published": "March 5, 2025"
  }
]