[
  {
    "title": "Xabi Alonso fights for Madrid future in latest edition of modern classic | Real Madrid | The Guardian",
    "url": "https://www.theguardian.com/football/2025/dec/09/xabi-alonso-real-madrid-manchester-city-champions-league",
    "snippet": "“This is a team, it is a club, and we all go together hand in hand,” Xabi Alonso insisted, protesting perhaps a little too much. “When you’re Real Madrid coach you’re ready,” he added on the morning before Manchester City return to the Santiago Bernabéu for the latest of a very modern classic against one of the many managers who made him.",
    "published": "1 week ago"
  },
  {
    "title": "Xabi Alonso: “The Xabi who arrived in June is the not same as the one now” | Managing Madrid",
    "url": "https://www.managingmadrid.com/coach/101791/xabi-alonso-the-xabi-who-arrived-in-june-is-the-not-same-as-the-one-now",
    "snippet": "December 16, 2025 · Managing Madrid ... Tuesday, and addressed his start in the job and said that, “<strong>the Xabi who arrived in June is not the same as the one now.</strong>...",
    "published": "6 hours ago"
  },
  {
    "title": "Xabi Alonso’s Real Madrid future confirmed after Man City defeat - Yahoo Sports",
    "url": "https://sports.yahoo.com/articles/xabi-alonso-real-madrid-future-224000571.html",
    "snippet": "Real Madrid head coach Xabi Alonso will not be sacked owing to the club’s defeat at the hands of Manchester City.As much has been confirmed by multiple sources across Spain late on Wednesday.Marca, ...",
    "published": "6 days ago"
  },
  {
    "title": "Real Madrid players insist head coach Xabi Alonso has their support after Manchester City defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6880115/2025/12/10/real-madrid-players-xabi-alonso/",
    "snippet": "Dec. 10, 2025 ... <strong>Real Madrid players have said that they continue to back head coach Xabi Alonso</strong> following the team’s 2-1 Champions League defeat against Manchester City on Wednesday.",
    "published": "6 days ago"
  },
  {
    "title": "Real Madrid boss Xabi Alonso backed by Jude Bellingham but facing uncertain future after Man City defeat | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13482040/real-madrid-boss-xabi-alonso-backed-by-jude-bellingham-but-facing-uncertain-future-after-man-city-defeat",
    "snippet": "Real Madrid were beaten 2-1 by Man City at the Bernabeu in the Champions League as they suffered back-to-back home defeats to raise the pressure on Xabi Alonso, whose side have won just twice in their last eight games, but <strong>Jude Bellingham</strong> says the ...",
    "published": "5 days ago"
  }
]