[
  {
    "title": "List of prime ministers of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Canada",
    "snippet": "The office was modelled after that which existed in the United Kingdom at the time of Confederation. <strong>John A. Macdonald was commissioned by the Viscount Monck on 24 May 1867 to form the first government of the Canadian</strong> ...",
    "published": "2 days ago"
  },
  {
    "title": "Canada’s History Through the Prime Ministers",
    "url": "https://www.theoldschoolhouse.com/thecanadianschoolhouse/history/canadas-history-through-the-prime-ministers/",
    "snippet": "Check the end of the article for the PDF download link of this history article and additional history resources. <strong>Prime ministers have been the head of the Canadian government since 1867</strong>. The prime minister’s office was adapted from that which ...",
    "published": "April 12, 2021"
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "Prime Minister Carney started his career in finance before joining Canada’s public service to help ensure our economy supports the things that Canadians value – like health care, security, and a life you can afford. As Governor of the Bank of Canada during the 2008 financial crisis, he guided our country through one of the most turbulent economic periods in modern history...",
    "published": null
  },
  {
    "title": "Prime Ministers of Canada",
    "url": "https://lop.parl.ca/sites/ParlInfo/default/en_CA/People/primeMinisters",
    "snippet": "This page provides general details on Canada&#x27;s prime ministers since 1867. For more information on an individual prime minister, including their electoral history and parliamentary roles, click on their name to view their complete profile.",
    "published": null
  },
  {
    "title": "A history of Canadian prime ministers in times of crisis - The Globe and Mail",
    "url": "https://www.theglobeandmail.com/opinion/article-a-history-of-canadian-prime-ministers-in-times-of-crisis/",
    "snippet": "King’s cabinet tore itself apart, with English-Canadian ministers clamouring for soldiers to be sent overseas right away. But the prime minister, still wary of mandatory enlistment for national-unity reasons, engineered the resignation of pro-conscription defence minister James Ralston, replacing him with Andrew McNaughton, who promised he could get the needed volunteers.",
    "published": "March 20, 2020"
  }
]