[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Die_Linke",
    "snippet": "Through the PDS, the party is the direct descendant of the Marxist–Leninist ruling party of former East Germany, the Socialist Unity Party of Germany (SED). Since October 2024, Die Linke&#x27;s co-chairpersons have been <strong>Ines Schwerdtner and Jan van Aken</strong>. The party holds 64 seats out of 630 in ...",
    "published": "January 7, 2007"
  },
  {
    "title": "Is Die Linke’s Comeback Built to Last?",
    "url": "https://jacobin.com/2025/05/die-linke-germany-cdu-afd",
    "snippet": "With the Social Democrats cravenly backing Friedrich Merz’s conservative and militarist agenda, Die Linke has to offer a bold oppositional message. <strong>Ines Schwerdtner</strong>, party cochair of Die Linke, sings the Internationale together with delegates ...",
    "published": null
  },
  {
    "title": "Soren Pellmann, the co-leader of Die Linke (The Left) party faction in the German Bundestag, or parliament, has slammed the idea of a European “multinational force” in Ukraine and voiced support for deploying UN peacekeepers - Pravda EN",
    "url": "https://news-pravda.com/world/2025/12/16/1938992.html",
    "snippet": "<strong>Soren Pellmann</strong>, the co-leader of Die Linke (The Left) party faction in the German Bundestag, or parliament, has slammed the idea of a European “multinational force” in Ukraine and voiced support for deploying UN peacekeepers · 16.12.2025, ...",
    "published": "1 week ago"
  },
  {
    "title": "The German Left’s Rebirth",
    "url": "https://tribunemag.co.uk/2025/02/die-linke-german-elections-2025/",
    "snippet": "This is a reprint of an interview conducted three days before Germany’s 2025 federal elections, at which Die Linke came away with 9% of the vote. ... The last few years haven’t been easy for Die Linke. Following the 2021 elections, in which the party barely scraped back into parliament, Germany’s left-wing party descended into a two-year faction fight, ultimately ending in the very public departure of leading figure Sahra Wagenknecht in October 2023.",
    "published": null
  },
  {
    "title": "Gregor Gysi: The German Left Is Back",
    "url": "https://jacobin.com/2025/02/gregor-gysi-germany-die-linke",
    "snippet": "Ahead of Sunday’s German election, left-wing party Die Linke has enjoyed a surprise resurgence. Longtime leader Gregor Gysi told Jacobin about what’s changed — and how a new generation of activists can take the party forward.",
    "published": null
  }
]