[
  {
    "title": "Fiat - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat",
    "snippet": "On 11 July 1899, Giovanni Agnelli was part of the group of founding members of FIAT, Fabbrica Italiana Automobili Torino. The first Fiat plant opened in 1900 with 35 staff making 24 cars. Known from the beginning for the talent and creativity of its engineering staff, by 1903 Fiat made a small profit and produced 135 cars; this grew to 1,149 cars by 1906.",
    "published": "2 weeks ago"
  },
  {
    "title": "FIAT USA Headquarters, 1000 Chrysler Dr, Auburn Hills, MI 48326, US - MapQuest",
    "url": "https://www.mapquest.com/us/michigan/fiat-usa-headquarters-452236623",
    "snippet": "FIAT USA Headquarters in <strong>Auburn Hills, MI</strong>, serves as the central hub for the company&#x27;s operations in the United States.",
    "published": null
  },
  {
    "title": "Where is Fiat Chrysler Automobiles Located? HQ, Global Offices & Company Insights",
    "url": "https://www.highperformr.ai/company/fca-group",
    "snippet": "Fiat Chrysler Automobiles established in 2014 and headquartered in <strong>Auburn Hills</strong>., Learn more about Fiat Chrysler Automobiles offices, leadership team, mission, and growth journey.",
    "published": null
  },
  {
    "title": "Fiat Chrysler Automobiles - Products, Competitors, Financials, Employees, Headquarters Locations",
    "url": "https://www.cbinsights.com/company/fiat-chrysler-automobiles",
    "snippet": "Fiat Chrysler Automobiles&#x27;s headquarters is located at <strong>25 St.</strong>",
    "published": null
  },
  {
    "title": "Fiat Mirafiori - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_Mirafiori",
    "snippet": "<strong>The Stabilimento di Mirafiori</strong> (in English: Mirafiori Factory) is the headquarters and industrial district of the Italian automobile manufacturer Fiat, a subsidiary of FCA Italy, which is part of Stellantis, and is the headquarters of CNH Industrial ...",
    "published": "July 28, 2025"
  }
]