[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She and Paris Saint-Germain lost 5–2 on aggregate to Juventus in the 2024–25 UEFA Women&#x27;s Champions League qualifying rounds. On 12 November 2025, Earps returned to <strong>Manchester United</strong> in the Champions League for the first time since her move, where they lost 2-1.",
    "published": "1 month ago"
  },
  {
    "title": "Mary Earps: England goalkeeper retires before Euro 2025 - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cdj9ryd8mgro",
    "snippet": "<strong>Earps was selected for the upcoming Women&#x27;s Nations League matches against Portugal and Spain this week</strong>, the final international camp before Wiegman finalises her Euro 2025 squad.",
    "published": "May 27, 2025"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in 2024, Mary took on a new challenge by joining French giants <strong>Paris Saint-Germain</strong>. Earps called time on her spell with the Lionesses in May 2025, after collecting a total of 53 caps.",
    "published": null
  },
  {
    "title": "Mary Earps and the end of an England career that was a testament to willpower - The Athletic",
    "url": "https://www.nytimes.com/athletic/6385134/2025/05/27/mary-earps-england-retirement-profile/",
    "snippet": "Her inconsolable tears after the dramatic 3-2 win against the Netherlands in a December 2023 Nations League match were a reminder of her vulnerability, the almost-impossible standards she holds herself to. ... It is why this announcement arrives with a stinging sense of sadness. England without Earps threatens to feel surreal, their goalkeeper having become such a foundational block of the team’s recent successes (she kept 26 clean sheets in those 53 appearances) and its emotional bellwether.",
    "published": "May 27, 2025"
  },
  {
    "title": "Mary Earps: England Women goalkeeper announces international retirement ahead of Nations League and Euro 2025 | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13375347/mary-earps-england-women-goalkeeper-announces-international-retirement-ahead-of-nations-league-and-euro-2025",
    "snippet": "The decision has come as a surprise this close to a major tournament, with head coach Sarina Wiegman admitting she &quot;had hoped Mary would play an important role&quot; as England defend their title this summer. Earps was expected to part of the England squad for the Euros, even if she wasn&#x27;t guaranteed to be England&#x27;s starter. Talks between Earps and Wiegman about her place in the side have been ongoing for months given the pair&#x27;s close relationship. ... Earps arrived at St George&#x27;s Park on Monday with the rest of her team-mates, but only to bid farewell.",
    "published": "May 27, 2025"
  }
]