[
  {
    "title": "President of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_France",
    "snippet": "The president of France, officially the president of the French Republic (French: Président de la République française, [pʁezidɑ̃ d(ə) la ʁepyblik fʁɑ̃sɛːz]) or president of the Republic (Président de la République), is the executive head of state of France, and the commander-in-chief of the French Armed Forces. As the presidency is the supreme magistracy of the country, the position is the highest office in France. The powers, functions and duties of prior presidential offices, in addition to their relation with the prime minister and government of France, have over time differed with the various constitutional documents since the Second Republic.",
    "published": "1 day ago"
  },
  {
    "title": "List of prime ministers of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_France",
    "snippet": "The head of the government of France has been called the prime minister of France (French: Premier ministre) since 1959, when <strong>Michel Debré</strong> became the first officeholder appointed under the Fifth Republic. During earlier periods of French history, the country&#x27;s head of government was known ...",
    "published": "1 week ago"
  },
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "As a result, a prime minister has only been censured twice during the existence of the Fifth Republic: the first such instance occurred in 1962 when Georges Pompidou was toppled over opposition objections to President Charles de Gaulle&#x27;s effort to have the president popularly elected. At the ensuing 1962 French legislative election, de Gaulle&#x27;s coalition won an increased majority, and Pompidou was reappointed prime minister.",
    "published": "1 week ago"
  },
  {
    "title": "TIMELINE - France's perpetual political chaos: 4 prime ministers out in u under 2 years",
    "url": "https://www.aa.com.tr/en/europe/timeline-frances-perpetual-political-chaos-4-prime-ministers-out-in-under-2-years/3682499",
    "snippet": "Attal stayed on only as caretaker until a successor could be named. Attal has since taken over as leader of the pro-Macron group in parliament, confirming he would not return to the premiership. ... Seeking stability, Macron turned to veteran statesman Michel Barnier, the former EU Brexit negotiator, who was appointed prime minister on Sept.",
    "published": null
  },
  {
    "title": "List of Prime Ministers of France (1962-2024)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-prime-ministers-of-france-1725954177-1",
    "snippet": "Explore the comprehensive list of Prime Ministers of France from 1962 to 2024. Discover their tenures, policies, and impact on French politics.",
    "published": "September 10, 2024"
  }
]