[
  {
    "title": "Mario Draghi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mario_Draghi",
    "snippet": "Mario Draghi OMRI (Italian: [ˈmaːrjo ... to his appointment as prime minister, he served as the president of the European Central Bank (ECB) between <strong>2011 and 2019.</strong>...",
    "published": "2 days ago"
  },
  {
    "title": "Mario Draghi | CEPR",
    "url": "https://cepr.org/about/people/mario-draghi",
    "snippet": "He served as President of the European Central Bank (ECB) from <strong>2011 to 2019,</strong> where he played a pivotal role in navigating the Eurozone through the sovereign debt crisis. Widely recognised for his decisive leadership, including his famous commitment to do &quot;whatever it takes&quot; to preserve the ...",
    "published": null
  },
  {
    "title": "Mario Draghi | Biography, Prime Minister, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Mario-Draghi",
    "snippet": "Mario Draghi (born September 3, 1947, Rome, Italy) is an Italian economist who served from <strong>2011 to 2019</strong> as president of the European Central Bank (ECB), the financial institution responsible for making monetary decisions within the eurozone, ...",
    "published": "October 25, 2011"
  },
  {
    "title": "Mario Draghi: His legacy after eight tumultuous years at the ECB",
    "url": "https://www.bbc.com/news/business-50020948",
    "snippet": "So now that Super-Mario is pulling the plug on his time at the ECB - his <strong>eight-year term</strong> is ending and Thursday sees the last ECB interest rate announcement under his tenure - how does his record look?",
    "published": "October 23, 2019"
  },
  {
    "title": "Mario Draghi - European Central Bank",
    "url": "https://www.forbes.com/profile/mario-draghi/",
    "snippet": "Get in TouchGet In Touch With Mario DraghiGet In Touch ... As president of the European Central Bank (ECB), Mario Draghi has presided over an era of disintegrating faith in EU, notable in the 2016 Brexit vote.",
    "published": null
  }
]