[
  {
    "title": "Latest Saudi Arabia News, Insights and Updates | Arab News",
    "url": "https://www.arabnews.com/saudiarabia",
    "snippet": "Stay updated on Saudi Arabia’s news, events, and national developments. Explore comprensive national insights, top stories, and more on Arab News.",
    "published": null
  },
  {
    "title": "Saudi Arabia Digital Infrastructure Boosted by Khazna’s Entry and Leadership Appointment - TechAfrica News",
    "url": "https://techafricanews.com/2025/12/09/saudi-arabia-digital-infrastructure-boosted-by-khaznas-entry-and-leadership-appointment/",
    "snippet": "#News · December 9, 2025 · 3 min read · Author: Jennifer Onyeagoro · F · E · In his new role, <strong>Bin Hassan</strong> will strengthen Khazna’s presence in Saudi Arabia, deepen partnerships with local clients, and drive sustainable capacity growth ...",
    "published": "1 week ago"
  },
  {
    "title": "2025 in Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_in_Saudi_Arabia",
    "snippet": "17 November – 2025 Medina bus crash: A bus carrying Indian pilgrims undertaking Umrah catches fire near Medina, killing 45 of the 46 people on board. 1 December – <strong>Saudi Arabia and Russia sign an agreement on mutual visa exemption for each other&#x27;s citizens</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Saudi Arabia Latest and Breaking News | Al Arabiya",
    "url": "https://english.alarabiya.net/News/saudi-arabia",
    "snippet": "Saudi leadership congratulates al-Sharaa on Syria’s Liberation Day anniversary Saudi Arabia’s King Salman and Crown Prince Mohammed bin Salman on Monday congratulated Syrian President Ahmed... ... Who will win the 2025-26 Saudi Pro League Golden Boot?",
    "published": null
  },
  {
    "title": "Lenovo Strengthens Strategic Commitment to the Kingdom of Saudi Arabia with Senior Leadership Appointments and Regional Headquarters in Riyadh - Lenovo StoryHub",
    "url": "https://news.lenovo.com/pressroom/press-releases/lenovo-strengthens-strategic-commitment-to-the-kingdom-of-saudi-arabia-with-senior-leadership-appointments-and-regional-headquarters-in-riyadh/",
    "snippet": "<strong>Lenovo announced the appointment of its executive leadership team for Saudi Arabia</strong>, marking a key milestone in the company’s regional growth strategy and its plans to establish Regional Headquarters (RHQ) in Riyadh.",
    "published": "August 19, 2025"
  }
]