[
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "UC Santa Cruz Chancellor Cynthia Larive is <strong>set to undergo an overdue five-year performance review</strong>, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "<strong>She gained approval for the campus Long Range Development Plan that will serve as a blueprint for development on campus over the next two decades</strong> and completed “Leading the Change: The UC Santa Cruz Strategic Plan,” which details the campus community’s collective vision for the university ...",
    "published": null
  },
  {
    "title": "Office of the Chancellor – The Office of the Chancellor at UC Santa Cruz.",
    "url": "https://chancellor.ucsc.edu/",
    "snippet": "Chancellor Cynthia Larive · Campus notification procedures for immigration enforcement (SB 98)December 4, 2025 · Announcing Inspiring Change: The Campaign for UC Santa CruzNovember 16, 2025 · <strong>Campus Provost and Executive Vice Chancellor</strong> recruitment underwayNovember 7, 2025 ·",
    "published": null
  },
  {
    "title": "Cynthia Larive to become 11th chancellor of UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2019/05/chancellor-designate/",
    "snippet": "The University of California Board of Regents approved today (May 16) Dr. Cynthia K. Larive as the <strong>eleventh chancellor of UC Santa Cruz</strong>.",
    "published": "May 13, 2025"
  },
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "On August 6th, 2024, UCSC released a report that an investigation conducted by the UC Santa Cruz Police Department found no evidence of mechanical failure on the bus that could have resulted in the December crash and therefore attributed it to driver error. Concerns over the safety of on-campus transportation remain in the student body, exacerbated by incidents such as a loop bus catching on fire while transporting students in November 2023. In April 2022, Student Organizers hosted a rally at Kerr Hall over Chancellor Larive&#x27;s raise of $105,286.",
    "published": "July 15, 2025"
  }
]