[
  {
    "title": "Past Presidents of the IAAF | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/past-presidents-of-the-iaaf",
    "snippet": "Aside the present incumbent <strong>Lamine Diack</strong>, since the IAAF was founded in 1912 only four other Presidents have been elected by Congress.",
    "published": null
  },
  {
    "title": "The Past Presidents of the IAAF | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/the-past-presidents-of-the-iaaf",
    "snippet": "Under Burghley - although he was also officially known as the 6th Marquess of Exeter after the death of his father in 1956 - athletics also enhanced its position within the Olympic movement and strengthened its financial position from the distribution of International Olympic Committee television revenues. However, his final years as IAAF president before standing down in 1976 were turbulent, with many countries outside Europe were clamouring for a greater say in the decision making of the Federation.",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "All time Top lists · Records by Type · Records by Event · Certified Road Events · IAAF PRESIDENT SEBASTIAN COE · Past Presidents · <strong>LAMINE DIACK</strong> · PRIMO NEBIOLO · ADRIAAN PAULEN · LORD BURGHLEY · J SIGFRID EDSTROM ·",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Association_of_Athletics_Federations",
    "snippet": "At that meeting, 27 representatives from 17 national federations agreed to meet at a congress in Berlin, Germany, the following year, overseen by Sigfrid Edström who was to become the fledgling organisation&#x27;s first president. The 1913 congress formally completed the founding of what was then known as the International Amateur Athletic Federation (IAAF).",
    "published": "September 18, 2025"
  },
  {
    "title": "SEBASTIAN COE ELECTED IAAF PRESIDENT – The European Olympic Committees",
    "url": "https://www.eurolympic.org/sebastian-coe-elected-iaaf-president/",
    "snippet": "Among the first to congratulate Sebastian Coe were the current IAAF President Lamine Diack and Sergey Bubka, who was later elected as an IAAF Vice President.",
    "published": null
  }
]