[
  {
    "title": "Samy Bengio",
    "url": "https://bengio.abracadoudou.com/",
    "snippet": "Keynote talk on &quot;Recent results towards reasoning with LLMs&quot;, Sarajevo, July 2025.",
    "published": null
  },
  {
    "title": "Fame | Samy Bengio net worth and salary income estimation Oct, 2025 | People Ai",
    "url": "https://peopleai.com/fame/identities/samy-bengio",
    "snippet": "Samy Bengio is a Canadian computer scientist, Senior Director of AI and Machine Learning Research at Apple, and a former long-time scientist at Google known for leading a large group of researchers working in machine learning including adversarial settings. Bengio left Google shortly after the company fired his report, Timnit Gebru, without first notifying him.",
    "published": null
  },
  {
    "title": "Ex-Google AI Scientist Samy Bengio Finds Job at Apple",
    "url": "https://www.techtimes.com/articles/259852/20210504/ex-google-ai-scientist-samy-bengio-job-apple.htm",
    "snippet": "Google&#x27;s former AI scientist Samy Bengio <strong>finds a new job at Apple</strong> after leaving the search engine giant over ethics concern.",
    "published": "May 4, 2021"
  },
  {
    "title": "Samy Bengio",
    "url": "https://scholar.google.com/citations?user=Vs-MdPcAAAAJ&hl=en",
    "snippet": "‪<strong>Senior Director, AI and ML Research, Apple</strong>‬ - ‪‪Cited by 105,612‬‬ - ‪Machine Learning‬ - ‪Deep Learning‬ - ‪Representation Learning‬ - ‪Reasoning‬ - ‪Prof EPFL‬",
    "published": null
  },
  {
    "title": "Yoshua Bengio, who helped create AI: It’s only ‘a matter of time’ before all jobs are wiped out | Fortune",
    "url": "https://fortune.com/2025/12/19/yoshua-bengio-ai-only-a-matter-of-time-before-every-single-job-is-wiped-out-even-gen-z-trade-plumbing/",
    "snippet": "But now, even highly educated students are finding themselves “unemployable” as employers launch a “wait-and-watch strategy” in the midst of AI. Graduates in the U.K. are facing the worst job market since 2018. And companies like Intel, IBM, and Google have been freezing thousands of would-be new roles that AI is expected to take over in the next five years. But it’s not just a blip or a reflection of the current economy, Bengio warned.",
    "published": "3 days ago"
  }
]