[
  {
    "title": "Bart De Wever - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bart_De_Wever",
    "snippet": "Bart Albert Liliane De Wever (Dutch: [ˈbɑrt də ˈʋeːvər]; born 21 December 1970) is a Belgian author, historian and politician who has served as the Prime Minister of Belgium since February 2025. From 2004 to 2025, De Wever had been the <strong>leader of the New Flemish Alliance (N-VA),</strong> a political ...",
    "published": "1 day ago"
  },
  {
    "title": "PM meeting with Belgian Prime Minister Bart de Wever: 12 December 2025 - GOV.UK",
    "url": "https://www.gov.uk/government/news/pm-meeting-with-belgian-prime-minister-bart-de-wever-12-december-2025",
    "snippet": "We’d like to set additional cookies to understand how you use GOV.UK, remember your settings and improve government services. We also use cookies set by other sites to help us deliver content from their services. You have accepted additional cookies. You can change your cookie settings at any time. You have rejected additional cookies. You can change your cookie settings at any time. Accept additional cookies Reject additional cookies View cookies ... The Prime Minister met Belgian Prime Minister Bart de Wever in Downing Street this afternoon.",
    "published": "4 days ago"
  },
  {
    "title": "Belgium to form government after seven months of negotiations | Belgium | The Guardian",
    "url": "https://www.theguardian.com/world/2025/jan/31/belgium-to-form-government-after-seven-months-of-negotiations",
    "snippet": "<strong>Five Belgian parties struck a coalition deal on Friday to form a new government headed by the Flemish conservative Bart De Wever</strong>, after more than seven months of tortuous negotiations.",
    "published": "January 31, 2025"
  },
  {
    "title": "Flemish nationalist Bart De Wever sworn in as Belgian prime minister | Euronews",
    "url": "https://www.euronews.com/my-europe/2025/02/03/flemish-nationalist-bart-de-wever-sworn-in-as-belgian-prime-minister",
    "snippet": "<strong>Flemish nationalist Bart De Wever has been sworn in as the country&#x27;s new prime minister</strong> following months of painstaking negotiations to form a coalition that moves the country further to the right.",
    "published": "February 8, 2025"
  },
  {
    "title": "New Belgian PM wants to cool EU 'regulatory fervour', defend Europe within NATO | Reuters",
    "url": "https://www.reuters.com/world/europe/belgium-government-installed-led-by-nationalist-pm-de-wever-2025-02-03/",
    "snippet": "At home, De Wever <strong>outlined plans to streamline state finances to save 23 billion euros, while increasing defence spending to 2% of GDP</strong>, in line with NATO commitments. In December 2024, Belgium received an EU extension to present its budget in ...",
    "published": "February 3, 2025"
  }
]