[
  {
    "title": "Man Utd vs Paris St-Germain: Mary Earps says return to old club was 'written in stars' - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cy7e214vx6yo",
    "snippet": "But the goalkeeper, who played 125 times for the club during a five-year spell, will be lining up on the other side of the pitch when Paris St-Germain visit <strong>Old Trafford</strong> in the Women&#x27;s Champions League on Wednesday.",
    "published": "November 11, 2025"
  },
  {
    "title": "Mary Earps honoured by Madame Tussauds | Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/womens-team/content/mary-earps-gets-a-waxwork-statue-at-madame-tussauds-london-paris-saint-germain-2024-2025",
    "snippet": "The Paris Saint-Germain goalkeeper headed across the Channel to meet the waxwork of herself at the famous <strong>London museum</strong> · The England international goalkeeper was chosen as the player to represent all the Lionesses in the museum following a ...",
    "published": null
  },
  {
    "title": "Mary Earps | Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/womens-team/squad/mary-earps",
    "snippet": "After a short spell abroad, she returned to England in summer 2019 to sign for Manchester United. In five seasons with the Red Devils, Mary Earps played nearly 100 games and won the 2024 Women’s FA Cup shortly before joining Paris Saint-Germain on 1 July.",
    "published": null
  },
  {
    "title": "How Mary Earps’s Manchester United homecoming turned toxic | The Independent",
    "url": "https://www.the-independent.com/sport/football/mary-earps-hannah-hampton-man-united-psg-b2862864.html",
    "snippet": "Earps returns to <strong>Old Trafford</strong> with Paris Saint-Germain amid the explosive fallout from the release of her autobiography and comments on former Lionesses team-mate Hannah Hampton",
    "published": "November 12, 2025"
  },
  {
    "title": "Mary Earps signs for Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/womens-team/content/mary-earps-signs-for-paris-saint-germain-psg-feminines-women-mercato-2024-2025",
    "snippet": "Paris Saint-Germain are delighted to announce that Mary Earps has joined their women&#x27;s team. The England international goalkeeper has signed a contract with the Parisian club until June 2026. Mary Earps began her professional career with Doncaster Rovers before moving on to a number of big-name clubs in England, including Birmingham City, Bristol City and Reading FC. In 2018, she left her homeland ...",
    "published": null
  }
]