[
  {
    "title": "2019 Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2019_Ukrainian_presidential_election",
    "snippet": "Presidential elections were held in Ukraine on 31 March 2019. As none of the 39 candidates on the ballot received an absolute majority of the initial vote, a runoff was held on <strong>21 April</strong> between the top two vote-getters: Volodymyr Zelenskyy, a television personality, and Petro Poroshenko, the ...",
    "published": "1 week ago"
  },
  {
    "title": "Next Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Ukrainian_presidential_election",
    "snippet": "On <strong>9 December 2025</strong>, after pressure from US President Donald Trump to hold elections, Zelenskyy said he was ready to hold elections in 60 to 90 days if the US and Ukraine&#x27;s European allies ensured the necessary security.",
    "published": "1 week ago"
  },
  {
    "title": "Zelenskyy ‘ready for elections’ after Trump questions Ukrainian democracy | Ukraine | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/09/zelenskyy-ready-for-elections-after-trump-questions-ukrainian-democracy",
    "snippet": "Volodymyr Zelenskyy has said he is ready to hold a wartime election within the next three months, if Ukraine’s parliament and foreign allies will allow it, after Donald Trump accused him of clinging on to power.",
    "published": "2 weeks ago"
  },
  {
    "title": "Russia-Ukraine Live: Trump Gives Zelensky New Deadline On Peace Plan—Report - Newsweek",
    "url": "https://www.newsweek.com/russia-ukraine-live-updates-news-nato-zelensky-trump-putin-11178524",
    "snippet": "The move comes after President ... have typically ended in <strong>May 2024</strong> but according to Ukraine&#x27;s constitution, elections cannot be held during martial law - which was declared when Russia invaded in 2022. &quot;Maybe Zelenskyy would win....",
    "published": "2 weeks ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "Zelenskyy&#x27;s term was originally scheduled to end in <strong>May 2024</strong>, but the ongoing Russian invasion and the resulting ongoing martial law prevented the regularly scheduled presidential election from being conducted.",
    "published": "4 days ago"
  }
]