[
  {
    "title": "Is Alfa Romeo Part of Stellantis? | Benson Alfa Romeo",
    "url": "https://www.alfaromeousaofgreer.com/research/is-alfa-romeo-part-of-stellantis.htm",
    "snippet": "Stelantis was formed with a joint venture, a 50-50 merger of two well-known automotive empires: the Italian-American conglomerate Fiat Chrysler Automobiles and the French PSA Group, Peugeot S.A, creating the fourth largest automaker today. This makes <strong>Stellantis the current owner of Alfa Romeo</strong>.",
    "published": null
  },
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Alfa Romeo Automobiles S.p.A. (Italian: [ˈalfa roˈmɛːo]) is an Italian car manufacturer known for its sports-oriented vehicles, strong auto racing heritage, and iconic design. Headquartered in Turin, Italy, <strong>it is a subsidiary of Stellantis Europe</strong> and one of 14 brands of multinational automotive ...",
    "published": "5 days ago"
  },
  {
    "title": "Who Makes Alfa Romeo? | Alfa Romeo of Omaha",
    "url": "https://www.alfaromeoomaha.com/alfaromeo-research/who-owns-alfa-romeo/",
    "snippet": "Who owns Alfa Romeo, exactly? <strong>Alfa Romeo is currently owned by the Stellantis automotive company</strong>. Despite this, the origin of Italian precision shines through the top Alfa Romeo models like the Stelvio and Giulia models.",
    "published": "January 13, 2024"
  },
  {
    "title": "Who Makes Alfa Romeo? | Ron Lewis Alfa Romeo",
    "url": "https://www.ronlewisalfaromeo.com/who-makes-alfa-romeo/",
    "snippet": "Who Makes Alfa Romeo: <strong>Stellantis currently oversees the production and development of Alfa Romeo vehicles</strong>. This multinational corporation was established in 2021 through the merger of Fiat Chrysler Automobiles (FCA) and PSA Group.",
    "published": "October 31, 2025"
  },
  {
    "title": "Stellantis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stellantis",
    "snippet": "<strong>The company designs, manufactures, and markets vehicles under 14 brands: Abarth, Alfa Romeo</strong>, Chrysler, Citroën, Dodge, DS Automobiles, Fiat, Jeep, Lancia, Maserati, Opel, Peugeot, Ram Trucks, and Vauxhall.",
    "published": "2 days ago"
  }
]