[
  {
    "title": "Governance Structure - IAU",
    "url": "https://www.iau-aiu.net/Governance-Structure",
    "snippet": "Deputy members are also elected for each region and each category of members. A balanced geographic and gender representation are taken into consideration. The Administrative Board meets annually, ensures that decisions of the General Conference are implemented and guides the work of the IAU Secretariat.",
    "published": null
  },
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "The IAU is composed of <strong>individual members, who include both professional astronomers and junior scientists, and national members, such as professional associations, national societies, or academic institutions</strong>.",
    "published": "5 days ago"
  },
  {
    "title": "Leadership — International Association of Universities",
    "url": "https://iau.global/leadership",
    "snippet": "It is embedded in the IAU’s mission to guide leaders of universities and other higher education institutions (HEI) worldwide: Thought leadership permeates the overall work of the Association, extending into all other IAU work.",
    "published": null
  },
  {
    "title": "Executive Leadership Programme — International Association of Universities",
    "url": "https://iau.global/elp",
    "snippet": "Develop Effective Teams: Explore leadership expectations and improve interpersonal management skills to unlock the full potential of diverse high-performing teams. Build a Global Network of Peers: Create long-term partnerships, connect with colleagues from all over the world, and share experiences to learn from each other. The IAU is now accepting applications for the 2025-2026 cohort of the ELP.",
    "published": null
  },
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "IAU adopts positions and develops Policy Statements on issues of global concern for higher education. The topics are identified by the Association’s leadership and membership. Each Statement is the product of extensive drafting and international consultations.",
    "published": null
  }
]