[
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The International Mathematical Union (IMU) is an international organization devoted to international cooperation in the field of mathematics across the world. It is a member of the International Science Council (ISC) and supports the International Congress of Mathematicians (ICM).",
    "published": "February 24, 2025"
  },
  {
    "title": "| International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/",
    "snippet": "ICM 2026 Program Committee Chair Claire Voisin (CNRS, Institut de Mathématiques de Jussieu-Paris Rive Gauche) has been awarded the Crafoord Prize in Mathematics 2024 by the Royal Swedish Academy of Sciences.",
    "published": null
  },
  {
    "title": "IMU Executive Committee | International Mathematical Union Leadership 2023-2026",
    "url": "https://www.mathunion.org/organization/imu-executive-committee",
    "snippet": "Meet the IMU Executive Committee members leading the International Mathematical Union for 2023-2026. Learn about their roles and bios.",
    "published": null
  },
  {
    "title": "International Mathematical Union | international organization | Britannica",
    "url": "https://www.britannica.com/topic/International-Mathematical-Union",
    "snippet": "Other articles where International Mathematical Union is discussed: Lars V. Hörmander: …a vice president of the International Mathematical Union. In 1988 Hörmander was awarded the Wolf Prize.",
    "published": null
  },
  {
    "title": "Past ICMI Executive Committees | History & Members of ICMI Leadership",
    "url": "https://www.mathunion.org/icmi/organization/icmi-executive-committee/past-icmi-executive-committees",
    "snippet": "Since the establishment of ICMI during the fourth International Congress of Mathematicians held in Rome, 1908 the Executive Committees of the Commission (originally known as &quot;Central Committees&quot;) have succeeded one another at intervals of approximately four years. A list of previous members and officials appears below.",
    "published": null
  }
]