[
  {
    "title": "Premiership of Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Premiership_of_Mark_Carney",
    "snippet": "The premiership of Mark Carney began on March 14, 2025, when the first Cabinet headed by Mark Carney was sworn in by Governor General Mary Simon. Carney was invited to form the 30th Canadian Ministry and become the 24th Prime Minister of Canada after he succeeded Prime Minister <strong>Justin Trudeau</strong> ...",
    "published": "2 days ago"
  },
  {
    "title": "List of prime ministers of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Canada",
    "snippet": "<strong>John A. Macdonald</strong> was commissioned by the Viscount Monck on 24 May 1867 to form the first government of the Canadian Confederation. On 1 July 1867, the first ministry assumed office.",
    "published": "2 weeks ago"
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "The Right Honourable Mark Carney, Prime Minister of CanadaMark Carney is Canada’s 24th Prime Minister. He was elected Leader of the Liberal Party of Canada and sworn in as Prime Minister in March 2025. He leads a government that will take action to unite Canadians, defend Canada’s sovereignty, ...",
    "published": null
  },
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "Mark Joseph Carney (born March 16, 1965) is a Canadian politician and economist who has been serving as the 24th prime minister of Canada since 2025. He has also been leader of the Liberal Party and the member of Parliament (MP) for Nepean since 2025.",
    "published": "1 day ago"
  },
  {
    "title": "List of prime ministers of Canada | Britannica",
    "url": "https://www.britannica.com/place/list-of-prime-ministers-of-Canada-1800352",
    "snippet": "This is a chronologically ordered list of the prime ministers, from the earliest to the most recent. <strong>Sir John Alexander Macdonald</strong> (1867–73; 1st time) ... W.L. Mackenzie King (1921–26; 1st time) ...",
    "published": "November 4, 2011"
  }
]