[
  {
    "title": "American Airlines Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/American_Airlines_Center",
    "snippet": "<strong>American Airlines Center (AAC)</strong> is a multi-purpose indoor arena located in the Victory Park neighborhood in downtown Dallas, Texas. The arena serves as the home of the Dallas Stars of the National Hockey League and Dallas Mavericks of the National Basketball Association.",
    "published": "1 week ago"
  },
  {
    "title": "American Airlines Center",
    "url": "https://www.americanairlinescenter.com/",
    "snippet": "The <strong>American Airlines Center</strong> is the Dallas area&#x27;s Premier Sports and Entertainment arena, and home to the NHL&#x27;s Dallas Stars and NBA&#x27;s Dallas Mavericks.",
    "published": null
  },
  {
    "title": "Dallas Mavericks: Everything to Know Before the Game | Visit Dallas",
    "url": "https://www.visitdallas.com/blog/dallas-mavericks/",
    "snippet": "The Dallas Mavericks, or the Mavs as they&#x27;re lovingly called, are quite the big deal around here. <strong>American Airlines Arena (AAC)</strong> isn’t just a sports arena - it&#x27;s an entertainment powerhouse.",
    "published": null
  },
  {
    "title": "American Airlines Center – ArenaNetwork",
    "url": "https://arenanetwork.net/properties/american-airlines-center/",
    "snippet": "Since opening in July 2001, the <strong>American Airlines Center</strong> has set a new standard for sports and entertainment facilities. From its traditional architecture to hi-tech innovation, it has become one of the premier sports and entertainment venue in the US and is home to the NBA Dallas Mavericks ...",
    "published": null
  },
  {
    "title": "Dallas Mavericks - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Dallas_Mavericks",
    "snippet": "The Mavericks compete in the National Basketball Association (NBA) as a member of the Southwest Division of the Western Conference. The team plays its home games at <strong>American Airlines Center</strong>, which it shares with the National Hockey League&#x27;s ...",
    "published": "1 week ago"
  }
]