[
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Born in Cahors, Galthié began his career at a club in Tournefeuille, before joining Colomiers. He made his international debut for France against Romania in June 1991. He was called into France&#x27;s 1991 Rugby World Cup squad, replacing the injured <strong>Pierre Berbizier</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "<strong>Thibault Giroud</strong>, former Toulon head of physical training where he worked with Galthié, was also appointed as head of high performance. Video analyst Nicolas Buffa retained his positions and became the analysis unit director. After the 2023 Rugby World Cup, Ghezal, Labit and Giroud left the ...",
    "published": "1 week ago"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "It was a largely uninspiring stint in charge, which included a series defeat to New Zealand down under and uninspiring Six Nations campaigns. At the 2019 Rugby World Cup, Brunel was in charge in name only, with Fabien Galthie present in the coach’s box for every game as the team exited in the quarter finals again.",
    "published": "May 30, 2025"
  },
  {
    "title": "List of France national rugby union team coaches - FamousFix List",
    "url": "https://www.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "<strong>Bernard Laporte</strong> (born 1 July 1964) is a rugby player, coach and former French Secretary of State for Sport. From 1999 to 2007, Laporte was the head coach of the France national team.",
    "published": null
  },
  {
    "title": "France rugby union team: Fixtures, squad and head coach",
    "url": "https://news.bet365.com/en-gb/article/france-rugby-union-team-profile/2025012409221201023",
    "snippet": "As far as tryscorers go, France&#x27;s <strong>Damian Penaud</strong> must be regarded as one of the most prolific in world rugby at the moment. The top tryscorer in the Six Nations in both 2022 and 2023, Bordeaux Begles wing Penaud is a gamechanger for this France side who time and time again is on hand to apply ...",
    "published": null
  }
]