[
  {
    "title": "Jonathan Kodjia",
    "url": "https://grokipedia.com/page/Jonathan_Kodjia",
    "snippet": "Jonathan Adjo Kodjia (born 22 October ... the lower tiers of French football before achieving prominence in England with <strong>Bristol City and Aston Villa</strong>, where he became known for his goal-scoring prowess and physical presence as a 1.89 ...",
    "published": null
  },
  {
    "title": "Jonathan Kodjia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jonathan_Kodjia",
    "snippet": "Kodjia made his professional debut in a 4–1 loss against Dijon. In the first four seasons at the club, Kodjia rarely played and was never able to score for the Reims first team, his most productive campaign being when he made 13 appearances after the club had dropped into France&#x27;s third tier.",
    "published": "October 3, 2025"
  },
  {
    "title": "Jonathan Kodjia",
    "url": "https://www.worldfootball.net/player_summary/jonathan-kodjia/",
    "snippet": "Jonathan Kodjia - FC Versailles, <strong>FC Annecy, Umm-Salal, Al Gharafa, Aston Villa, Aston Villa U23, Bristol City, Angers SCO, SM Caen, Amiens SC, AS Cherbourg, Stade de Reims</strong> /",
    "published": null
  },
  {
    "title": "Jonathan Kodjia à Versailles -",
    "url": "https://www.unfp.org/2024/08/jonathan-kodjia-a-versailles/",
    "snippet": "C’est signé pour Jonathan Kodjia. L’expérimenté buteur, passé par <strong>Reims, Cherbourg, Amiens, Caen, Angers, Bristol, Aston Villa, Al-Gharafa et Annecy</strong>, s’est engagé ce jeudi avec le FC Versailles, après avoir passé six semaines avec l’UNFP Football Club.",
    "published": null
  },
  {
    "title": "Jonathan Kodjia - Player profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/jonathan-kodjia/profil/spieler/88971",
    "snippet": "Without Club Last club: FC Versailles Most games for: <strong>Aston Villa</strong> Without Club since: Jul 1, 2025 ... Name in home country: Jonathan Adjo Kodjia Date of birth/Age: Oct 22, 1989 (36) Place of birth: Saint-Denis Height: 1,89 m Citizenship: Cote ...",
    "published": null
  }
]