[
  {
    "title": "World Athletics sets ambitious targets with three-year gender leadership strategy | World Athletics",
    "url": "https://worldathletics.org/women-in-athletics/news/world-athletics-targets-gender-leadership-strategy",
    "snippet": "The World Athletics Gender Leadership ... on <strong>promoting awareness, initiating policy change, and implementing education to support progression and growth of the pool and pipeline of female leaders aligned to defined targets</strong>...",
    "published": null
  },
  {
    "title": "2025 World Athletics Championships - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_World_Athletics_Championships",
    "snippet": "In August 2024, World Athletics released the timetable for the championships. ... On 5 September 2025, World Athletics officially published the final entry lists to the championships.",
    "published": "16 hours ago"
  },
  {
    "title": "Livestream - Gender Leadership Conference - World Athletics Championships Tokyo 2025 - YouTube",
    "url": "https://www.youtube.com/watch?v=bgkyPzj6hbo",
    "snippet": "The Lead the Track: Breaking Limits in Global Sport Leadership conference brings together visionary leaders, changemakers and emerging voices - women and mal...",
    "published": "September 17, 2025"
  },
  {
    "title": "Nominees announced for 2025 Member Federations Award | World Athletics",
    "url": "https://worldathletics.org/awards/news/nominees-2025-member-federations-award",
    "snippet": "Spain delivered strong results in 2025, including a record medal haul at the European U20 Championships in Tampere and a competitive presence at the World Athletics Championships Tokyo 25. The country hosted the European Team Championships 1st Division in Madrid, while it expanded youth and community athletics initiatives across regions. Under new leadership, the federation enhanced governance and modernisation practices, ensuring transparency and efficiency.",
    "published": null
  },
  {
    "title": "‘Your column was very unfair’: what happened when I met World Athletics CEO | Athletics | The Guardian",
    "url": "https://www.theguardian.com/sport/2025/dec/02/athletics-joining-sports-goliaths-long-way-to-go",
    "snippet": "And then the World Athletics chief executive, <strong>Jon Ridgeon</strong>, walks up to me and says: “I read your recent Guardian column, and I thought it was very unfair.” · Imagine Gary Lineker going in two-footed, having never picked up a yellow card ...",
    "published": "2 weeks ago"
  }
]