[
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "<strong>Christopher Ruddy</strong> (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and majority owner of Newsmax Media.",
    "published": "5 days ago"
  },
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "Newsmax, Inc. (or Newsmax.com, previously styled NewsMax) is an American cable news, political opinion commentary, and digital media company founded by <strong>Christopher Ruddy</strong> in 1998. It has been variously described as conservative, right-wing, and far-right.",
    "published": "1 week ago"
  },
  {
    "title": "Who Owns Newsmax TV? Inside The Story Of Its Owner And Conservative Media Rise",
    "url": "https://richniches.com/who-owns-newsmax-tv/",
    "snippet": "Private ownership defines Newsmax TV, with <strong>Christopher Ruddy</strong> holding the majority stake in the company. Additional investors have contributed to its growth, though full details on these stakeholders remain private.",
    "published": "September 17, 2025"
  },
  {
    "title": "Christopher Ruddy | Long Island University",
    "url": "https://liu.edu/roosevelt/~/link.aspx?_id=CBEEEDD71542408AA2E0F8E91B527511&_z=z",
    "snippet": "<strong>Christopher Ruddy</strong> is CEO and President of Newsmax Media Inc., a leading digital and television news media company. Ruddy, who grew up near Sagamore Hill, has been a long-time member of the Theodore Roosevelt Association and often reference Theodore Roosevelt in his commentaries on current U.S.",
    "published": null
  },
  {
    "title": "Newsmax Stock Ownership - Who Owns Newsmax in 2025? | WallStreetZen",
    "url": "https://www.wallstreetzen.com/stocks/us/nyse/nmax/ownership",
    "snippet": "Newsmax (NYSE: NMAX) is owned by <strong>2.95% institutional shareholders, 93.91% Newsmax insiders, and 3.15% retail investors</strong>. Ruddy Revocable Trust Dated October 12 2007 Christopher is the largest individual Newsmax shareholder, owning 39.24M shares representing 30.39% of the company.",
    "published": "1 week ago"
  }
]