[
  {
    "title": "Gianni Infantino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gianni_Infantino",
    "snippet": "Giovanni Vincenzo Infantino (born ... his initial election to the FIFA presidency on 26 February 2016, he was re-elected on 5 June 2019 and again on <strong>16 March 2023</strong>....",
    "published": "1 day ago"
  },
  {
    "title": "FIFA President Gianni Infantino re-elected by acclamation at historic ...",
    "url": "https://inside.fifa.com/en/media-releases/fifa-president-gianni-infantino-re-elected-by-acclamation-at-historic-fifa",
    "snippet": "Speaking immediately after the re-election to serve from <strong>2023 to 2027</strong>, President Infantino said: “Being FIFA President is an incredible honour, an incredible privilege, and it is also a great responsibility.",
    "published": null
  },
  {
    "title": "Gianni Infantino",
    "url": "https://grokipedia.com/page/Gianni_Infantino",
    "snippet": "Gianni Infantino was elected as the ninth president of FIFA on <strong>February 26, 2016</strong>, during an Extraordinary Congress held in Zurich, Switzerland, succeeding Sepp Blatter, who had been banned from football activities amid ongoing FBI and Swiss ...",
    "published": null
  },
  {
    "title": "‘He massages Trump’s basest instincts’: why is Fifa’s Gianni Infantino cosying up to the US president? | Gianni Infantino | The Guardian",
    "url": "https://www.theguardian.com/football/2025/nov/30/he-massages-trumps-basest-instincts-why-is-fifas-gianni-infantino-cosying-up-to-the-us-president",
    "snippet": "Since first being installed as Fifa president in 2016, Infantino has been re-elected unopposed in <strong>2019 and 2023</strong>, under the old football maxim that you can only beat what’s not put in front of you.",
    "published": "2 weeks ago"
  },
  {
    "title": "Gianni Infantino accused of breaching FIFA’s ethics codes in relation to President Trump comments - The Athletic",
    "url": "https://www.nytimes.com/athletic/6873068/2025/12/09/fifa-infantino-trump-peace-prize-complaint/",
    "snippet": "FairSquare’s submission records that Infantino said that he considered President Trump “a really close friend” and the FIFA President said on stage: “I’m a bit surprised sometimes when I read some negative comments (about President Trump). I am not American, but as far as I understand, President Trump was elected in the United States of America and was quite clearly elected.",
    "published": "1 week ago"
  }
]