[
  {
    "title": "List of prime ministers of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Australia",
    "snippet": "The prime ministership of <strong>Frank Forde</strong>, who was prime minister for seven days in 1945, was the shortest in Australian history. Menzies served the longest, with eighteen years over two non-consecutive periods. The current prime minister is Anthony Albanese, who assumed office on 23 May 2022.",
    "published": "2 weeks ago"
  },
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "A 2002 reshuffle saw him become Shadow Minister for Employment Services and Training, and in 2004 he became Shadow Minister for Environment and Heritage. It was during this latter role that then prime minister <strong>John Howard</strong> and science minister Brendan Nelson started raising the idea of nuclear ...",
    "published": "9 hours ago"
  },
  {
    "title": "Prime Minister of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Australia",
    "snippet": "The prime minister is the chair of the Cabinet of Australia and thus the head of the federal executive government. Under the principles of responsible government, the prime minister is both responsible to and a member of the Commonwealth Parliament. The current prime minister is Anthony Albanese of the Australian Labor Party, who assumed the office on 23 May 2022.",
    "published": "November 6, 2025"
  },
  {
    "title": "List of prime ministers of Australia | Names & Years | Britannica",
    "url": "https://www.britannica.com/topic/list-of-prime-ministers-of-Australia-1798815",
    "snippet": "This is a chronologically ordered list of the prime ministers, from the earliest to the most recent. Each prime minister is listed only once; multiple terms are noted in parentheses. ... Anthony Albanese (2022– ) The Editors of Encyclopaedia Britannica This article was most recently revised ...",
    "published": "October 24, 2011"
  },
  {
    "title": "Australia's prime ministers | naa.gov.au",
    "url": "https://www.naa.gov.au/explore-collection/australias-prime-ministers",
    "snippet": "<strong>Earle Page</strong> (1939): first Country Party prime minister",
    "published": null
  }
]