[
  {
    "title": "Pier Luigi Bersani - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pier_Luigi_Bersani",
    "snippet": "Pier Luigi Bersani (Italian pronunciation: [ˈpjɛr luˈiːdʒi berˈsaːni]; born 29 September 1951) is an Italian politician and was Secretary of the <strong>Democratic Party (PD),</strong> Italy&#x27;s leading centre-left party, from 2009 to 2013. Bersani was Minister of Industry, Commerce and Craftmanship from ...",
    "published": "August 25, 2025"
  },
  {
    "title": "Pier Luigi Bersani - La Regione e la sua storia - Regione Emilia-Romagna",
    "url": "https://www.regione.emilia-romagna.it/storia/presidenti/pier-luigi-bersani",
    "snippet": "Nasce a Bettola (Piacenza) nel 1951 · Si laurea in Filosofia a Bologna e compie una breve esperienza come insegnante. Consigliere regionale appartenente al <strong>Partito Comunista</strong> dal 1980 al 1986, viene eletto presidente della Regione Emilia-Romagna nel 1993 e riconfermato nel 1995 tra le fila ...",
    "published": null
  },
  {
    "title": "Democratic Centre (Italy)",
    "url": "https://grokipedia.com/page/Democratic_Centre_(Italy)",
    "snippet": "<strong>Centro Democratico (CD) is a centrist political party in Italy, founded on 28 December 2012 by Bruno Tabacci and dissidents from prior centrist formations seeking to bolster the centre-left alliance</strong> led by Pier Luigi Bersani.[1] Under Tabacci&#x27;s ...",
    "published": null
  },
  {
    "title": "Bersani: “Si dica tutti insieme che parte l’alternativa. Cambi il nome campo largo” - la Repubblica",
    "url": "https://www.repubblica.it/politica/2025/11/28/news/pier_luigi_bersani_intervista_campo_largo_cambiare_nome-425009648/",
    "snippet": "Pier Luigi Bersani · L’ex segretario Pd: “Un gesto politico dichiari l’avvio del progetto con un programma da portare nel Paese” · L&#x27;ascolto è riservato agli abbonati premium · 28 Novembre 2025 alle 01:00 3 minuti di lettura ·",
    "published": "3 weeks ago"
  },
  {
    "title": "“Chiedimi chi erano i Beatles”: Pier Luigi Bersani presenta il libro ai Giardini Luzzati - genovaquotidiana.com",
    "url": "https://genovaquotidiana.com/2025/10/29/chiedimi-chi-erano-i-beatles-pier-luigi-bersani-presenta-il-libro-ai-giardini-luzzati/",
    "snippet": "Pier Luigi Bersani è stato presidente della Regione Emilia-Romagna (1993-1996), più volte ministro, segretario nazionale del <strong>Partito Democratico</strong> (2009). Tra i promotori di riforme e liberalizzazioni in diversi settori, è laureato in Filosofia ...",
    "published": "October 29, 2025"
  }
]