[
  {
    "title": "List of Arsenal F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Arsenal_F.C._managers",
    "snippet": "In December 2019, Arsenal appointed former club captain <strong>Mikel Arteta</strong> as the new head coach.",
    "published": "6 days ago"
  },
  {
    "title": "Arsenal Coaching Staff | Team Behind the Team",
    "url": "https://www.arsenalinsider.com/club/coaching-staff/",
    "snippet": "Arsenal’s coaching staff for the 2025/26 season under <strong>Mikel Arteta</strong> is a close-knit group. But who features among the Spaniard’s small clutch of experts in the Emirates Stadium dugout?",
    "published": "July 8, 2025"
  },
  {
    "title": "Why Arsenal hired Renee Slegers as their new head coach – consistency, solidity and ruthlessness - The Athletic",
    "url": "https://www.nytimes.com/athletic/6066264/2025/01/18/why-arsenal-hired-renee-slegers-as-head-coach/",
    "snippet": "Slegers is now Arsenal’s permanent head coach after a three-month recruitment process. The Dutch 35-year-old was keen for the club’s hierarchy to conduct the undertaking in full, and not hand her the job simply because she was interim.",
    "published": "January 18, 2025"
  },
  {
    "title": "Renée Slegers appointed head coach | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/renee-slegers-appointed-head-coach",
    "snippet": "We’re delighted to announce that <strong>Renée Slegers</strong> has been appointed as our permanent head coach. Renée, who has signed a contract through to the end of the 2025/26 season, took charge of our women’s first team in October 2024 on an interim basis.",
    "published": null
  },
  {
    "title": "Mikel Arteta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikel_Arteta",
    "snippet": "In 2018, Arteta became strongly linked with the Arsenal manager&#x27;s vacancy, following the departure of his former manager Arsène Wenger, but <strong>Unai Emery</strong> was eventually hired. On 20 December 2019, Arteta was appointed head coach at his former ...",
    "published": "9 hours ago"
  }
]