[
  {
    "title": "Chelsea Football Club is delighted to announce the appointment of Enzo Maresca as new head coach of the men’s team.",
    "url": "https://www.chelseafc.com/en/news/article/enzo-maresca-to-become-chelsea-mens-head-coach",
    "snippet": "Chelsea Football Club is delighted to announce the appointment of Enzo Maresca as new head coach of the men’s team.",
    "published": null
  },
  {
    "title": "Chelsea appoint Enzo Maresca as head coach",
    "url": "https://www.premierleague.com/en/news/4030968",
    "snippet": "Italian signs five-year deal as he leaves Leicester City to replace Mauricio Pochettino at Stamford Bridge · <strong>Chelsea have announced the appointment of Enzo Maresca as their new head coach</strong>.",
    "published": null
  },
  {
    "title": "How and why Chelsea hired Enzo Maresca – and the seven things they were looking for - The Athletic",
    "url": "https://www.nytimes.com/athletic/5523993/2024/06/03/chelsea-appoint-maresca-inside-story/",
    "snippet": "Chelsea’s search is over: Enzo Maresca is now officially the fourth permanent head coach to be employed by the Clearlake Capital-Todd Boehly consortium in the space of two years.",
    "published": "June 3, 2024"
  },
  {
    "title": "Enzo Maresca: Chelsea appoint Leicester City boss as new manager on five-year deal - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cyxxnve9g23o",
    "snippet": "Chelsea appoint Leicester City manager Enzo Maresca <strong>on a five-year contract with the option of an extra year</strong>.",
    "published": "June 3, 2024"
  },
  {
    "title": "‘A dream’: Enzo Maresca appointed Chelsea head coach on five-year deal | Chelsea | The Guardian",
    "url": "https://www.theguardian.com/football/article/2024/jun/03/chelsea-confirm-enzo-maresca-appointment-head-coach",
    "snippet": "The 44‑year‑old ­Italian led Leicester to the Championship title last season – his only full campaign as a head coach – and he succeeds ­Mauricio ­Pochettino, who left ­Chelsea by mutual consent two weeks ago. Maresca becomes the fifth mana­ger in the two-year Chelsea ownership of Behdad Eghbali and Todd ­Boehly, after Thomas Tuchel, Graham Potter, Frank Lampard and ­Pochettino.",
    "published": "April 2, 2025"
  }
]