[
  {
    "title": "Argentina cabinet reshuffle: Milei appoints new security and defense ministers - Buenos Aires Herald",
    "url": "https://buenosairesherald.com/politics/argentina-cabinet-reshuffle-milei-appoints-new-security-and-defense-ministers",
    "snippet": "Alejandra Monteoliva will become Argentina’s next security minister and Lieutenant General Carlos Alberto Presti, the new defense minister, the president’s communications team announced on Saturday afternoon. They will replace Patricia Bullrich and Luis Petri, who were elected to Congress in October’s mid-term elections. The appointment of Presti, currently head of the Argentine army, marks the first time since the end of the dictatorship in 1983 that a top military official has been defense minister.",
    "published": "1 month ago"
  },
  {
    "title": "Ministry of National Security (Argentina) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Security_(Argentina)",
    "snippet": "The current minister of security is Patricia Bullrich, who <strong>assumed office in 2023</strong> under President Javier Milei.",
    "published": "October 19, 2025"
  },
  {
    "title": "Argentina - World Leaders",
    "url": "https://www.cia.gov/resources/world-leaders/foreign-governments/argentina/",
    "snippet": "Skip to main content · Go to CIA.gov · World Leaders · All Foreign Governments · Argentina · Leaders and Cabinet Members · Last Updated: 12/2/2025 · Pres · Javier MILEI · Vice Pres",
    "published": null
  },
  {
    "title": "Ministries of the Argentine Republic - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministries_of_the_Argentine_Republic",
    "snippet": "The ministries of Argentina, which form the cabinet, currently consist of eight ministries under a ministerial chief of staff. The ministers are appointed by and serve at the pleasure of the president. The current organization derives from the constitutional revision of 1994.",
    "published": "1 week ago"
  },
  {
    "title": "Explainer: Who's Who in Javier Milei's Cabinet? | AS/COA",
    "url": "https://www.as-coa.org/articles/explainer-whos-who-javier-mileis-cabinet",
    "snippet": "Vice President: Victoria Villarruel Foreign Minister: Diana Mondino Economy Minister: Luis “Toto” Caputo Chief of Staff: Nicolás Posse Health Minister: Mario Russo Justice Minister: Mariano Cúneo Libarona Security Minister: Patricia Bullrich Defense Minister: Luis Petri Interior Minister: Guillermo Francos Human Capital Minister: Sandra Pettovello Infrastructure Minister: Guillermo Ferraro ... With a goal of eliminating some ministries, Argentina’s new president has picked a smaller-than-usual team to help him carry out his agenda.",
    "published": null
  }
]