[
  {
    "title": "Alphabet Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
    "snippet": "As of September 1, 2017, <strong>their equity is held by a subsidiary known as XXVI Holdings, Inc.</strong> (referring to the Roman numeral of 26, the number of letters in the alphabet), so that they can be valued and legally separated from Google. At the same time, it was announced that Google would be reorganized ...",
    "published": "1 week ago"
  },
  {
    "title": "Who Currently Owns Alphabet? A Deep Dive Investigation",
    "url": "https://surgegraph.io/business/who-currently-owns-alphabet",
    "snippet": "L. John Doerr: 2.6% ownership with 1.6% voting power · (Source: Alphabet Notice of 2024 Annual Meeting of Stockholders and Proxy Statement) <strong>Larry Page and Sergey Brin directly control 51.7% of voting power</strong>, allowing them to continue to chart ...",
    "published": null
  },
  {
    "title": "Who owns Alphabet in 2025? GOOGL shareholders explained | Capital.com",
    "url": "https://capital.com/en-int/analysis/alphabet-shareholder-who-owns-most-googl",
    "snippet": "As of June 2025, the largest institutional holders include The <strong>Vanguard Group (7.73%), BlackRock (6.55%) and State Street Global Advisors (3.47%), followed by FMR LLC, Capital Research and Management Company, and T.</strong>",
    "published": null
  },
  {
    "title": "Who Owns Alphabet Inc.? How Does Its Ownership Work?",
    "url": "https://bitkan.com/learn/who-owns-alphabet-inc-how-does-its-ownership-work-36947",
    "snippet": "<strong>Larry Page holds approximately 45% of Class B shares, while Sergey Brin holds about 42%</strong>. Although neither of them is involved in the day-to-day operations, they maintain significant influence over Alphabet&#x27;s direction through their voting power.",
    "published": null
  },
  {
    "title": "Alphabet Inc.: Shareholders Board Members Managers and Company Profile | US02079K3059 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/ALPHABET-INC-24203373/company/",
    "snippet": "Alphabet Inc. is a <strong>holding company</strong> organized around 6 areas of activities: - operation of a web-based search engine (Google).",
    "published": null
  }
]