[
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "Prior to his election, Cameroonian Issa Hayatou was acting president after the impeachment of Sepp Blatter on 8 October 2015, who was given an eight-year ban from all football-related activities on 21 December 2015 (reduced to six years on 24 February 2016), which was renewed for six years on 24 March 2021. ... ^ a b Rimet was provisionally placed in control of FIFA as chairman during the 1920 Summer Olympics in Antwerp, Belgium.",
    "published": "1 month ago"
  },
  {
    "title": "Gianni Infantino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gianni_Infantino",
    "snippet": "Infantino was a member of FIFA&#x27;s Reform Committee. <strong>On 26 October 2015, he received the backing of the UEFA Executive Committee to stand for the position of president in the 2016 FIFA Extraordinary Congress</strong>. On the same day, he confirmed his candidacy and submitted the required declarations ...",
    "published": "1 day ago"
  },
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/organisation/president/past-presidents",
    "snippet": "<strong>On 22 May 1904, Guerin - then just 28 - was elected president at the inaugural FIFA Congress and remained in his post for two years</strong>, during which time another eight associations came on board, including the English Football Association.",
    "published": null
  },
  {
    "title": "FIFA Presidents - My Football Facts",
    "url": "https://www.myfootballfacts.com/world-football/fifa/world-cup/fifa-all-time-world-cup/fifa-presidents/",
    "snippet": "Shortly after Blatter’s win, he was forced to resign and new elections took place on 26th February 2016 with Prince Ali, Jérôme Champagne, Tokyo Sexwale, Sheik Salman and Gianni Infantino vying to become FIFA’s 9th President. Sexwale withdrew before the election and Switzerland’s Gianni Infantino was victorious after a second ballot.",
    "published": "April 30, 2025"
  },
  {
    "title": "Sepp Blatter | Biography, FIFA, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Sepp-Blatter",
    "snippet": "He became the organization’s general secretary in 1981 before being <strong>elected president on June 8, 1998</strong>, to succeed João Havelange. Early in his tenure, a succession of financial scandals initially did not affect Blatter’s position, as he ...",
    "published": null
  }
]