[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "Earps kept 14 league clean sheets, ... also helped the club to reached a major cup final for the first time, losing 1–0 to Chelsea in the final at <strong>Wembley Stadium</strong>......",
    "published": "3 days ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "Before arriving at Manchester United, Earps spent time playing for hometown club Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in 2024, Mary took on a new challenge by joining French giants Paris Saint-Germain.",
    "published": null
  },
  {
    "title": "Mary Earps’ Manchester United return: Jeers, cheers, selfies and a painful defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6802703/2025/11/13/mary-earps-manchester-united-psg/",
    "snippet": "<strong>Old Trafford</strong> should be a happy place for Earps. It was here, as a child, that she watched her team, Liverpool, live and in the flesh for the first time. In March 2022, she was part of the United team who played the first women’s match in front ...",
    "published": "November 13, 2025"
  },
  {
    "title": "Mary Earps MBE (@maryearps) - Instagram",
    "url": "https://www.instagram.com/maryearps/",
    "snippet": "See Instagram photos and videos from <strong>Mary</strong> <strong>Earps</strong> MBE (@maryearps)",
    "published": null
  },
  {
    "title": "Mary Earps | Alumni | Loughborough University",
    "url": "https://www.lboro.ac.uk/alumni/our-alumni/mary-earps/",
    "snippet": "The Euro 2022 Championship saw the Lionesses – and Mary – paving the way for the next generation. The squad took home that winner&#x27;s trophy for the first time in the side’s history. They played in front of a packed <strong>Wembley Stadium</strong> – with more than 87,000 in attendance.",
    "published": null
  }
]