[
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Galthié won his only club trophy on his last competitive match, the French championship final with <strong>Stade Français</strong> against Toulouse on 7 June 2003 at Stade de France (32–18). Galthié became the coach of <strong>Stade Français</strong> in 2004 after head coach Nick Mallet departed the Paris club.",
    "published": "3 weeks ago"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "Novès was dismissed in December ... coach <strong>Jacques Brunel, who arrived from the same position with Bordeaux Bègles. Novès&#x27; assistants were dismissed as well. In April 2019, then-French Rugby Federation president Bernard Laporte announced that Fabien Galthié</strong> would be appointed ...",
    "published": "1 week ago"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "<strong>Marc Lievremont</strong>’s time as France’s head coach included a 2010 Six Nations Grand Slam and second-place finish at the 2011 Rugby World Cup. Despite finishing as runner-up at the Rugby World Cup, Lievremont left the role due a fractured ...",
    "published": "May 30, 2025"
  },
  {
    "title": "Fabien Galthie: Ten things you should know about the France head coach",
    "url": "https://www.rugbyworld.com/countries/france-countries/fabien-galthie-ten-things-you-should-know-about-the-france-head-coach-134810",
    "snippet": "Find out more about the former France scrum-half who has sparked a turnaround in fortunes of the national team · <strong>Fabien Galthie</strong> has rejuvenated the French team (Getty Images) <strong>Fabien Galthie</strong> has overseen significant improvements in the France ...",
    "published": "January 12, 2024"
  },
  {
    "title": "Fabien Galthié, the perfectionist masterminding France's Rugby World Cup tilt",
    "url": "https://www.france24.com/en/sport/20230921-fabien-galthi%C3%A9-the-perfectionist-masterminding-france-s-rugby-world-cup-tilt",
    "snippet": "Having played for France in four Rugby World Cups, and lost a final, <strong>Fabien Galthié</strong> is now focused on coaching the home nation to its maiden Webb Ellis Cup. In his three years at the helm, the former…",
    "published": "September 21, 2023"
  }
]