[
  {
    "title": "MS NOW - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/MS_NOW",
    "snippet": "MSNBC was established in 1996 under a strategic partnership between <strong>NBC and Microsoft</strong>. NBC executive Tom Rogers was instrumental in developing the partnership. James Kinsella, a Microsoft executive, served as president of the online component, MSNBC.com, and represented the technology company ...",
    "published": "5 days ago"
  },
  {
    "title": "MSNBC to rebrand to MS NOW",
    "url": "https://www.axios.com/2025/08/18/msnbc-rebrand-ms-now-versant",
    "snippet": "MSNBC, the progressive cable network owned by NBCUniversal, is rebranding to <strong>MS NOW</strong>, an acronym that stands for My Source for News, Opinion and the World. Why it matters: The rebrand is part of a wider effort by NBCU to create a distinction ...",
    "published": "August 18, 2025"
  },
  {
    "title": "Why MS NOW? What the MSNBC name change means for viewers - Los Angeles Times",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2025-11-14/msnbcs-name-will-change-but-its-political-leanings-will-not",
    "snippet": "Mika Brzezinski and Joe Scarborough on “Morning Joe.” ... <strong>MS NOW</strong> — an acronym for “My Source for News, Opinion and the World” — is the result of the politically progressive network being spun off into a company called Versant.",
    "published": "November 14, 2025"
  },
  {
    "title": "MSNBC to change name to MS NOW amid spinoff from NBCUniversal",
    "url": "https://www.nbcnews.com/business/media/msnbc-change-name-ms-now-spinoff-nbcuniversal-rcna225563",
    "snippet": "MSNBC will change its name to <strong>MS Now</strong>, for My Source News Opinion World, and unveil a new logo this year as part of the cable news channel’s spinoff from the Comcast-owned media company NBCUniversal",
    "published": "August 19, 2025"
  },
  {
    "title": "MSNBC is becoming MS NOW. What to know about the change and how to watch.",
    "url": "https://www.usatoday.com/story/entertainment/tv/2025/11/14/msnbc-turns-ms-now-watch/87248614007/",
    "snippet": "The transition comes as MSNBC breaks off from its current parent company, <strong>Comcast NBCUniversal</strong>, and moves into Versant, an independent media company.",
    "published": "November 14, 2025"
  }
]