[
  {
    "title": "The Official Website of the Buffalo Bills",
    "url": "https://www.buffalobills.com/team/front-office-roster/",
    "snippet": "<strong>Kim Pegula</strong> is the owner of both the Buffalo Bills and Buffalo Sabres.",
    "published": null
  },
  {
    "title": "Buffalo Bills - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Buffalo_Bills",
    "snippet": "Drawing much of its fanbase from western New York and neighboring southern Ontario, the Bills are the only NFL team that plays home games in the state of New York. The franchise is owned by <strong>Terry Pegula</strong>, who purchased the Bills after the death of the original owner Ralph Wilson in 2014, and ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Terry Pegula - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Terry_Pegula",
    "snippet": "<strong>Terrence Michael Pegula</strong> (born March 27, 1951) is an American billionaire businessman and petroleum engineer. He is the owner of the Buffalo Sabres of the National Hockey League (NHL) and, with a consortium of private equity firms and athletes, the Buffalo Bills of the National Football League (NFL).",
    "published": "1 week ago"
  },
  {
    "title": "Buffalo Bills Executives and Owners | Pro-Football-Reference.com",
    "url": "https://www.pro-football-reference.com/teams/buf/executives.htm",
    "snippet": "Historical Coaches: Don Shula, George Halas, Bill Belichick, Tom Landry ... ... Bud Adams, Scott Pioli, George Halas ... ... Ed Hochuli, Tony Steratore, Terry McAulay ... ... Current Fantasy Matchups, Fantasy Points Allowed ... ... Lambeau Field, Superdome, Candlestick Park ... ... Pro Football Hall of Fame, AP NFL MVP, Pro Bowl ... ... Players who played for multiple teams, Player Linker Tool, Birthdays, Uniform Numbers ... ... Glossary, Stat Minimums, Frequently Asked Questions about the ...",
    "published": null
  },
  {
    "title": "All About Jessica Pegula's Billionaire Parents, Buffalo Bills Owners Terry and Kim Pegula",
    "url": "https://people.com/all-about-jessica-pegula-parents-terry-and-kim-pegula-11800388",
    "snippet": "Terry, who has two children from his first marriage, and Kim met at a restaurant in 1991 and married two years later. For the majority of their three-decade-long relationship, they’ve worked together and are the current owners of the Buffalo Bills NFL team and the Buffalo Sabres NHL team.",
    "published": "August 29, 2025"
  }
]