[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Initially ignored as a novelty ... fights for control over the party, Ventura <strong>left the Reform Party a year after taking office and served the remainder of his term as a member of the Independence Party of Minnesota</strong>....",
    "published": "3 days ago"
  },
  {
    "title": "Governorship of Jesse Ventura | MNopedia",
    "url": "https://www.mnhs.org/mnopedia/search/index/event/governorship-jesse-ventura",
    "snippet": "<strong>The former Reform Party, now the Independence Party, loses major-party status</strong>. Frank, Stephen I., and Steven Charles Wagner. We Shocked the World! A Case Study of Jesse Ventura’s Election as Governor of Minnesota.",
    "published": "April 14, 2025"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Ventura ran for governor of Minnesota in 1998. <strong>Ventura was elected as a member of the Reform Party, but later left and reorganized the Minnesota Reform Party as the Independence Party</strong>.[1] He did not seek a second term as governor.[2]",
    "published": null
  },
  {
    "title": "Jesse Ventura | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/jesse-ventura",
    "snippet": "During the 1990s, Ventura became increasingly involved in state politics. <strong>He joined the Minnesota Independence Party (later affiliated with H. Ross Perot as the Minnesota Reform Party)</strong> and supported MIP candidate Dean Barkley for the US Senate.",
    "published": null
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "His first foray into politics was as mayor of Brooklyn Park (1991–95). In the late 1990s he worked as a radio shock jock. ... <strong>In 1998 Ventura ran for governor of Minnesota as the Reform Party candidate</strong>.",
    "published": "January 14, 2009"
  }
]