[
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "On July 22, 2013, <strong>ESPN (a subsidiary of the Walt Disney Company)</strong> announced that it had acquired ownership of the FiveThirtyEight website and brand, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming ...",
    "published": "1 day ago"
  },
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "On June 3, 2010, The New York Times and Silver announced that FiveThirtyEight had formed a partnership under which the blog would be hosted by the Times for a period of three years. In legal terms, FiveThirtyEight granted a &quot;license&quot; to the Times to publish the blog.",
    "published": "1 month ago"
  },
  {
    "title": "A few words about FiveThirtyEight - by Nate Silver",
    "url": "https://www.natesilver.net/p/a-few-words-about-fivethirtyeight",
    "snippet": "It’s always an uphill battle under those conditions, particularly when it comes to recruiting and retaining staff, who were constantly being poached by outlets like the New York Times and the Washington Post. The FiveThirtyEight.com homepage as of its relaunch under ESPN/Disney on March 17, 2014.",
    "published": "March 5, 2025"
  },
  {
    "title": "The End of an Error: FiveThirtyEight Is Shutting Down – PJ Media",
    "url": "https://pjmedia.com/matt-margolis/2025/03/05/the-end-of-an-error-fivethirtyeight-is-being-shut-down-n4937614",
    "snippet": "Stats guru <strong>Nate Silver</strong> founded FiveThirtyEight, once the darling of the left-wing polling establishment, in 2008 before licensing it to The New York Times.",
    "published": "March 5, 2025"
  },
  {
    "title": "The New York Times - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_New_York_Times",
    "snippet": "In June 2010, The New York Times licensed the political blog FiveThirtyEight in a three-year agreement. The blog, written by Nate Silver, had garnered attention during the 2008 presidential election for predicting the elections in forty-nine of fifty states. FiveThirtyEight appeared on nytimes.com in August.",
    "published": "15 hours ago"
  }
]