[
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "<strong>Albert II, Prince of Monaco is the Honorary President and the role of IAF President is held by the World Athletics President</strong>. A World Athletics Heritage department was created in 2018 to maintain historic artifacts and display them through a physical gallery in Monaco, a virtual online gallery, ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "World Athletics Gender Leadership Taskforce (2018-present) Athletes’ Commission Member (2001-2003) World Athletics Human Rights Working Group Member (2020-2021) World Athletics Bid Evaluation Panel Member (2021-present) World Athletics Risk Committee Member (2020-present) Atletismo Suramericano Board Member (2019-present) ConSudAtle Athletes’ Commission Member (2017-2023) Universidad Catolica track and field Team head coach (2006-2011) Club Deportivo Universidad Católica Track and Field Board Member (2011-present) Organising Committee of Santiago 2023 Pan-American Games Technical Director ·",
    "published": null
  },
  {
    "title": "The Past Presidents of the IAAF | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/the-past-presidents-of-the-iaaf",
    "snippet": "He was elected president of FIDAL, the Italian athletics federation, in 1969 and three years later he was also elected to the IAAF Council before becoming president in 1981. Nebiolo expanded the IAAF calendar into the form we know it today, especially with the introduction of events such as the IAAF World Junior Championships, as well as moving the show piece IAAF World Championships to a two-yearly cycle. A pivotal moment in the political history of the IAAF came in 1987 when Nebiolo insisted on changes to the voting structure of Congress, which had been biased towards the &#x27;traditional&#x27; powers&#x27;, to one-member one-vote.",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "In 1901, he was elected as the president of the Swedish Athletic Association and two years later was one of the founders of the Swedish National Sports Foundation. He was among the organisers of the 1912 Olympic Games in Stockholm and in this capacity sent written invitations to interested parties to attend the inaugural Congress on 17 July 1912, which lead to the formation of the IAAF. The hallmark of his 34 years as president was a staunch defence of amateurism but his highly skilful leadership, aided by residing in a neutral country and linguistic skills which included speaking fluent German and English, helped the IAAF steadily expand its scope and influence as well as weather the storms brought about by two World Wars.",
    "published": null
  },
  {
    "title": "Track and Field: World Athletics (formerly the IAAF)",
    "url": "https://www.ducksters.com/sports/track_and_field/iaaf.php",
    "snippet": "As of 2021, the organization is governed under the leadership of <strong>President Sebastian Coe</strong>. He is a member of the World Athletics council which also consists of four vice presidents, the treasurer, a representative from each area association, and fifteen other members.",
    "published": null
  }
]