[
  {
    "title": "Mergers: Commission approves acquisition of Com Hem by Tele2",
    "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_18_6065",
    "snippet": "<strong>The European Commission has approved unconditionally, under the EU Merger Regulation, the proposed acquisition of Com Hem by Tele2.</strong> The Commission concluded that the transaction would raise no competition concerns as the companies\\&#x27; activities ...",
    "published": null
  },
  {
    "title": "Tele2 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tele2",
    "snippet": "In 2023, Tele2 was named Europe’s leading climate leader by the Financial Times. In 2024, the company was recognized as Sweden’s most sustainable and ranked 37th globally by Time Magazine. The same year, Tele2 AB was acquired by <strong>Iliad through its subsidiary Freya Investissement</strong>.[1]",
    "published": "November 2, 2025"
  },
  {
    "title": "Tele2 biedt 2,7 miljard voor kabelmaatschappij Com Hem | Economie | NU.nl",
    "url": "https://www.nu.nl/economie/5080589/tele2-biedt-27-miljard-voor-kabelmaatschappij-com-hem.html",
    "snippet": "Woensdag 17 december 2025 | Het ... de Zweedse telecomsector is een fusie in de maak. <strong>Tele2 heeft overeenstemming bereikt met kabelmaatschappij Com Hem over een overname</strong>....",
    "published": "March 28, 2025"
  },
  {
    "title": "Sec",
    "url": "https://www.sec.gov/Archives/edgar/data/1122535/000094787118000030/ss75121_425.htm",
    "snippet": "I hope you enjoy the longest-ever ... the board of Com Hem to merge Com Hem into Tele2 for a consideration that is roughly equivalent to <strong>75% in Tele2 shares and 25% in cash</strong>....",
    "published": null
  },
  {
    "title": "TELE2 AND COM HEM COMBINING TO CREATE LEADING INTEGRATED CONNECTIVITY PROVIDER - Tele2 play",
    "url": "https://news.cision.com/tele2-play/r/tele2-and-com-hem-combining-to-create-leading-integrated-connectivity-provider,c2428559",
    "snippet": "It is expected that upon completion ... ... Pursuant to the Merger Plan, Com Hem’s shareholders will receive approximately <strong>26.9 percent</strong> economic ownership in Enlarged Tele2....",
    "published": null
  }
]