[
  {
    "title": "Allies of Kyrgyzstan's strongman president sweep snap parliamentary election | Reuters",
    "url": "https://www.reuters.com/world/asia-pacific/allies-kyrgyzstans-president-win-majority-parliamentary-election-preliminary-2025-11-30/",
    "snippet": "Kyrgyz President <strong>Sadyr Japarov</strong> casts his ballot as his wife Aigul Japarova stands nearby at a polling station during the snap parliamentary election in Bishkek, Kyrgyzstan November 30, 2025.",
    "published": "3 weeks ago"
  },
  {
    "title": "Allies of Kyrgyzstan's President Set to Win Snap Parliamentary Election",
    "url": "https://www.usnews.com/news/world/articles/2025-11-29/allies-of-kyrgyzstans-president-set-to-win-snap-parliamentary-election",
    "snippet": "REUTERS/Vladimir Pirogov ... BISHKEK, Nov 29 (Reuters) - Kyrgyzstan votes in a snap parliamentary election on Sunday in which allies of President <strong>Sadyr Japarov</strong> are expected to win a resounding ...",
    "published": "3 weeks ago"
  },
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "The office of president is open to all citizens of Kyrgyzstan who are no younger than 35 years of age, and no older than 65 years of age. A candidate must have a command of the state language, and have resided in the republic for no less than 15 years before the nomination of his or her candidacy for the position.",
    "published": "November 11, 2025"
  },
  {
    "title": "2025 Kyrgyz parliamentary election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Kyrgyz_parliamentary_election",
    "snippet": "On 30 September 2025, after the decree of President <strong>Sadyr Japarov</strong> setting the date for early elections, the Central Election Commission approved the Calendar Plan for the organization and conduct of the early elections of deputies of the Jogorku ...",
    "published": "1 week ago"
  },
  {
    "title": "Allies of Kyrgyzstan's president set to win snap parliamentary election | Reuters",
    "url": "https://www.reuters.com/business/media-telecom/allies-kyrgyzstans-president-set-win-snap-parliamentary-election-2025-11-29/",
    "snippet": "REUTERS/Vladimir Pirogov Purchase Licensing Rights, opens new tab ... BISHKEK, Nov 29 (Reuters) - Kyrgyzstan votes in a snap parliamentary election on Sunday in which allies of President <strong>Sadyr Japarov</strong> are expected to win a resounding victory.",
    "published": "3 weeks ago"
  }
]