[
  {
    "title": "Greta Van Susteren Signs Multi-Year Renewal with Newsmax | Newsmax Media, Inc.",
    "url": "https://ir.newsmax.com/news/news-details/2025/Greta-Van-Susteren-Signs-Multi-Year-Renewal-with-Newsmax-/default.aspx",
    "snippet": "(NYSE:NMAX) (&quot;Newsmax&quot; or the &quot;Company&quot;) today announced that veteran news anchor and broadcaster Greta Van Susteren has signed a multi-year extension to <strong>host &quot;The Record with Greta Van Susteren.&quot;</strong>",
    "published": null
  },
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "Greta Conway Van Susteren (born June 11, 1954) is an American <strong>journalist, lawyer, and television news anchor</strong> for Newsmax TV. She was previously on CNN, Fox News, and MSNBC. She hosted Fox News&#x27;s On the Record w/ Greta Van Susteren for 14 years (2002–2016) before departing for MSNBC, where ...",
    "published": "August 20, 2025"
  },
  {
    "title": "Greta Van Susteren Signs New Deal With Newsmax",
    "url": "https://deadline.com/2025/04/greta-van-susteren-signs-new-deal-with-newsmax-1236366410/",
    "snippet": "Greta Van Susteren has signed a multi-year deal to continue hosting Newsmax‘s The Record with Greta Van Susteren. The show, based in Washington, D.C., airs at 6 p.m. ET, kicking off the network’s nighttime lineup. Her show debuted on the network in 2022. Van Susteren provided legal analysis ...",
    "published": "April 11, 2025"
  },
  {
    "title": "Greta Van Susteren – USC Center on Communication Leadership and Policy",
    "url": "https://communicationleadership.usc.edu/cp_school_directory/greta-van-susteren/",
    "snippet": "While working for <strong>Gray TV</strong>, Greta simultaneously anchored Voice of America’s weekly television program Plugged In which covered foreign policy, US domestic affairs, and broadcasted worldwide in 48 languages.",
    "published": null
  },
  {
    "title": "Greta van Susteren :: New Netherland Institute",
    "url": "https://www.newnetherlandinstitute.org/history-and-heritage/dutch_americans/greta-van-susteren",
    "snippet": "Greta Van Susteren is a <strong>journalist and well known television personality</strong>, currently on the Fox News Channel, and earlier, from 1991 to 2002, on the CNN Channel. Van Susteren started her journalistic career, on CNN, as a legal analyst, and first came into prominence with the William Kennedy ...",
    "published": null
  }
]