[
  {
    "title": "President of Georgia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Georgia",
    "snippet": "<strong>Salome Zourabichvili</strong> stated on 29 December and during the following weeks that she remained the president of Georgia. Protests against the ruling party have continued since the election, with hundreds of protesters arrested, beaten or tortured by the police and the ruling-party affiliated violent ...",
    "published": "4 weeks ago"
  },
  {
    "title": "2024 Georgian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024_Georgian_presidential_election",
    "snippet": "Kazakhstan: President Kassym-Jomart Tokayev sent a letter to Kavelashvili, extending New Year greetings and expressing his &quot;best wishes for a joyous and prosperous 2025&quot;. Hungary: President Tamás Sulyok congratulated Kavelashvili on his election as president. Sulyok emphasized that &quot;Hungary firmly supports the territorial integrity and sovereignty of Georgia and the country&#x27;s European integration efforts&quot;. Russia: Leonid Slutsky, Chairman of the Russia State Duma Committee on International Affairs, praised Kavelashvili&#x27;s election, stating that &quot;Georgia confidently passes the test of sovereignty and independence.",
    "published": "November 14, 2025"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "Kavelashvili, 53, who was the only candidate on the ballot, easily won the vote earlier in December given the Georgian Dream party’s control of a 300-seat electoral college that replaced direct presidential elections in 2017.",
    "published": "December 29, 2024"
  },
  {
    "title": "New Georgian President Sworn In Amid Political Standoff",
    "url": "https://www.rferl.org/a/georgia-tbilisi-kavelashvili-zourabichvili/33256787.html",
    "snippet": "TBILISI -- <strong>Mikheil Kavelashvili</strong>, a former soccer player and right-wing populist, has been sworn in as Georgia&#x27;s new president amid a monthslong political crisis, likely further complicating the country&#x27;s prospects for European Union membership.",
    "published": "December 29, 2024"
  },
  {
    "title": "Georgia: Ex-footballer Mikheil Kavelashvili named president",
    "url": "https://www.bbc.com/news/articles/c5ygejxej28o",
    "snippet": "Prime Minister Irakli Kobakhidze has accused Zourabichvili of trying to harm Georgia&#x27;s interests, emphasising that when her term of office ends on 29 December, she will have to retire. &quot;We have very strong state institutions, so we certainly have no difficulty in bringing the situation under full control,&quot; he was quoted as saying on Friday. Party colleague Nino Tsilosani told reporters that Zourabichvili was no longer president in the eyes of the public. Georgia is a parliamentary democracy with the president the head of state, and the prime minister the head of Parliament.",
    "published": "December 14, 2024"
  }
]