[
  {
    "title": "Eric Schmidt - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eric_Schmidt",
    "snippet": "<strong>Eric Emerson Schmidt</strong> (born April 27, 1955) is an American businessman and former computer engineer who was the chief executive officer of Google from 2001 to 2011 and the company&#x27;s executive chairman from 2011 to 2015. He also was the executive chairman of parent company Alphabet Inc. from ...",
    "published": "1 week ago"
  },
  {
    "title": "Sundar Pichai - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sundar_Pichai",
    "snippet": "On March 13, 2013, Pichai added Android to the list of Google products that he oversaw. Android was formerly managed by Andy Rubin. Pichai was selected to become the next CEO of Google on August 10, 2015, after previously being appointed Product Chief by CEO, Larry Page.",
    "published": "3 weeks ago"
  },
  {
    "title": "Larry Page - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Larry_Page",
    "snippet": "Page was chief executive officer of Google from 1997 until August 2001 when he was succeeded by <strong>Eric Schmidt</strong>, and then again from April 2011 until July 2015 when he became CEO of its newly formed parent organization Alphabet Inc. He held that post until December 4, 2019, when he and Brin stepped ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Google",
    "snippet": "The lawsuit became known in March 2021 when a federal judge denied Google&#x27;s request to dismiss the case, ruling that they must face the group&#x27;s charges. Reuters reported that the lawsuit alleged that Google&#x27;s CEO <strong>Sundar Pichai</strong> sought to keep ...",
    "published": "3 days ago"
  },
  {
    "title": "About Eric - Eric Schmidt",
    "url": "https://ericschmidt.com/bio/",
    "snippet": "As Chairman and CEO of Google, he oversaw the company’s transformation from a small startup to one of the world’s most influential companies from 2001 to 2011. Prior to joining Google, Eric was Chairman and CEO of Novell, a software as a service company. He previously spent 14 years at Sun Microsystems, Inc., starting his career as a manager and rising to become their Chief Technology Officer.",
    "published": "August 13, 2025"
  }
]