[
  {
    "title": "Marcelo Ebrard - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Ebrard",
    "snippet": "Marcelo Luis Ebrard Casaubón (Spanish: [maɾˈselo eˈβɾaɾð]; born 10 October 1959) is a Mexican politician and internationalist who has served as the secretary of economy since 2024. A member of the <strong>National Regeneration Movement (Morena),</strong> he previously served as secretary of foreign ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Cabinet Profile: Marcelo Ebrard, Secretary of the Economy | Mexico News Report",
    "url": "https://mexiconewsreport.com/index.php/2025/02/19/cabinet-profile-marcelo-ebrard-secretary-of-the-economy/",
    "snippet": "After that he studied public ... the PRI, the Partido de Centro Democrático, the PRD and since 2018, Ebrard has been in <strong>MORENA, the party of AMLO and Claudia Sheinbaum</strong>....",
    "published": null
  },
  {
    "title": "Meet Mexico's Secretary of the Economy: Marcelo Ebrard -",
    "url": "https://mexicodailypost.com/2025/02/20/meet-mexicos-secretary-of-the-economy-marcelo-ebrard/",
    "snippet": "Over the years he’s been a member of four political parties, the PRI, the Partido de Centro Democrático, the PRD and since 2018, Ebrard has been in <strong>MORENA, the party of AMLO and Claudia Sheinbaum</strong>.",
    "published": "February 20, 2025"
  },
  {
    "title": "Marcelo Ebrard",
    "url": "https://dairynews.today/milkypedia/person/marcelo_ebrard_6642080/",
    "snippet": "He holds a degree in International ... transitioning to the Party of the Democratic Revolution (PRD), and currently aligning with the <strong>National Regeneration Movement (MORENA).</strong>...",
    "published": null
  },
  {
    "title": "Who is Marcelo Ebrard? A video guide",
    "url": "https://mexiconewsdaily.com/business/a-video-guide-to-who-is-marcelo-ebrard/",
    "snippet": "The second-most senior politician in the ruling <strong>Morena party</strong>, Economy Minister Marcelo Ebrard will help President Claudia Sheinbaum to formulate a solution that will safeguard jobs, promote growth and protect Mexico from retaliation by its largest ...",
    "published": "March 5, 2025"
  }
]