[
  {
    "title": "Mediocredito Centrale|Invitalia",
    "url": "https://www.invitalia.it/en/chi-siamo/il-gruppo/mediocredito-centrale",
    "snippet": "Mediocredito Centrale - Banca del Mezzogiorno was <strong>acquired by Invitalia in August 2017</strong> to develop synergies with the offer of incentives to enterprises and to promote growth policies.",
    "published": null
  },
  {
    "title": "Banca del Mezzogiorno – MedioCredito Centrale - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banca_del_Mezzogiorno_–_MedioCredito_Centrale",
    "snippet": "Banca del Mezzogiorno – MedioCredito Centrale (BdM-MCC) is an Italian bank based in Rome, Lazio region. <strong>The bank is entirely controlled by Invitalia S.p.A.</strong>, which in turn is owned by the Ministry of Economy. The bank was specialized in medium-term loan to companies, which developed into corporate ...",
    "published": "April 5, 2025"
  },
  {
    "title": "Invitalia: l'Agenzia nazionale per lo sviluppo d'impresa - Invitalia",
    "url": "https://www.invitalia.it/eng/who-we-are/the-agency/the-group",
    "snippet": "Banca del Mezzogiorno – Mediocredito Centrale BdM-MCC was <strong>acquired by Invitalia in August 2017</strong> to generate synergies by providing incentives in support of enterprises and to promote growth policies.",
    "published": null
  },
  {
    "title": "Banca del Mezzogiorno - MedioCredito Centrale - Wikipedia",
    "url": "https://it.wikipedia.org/wiki/Banca_del_Mezzogiorno_-_MedioCredito_Centrale",
    "snippet": "Banca del Mezzogiorno - MedioCredito Centrale S.p.A. è un istituto bancario italiano, <strong>partecipato al 100% da Invitalia</strong>. MedioCredito Centrale nasce nel 1952, istituito dalla Legge 949/52 emanata dal Governo De Gasperi VI, come ente pubblico ...",
    "published": "1 month ago"
  },
  {
    "title": "Mediocredito Centrale: le nuove nomine del Consiglio di Amministrazione - Invitalia",
    "url": "https://www.invitalia.it/chi-siamo/area-media/notizie-e-comunicati-stampa/mcc-nuovo-cda",
    "snippet": "Ferruccio Ferranti Presidente del CdA, Francesco Minotti Amministratore Delegato",
    "published": null
  }
]