[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and is on the advisory board of the University of Austin.",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "After earning his master’s and ... and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an <strong>assistant professor of zoology</strong> (1967–69) at the University of California, Berkeley....",
    "published": "July 15, 2009"
  },
  {
    "title": "Biography: Dr. Richard Dawkins",
    "url": "https://www.pbs.org/faithandreason/bio/dawk-body.html",
    "snippet": "Richard Dawkins was born in Nairobi in 1941 and educated at Oxford University. He has taught zoology at the universities of California and Oxford. In 1995 he became the first holder of the newly endowed Charles Simonyi Chair of Public Understanding of Science at Oxford University. His previous ...",
    "published": null
  },
  {
    "title": "Richard Dawkins - Students | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/students/article/Richard-Dawkins/603802",
    "snippet": "More books followed, including ... Improbable (1996). In 1995 Dawkins was made the <strong>Charles Simonyi professor of public understanding of science at Oxford University</strong>....",
    "published": null
  },
  {
    "title": "Amazon.com: Richard Dawkins: Books, Biography, Blog, Audiobooks, Kindle",
    "url": "https://www.amazon.com/Richard-Dawkins/e/B000AQ3RBI",
    "snippet": "Richard Dawkins <strong>taught zoology at the University of California at Berkeley and at Oxford University</strong> and is now the Charles Simonyi Professor of the Public Understanding of Science at Oxford, a position he has held since 1995.",
    "published": null
  }
]