[
  {
    "title": "Union Berlin brings former Germany forward Kevin Volland back to Bundesliga from Monaco | AP News",
    "url": "https://apnews.com/article/volland-union-berlin-monaco-transfer-3bfe2ddda7d6d3fe682af2c9c2374021",
    "snippet": "BERLIN (AP) — <strong>Union Berlin signed former Germany forward Kevin Volland from French league club Monaco on Thursday</strong>, further bolstering its attack ahead of its first Champions League participation.",
    "published": "August 17, 2023"
  },
  {
    "title": "Union Berlin bring Kevin Volland back to the Bundesliga | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/union-berlin-sign-former-germany-forward-kevin-volland-monaco-24393",
    "snippet": "<strong>Union Berlin have completed the signing of Germany forward Kevin Volland from Monaco</strong>.",
    "published": "August 18, 2023"
  },
  {
    "title": "Kevin Volland joins Union Berlin",
    "url": "https://www.asmonaco.com/en/kevin-volland-joins-union-berlin/",
    "snippet": "Hampered by physical problems last season (3 goals and three assists in 17 league appearances), <strong>the player from Marktoberdorf in Bavaria will now be joining Union Berlin, his fifth club after Munich 1860, Hoffenheim, Bayer Leverkusen and AS Monaco</strong>.",
    "published": "August 17, 2023"
  },
  {
    "title": "Kevin Volland Joins Union | Professional | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/union-live/latest-news/professional/Kevin-Volland-Joins-Union-1409H/",
    "snippet": "1. <strong>FC Union Berlin have signed Kevin Volland from AS Monaco</strong>, with the 15-time German international coming to strengthen Union’s attack for the 2023/24 season.",
    "published": null
  },
  {
    "title": "Union Berlin reach agreement with Monaco to sign Kevin Volland - Get French Football News",
    "url": "https://www.getfootballnewsfrance.com/2023/union-berlin-reach-agreement-with-monaco-to-sign-kevin-volland/",
    "snippet": "According to Foot Mercato journalist Sébastian Denis, <strong>Bundesliga club Union Berlin have reached an agreement with Monaco to sign Kevin Volland</strong>. The German striker is entering the last year of his contract at the Stade Louis II, so Les Monégasques ...",
    "published": "August 16, 2023"
  }
]