[
  {
    "title": "Mike Downey (producer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mike_Downey_(producer)",
    "snippet": "<strong>In 2004, Downey joined the European Film Academy Board and was elected deputy chairman in 2014, and was also elected as EFA chairman in 2020.</strong>",
    "published": "July 19, 2025"
  },
  {
    "title": "Mike Downey • Producer and chairman of the European Film Academy - Cineuropa",
    "url": "https://cineuropa.org/en/interview/440528/",
    "snippet": "31/03/2023 - After receiving an honorary award at Stockfish, the “old friend of Iceland” broke down his career and the role of the International Coalition for Filmmakers at Risk",
    "published": null
  },
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "Mike <strong>first joined the board of the European Film Academy 15 years ago</strong> and has served alongside a broad range of European film makers including Istvan Szabo, Volker Schloendorff, Wim Wenders, Nikita Mikhalkov, Pawel Pawlikowski, Agnes Jaoui, ...",
    "published": null
  },
  {
    "title": "Story - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/story/",
    "snippet": "Wim Wenders (1996-2020) Agnieszka Holland (2020-2024) and Juliette Binoche (2024- ) followed in Bergman’s footsteps as Presidents of the Academy. <strong>The current chair of the Board is Mike Downey</strong>.",
    "published": "June 13, 2025"
  },
  {
    "title": "Mike Downey, member of the European Film Academy: presentation",
    "url": "https://www.europeanfilmacademy.org/Presentation.presentation.0.html?no_cache=1&uid=1332",
    "snippet": "European Film Academy - <strong>Founded in 1988</strong>, the European Film Academy currently unites more than 2,500 European film professionals with the common aim of promoting Europe&#x27;s film culture.",
    "published": null
  }
]