[
  {
    "title": "Unai Emery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Unai_Emery",
    "snippet": "Emery was born in <strong>Hondarribia, Gipuzkoa, Basque Country</strong>. He is a native speaker of the Basque language. His father and grandfather, named Juan and Antonio respectively, were also footballers, both goalkeepers. The former appeared for several clubs in the second tier including Real Unión, while ...",
    "published": "1 day ago"
  },
  {
    "title": "Unai Emery - Aston Villa - Coach Profile",
    "url": "https://www.playmakerstats.com/manager/unai-emery/569",
    "snippet": "Unai Emery Etxegoien is a 54-year-old Football coach born in <strong>Hondarribia, Spain</strong> on 1971-11-03, who currently coaches Aston Villa, in England.",
    "published": null
  },
  {
    "title": "Aston Villa’s Unai Emery: Formed by a place of history, struggle and principle - The Athletic",
    "url": "https://www.nytimes.com/athletic/6283642/2025/04/24/aston-villa-unai-emery-hometown-hondarribia/",
    "snippet": "The Emerys are fiercely proud of their place of birth, situated in the <strong>Basque Country</strong>. “Born in Hondarribia” is the first sentence on Unai’s Instagram bio and he was close to tears when he received the town’s “gold badge” from the ...",
    "published": "April 24, 2025"
  },
  {
    "title": "Unai Emery - IMDb",
    "url": "https://www.imdb.com/name/nm10063025/",
    "snippet": "Unai Emery. Self: LaLiga. Unai Emery was born on 3 November 1971 in <strong>Fuenterrabia, Basque Country, Spain</strong>.",
    "published": null
  },
  {
    "title": "Unai Emery Age, Wife, Biography, Family & More » StarsUnfolded",
    "url": "https://starsunfolded.com/unai-emery/",
    "snippet": "Bio/Wiki Full NameUnai Emery Etxegoien NicknameUnai ProfessionFootball Manager Physical Stats &amp; More Eye ColourHazel Brown Hair ColourBlack Football Managerial DebutWith Lorca in the 2004-2005 Season Teams ManagedLorca, Almeria, Valencia, Spartak Moscow, Sevilla, Paris Saint Germain Career ...",
    "published": null
  }
]