[
  {
    "title": "List of Arsenal F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Arsenal_F.C._managers",
    "snippet": "On 29 November 2019, with Arsenal ... as interim head coach. In December 2019, Arsenal appointed former club captain <strong>Mikel Arteta</strong> as the new head coach....",
    "published": "6 days ago"
  },
  {
    "title": "Arsenal Coaching Staff | Team Behind the Team",
    "url": "https://www.arsenalinsider.com/club/coaching-staff/",
    "snippet": "Arsenal’s coaching staff for the 2025/26 season under <strong>Mikel Arteta</strong> is a close-knit group. But who features among the Spaniard’s small clutch of experts in the Emirates Stadium dugout?",
    "published": "July 8, 2025"
  },
  {
    "title": "2025–26 Arsenal F.C. season - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025–26_Arsenal_F.C._season",
    "snippet": "On 8 July, Arsenal announced the appointment of former Argentinian defender <strong>Gabriel Heinze</strong> as a first team assistant coach, replacing Carlos Cuesta who departed the club to become the Head Coach of Serie A side Parma on 19 June.",
    "published": "2 days ago"
  },
  {
    "title": "Mikel Arteta joining as our new head coach | Club announcement | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/mikel-arteta-joining-our-new-head-coach",
    "snippet": "Head of football <strong>Raul Sanllehi</strong> said: “We met several top-class candidates and Mikel stood out to every single one of us as the perfect person for us. Mikel understands Arsenal Football Club and what it means to our fans around the world.",
    "published": null
  },
  {
    "title": "Why Arsenal hired Renee Slegers as their new head coach – consistency, solidity and ruthlessness - The Athletic",
    "url": "https://www.nytimes.com/athletic/6066264/2025/01/18/why-arsenal-hired-renee-slegers-as-head-coach/",
    "snippet": "Despite her experience as Rosengard head coach, whether Slegers could carry the weight of the Arsenal hot seat could have been in doubt, but that may have underestimated her capabilities. “You work in a lot of directions,” she said while still interim boss in December.",
    "published": "January 18, 2025"
  }
]