[
  {
    "title": "Stadion - 1. FFC Turbine Potsdam",
    "url": "https://www.turbine-potsdam.de/verein/stadion/",
    "snippet": "Karl-Liebknecht-Stadion Die Heimspiele der 1. Mannschaft werden im <strong>Karl-Liebknecht-Stadion in Potsdam/Babelsberg</strong> ausgetragen, in welchem ebenfalls die Heimpartien des Regionalligisten SV Babelsberg 03 stattfinden.…",
    "published": "January 12, 2024"
  },
  {
    "title": "Karl-Liebknecht-Stadion - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Karl-Liebknecht-Stadion",
    "snippet": "The <strong>Karl-Liebknecht-Stadion</strong> is a football stadium in Potsdam-Babelsberg, Germany. It is the home stadium of 1. FFC Turbine Potsdam and SV Babelsberg 03. The stadium has a capacity of 10,787 for 8,784 standing and 2,003 seated guests.",
    "published": "April 30, 2025"
  },
  {
    "title": "Karl-Liebknecht-Stadion, Potsdam | cityseeker",
    "url": "https://cityseeker.com/potsdam-de/689134-karl-liebknecht-stadion",
    "snippet": "Home stadium of FFC Turbine Potsdam and SV Babelsberg 03, <strong>Karl-Liebknecht-Stadion</strong> is a huge football stadium with excellent views of the ground. With a seating capacity of 2003 and a standing capacity of 8784, it can accommodate all of 10,787 ...",
    "published": null
  },
  {
    "title": "1. FFC Turbine Potsdam - Stadion | Soccerdonna",
    "url": "https://www.soccerdonna.de/de/1-ffc-turbine-potsdam/stadion/verein_368.html",
    "snippet": "Anfahrt öffentliche Verkehrsmittel: Per S-Bahn: Linie S7 Richtung Potsdam bis S-Bahnhof Babelsberg, in Fahrtrichtung aussteigen. Für Heimfans (vom S-Bahnhof Babelsberg): Kurzer Fußweg über die Karl-Liebknecht-Straße bis zum Stadion (etwa 950m). Für Gästefans (vom S-Bahnhof Babelsberg): Von der Karl-Liebknecht-Straße links in die Rudolf-Breitscheid-Str., nach 500m rechts in „Alt Nowawes“, dort 900m geradeaus laufen.",
    "published": null
  },
  {
    "title": "Karl-Liebknecht-Stadion | Babelsberg, Turbine Potsdam • Stats",
    "url": "https://www.onlinebettingacademy.com/stats/venue/germany/karl-liebknecht-stadion/1226",
    "snippet": "The next match at <strong>Karl-Liebknecht-Stadion</strong>, Potsdam, will be on 10 February 2023, between Turbine Potsdam W and Werder Bremen W, a match for the Frauen Bundesliga of Germany.",
    "published": null
  }
]