[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "On 1 March 1993, the cable and satellite channel Screensport merged with Eurosport. As a result, Eurosport International was co-owned by the <strong>TF1 Group, (operator), Canal+ Group and ESPN Inc</strong>, with Générale d&#x27;Images (later rebranded Havas Images) as a fourth shareholder of the French operations.",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport | Warner Bros. Entertainment Wiki | Fandom",
    "url": "https://warnerbros.fandom.com/wiki/Eurosport",
    "snippet": "Discovery through its TNT Sports ... and streams on Max and Discovery+. Originally a joint venture between <strong>the European Broadcasting Union and Sky</strong> established in 1989, it was briefly shut down in 1991 following complaints ...",
    "published": null
  },
  {
    "title": "When will Eurosport be switched off and replaced by TNT Sports? Merger explained",
    "url": "https://www.radiotimes.com/tv/sport/eurosport-tnt-sports-merger/",
    "snippet": "... The home of cycling, snooker and winter events such as skiing will be switched off after 36 years of live coverage, highlights and more. <strong>Warner Bros Discovery</strong>, the company which has owned the Eurosport brand since 2014, will merge Eurosport ...",
    "published": "February 20, 2025"
  },
  {
    "title": "No more Eurosport in the UK from late February as channels merged with TNT - Sportcal",
    "url": "https://www.sportcal.com/media/no-more-eurosport-in-the-uk-as-fta-channels-merged-with-tnt/",
    "snippet": "Discovery initially bought Eurosport in 2015, before merging with <strong>Warner Media</strong> in 2022.",
    "published": "January 28, 2025"
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "Eurosport 1 is a television sports network channel which is a division of Eurosport and a subsidiary of EMEA version of <strong>Warner Bros. Discovery</strong>. Discovery took a 20% minority interest share in December 2012, and became majority shareholder in ...",
    "published": "October 31, 2025"
  }
]