[
  {
    "title": "List of prime ministers of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Spain",
    "snippet": "Since the reign of Philip V, prime ... such as <strong>First Secretary of State (until 1834), President of the Council of Ministers (1834–1868; 1874–1923; 1925–1939), President of the Executive Power (1874) or President of the Government (1973–present),</strong> among ...",
    "published": "6 days ago"
  },
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "Since then, Sánchez has led three governments, the most—along with Adolfo Suárez—just behind fellow socialist Felipe González, prime minister from <strong>1982 to 1996</strong>. King Felipe VI re-appointed Sánchez for the third time on 17 November 2023 after he reached a coalition agreement with Sumar ...",
    "published": "3 weeks ago"
  },
  {
    "title": "List Of Prime Ministers Of Spain",
    "url": "https://www.worldatlas.com/articles/list-of-prime-ministers-of-spain.html",
    "snippet": "Therefore, it is not clear who the first prime minister was. However, below are the officeholders of this position since 1975. Carlos Arias Navaro, born in December 1908, was a vocal and popular politician, especially during the rule of Francisco Franco. Although he was a moderate leader at the beginning of the transition to democracy, Navaro turned into a hard-liner and was involved in the White Terror, signing many death warrants during the dismantling of the Spanish Republic, earning the name “Butcher of Malaga.” Following the assassination of Luis Carrero Blanco, Navara was appointed Prime minister in 1973, a position he retained during the transition to democracy.",
    "published": "December 22, 2020"
  },
  {
    "title": "List of Prime Ministers of Spain (Springtime of Nations)",
    "url": "https://althistory.fandom.com/wiki/List_of_Prime_Ministers_of_Spain_(Springtime_of_Nations)",
    "snippet": "JavaScript is disabled in your browser · Please enable JavaScript to proceed · A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser",
    "published": null
  },
  {
    "title": "List of prime ministers of Spain facts for kids",
    "url": "https://kids.kiddle.co/List_of_prime_ministers_of_Spain",
    "snippet": "After Franco&#x27;s rule, Spain became a democracy again with a king and a prime minister. ... This timeline shows when each Prime Minister served, and which political party they belonged to.",
    "published": null
  }
]