[
  {
    "title": "Situation Sudan situation",
    "url": "https://data.unhcr.org/en/situations/sudansituation",
    "snippet": "South Sudan: Surge in Arrivals to South Sudan - Operational Presence in Renk (30 December 2024) Publish date: 31 December 2024 (11 months ago) Create date: 31 December 2024 (11 months ago) ... South Sudan: Renk TC Intention Report - July 2025 Publish date: 21 July 2025 (4 months ago) Create date: 21 July 2025 (4 months ago) ... Impact on the conflict in Sudan on onward and mixed movement Publish date: 23 May 2024 (1 year ago) Create date: 23 May 2024 (1 year ago) ... This is a weekly update on the new arrivals from Sudan to Libya Publish date: 10 February 2025 (10 months ago) Create date: 10 February 2025 (10 months ago)",
    "published": null
  },
  {
    "title": "Briefing on the situation in Sudan – Amani Africa",
    "url": "https://amaniafrica-et.org/briefing-on-the-situation-in-sudan-16-december-2025/",
    "snippet": "From the communiqué it adopted after the session, the PSC tasked the AU Commission ‘to regularly monitor and report such heinous crimes committed throughout Sudan, in order to put in place preventive measures and reduce the risk of recurrence; develop proposals on how to address them to prevent their further escalation; [and] develop a plan for the protection of civilians, and make recommendations to the PSC within three weeks.’ · PSC went further and directed the Chairperson of the AU Commission to engage with the Members of the PSC Presidential Ad-hoc Committee, under the leadership of Yoweri Kaguta Museveni, President of Uganda, to urgently facilitate the negotiation process between the leaders of the Sudanese Armed Forces (SAF) and the paramilitary Rapid Support Forces (RSF), including the holding of an AU Special Summit on Sudan.",
    "published": null
  },
  {
    "title": "Sudan: Statement by the High Representative on behalf of the European Union - Consilium",
    "url": "https://www.consilium.europa.eu/en/press/press-releases/2025/11/20/sudan-statement-by-the-high-representative-on-behalf-of-the-european-union-20-november-2025/",
    "snippet": "In response to these crimes, <strong>the EU Foreign Affairs Council adopted today restrictive measures against Abdelrahim Hamdan Dagalo</strong>, the second in command of the RSF. The EU stands ready to impose any further restrictive measure where appropriate, ...",
    "published": null
  },
  {
    "title": "World Report 2025: South Sudan | Human Rights Watch",
    "url": "https://www.hrw.org/world-report/2025/country-chapters/south-sudan",
    "snippet": "On September 1, the NSS shutdown the annual general assembly of the South Sudan Doctors Union without providing a reason. On September 3, the NSS gave the union a list of requirements to fulfil including to not discuss, “controversial issues” and to supply a list of all attendees. The Union was allowed to meet in October after meeting the NSS demands. On October 2, Kiir dismissed Akol Kor Kuc as director general of the NSS internal security bureau. Between November 7 and 11, the new leadership released at least 16 detainees including Michael Wetnhialic, a political activist detained since March and Morris Mabior Awikjiok, a South Sudanese critic and former refugee, whom they had continued to hold in violation of the justice minister directives in June and a court order in August to release him.",
    "published": "January 16, 2025"
  },
  {
    "title": "Sudan: Council approves conclusions on the ongoing conflict - Consilium",
    "url": "https://www.consilium.europa.eu/en/press/press-releases/2025/10/20/sudan-council-approves-conclusions-on-the-ongoing-conflict/",
    "snippet": "<strong>The EU rejects any attempt to partition Sudan</strong>. The Council conclusions emphasise that the primary responsibility for ending the conflict lies with the leadership of both the Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF), and ...",
    "published": null
  }
]