[
  {
    "title": "Malaysia’s ex-PM Mahathir quits Pejuang party he founded, picks GTA as new political platform | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/malaysia-ex-pm-mahathir-quits-the-pejuang-party-he-founded-chooses-gta-as-new-political-platform",
    "snippet": "KUALA LUMPUR - Malaysia’s former premier Mahathir Mohamad has quit <strong>Parti Pejuang Tanah Air</strong>, a Malay party he founded just over two years ago, indicating a split in political direction with his son Mukhriz Mahathir, who currently heads the party.",
    "published": "November 22, 2024"
  },
  {
    "title": "Gerakan Tanah Air - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gerakan_Tanah_Air",
    "snippet": "Gerakan Tanah Air (GTA, Homeland Movement or Homeland Party) is an alliance of <strong>Malay political parties</strong>, founded in August 2022 by former Prime Minister of Malaysia Mahathir Mohamad. Mahathir had announced during the coalition&#x27;s founding that GTA will contest in the next Malaysian general election ...",
    "published": "October 16, 2025"
  },
  {
    "title": "Gerakan Tanah Air (GTA) - Dr Mahathir Mohamad",
    "url": "https://malaysia4drm.com/en/gerakantanahair",
    "snippet": "All members of the Malaysian House of Representatives and the State Assembly ( the state legislature ) who support the GTA are members of the <strong>Parti Pejuang Tanah Air ( PEJUANG ).</strong> Tun Dr.",
    "published": null
  },
  {
    "title": "GTA issues PN ultimatum on GE15 alliance | FMT",
    "url": "https://www.freemalaysiatoday.com/category/nation/2022/10/27/gta-issues-pn-ultimatum-on-ge15-alliance",
    "snippet": "GTA is a loose coalition comprising ... parties in GTA are Mahathir’s <strong>Pejuang, Putra, the National Indian Muslim Alliance Party (Iman) and Parti Barisan Jemaah Islamiah Se-Malaysia (Berjasa).</strong>...",
    "published": "October 27, 2022"
  },
  {
    "title": "Gerakan Tanah Air",
    "url": "https://grokipedia.com/page/Gerakan_Tanah_Air",
    "snippet": "Gerakan Tanah Air (GTA) was established ... election.[14][15] The initiative was spearheaded by Mahathir through his <strong>Parti Pejuang Tanah Air (Pejuang),</strong> which formed the core of the alliance alongside smaller Malay-centric parties ...",
    "published": null
  }
]