[
  {
    "title": "Business Council of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Business_Council_of_Australia",
    "snippet": "The board oversees the council&#x27;s secretariat, committees and task forces, makes recommendations about membership and appointments, and proposes policies. ... President: <strong>Geoff Culbert</strong> - Chair of the NSW Fundraising Committee for the Australian Olympic Committee",
    "published": "April 1, 2025"
  },
  {
    "title": "New BCA President starts today - Business Council of Australia",
    "url": "https://www.bca.com.au/new_bca_president_starts_today",
    "snippet": "The Business Council of Australia welcomes incoming BCA President <strong>Geoff Culbert</strong>, who today takes over leadership of the BCA Board from outgoing President Tim Reed. Mr Culbert brings extensive commercial and leadership experience in both domestic ...",
    "published": null
  },
  {
    "title": "Business Council of Australia annual dinner 2025",
    "url": "https://www.afr.com/politics/federal/in-pictures-bca-dinner-2025-20250908-p5mtaw",
    "snippet": "BCA president Geoff Culbert, Western Sydney University chancellor and former BCA CEO Jennifer Westacott, current CEO <strong>Bran Black</strong>, Council of Small Business Organisations Australia chair Matthew Addison.",
    "published": "September 8, 2025"
  },
  {
    "title": "Board - Business Council of Australia - V1",
    "url": "https://www.bca.com.au/board",
    "snippet": "Response to the Productivity Commission&#x27;s Interim Report – Delivering quality care more efficiently 2 October 2025 Read more ... Open letter to Parliament: A strong economy through successful businesses The Big Five Questions: Australia’s priorities Workplace Relations Seize the Moment Disability Inclusion Frontier Economy Advancing Women Australian supplier payment code Strong Australia Network BizRebuild Indigenous Engagement Past Campaigns",
    "published": null
  },
  {
    "title": "Business Council of Australia proposes five critical questions for the next Australian government - AICD",
    "url": "https://www.aicd.com.au/leadership/types/management/business-council-of-australia-proposes-five-critical-questions-for-the-next-australian-government.html",
    "snippet": "Tuesday, 01 April 2025 · Board and organisational culture Strategy and risk · Deborah Tarrant · Journalist · Open Quick Links Content · Current · CEO <strong>Bran Black</strong> and president Geoff Culbert have refined the organisation’s focus to a handful ...",
    "published": null
  }
]