[
  {
    "title": "Official | Metz announce Pierre Dréossi as Sporting Director and Lászlo Bölöni as First Team Coach - Get French Football News",
    "url": "https://www.getfootballnewsfrance.com/2022/official-metz-announce-pierre-dreossi-as-sporting-director-and-laszlo-boloni-as-first-team-coach/",
    "snippet": "The Romanian coach’s record of achievements was further enhanced by a spell at Standard Liège between 2008 and 2010, where <strong>László Bölöni</strong> was crowned Belgian champion in 2009.",
    "published": "June 16, 2022"
  },
  {
    "title": "FC Metz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FC_Metz",
    "snippet": "At the end of the 2011–12 season, ... with Tours at home on 20 May 2012, in very tense circumstances. Metz spent only one season at this level, rebuilding a team with iconic former player <strong>Albert Cartier</strong> as coach, winning promotion to Ligue 2, and then immediately finishing first ...",
    "published": "November 17, 2025"
  },
  {
    "title": "FC Metz - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/fc-metz/mitarbeiterhistorie/verein/347",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  },
  {
    "title": "FC Metz » Manager history",
    "url": "https://www.worldfootball.net/teams/fc-metz/9/",
    "snippet": "French champions Lille staggered to a toothless 0-0 draw at home to lowly Metz on Friday ahead of their midweek Champions League clash at Chelsea.... more » ... <strong>Claude Puel</strong> became the first Ligue 1 coach to be dismissed this season after bottom ...",
    "published": null
  },
  {
    "title": "FC Metz - Staff | Transfermarkt",
    "url": "https://www.transfermarkt.us/fc-metz/mitarbeiter/verein/347",
    "snippet": "Trainer, Manager und Co.: Diese Statistik listet alle Mitarbeiter, gegliedert nach ihrer Funktion, von dem Verein FC Metz auf, die aktuell für den Verein arbeiten.",
    "published": null
  }
]