[
  {
    "title": "r/fivethirtyeight on Reddit: Future of the subreddit after 538’s disbandment",
    "url": "https://www.reddit.com/r/fivethirtyeight/comments/1j3v5li/future_of_the_subreddit_after_538s_disbandment/",
    "snippet": "434 votes, 129 comments. Howdy kits, In case you have not heard, Disney is officially shuttering 538, which is the namesake of this subreddit. Its…",
    "published": "March 5, 2025"
  },
  {
    "title": "The New York Times picks up the shuttered FiveThirtyEight’s poll tracking work | Nieman Journalism Lab",
    "url": "https://www.niemanlab.org/2025/03/the-new-york-times-picks-up-the-shuttered-fivethirtyeights-poll-tracking-database/",
    "snippet": "Luckily, the data will live on: The New York Times is picking up where FiveThirtyEight left off and has “begun a new effort to track public opinion surveys, starting by collecting all polls on President Trump’s job approval…building on the work of the politics website 538,” William P.",
    "published": null
  },
  {
    "title": "Daring Fireball: ABC Shuts Down FiveThirtyEight, and Pulls the Plug on Its Website",
    "url": "https://daringfireball.net/2025/03/abc_shuts_down_fivethirtyeight",
    "snippet": "Oliver Darcy, reporting at Status (paywalled, alas), on the sudden demise of FiveThirtyEight: On Wednesday morning, shortly after sending an all-staff memo announcing layoffs at ABC News, network president Almin Karamehmedovic joined a virtual meeting with the FiveThirtyEight team.",
    "published": null
  },
  {
    "title": "Politics News | Breaking Political News, Video & Analysis-ABC News ...",
    "url": "http://fivethirtyeight.com/",
    "snippet": "With neither chamber agreeing on an extension, <strong>enhanced tax credits are widely expected to expire after 2025</strong>.",
    "published": null
  },
  {
    "title": "Polling website FiveThirtyEight closes | News | Research live",
    "url": "https://www.research-live.com/article/news/polling-website-fivethirtyeight-closes/id/5136753",
    "snippet": "US – American political polling news website FiveThirtyEight ( 538 ) has <strong>closed down</strong>, with owner The Walt Disney Company rolling it into ABC News. Disney closed 538 and laid off around 15 employees as part of wider cuts, The Wall Street Journal ...",
    "published": null
  }
]