[
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "Earlier, Nehru had served as prime minister of the Interim Government of India during the British Raj from 2 September 1946 until 14 August 1947, his party, the Indian National Congress having won the 1946 Indian provincial elections. Nehru was succeeded by Lal Bahadur Shastri, whose 1 year 7-month term ended in his death in Tashkent, then in the USSR, where he had signed the Tashkent Declaration between India and Pakistan.",
    "published": "1 day ago"
  },
  {
    "title": "List of Prime Ministers of India | Britannica",
    "url": "https://www.britannica.com/topic/list-of-prime-ministers-of-India-1832692",
    "snippet": "India’s head of state is the president, whose powers are largely nominal and ceremonial. Effective executive power rests with the Council of Ministers, headed by the prime minister, who is chosen by the majority party or coalition in the Lok Sabha (lower house of parliament) and is formally appointed by the president. This is a chronologically ordered list of the prime ministers, from the earliest to the most recent.",
    "published": "March 13, 2012"
  },
  {
    "title": "List of all Prime Ministers of India (1947-2025) | India PM List",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1",
    "snippet": "List of all Prime Ministers of India till 2025: <strong>Narendra Modi</strong> is the current and 14th Prime Minister of India who assumed office on 10 June 2024. Jawaharlal Nehru is the first and the longest-serving Prime Minister of India while Indira Gandhi ...",
    "published": "August 22, 2025"
  },
  {
    "title": "PM Sangrahlaya - a Tribute to India's Prime Ministers",
    "url": "https://www.pmsangrahalaya.gov.in/prime-ministers-of-india",
    "snippet": "The Pradhanmantri Sangrahalaya in New Delhi is a tribute by our nation to the Prime Ministers who rebuilt India after Independence",
    "published": null
  },
  {
    "title": "Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/",
    "snippet": "BBBP addresses the declining Child Sex Ratio (CSR) and related issues of women empowerment over a life-cycle continuum. It is a tri-ministerial effort of Ministries of Women and Child Development, Health &amp; Family ... View More · Dynamic, dedicated and determined, <strong>Narendra Modi</strong> arrives as a ...",
    "published": "6 hours ago"
  }
]