[
  {
    "title": "2025 Chilean general election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Chilean_general_election",
    "snippet": "Voters went to the polls to elect the 38th President of Chile, renew all 155 seats in the Chamber of Deputies, and fill 23 of the 50 seats in the Senate. Republican Party candidate <strong>José Antonio Kast</strong> defeated Communist Party member Jeannette Jara in a runoff election on 14 December...",
    "published": "3 hours ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "The US secretary of state, Marco Rubio, on Sunday congratulated Kast, whose victory has added another right wing leader more closely aligned with Donald Trump in Latin America. Under Kast’s leadership, “we are confident Chile will advance shared priorities to include strengthening public security, ending illegal immigration, and revitalising our commercial relationship,” Rubio said in a statement.",
    "published": "13 hours ago"
  },
  {
    "title": "Chile’s new far-right head is latest Latin American leader to ride hardline wave to power | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-chile-election-analysis",
    "snippet": "<strong>Jose Antonio Kast</strong> greets a supporter after winning Chile’s presidential election in Santiago on 14 December 2025. Photograph: Reinaldo Ubilla/NurPhoto/Shutterstock ... From the US to Hungary to Argentina, rightwing leaders are praising José ...",
    "published": "1 day ago"
  },
  {
    "title": "Congratulations to Chile's President-Elect Kast - United States Department of State",
    "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/12/congratulations-to-chiles-president-elect-kast",
    "snippet": "HomeOffice of the SpokespersonPress Releases…Congratulations to Chile’s President-Elect Kast · hide · Press Statement · <strong>Marco Rubio</strong>, Secretary of State · December 14, 2025 · The United States congratulates President-Elect José Antonio ...",
    "published": "1 day ago"
  },
  {
    "title": "MAKE CHILE GREAT AGAIN! Pro-Trump Conservative Jose Antonio Kast Wins Chile’s Presidential Election (VIDEO) | The Gateway Pundit | by Ben Kew",
    "url": "https://www.thegatewaypundit.com/2025/12/make-chile-great-again-pro-trump-conservative-jose/",
    "snippet": "Pro-life, pro-family Catholic politician <strong>José Antonio Kast</strong>, a father of nine, has won Chile’s presidential election, defeating his communist rival. pic.twitter.com/ADiYQYn2Te · — Sachin Jose (@Sachinettiyil) December 14, 2025 · Kast was ...",
    "published": "2 days ago"
  }
]