[
  {
    "title": "List of presidents of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Portugal",
    "snippet": "Not shown are Manuel de Arriaga (born in Horta, Azores, Portugal), Teófilo Braga (born in Ponta Delgada, Azores, Portugal), and Bernardino Machado (born in Rio de Janeiro, Brazil). ... ^ Teófilo Braga served as President of the Provisional Government, the de facto head of government and head of state, from the republican revolution of 1910 to the election of Manuel de Arriaga, the 1st President of Portugal.",
    "published": "2 weeks ago"
  },
  {
    "title": "List of heads of state of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Portugal",
    "snippet": "^ Teófilo Braga served as President of the Provisional Government, the de facto head of government and head of state, from the republican revolution of 1910 to the election of Manuel de Arriaga, the 1st President of Portugal.",
    "published": "2 weeks ago"
  },
  {
    "title": "List of presidents of Portugal facts for kids",
    "url": "https://kids.kiddle.co/List_of_presidents_of_Portugal",
    "snippet": "For Portuguese heads of state prior to 1910, see list of Portuguese monarchs. Top left: Teofilo Braga was the first leader of the Republic. Top right: Óscar Carmona served the longest as president.",
    "published": null
  },
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "However, since the Assembly of the Republic has the sole power to dismiss the prime minister&#x27;s government, the prime minister named by the president must have the confidence of a majority of representatives in the assembly, otherwise the prime minister may face a motion of no confidence. The president has the discretionary power to dissolve parliament when he/she sees fit (colloquially known as the &quot;atomic bomb&quot; in Portugal), and President Jorge Sampaio made use of this prerogative in late 2004 to remove the controversial government of Pedro Santana Lopes, despite the absolute majority of deputies supporting the government.",
    "published": "1 week ago"
  },
  {
    "title": "About: List of presidents of Portugal",
    "url": "https://dbpedia.org/page/List_of_presidents_of_Portugal",
    "snippet": "Also Sidónio Pais, Mendes Cabeçadas, Gomes da Costa, as well as Canto e Castro and Óscar Carmona in their early months, were not sworn into office as presidents of the Republic, usually being prime ministers, but de facto accumulated this function, thus combining in practice head of state and head of government in one person.",
    "published": null
  }
]