[
  {
    "title": "2025 Greek presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Greek_presidential_election",
    "snippet": "A third round of voting was held on 6 February 2025, where no candidate reached the reduced required majority of 180. The fourth round was held on 12 February 2025, where <strong>Konstantinos Tasoulas</strong> was elected as President of Greece.",
    "published": "September 8, 2025"
  },
  {
    "title": "Presidential Election 2025 Greece",
    "url": "https://www.robert-schuman.eu/en/monitor/6474-konstantinos-tasoulas-is-elected-president-of-greece",
    "snippet": "<strong>Konstantinos Tasoulas</strong> (New Democracy, ND) won the Greek presidential election in the 4th round of voting on 12 February with 160 votes. He beat Tassos Giannitsis (Panhellenic Socialist Movement-Movement for Change, PASOK-KINAL) who obtained 34 votes.",
    "published": null
  },
  {
    "title": "A veteran conservative lawmaker is sworn in as Greece’s new president | AP News",
    "url": "https://apnews.com/article/greece-president-politics-tassoulas-db1f4771e16254a234a713908c01f5b7",
    "snippet": "Greece’s new President <strong>Constantine Tassoulas</strong>, right, takes an oath next to Archbishop of Athens and All Greece Ieronimos during the swearing in ceremony at the Parliament, in Athens, Greece, Thursday, March 13, 2025.",
    "published": "March 13, 2025"
  },
  {
    "title": "Greece elects former parliament speaker as new president | Reuters",
    "url": "https://www.reuters.com/world/europe/greece-elects-former-parliament-speaker-new-president-2025-02-12/",
    "snippet": "[1/4]Greek prime minister <strong>Kyriakos Mitsotakis</strong> and his party&#x27;s lawmakers applaud after the conclusive vote for the Greek president, at the Greek parliament in Athens, Greece, February 12, 2025.",
    "published": "February 12, 2025"
  },
  {
    "title": "Konstantinos Tasoulas sworn in as Greece’s new president | eKathimerini.com",
    "url": "https://www.ekathimerini.com/politics/1263974/konstantinos-tasoulas-sworn-in-as-greeces-new-president/",
    "snippet": "Newsroom March 13, 2025 13.03.2025 • 12:05 · Former Parliament speaker <strong>Konstantinos Tasoulas</strong> became the ninth president of the Hellenic Republic since the fall of the 1967-1974 dictatorship and the abolition of the monarchy, on Thursday.",
    "published": "March 13, 2025"
  }
]