[
  {
    "title": "Princeton University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Princeton_University",
    "snippet": "Princeton University is a private Ivy League research university in Princeton, New Jersey, United States. Founded in <strong>1746</strong> in Elizabeth as the College of New Jersey, Princeton is the fourth-oldest institution of higher education in the United States and one of the nine colonial colleges chartered ...",
    "published": "September 10, 2001"
  },
  {
    "title": "The Early Years | Princetoniana - Princeton University",
    "url": "https://princetoniana.princeton.edu/history/early-years",
    "snippet": "Courtesy of Princeton University Archives The founding of Princeton, originally the College of New Jersey, followed the Great Awakening, the series of religious revivals that swept the English colonies in America in the 18th century. On <strong>October 22, 1746</strong>, which is celebrated as the day of ...",
    "published": null
  },
  {
    "title": "History | Princeton University",
    "url": "https://www.princeton.edu/meet-princeton/history",
    "snippet": "Program of Annual Giving established; undergraduate radio station (then WPRU, now WPRB) founded · Albert Einstein becomes a life member of the Institute for Advanced Study, with an office on the Princeton University campus",
    "published": null
  },
  {
    "title": "Princeton & Slavery | Princeton’s Founding Trustees",
    "url": "https://slavery.princeton.edu/stories/founding-trustees",
    "snippet": "In short order, the ministers convinced ... II chartered the College of New Jersey (now Princeton University) as British North America’s fourth college in <strong>October 1746</strong>....",
    "published": null
  },
  {
    "title": "History of Princeton University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Princeton_University",
    "snippet": "Princeton University was founded in Elizabeth, New Jersey, in <strong>1746</strong> as the College of New Jersey, shortly before moving into the newly built Nassau Hall in Princeton. In 1783, for about four months Nassau Hall hosted the United States Congress, and many of the students went on to become leaders ...",
    "published": "September 15, 2024"
  }
]