[
  {
    "title": "Inside Google's Leadership: Key Executives",
    "url": "https://websets.exa.ai/websets/directory/google-executives",
    "snippet": "His professional journey began as a materials engineer, followed by experience at McKinsey &amp; Co. before joining Google in 2004, where he quickly rose through the ranks by leading pivotal projects and product developments. <strong>Sundar Pichai</strong>’s vision and leadership set the direction for Google’s ...",
    "published": null
  },
  {
    "title": "Outline of Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Outline_of_Google",
    "snippet": ".google · CEO: <strong>Sundar Pichai</strong> · Co-founder: Larry Page · Co-founder: Sergey Brin · Parent company: Alphabet Inc. History of Google · Criticism of Google · Censorship by Google · List of mergers and acquisitions by Google · Google.org · Google platform ·",
    "published": "October 22, 2025"
  },
  {
    "title": "10 Google Executives & Org Chart | Clay",
    "url": "https://www.clay.com/dossier/google-executives",
    "snippet": "<strong>Pichai joined Google in 2004, where he initially led product management and innovation efforts</strong>. By 2015, he had risen to the role of CEO, bringing a wealth of experience from his academic background at Stanford University and the Indian Institute of Technology, Kharagpur.",
    "published": null
  },
  {
    "title": "13 Executives Running Google and Alphabet’s Other Moonshot Projects | Observer",
    "url": "https://observer.com/2024/10/top-executives-running-alphabet-google/",
    "snippet": "While Google has largely stayed true to its roots in search and innovation, it has also been forced to weather antitrust challenges and reposition itself amid industry advances like the A.I. revolution. Page and Brin stepped away from their respective leadership roles of CEO and president in 2019, leaving their conglomerate in the hands of a trove of executives overseeing its various divisions.",
    "published": "October 29, 2024"
  },
  {
    "title": "What Leadership Style Does Google Use: A Data-Driven Approach",
    "url": "https://quarterdeck.co.uk/articles/what-leadership-style-does-google-use",
    "snippet": "Discover Google&#x27;s unique leadership philosophy through Project Oxygen research, exploring how distributed leadership and servant management drive innovation and employee engagement. ... Picture this: a company so confident in its flat hierarchy that it once attempted to eliminate managers entirely. The experiment failed spectacularly. Yet from this failure emerged one of the most sophisticated leadership frameworks in corporate history—Google&#x27;s revolutionary approach to management that has redefined how technology companies operate.",
    "published": "May 27, 2025"
  }
]