[
  {
    "title": "Televerket (Sweden) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Televerket_(Sweden)",
    "snippet": "<strong>Televerket was a Swedish State authority acting as a state-owned corporation (public enterprise), responsible for telecommunications in Sweden from 1853 until 1993</strong>. Originally it was named Kongl. Elektriska Telegraf-Werket (literally: Royal Electric Telegraph Agency), which was founded in 1853.",
    "published": "June 4, 2025"
  },
  {
    "title": "Televerket – ett monopols uppgång och fall",
    "url": "https://arbetet.se/2021/04/01/televerket-ett-monopols-uppgang-och-fall/",
    "snippet": "Efter 110 år gick det inte längre att försvara Televerkets monopol. Synen på statens roll hade förändrats och 1993 blev året då telemarknaden öppnades för konkurrens. – Liberalismen hade segrat, säger professor Pontus Braunerhjelm.",
    "published": "April 1, 2021"
  },
  {
    "title": "About: Televerket (Sweden)",
    "url": "https://dbpedia.org/page/Televerket_(Sweden)",
    "snippet": "<strong>Televerket was a Swedish State authority acting as a state-owned corporation (public enterprise), responsible for telecommunications in Sweden from 1853 until 1993</strong>. Originally it was named Kongl.",
    "published": null
  },
  {
    "title": "Televerket - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q52918",
    "snippet": "Swedish State authority acting as a state-owned corporation (public enterprise), <strong>responsible for telecommunications in Sweden 1853–1993</strong>",
    "published": null
  },
  {
    "title": "February 20 in Swedish History - Nordstjernan",
    "url": "https://nordstjernan.com/news/sweden/5206/",
    "snippet": "The Swedish end was Kongl. Telegrafverket (<strong>founded in 1853</strong> as Konglige Elektriska Telegraf-Werket - literally: Royal Electric Telegraph Agency), later changed to Kungl. Telegrafverket in 1903. The Kungliga (Royal) was dropped in 1946 and the name was further modernized to Televerket in 1953.",
    "published": null
  }
]