[
  {
    "title": "Stellantis Leadership Team - Company | Stellantis",
    "url": "https://www.stellantis.com/en/company/governance/stellantis-leadership-team",
    "snippet": "Scott Thiele is responsible for Supply Chain and a member of the Stellantis Leadership Team. Prior to June 2025, he served as Senior Vice President, North America Commercial Performance, Cost, and Supply Chain.",
    "published": null
  },
  {
    "title": "Antonio Filosa Announces New Stellantis Leadership Team on First Day as CEO | Stellantis",
    "url": "https://www.stellantis.com/en/news/press-releases/2025/june/antonio-filosa-announces-new-stellantis-leadership-team",
    "snippet": "AMSTERDAM – Antonio Filosa today takes up the role as Chief Executive Officer of Stellantis N.V. and announces his new Stellantis Leadership Team, effective immediately, drawing on the deep bench of industry expertise from Stellantis’ teams around the world.",
    "published": null
  },
  {
    "title": "Stellantis Makes New Appointments to the Leadership Team As It Pursues Its Path to Recovery | Stellantis",
    "url": "https://www.stellantis.com/en/news/press-releases/2025/october/stellantis-makes-new-appointments-to-the-leadership-team-as-it-pursues-its-path-to-recovery",
    "snippet": "October 8, 2025 · AMSTERDAM – Building on the positive momentum established in recent months and ahead of the upcoming 2026 presentation of its updated strategy, Stellantis N.V. today announces the following new appointments to its Stellantis Leadership Team (SLT).",
    "published": null
  },
  {
    "title": "Stellantis Media - Antonio Filosa Announces New Stellantis Leadership Team on First Day as CEO",
    "url": "https://media.stellantisnorthamerica.com/newsrelease.do?id=26877&mid=",
    "snippet": "June 23, 2025 , Amsterdam - <strong>Antonio Filosa</strong> today takes up the role as CEO of Stellantis N.V. and announces his new Stellantis leadership team, effective immediately, drawing on the deep bench of industry expertise from Stellantis’ teams around ...",
    "published": null
  },
  {
    "title": "Stellantis Makes New Appointments to the Leadership Team As It Pursues Its Path to Recovery | Corporate Communications | Stellantis Media",
    "url": "https://www.media.stellantis.com/me-en/corporate-communications/press/stellantis-makes-new-appointments-to-the-leadership-team-as-it-pursues-its-path-to-recovery",
    "snippet": "AMSTERDAM, October 8, 2025 – Building on the positive momentum established in recent months and ahead of the upcoming 2026 presentation of its updated strategy, Stellantis N.V. today announces the following new appointments to its Stellantis Leadership Team (SLT).",
    "published": "October 8, 2025"
  }
]