[
  {
    "title": "Emre Can Transfers - All Rumours and Latest News - TransferFeed",
    "url": "https://www.transferfeed.com/players/emre-can/1234",
    "snippet": "Because Emre Can enjoys a high standing in the squad a... MORE ... <strong>Galatasaray&#x27;s coach, Okan Buruk, wants to transfer Emre Can, who can play as a defender and midfielder</strong>. The club plans to initiate...",
    "published": null
  },
  {
    "title": "Emre Can prepares his farewell to Borussia Dortmund | Fichajes.net",
    "url": "https://www.fichajes.net/en/news/emre-can-prepares-his-farewell-to-borussia-dortmund-20251207.html",
    "snippet": "🚨🆕 #Exclusive 🇹🇷 #BorussiaDortmund <strong>Fenerbahçe, Beşiktaş and Galatasaray are all targeting Emre Can, whose contract with Borussia Dortmund expires at the end of the season</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Turkish clubs show interest to sign Emre Can, but Dortmund want to extend player – reports - Football | Tribuna.com",
    "url": "https://tribuna.com/en/news/2025-12-08-turkish-clubs-show-interest-to-sign-emre-can-but-dortmund-want-to-extend-player-reports/",
    "snippet": "8 December 2025, 10:33 · Emre ... until the summer of 2026. <strong>A trio from Turkey apparently want to try to sign the captain of the Black and Yellows during the upcoming winter transfer window</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "Besiktas, Fenerbahce, Galatasaray to race for Dortmund's Emre Can: Report - Türkiye Today",
    "url": "https://www.turkiyetoday.com/sports/besiktas-fenerbahce-galatasaray-to-race-for-dortmunds-emre-can-report-3211118",
    "snippet": "German international midfielder ... to local media reports. <strong>The Istanbul-based teams are said to be considering a move for the 31-year-old during the upcoming January transfer window</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "Regarding the incident, Can told the German newspaper daily Bild: &quot;I am an absolute pacifist and against all forms of war,&quot; also stating that he unintentionally liked the post while scrolling through his timeline. In January 2023, Can revealed that he had thyroid cancer that was diagnosed during his medical tests prior to joining Juventus, which required surgery in October 2018. As of match played 10 December 2025 ·",
    "published": "5 days ago"
  }
]