[
  {
    "title": "Anke Domscheit-Berg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anke_Domscheit-Berg",
    "snippet": "Anke Domscheit-Berg (née Domscheit; born 17 February 1968 in Premnitz) is a <strong>German politician and activist</strong>. She was a member of the Bundestag from 2017 to 2025. In 2017, she was elected on the party list of The Left, without being a party member. She joined the party in 2021 following her ...",
    "published": "August 13, 2025"
  },
  {
    "title": "Anke Domscheit-Berg - Aktivistin, Publizistin, Mitglied des Deutschen Bundestages",
    "url": "https://mdb.anke.domscheit-berg.de/",
    "snippet": "Diese und noch viele Themen mehr besprechen unter anderem Digitalpolitikerin Anke Domscheit-Berg, die Präsidentin des Goethe-Instituts Gesche Joost, Vertreter*innen von PEN Deutschland, Wikimedia, Microsoft, dem Chaos Computer Club sowie vom &quot;Der KI-Podcast&quot; der ARD und des Podcasts &quot;KI verstehen&quot; von Deutschlandfunk.Zur Quelle",
    "published": "March 24, 2025"
  },
  {
    "title": "Anke Domscheit-Berg - Munzinger Biographie",
    "url": "https://www.munzinger.de/register/portrait/biographien/Anke+Domscheit+Berg/00/29287",
    "snippet": "Domscheit, wurde am 17. Febr. 1968 in Premnitz (damals DDR) als <strong>Tochter eines Landarztes und einer Kunsthistorikerin geboren</strong>. Ihre Mutter war im Zweiten Weltkrieg aus Bessarabien (heute Ukraine bzw. Moldau) geflohen, ihr Vater kam aus Königsberg/Ostpreußen (heute Russland).",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg - IMDb",
    "url": "https://www.imdb.com/name/nm4869132/",
    "snippet": "Anke Domscheit-Berg. Self: Frauen in Landschaften. Anke Domscheit-Berg was <strong>born in 1968 in Premnitz, German Democratic Republic [now Brandenburg, Germany].</strong>",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm4869132/bio/",
    "snippet": "Anke Domscheit-Berg. Self: Frauen in Landschaften. Anke Domscheit-Berg was <strong>born in 1968 in Premnitz, German Democratic Republic [now Brandenburg, Germany].</strong>",
    "published": null
  }
]