[
  {
    "title": "WARNER BROS. DISCOVERY BOLSTERS LIVE WINTER SPORTS OFFER IN EUROPE WITH EXTENDED LUGE COVERAGE | Welcome to WBD Sports",
    "url": "https://media.wbdsports.com/post/warner-bros-discovery-bolsters-live-winter-sports-offer-in-europ",
    "snippet": "Discovery (WBD) Sports Europe has <strong>agreed a new partnership with the International Luge Federation (FIL)</strong> that will bring the world’s greatest luge events to millions of fans across Europe during the 2025-2026 season.",
    "published": null
  },
  {
    "title": "WARNER BROS. DISCOVERY SEALS 2025 WORLD ATHLETICS CHAMPIONSHIPS RIGHTS | Welcome to WBD Sports",
    "url": "https://media.wbdsports.com/post/warner-bros-discovery-seals-2025-world-athletics-championships-r",
    "snippet": "Discovery (WBD) <strong>extends its partnership with the European Broadcasting Union (EBU) by bringing the 2025 World Athletics Championships to millions of viewers</strong> • Eurosport, TNT Sports, HBO Max and discovery+ will show coverage in 45 markets in ...",
    "published": null
  },
  {
    "title": "Welcome to WBD Sports",
    "url": "https://media.wbdsports.com/",
    "snippet": "TNT Sports announces the sleep ... the 2025/26 season. The deal was brokered by Sky Media, TNT Sports’ advertising sales partner in the UK and Ireland. Read more ... HBO Max and discovery+* will provide streaming coverage of every major luge event this season Partnership between Warner Bros. Discovery (WBD) Sports Europe and the International Luge Federation (FIL) includes linear coverage on Eurosport (Europe) and ...",
    "published": null
  },
  {
    "title": "MXGP Secures Long-Term Coverage Extension on Eurosport And TNT Sports",
    "url": "https://superbike-news.co.uk/mxgp-secures-long-term-coverage-extension-on-eurosport-and-tnt-sports/",
    "snippet": "MONACO (Principality of Monaco) 4 December 2025 – <strong>Infront Moto Racing is delighted to announce the renewal of its long-term partnership with Warner Bros.</strong> Discovery (WBD) Sports Europe to guarantee live coverage of the FIM Motocross World ...",
    "published": "2 weeks ago"
  },
  {
    "title": "WARNER BROS. DISCOVERY BECOMES THE HOME OF THE SNOW LEAGUE IN EUROPE | Welcome to WBD Sports",
    "url": "https://media.wbdsports.com/post/warner-bros-discovery-becomes-the-home-of-the-snow-league-in-eur",
    "snippet": "<strong>Freeskiing will be introduced at the league&#x27;s second event in China on 4 - 6 December 2025</strong> and will be featured in all subsequent events. ... Trojan Paillot, SVP Sports Rights Acquisitions and Syndications at Warner Bros.",
    "published": null
  }
]