[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "On 5 July 2015, Kasyanov was elected ... re-establish the institution of co-chairmanship, adding, &quot;<strong>Neither Alexei Navalny nor Mikhail Khodorkovsky will enter our party today and be elected as co-chairmen</strong>....",
    "published": "1 day ago"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "During the founding congress of 15 December 2012, Navalny said: &quot;People&#x27;s Alliance is my party, but I don&#x27;t think that right now People&#x27;s Alliance needs another member who spends his time torn between the Investigative Committee and some court hearing involving Rosneft. Yet it is my party; it represents my interests&quot;. On 30 April 2013, the Ministry of Justice of Russia suspended the registration of the party and then denied its registration on 5 June 2013.",
    "published": "September 30, 2025"
  },
  {
    "title": "Russia’s ‘Last Liberal Party’ Cuts Ties With Navalny Supporters - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/10/18/russias-last-liberal-party-cuts-ties-with-navalny-supporters-a75327",
    "snippet": "Russian liberal party Yabloko announced Monday it will cut ties with members who had backed jailed Kremlin critic Alexei Navalny’s anti-Kremlin voting initiative, a move that underlines bitter divisions in the country’s fragmented opposition.",
    "published": "September 10, 2025"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "In 2012, some of Navalny’s associates such as Vladimir Ashurkov, would found “The People’s Alliance,” a centrist political party. Navalny would be invited to join, but was hesitant to do so, believing his membership would make things complicated for the party, as past legal cases from before his life in politics continued to haunt him.",
    "published": null
  },
  {
    "title": "Kremlin Foe Navalny Launches New Political Party",
    "url": "https://www.rferl.org/a/russia-navalny-new-political-party/29237240.html",
    "snippet": "Russian opposition leader Aleksei Navalny has launched a new political party, though he missed its founding due to a jail sentence over nationwide protests he organized against President Vladimir Putin.",
    "published": "May 19, 2018"
  }
]