[
  {
    "title": "Can a New Chancellor Fix Germany? | Carnegie Endowment for International Peace",
    "url": "https://carnegieendowment.org/europe/strategic-europe/2025/01/can-a-new-chancellor-fix-germany?lang=en",
    "snippet": "If the polls prove right, <strong>Friedrich Merz</strong>, leader of the opposition conservative Christian Democratic Union (CDU) will succeed Olaf Scholz.",
    "published": null
  },
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "Scholz left office in October 2001, after the defeat of his party at the 2001 Hamburg state election and the election of Ole von Beust as First Mayor. His successor was <strong>Ronald Schill</strong>, who had won on a Law and order platform, with an emphasis on harsh penalties for drug dealers.",
    "published": "1 week ago"
  },
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "Germany would pay approximately €71 billion in interest annually from 2035. During negotiations for the next German cabinet, Merz and outgoing Chancellor Olaf Scholz reached an agreement to reform the debt brake by amending Paragraphs 109, 115 and 143h of the Basic Law to exempt defence spending exceeding 1% of GDP.",
    "published": "2 days ago"
  },
  {
    "title": "Chancellor Olaf Scholz? Change Without Disruption | Institut Montaigne",
    "url": "https://www.institutmontaigne.org/en/expressions/chancellor-olaf-scholz-change-without-disruption",
    "snippet": "As the embodiment of the SPD’s more moderate wing, Olaf Scholz has been viewed as the natural successor to the outgoing Chancellor. So much so that he used the signature Merkel-Raute, the trademark hand gesture known as the Merkel Diamond, on the cover of the Süddeutsche Zeitung.",
    "published": null
  },
  {
    "title": "Germany's Olaf Scholz takes over from Merkel as chancellor",
    "url": "https://www.bbc.com/news/world-europe-59575773",
    "snippet": "Olaf Scholz has been been sworn in as Germany&#x27;s new chancellor, formally taking power after Angela Merkel&#x27;s historic 16 years as leader.",
    "published": "December 8, 2021"
  }
]