[
  {
    "title": "Rodney Petersen Announces Retirement After Decades of Cybersecurity Education and Workforce Leadership | NIST",
    "url": "https://www.nist.gov/news-events/news/2025/12/rodney-petersen-announces-retirement-after-decades-cybersecurity-education",
    "snippet": "https://www.nist.gov/news-events/news/2025/12/rodney-petersen-announces-retirement-after-decades-cybersecurity-education · Menu · UPDATES · December 2, 2025 · Facebook · Linkedin · X.com · Email · <strong>Rodney J. Petersen</strong>, Director of Education ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Examining NIST’s Priorities for 2025 and Beyond | NIST",
    "url": "https://www.nist.gov/speech-testimony/examining-nists-priorities-2025-and-beyond",
    "snippet": "As a leader in quantum research, NIST continues to support the U.S. quantum industry by engaging in strategic collaborations, as well as identifying and conducting R&amp;D to increase U.S. leadership in this global endeavor. As other countries are rapidly investing in quantum technologies, NIST is requesting funding so that we can build and sustain the U.S. quantum economy as the best in the world for decades to come. The FY 2025 budget request includes an increase of $13.9 million above the FY 2024 enacted level for new efforts to advance quantum information science and technology readiness and build upon our global leadership role.",
    "published": "October 10, 2024"
  },
  {
    "title": "FY 2025: Presidential Budget Request Summary | NIST",
    "url": "https://www.nist.gov/congressional-and-legislative-affairs/nist-appropriations-summary-0",
    "snippet": "The President’s Budget Request for NIST totals $1.5 billion in FY 2025. With the requested funds, NIST will be positioned to lead U.S. science and technology innovation through dedicated investment in NIST measurement science; drive discoveries and standards development in critical and emerging technologies; strengthen U.S.",
    "published": "February 6, 2025"
  },
  {
    "title": "NIST Senior Leadership | NIST",
    "url": "https://www.nist.gov/director/leadership",
    "snippet": "<strong>Craig Burkhardt</strong> was appointed to serve as the Deputy Under Secretary of Commerce for Standards and Technology and NIST Deputy Director in January 2025.",
    "published": "June 2, 2025"
  },
  {
    "title": "NIST University Leadership – Board of Trustees, Governors, Advisors & Key Officials",
    "url": "http://www.nist.edu/about/leadership.php",
    "snippet": "2nd Convocation of NIST University The 2nd Convocation of NIST University, Odisha will be held on Friday, 19th December 2025 at the Indoor Stadium, NIST University, Institute Park, Berhampur. Dr. <strong>Hari Babu Kambhampati</strong>, Hon’ble Governor of Odisha has graciously consented to preside over the ...",
    "published": null
  }
]