[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "In the 2000s, Kaptur sought to steer the Democratic Party towards a greater focus on its working-class base and sought a leadership role by emphasizing her Midwestern &quot;heartland&quot; roots in contrast to the party&#x27;s coastal leadership. In 2002, she challenged Representative Nancy Pelosi for the position of House Democratic leader, using her candidacy to draw attention to what she described as the party&#x27;s neglect of its &quot;non-money wing.&quot; She withdrew before a vote was taken.",
    "published": "1 week ago"
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "Marcy Kaptur, the Representative from Ohio - in Congress from 1983 through Present",
    "published": null
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Incumbent Marcy Kaptur is running in the Democratic primary for U.S. House Ohio District 9 on May 5, 2026. Anthony Campbell, Wayne Kinsel, Derek Merrin, Alea Nadeem, and Josh Williams are running in the Republican primary for U.S. House Ohio District 9 on May 5, 2026. Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here. See also: Ohio&#x27;s 9th Congressional ...",
    "published": null
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "In 1981, while pursuing a doctorate in urban planning and development finance at MIT, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the 1982 recession to stage a nationally-recognized upset.",
    "published": "May 27, 2025"
  },
  {
    "title": "Rep. Marcy Kaptur [D-OH9, 1983-2026], Representative for Ohio's 9th Congressional District - GovTrack.us",
    "url": "https://www.govtrack.us/congress/members/marcy_kaptur/400211",
    "snippet": "Legislative Preview Dec. 15, 2025: Congress&#x27;s Last Week of Work of the Year » ... Kaptur is the representative for Ohio’s 9th congressional district (view map) and is a Democrat. She has served since Jan. 3, 1983. Kaptur is next up for reelection in 2026 and serves until Jan.",
    "published": null
  }
]