[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... nation&#x27;s head of government. The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "Leaders’ statement on Ukraine - Consilium",
    "url": "https://www.consilium.europa.eu/en/press/press-releases/2025/12/15/leaders-statement-on-ukraine/",
    "snippet": "15 December 2025 21:10 · This statement was adopted by President Costa, President von der Leyen, Prime Minister Frederiksen, President Stubb, President Macron, Chancellor Merz, Prime Minister Meloni, Prime Minister Schoof, Prime Minister Støre, Prime Minister Tusk, Prime Minister Kristersson, and Prime Minister Starmer. The Leaders welcomed significant progress on President Trump’s efforts to secure a just and lasting peace in Ukraine.",
    "published": null
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "In his address marking Ukrainian Armed Forces Day, President of Ukraine <strong>Volodymyr Zelenskyy</strong> spoke about Ukrainian warriors honored through murals in Ukraine and around the world. ... The parties covered multiple aspects and went through key ...",
    "published": "1 week ago"
  },
  {
    "title": "Conflict in Ukraine: A timeline (current conflict, 2022 - present) - House of Commons Library",
    "url": "https://commonslibrary.parliament.uk/research-briefings/cbp-9847/",
    "snippet": "Note: On 20 January 2025 the Trump administration took office in the US. All references to the US President and cabinet secretaries, and US government policies, are correct as of the date of each entry. ... Download full report Download ‘Conflict in Ukraine: A timeline (current conflict, 2022 - present)’ report (1 MB , PDF) The leadership ...",
    "published": "1 day ago"
  },
  {
    "title": "Yulia Svyrydenko: Ukraine’s new Prime Minister - The Hindu",
    "url": "https://www.thehindu.com/news/international/yulia-svyrydenko-ukraine-new-prime-minister/article69826906.ece",
    "snippet": "Newly appointed Ukrainian Prime Minister <strong>Yulia Svyrydenko</strong> attends a session of Ukrainian parliament, amid Russia’s attack on Ukraine, in Kyiv, on July 17, 2025.",
    "published": "July 19, 2025"
  }
]