[
  {
    "title": "New Regency Forms Partnership With Shamrock Capital | Media | Shamrock Capital",
    "url": "https://shamrockcap.com/media/new-regency-forms-partnership-with-shamrock-capital/",
    "snippet": "Los Angeles, CA (June 18, 2025) ... partnership with Shamrock Capital, <strong>a Los Angeles-based investment firm specializing in media, entertainment, communications, and related sectors</strong>....",
    "published": null
  },
  {
    "title": "New Regency Partners With Shamrock Capital, Investment Firm Acquires Participation In Studio’s Film & TV Library",
    "url": "https://deadline.com/2025/06/new-regency-shamrock-capital-1236436582/",
    "snippet": "<strong>Multi Oscar winning producer New Regency has entered into a partnership with Los Angeles investment firm Shamrock Capital</strong>, whose Shamrock Content Strategy is taking a participation in the studio’s 35-year-old plus film and television library.",
    "published": "June 18, 2025"
  },
  {
    "title": "New Regency Partners With Shamrock Capital for Film and TV Library",
    "url": "https://www.thewrap.com/shamrock-capital-new-regency-film-tv-library/",
    "snippet": "Shamrock Capital has entered into a long-term partnership with New Regency that will see the Los Angeles-based investment firm’s content strategy division acquire participation in the cash flows of the production company’s film and television library.",
    "published": "June 18, 2025"
  },
  {
    "title": "Sidley Represents Shamrock Capital Investment Firm in Acquiring Participation in New Regency’s Content Library | News | Sidley Austin LLP",
    "url": "https://www.sidley.com/en/newslanding/newsannouncements/2025/06/sidley-represents-shamrock-capital-investment-firm",
    "snippet": "Sidley represented Shamrock Capital, a Los Angeles-based investment firm specializing in media, entertainment, communications, and related sectors, in connection with its strategic investment in acquiring a participation in New Regency, a leading independent entertainment company.",
    "published": "June 20, 2025"
  },
  {
    "title": "Regency Enterprises",
    "url": "https://grokipedia.com/page/Regency_Enterprises",
    "snippet": "In June 2025, New Regency secured a major financial partnership with Shamrock Capital, involving <strong>a library investment in its extensive catalog of over 100 titles and new production and library credit facilities from a syndicate of lenders</strong>, enabling ...",
    "published": null
  }
]