[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The modern Ukrainian presidency was <strong>established on 5 July 1991</strong> by the Verkhovna Rada of the Ukrainian Soviet Socialist Republic, which formed the office of &quot;president of the Ukrainian SSR&quot; (Ukrainian: Президент Української РСР). During the transitional period until the ...",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "Upon the declaration of Ukrainian independence from the Soviet Union on 24 August 1991, the title was changed to &quot;President of Ukraine&quot;. <strong>The first presidential election held on 1 December 1991 was won by Leonid Kravchuk</strong>.",
    "published": "October 25, 2025"
  },
  {
    "title": "Ukraine’s Presidents, Power Elites, and the Country’s Evolution | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/ukraines-presidents-power-elites-and-countrys-evolution",
    "snippet": "His short, economically unsuccessful rule provoked nationwide strikes that lead to early presidential elections and his electoral defeat. Kravchuk’s successor, Leonid Kuchma (1994–2005), was president for 10 years, during which time the contemporary Ukrainian political and economic systems—with their successes and failures—were constructed.",
    "published": null
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "<strong>Volodymyr Zelensky</strong> (born January 25, 1978, Kryvyy Rih, Ukraine, U.S.S.R. [now in Ukraine]) is a Ukrainian actor and comedian who was elected president of Ukraine in 2019. Although he was a political novice, Zelensky’s anti-corruption platform ...",
    "published": "September 27, 2019"
  },
  {
    "title": "List of Presidents of Ukraine (1991 - 2022)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-presidents-of-ukraine-1646021751-1",
    "snippet": "In August 1991, after the proclamation of Ukrainian independence from the Soviet Union, the title was changed to the &quot;President of Ukraine&quot;. On 1 December 1991, the first election of the President of Ukraine took place and was won by <strong>Leonid Kravchuk</strong>.",
    "published": "February 28, 2022"
  }
]