[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She previously played for WSL clubs <strong>Manchester United, Bristol Academy, Birmingham City, Doncaster Belles, and Reading</strong>, and in the Bundesliga with VfL Wolfsburg. Earps has represented England at under-17, under-19, and under-23 levels, and won her first senior cap in 2017.",
    "published": "3 days ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "Before arriving at Manchester United, Earps spent time playing for hometown club <strong>Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg</strong>. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in ...",
    "published": null
  },
  {
    "title": "Who is Mary Earps? Everything you need to know about the England goalkeeper",
    "url": "https://www.fourfourtwo.com/features/mary-earps-everything-you-need-to-know",
    "snippet": "The goalkeeper signed for Reading in 2016 and impressed at the club, who played in the English top-flight at the time. In her first season at Reading she made the PFA Team of the Year. Mary Earps was a part of the <strong>Manchester United</strong> women&#x27;s team ...",
    "published": "October 18, 2024"
  },
  {
    "title": "Mary Earps left Manchester United to become a better player at PSG, England goalkeeper tells Pitch to Pod | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13340388/mary-earps-left-manchester-united-to-become-a-better-player-at-psg-england-goalkeeper-tells-pitch-to-pod",
    "snippet": "England and Paris Saint-Germain goalkeeper Mary Earps has admitted it was a difficult decision to leave <strong>Manchester United</strong> but says she was determined to push herself out of her comfort zone in order to become a better player.",
    "published": "April 4, 2025"
  },
  {
    "title": "Mary Earps on her journey from West Bridgford Colts to starring for England at UEFA Women's EUROs",
    "url": "https://www.englandfootball.com/articles/2022/Jul/25/mary-earps-grassroots-story-20220725",
    "snippet": "England goalkeeper Mary Earps talks about her journey from <strong>West Bridgford Colts to Leicester City, Nottingham Forest, Doncaster Rovers</strong> and beyond.",
    "published": null
  }
]