[
  {
    "title": "Mark Aguiar - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Aguiar",
    "snippet": "He then went on to <strong>graduate study at the Massachusetts Institute of Technology, where he received a PhD in economics in 1999</strong>, writing a thesis titled The Information Content of Asset Prices and Emerging Market Crises under the direction of Ricardo J. Caballero and Daron Acemoglu.",
    "published": "October 23, 2025"
  },
  {
    "title": "Mark Aguiar - Mark Aguiar",
    "url": "https://markaguiar.github.io/bio",
    "snippet": "Professor Aguiar received his Ph.D. in economics from MIT in 1999. He <strong>began his academic career at the University of Chicago&#x27;s Graduate School of Business before moving to the Federal Reserve Bank of Boston in 2004 and then to the University of Rochester in 2006.</strong>",
    "published": null
  },
  {
    "title": "Mark A. Aguiar",
    "url": "https://gceps.princeton.edu/mark-a-aguiar/",
    "snippet": "From 1989-1995, as a US Department ... of Japanese Affairs in Washington, DC. Aguiar <strong>received his BA in history and Chinese from Brown University, and his PhD in economics from MIT</strong>....",
    "published": null
  },
  {
    "title": "Mark Aguiar | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is a <strong>consultant at the Federal Reserve Bank of Minneapolis and the Walker Professor of Economics and International Finance at Princeton University</strong>. Previously, he was a professor of economics at the University of Rochester and a ...",
    "published": null
  },
  {
    "title": "Mark A. Aguiar",
    "url": "https://jrc.princeton.edu/people/mark-aguiar",
    "snippet": "Mark A. Aguiar is the <strong>Walker Professor of Economics and International Finance at Princeton University</strong>. His research focuses on models of consumption and savings with applications in both open- and closed-economy macroeconomics.",
    "published": null
  }
]