[
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "In 2011, EQT sold the company to BC Partners. Com Hem held its initial public offering (IPO) on 17 June 2014 and became listed on Stockholm Stock Exchange. <strong>On 27 April 2017 Kinnevik acquired approximately 18.5% of the stock</strong> and became Com Hem&#x27;s largest stock holder.",
    "published": "June 6, 2025"
  },
  {
    "title": "Com Hem AB - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn",
    "url": "https://tracxn.com/d/companies/com-hem-ab/__C72ILG9J1X0WjTdDonjKDs7MlEgXfBRoW-3D_-KNVmk",
    "snippet": "<strong>Com Hem AB got acquired by Tele2 on Jan 10, 2018 at an acquisition amount of $4.24B</strong>.",
    "published": "November 11, 2025"
  },
  {
    "title": "Com Hem 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10876-33",
    "snippet": "Com Hem’s most recent deal was a Merger/Acquisition with <strong>Boxer TV-Access</strong> for .",
    "published": null
  },
  {
    "title": "BC Partners to acquire Com Hem — BC Partners",
    "url": "https://www.bcpartners.com/news/bc-partners-to-acquire-com-hem/",
    "snippet": "<strong>July 21, 2011</strong> – BC Partners, a leading international private equity firm, today announces that it has signed an agreement to acquire Com Hem, Sweden’s leading TV, broadband and telephony company, from The Carlyle Group (“Carlyle”) and ...",
    "published": "April 28, 2025"
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - The Carlyle Group and Providence Equity Partners today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT. <strong>Financial details were not disclosed</strong>. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  }
]