[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "She received her undergraduate ... Massachusetts Institute of Technology in 1981. Kaptur <strong>began her career in urban planning, working as an urban planner on the Toledo-Lucas County Plan Commissions from 1969 to 1975</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "<strong>After graduating from St. Ursula Academy, she became the first member of her family to attend college, earning a bachelor&#x27;s degree in history from the University of Wisconsin (1968) and later a master&#x27;s degree in urban planning from the University of Michigan</strong>.",
    "published": "May 27, 2025"
  },
  {
    "title": "The Honorable Marcy Kaptur (D-OH) Biography",
    "url": "https://www.congress.gov/115/meeting/house/108368/witnesses/HHRG-115-VR03-Bio-K000009-20180613.pdf",
    "snippet": "Congresswoman Kaptur also is the first Democratic woman ever to serve on the powerful Defense · Subcommittee. There, she is a strong advocate for national security, energy independence and adequate ... She is also a member of the Interior Subcommittee where she fights for clean water programs that protect · our Great Lakes. Earlier in her congressional career, she served on the Appropriations Financial Services",
    "published": null
  },
  {
    "title": "Ohio Democrat Marcy Kaptur is the longest-serving woman in congressional history • Ohio Capital Journal",
    "url": "https://ohiocapitaljournal.com/2024/03/11/ohio-democrat-marcy-kaptur-is-the-longest-serving-woman-in-congressional-history/",
    "snippet": "Kaptur <strong>earned her masters in urban planning from the University of Michigan in 1974 and started to pursue a doctorate in urban planning and development finance at Massachusetts Institute of Technology</strong> — but that’s when her career really ...",
    "published": "March 11, 2024"
  },
  {
    "title": "Marcy Kaptur – Alumni Park",
    "url": "https://www.alumnipark.com/exhibits/featured/marcy-kaptur/",
    "snippet": "When Marcy Kaptur left her home in Toledo to attend the University of Wisconsin, she meant to study history. Over the following decades, she ended up making it. The first member of her family to attend college, she’s now about to become the longest-tenured woman in the history of the U.S.",
    "published": null
  }
]