[
  {
    "title": "Socialist Party of America History and Geography - Mapping American Social Movements Project",
    "url": "https://depts.washington.edu/moves/SP_intro.shtml",
    "snippet": "<strong>Founded in 1901</strong>, the Socialist Party grew rapidly, claiming 113,000 members in 1912, making it, briefly, one of the largest socialist movements in the world. The SP won more than 900,000 votes in elections in 1912 and again in 1920. The movement&#x27;s strength was evident also in the hundreds of ...",
    "published": null
  },
  {
    "title": "Socialist Party (PS) | Britannica",
    "url": "https://www.britannica.com/topic/Socialist-Party-France",
    "snippet": "The Socialist Party <strong>traces its roots to the French Revolution</strong>. Its predecessor parties, formed in the 19th century, drew inspiration from political and social theorists such as Charles Fourier, Henri de Saint-Simon,",
    "published": "July 20, 1998"
  },
  {
    "title": "Socialist Party of America | Beliefs, Platform, U.S. History, Norman ...",
    "url": "https://www.britannica.com/topic/Socialist-Party-political-party",
    "snippet": "Socialist Party of America, U.S. national political party <strong>founded in 1901 from the merger of the Social Democratic Parties of Chicago and Springfield, Massachusetts, and other independent state socialist groups</strong>.",
    "published": "August 20, 2025"
  },
  {
    "title": "Socialist Party (Portugal) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Socialist_Party_(Portugal)",
    "snippet": "It was founded on <strong>19 April 1973</strong> in the German city of Bad Münstereifel by militants who were at the time with the Portuguese Socialist Action (Portuguese: Acção Socialista Portuguesa).",
    "published": "1 week ago"
  },
  {
    "title": "Socialist Party (France) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Socialist_Party_(France)",
    "snippet": "The PS was <strong>founded in 1969 from a merger of the French Section of the Workers&#x27; International (SFIO), the Convention of Republican Institutions led by François Mitterrand, and other groups</strong>.",
    "published": "4 weeks ago"
  }
]