[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Navalny was arrested on 5 December. After a period of uncertainty for his supporters, Navalny appeared in court and was sentenced to a maximum of 15 days &quot;for defying a government official&quot;. Alexei Venediktov, editor-in-chief of Echo of Moscow radio station, called the arrest &quot;a political mistake: jailing Navalny transforms him from an online leader into an offline one&quot;.",
    "published": "2 days ago"
  },
  {
    "title": "Alexei Navalny’s wife and political heir still has ‘big hopes’ for Russia",
    "url": "https://www.politico.eu/article/alexei-navalny-yulia-navalnaya-political-heir-big-hopes-russia/",
    "snippet": "Yulia Navalnaya at the POLITICO 28 gala. | David Baatzsch for POLITICO · December 11, 2025 10:48 pm CET · By Eva Hartog · The exiled widow of Russia’s late opposition leader Alexei Navalny told POLITICO on Thursday that remaining hopeful about her home country is part of her job.",
    "published": "5 days ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "As many of the executives were close political allies of Putin, these encounters provided an effective means of expressing dissent in a society where political dialog was becoming increasingly restricted. Navalny documented his efforts in a blog that became so popular that Russian Pres. Dmitry Medvedev (2008–12)—who took office as part of a power-sharing agreement with a term-limited Putin—was forced to acknowledge the scale of corruption. According to Medvedev himself, a trillion rubles (about $31 billion) was being embezzled annually from the state procurement system. In December 2010 Navalny launched the whistleblowing website RosPil (a Russian abbreviation for “Russian Saw”—saw being slang for “to embezzle,” as in to saw off a piece of a contract).",
    "published": "March 7, 2023"
  },
  {
    "title": "Alexei Navalny, Russia's most outspoken Putin critic - BBC News",
    "url": "https://www.bbc.com/news/world-europe-16057045",
    "snippet": "Anti-corruption campaigner Alexei Navalny was long the most prominent face of Russian opposition to President Vladimir Putin.",
    "published": "February 16, 2024"
  },
  {
    "title": "Alexei Navalny - BBC News",
    "url": "https://www.bbc.com/news/topics/cpzyrklr4l8t",
    "snippet": "For years, Navalny was Vladimir Putin&#x27;s biggest political rival, but now the Russian opposition is weaker than ever. ... The trio were arrested as authorities intensified pressure on the jailed Kremlin critic, who died last February. ... The march was led by Yulia Navalnaya, widow of Russian opposition leader Alexei Navalny, who died in February.",
    "published": null
  }
]