[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "During a cabinet meeting on 22 January 2025, <strong>Prabowo remarked that he is the first president to oversee a budget that is &quot;up to the ninth unit&quot;</strong> and announced that he will cut non-essential spending in his government, from cutting budget for official trips by the ministry to banning ceremonial ...",
    "published": "2 days ago"
  },
  {
    "title": "Prabowo's Key Statements on the Sumatra Disaster - News En.tempo.co",
    "url": "https://en.tempo.co/read/2073752/prabowos-key-statements-on-the-sumatra-disaster",
    "snippet": "TEMPO.CO, Jakarta - Indonesian President Prabowo Subianto held a cabinet meeting at the Presidential Palace in Jakarta on Monday afternoon, December 15, 2025, <strong>addressing the disaster response in Sumatra</strong>.",
    "published": "10 hours ago"
  },
  {
    "title": "Life and Political Career of the Indonesian President, Prabowo Subianto",
    "url": "https://thediplomaticinsight.com/life-political-career-of-indonesian-pres-prabowo/",
    "snippet": "December 9, 2025 · Modified: 4 days ago · Twitter · Facebook · WhatsApp · Linkedin · Email · Print · In a country navigating rapid economic growth alongside social and political challenges, the question arises: can a leader with both discipline and pragmatism guide Indonesia toward stability and progress? The presidency of Prabowo Subianto in October 2024 sparked both anticipation and scrutiny as he assumed leadership of one of southeast Asia’s largest democracies.",
    "published": "1 week ago"
  },
  {
    "title": "Prabowo invites PM Shehbaz Sharif to boost Indonesia-Pakistan ties - ANTARA News",
    "url": "https://en.antaranews.com/news/395860/prabowo-invites-pm-shehbaz-sharif-to-boost-indonesia-pakistan-ties",
    "snippet": "Jakarta (ANTARA) - <strong>President Prabowo Subianto officially invited Pakistani Prime Minister Shehbaz Sharif to visit Indonesia</strong>, reciprocating his visit to Islamabad on December 8–9, 2025.",
    "published": "1 week ago"
  },
  {
    "title": "Full article: Prabowo’s First 100 Days and beyond as President: A Security-Focused Economic Agenda",
    "url": "https://www.tandfonline.com/doi/full/10.1080/00074918.2025.2483310",
    "snippet": "In this year’s 2025 state budget, <strong>a larger sum has been allocated for military spending and, along with his signature free school meals program, two food and fuel selfsufficiency programs are noteworthy</strong> (Habir and Negara Citation2024a).",
    "published": null
  }
]