[
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "As of 1 July 2022, <strong>Alfred Schreuder succeeded Erik ten Hag</strong>, who left for Manchester United, as Ajax&#x27;s coach. Most of the key players from previous seasons left during the summer transfer period, but there was also a lot of reinvestment. Ajax started the 2022/23 season relatively well with six ...",
    "published": "2 weeks ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "<strong>Heitinga is signing a contract with Ajax as head coach until June 30, 2027</strong>. Marcel Keizer will be his assistant and is signing a contract of the same duration. Date: 31.05.2025 · Photographer: AFC Ajax ·",
    "published": null
  },
  {
    "title": "r/soccer on Reddit: [VI] Fred Grim will be Ajax first team head coach until at least the winter break",
    "url": "https://www.reddit.com/r/soccer/comments/1p2uetc/vi_fred_grim_will_be_ajax_first_team_head_coach/",
    "snippet": "Simonis next Ajax coach - about to get fired.",
    "published": "4 weeks ago"
  },
  {
    "title": "Ajax hires Liverpool assistant John Heitinga as new head coach | AP News",
    "url": "https://apnews.com/article/ajax-coach-heitinga-liverpool-c894f54c8f6ecf0949d3962a5d3e353e",
    "snippet": "Ajax has hired <strong>John Heitinga as head coach to replace Francesco Farioli</strong> nearly two weeks after the Italian resigned following the team’s late-season collapse.",
    "published": "May 31, 2025"
  },
  {
    "title": "Denny Landzaat appointed assistant coach of Ajax",
    "url": "https://english.ajax.nl/articles/denny-landzaat-appointed-ajax-assistant-coach/",
    "snippet": "<strong>Denny Landzaat has been added to the first team&#x27;s technical staff with immediate effect</strong>. The 49-year-old Amsterdam native appeared on the training pitch today in his new role as assistant coach to Fred Grim.",
    "published": null
  }
]