[
  {
    "title": "Complexity Science Hub * Dirk Helbing",
    "url": "https://csh.ac.at/dirk-helbing/",
    "snippet": "Dirk Helbing is Professor of Computational Social Science at the Department of Humanities, Social and Political Sciences and associated at ETH Zurich’s Department of Computer Science. His current studies discuss the digital society, smart cities, as well as challenges and opportunities of ...",
    "published": "September 15, 2025"
  },
  {
    "title": "Dirk HELBING | Professor | PhD, Physics | ETH Zurich, Zürich | ETH Zürich | Research profile",
    "url": "https://www.researchgate.net/profile/Dirk-Helbing",
    "snippet": "Oct 2025 · Dirk Helbing · This review article <strong>reflects on emerging societies using a data-driven, cybernetic governance approach</strong>. Such an approach implies great opportunities, but also considerable challenges and potential ethical issues, ...",
    "published": null
  },
  {
    "title": "dblp: Dirk Helbing",
    "url": "https://dblp.org/pid/78/6036.html",
    "snippet": "Claudio Novelli, Javier Argota Sánchez-Vaquerizo, Dirk Helbing, Antonino Rotolo, Luciano Floridi: A Replica for our Democracies? On Using Digital Twins to Enhance Deliberative Democracy. CoRR abs/2504.07138 (2025)",
    "published": "May 22, 2025"
  },
  {
    "title": "Dirk Helbing",
    "url": "https://scholar.google.com/citations?user=ebrNfPAAAAAJ",
    "snippet": "Dirk Helbing · Computational Social Science, ETH Zurich · Verified email at ethz.ch - Homepage · computational social sciencecomplex systemsdigital democracystatistical physicsintelligent transportation systems · ArticlesCited byPublic accessCo-authors ·",
    "published": null
  },
  {
    "title": "Dirk Helbing - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Dirk_Helbing",
    "snippet": "Helbing received an honorary PhD from Delft University of Technology (TU Delft). Since June 2015 he was affiliate professor at the faculty of Technology, Policy and Management at TU Delft for some years, where he led the PhD school in &quot;Engineering Social Technologies for a Responsible Digital Future&quot;. Dirk Helbing started out as a physicist.",
    "published": "2 weeks ago"
  }
]