[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Both criminal cases have been widely considered politically motivated and intended to bar him from running in future elections. He ran in the 2013 Moscow mayoral election and came in second with 27.2% of the vote, but was barred from running in the 2018 presidential election. In August 2020, Navalny was hospitalised after being severely poisoned with a Novichok nerve agent.",
    "published": "1 day ago"
  },
  {
    "title": "Death and funeral of Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Death_and_funeral_of_Alexei_Navalny",
    "snippet": "Navalnaya called for the EU to recognize the results of the 2024 Russian presidential election as illegitimate, stating &quot;A president who assassinated his main political opponent cannot be legitimate by definition.&quot; Navalny&#x27;s mother, Lyudmila, said she did not &quot;want to hear any words of sympathy&quot;, adding that he was &quot;alive, healthy and cheerful&quot; four days prior to his death.",
    "published": "3 weeks ago"
  },
  {
    "title": "The death of Alexei Navalny | Brookings",
    "url": "https://www.brookings.edu/articles/the-death-of-alexei-navalny/",
    "snippet": "Navalny created a successful political organization with branches all over Russia. He advocated “smart voting”—those who oppose Putin should vote for candidates who might be able to defeat the United Russia candidate, be they communists or from the far-right Liberal Democratic Party. His death amid increasingly repressive moves from the Kremlin means that there is no opposition leader left in Russia.",
    "published": "February 16, 2024"
  },
  {
    "title": "A year after Navalny's death, Russian opposition demoralized",
    "url": "https://www.dw.com/en/a-year-after-navalnys-death-russian-opposition-demoralized/a-71617836",
    "snippet": "Alexei Navalny, Russia&#x27;s most prominent dissident, died on February 16, 2024. Without him, the opposition in Russia remains fragmented, and <strong>the political process has ground to a halt</strong>.",
    "published": "February 15, 2025"
  },
  {
    "title": "Alexei Navalny’s wife and political heir still has ‘big hopes’ for Russia",
    "url": "https://www.politico.eu/article/alexei-navalny-yulia-navalnaya-political-heir-big-hopes-russia/",
    "snippet": "Even after Navalny’s death, Russian authorities have continued to crack down on associates of the late politician.",
    "published": "5 days ago"
  }
]