[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Marcia Carolyn Kaptur (/ˈkæptər/ ... district since 1983. <strong>A member of the Democratic Party, Kaptur is the longest-serving woman in congressional history and the dean of Ohio&#x27;s congressional delegation since 2009 when Representative Ralph Regula retired</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "In 1981, while pursuing a doctorate in urban planning and development finance at MIT, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the 1982 recession to stage a nationally-recognized upset.",
    "published": "May 27, 2025"
  },
  {
    "title": "The Honorable Marcy Kaptur (D-OH) Biography",
    "url": "https://www.congress.gov/115/meeting/house/108368/witnesses/HHRG-115-VR03-Bio-K000009-20180613.pdf",
    "snippet": "The Honorable Marcy Kaptur (D-OH) Biography · Congresswoman Marcy Kaptur, who represents Ohio&#x27;s Ninth Congressional District, is currently serving · her seventeenth term in the U.S. House of Representatives. She is the senior-most woman in the House · and the longest-serving woman from Ohio in history.",
    "published": null
  },
  {
    "title": "Rep. Marcy Kaptur - D Ohio, 9th, In Office - Biography | LegiStorm",
    "url": "https://www.legistorm.com/person/bio/51457/Marcia_Carolyn_Kaptur.html",
    "snippet": "See more about Rep. Marcy Kaptur - D Ohio, 9th, In Office, including dates served, biography, salaries paid, personal financial disclosures, office information, staff directories and other biographical information.",
    "published": null
  },
  {
    "title": "About Marcy",
    "url": "https://marcykaptur.com/about-marcy/",
    "snippet": "JavaScript is disabled in your browser · Please enable JavaScript to proceed · A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser",
    "published": null
  }
]