[
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "President of Ukraine <strong>Volodymyr Zelenskyy</strong> had a phone call with President of the Council of Ministers of Italy Giorgia Meloni. 7 December 2025 - 14:00 · On Local Self-Government Day, President of Ukraine <strong>Volodymyr Zelenskyy</strong> signed a decree awarding ...",
    "published": "1 week ago"
  },
  {
    "title": "PM's engagements with President Zelenskyy of Ukraine, President Macron of France, Chancellor Merz of Germany and European partners: 8 December 2025 - GOV.UK",
    "url": "https://www.gov.uk/government/news/pms-engagements-with-president-zelenskyy-of-ukraine-president-macron-of-france-chancellor-merz-of-germany-and-european-partners-8-december-2025",
    "snippet": "The Prime Minister welcomed the President of Ukraine, <strong>Volodymyr Zelenskyy</strong>, the President of France, Emmanuel Macron, and the Chancellor of Germany, Friedrich Merz, to Downing Street today.",
    "published": "1 week ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... nation&#x27;s head of government. The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "What Will a Change of Prime Minister Mean for Ukraine? | Carnegie Endowment for International Peace",
    "url": "https://carnegieendowment.org/russia-eurasia/politika/2025/07/ukraine-government-reshuffle?lang=en&amp=&center=russia-eurasia",
    "snippet": "Ukraine has a new prime minister for the first time in five years. The country’s longest-serving head of government Denys Shmyhal has ceded his place to <strong>Yulia Svyrydenko</strong>, a fellow technocrat.",
    "published": null
  },
  {
    "title": "Government of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_Ukraine",
    "snippet": "The current Cabinet of Ministers of Ukraine is the Svyrydenko Government that was formed on 17 July 2025, led by <strong>Yulia Svyrydenko</strong>.",
    "published": "3 weeks ago"
  }
]