[
  {
    "title": "Ada Solomon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ada_Solomon",
    "snippet": "Ada Solomon (born 3 June 1968 in Bucharest) is a <strong>Romanian</strong> film producer behind over 60 movies. After first working in marketing, she turned to media companies in 1993 and produced her first film Asphalt Tango in 1995. In 2004 she created HiFilm Productions where she has worked with directors ...",
    "published": "August 13, 2025"
  },
  {
    "title": "Ada Solomon | Producer, Production Manager, Actress",
    "url": "https://www.imdb.com/name/nm1127536/",
    "snippet": "Ada Solomon. Producer: Bad Luck Banging or Loony Porn. Ada Solomon was born on 3 June 1968 in Bucharest, <strong>Romania</strong>. She is a producer and production manager. She is married to Alexandru Solomon.",
    "published": "July 16, 2009"
  },
  {
    "title": "Ada Solomon | MIDPOINT Institute",
    "url": "https://www.midpoint-institute.eu/en/person/ada-1dGcDV",
    "snippet": "Ada Solomon is a <strong>Romanian</strong> producer.",
    "published": null
  },
  {
    "title": "Ada Solomon — Network — EAVE",
    "url": "https://eave.org/network/10719",
    "snippet": "Apart of her producing job Ada Solomon is also Head of Distribution in Parada Film &amp; is managing (together with Tudor Giurgiu) Cityplex -3 mini-plex cinemas in Romania, member of Europa Cinemas, as well as being Founder &amp; Executive Director of Short &amp; Medium Length Int’l Film Festival NexT &amp; teaching in the National ...",
    "published": null
  },
  {
    "title": "Ada Solomon - Producer - First Cut Lab",
    "url": "https://firstcutlab.eu/project/ada-solomon-producer/",
    "snippet": "Ada Solomon is a Romanian producer, founder of Hi Film Productions and Micro Film. She has produced over 60 titles such as: I DO NOT CARE IF WE GO DOWN IN HISTORY AS BARBARIANS (Radu Jude, 2018, Grand Prix Crystal Globe in KV IFF), AFERIM! (Radu Jude, 2015, Silver Bear Berlin) and CHILD’S POSE (Calin Netzer, 2013, Golden Bear Berlin).",
    "published": "May 12, 2022"
  }
]