[
  {
    "title": "Mark Aguiar | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is a consultant at ... University. Previously, he was a <strong>professor of economics at the University of Rochester and a senior economist at the Federal Reserve Bank of Boston</strong>....",
    "published": null
  },
  {
    "title": "Mark Aguiar - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Aguiar",
    "snippet": "He was elected a Fellow of the Econometric Society in 2018, and was a co-editor of the American Economic Review from 2014 to 2017, where he previously served on the board of editors and reviewed submissions relating to macroeconomics. Aguiar has been a member of the advisory board of the Carnegie-NYU-Rochester Conference on Public Policy since 2010. In 2017, The Economist commented on research he conducted (alongside Mark Bils, Kerwin Charles, and Erik Hurst) on the link between unemployment and ownership of video game consoles.",
    "published": "October 23, 2025"
  },
  {
    "title": "Mark A. Aguiar | NBER",
    "url": "https://www.nber.org/people/mark_aguiar",
    "snippet": "Contact Us 1050 Massachusetts Avenue Cambridge, MA 02138 617-868-3900 info@nber.org webaccessibility@nber.org",
    "published": null
  },
  {
    "title": "Mark A. Aguiar - Princeton University",
    "url": "https://collaborate.princeton.edu/en/persons/mark-a-aguiar/",
    "snippet": "Dive into the research topics where Mark A. Aguiar is active. These topic labels come from the works of this person. Together they form a unique fingerprint. ... Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory ...",
    "published": null
  },
  {
    "title": "Mark Aguiar | IDEAS/RePEc",
    "url": "https://ideas.repec.org/e/c/pag57.html",
    "snippet": "&quot;The Changing Value of Employment and Its Implications,&quot; CEPR Discussion Papers 17943, C.E.P.R. Discussion Papers. Ananth Seshadri, 2018. &quot;A Meta-Analysis of the Decline in the Labor Force Participation Rate,&quot; Working Papers wp381, University of Michigan, Michigan Retirement Research Center. Michael Elsby &amp; David Ratner &amp; Ryan Michaels, 2018. &quot;The Wages of Nonemployment,&quot; 2018 Meeting Papers 1077, Society for Economic Dynamics. Mark Aguiar &amp; Manuel Amador &amp; Hugo Hopenhayn &amp; Iván Werning, 2016.",
    "published": null
  }
]