[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "WBD would serve as managing partner, with Eurosport&#x27;s UK operations to be merged with the <strong>BT Sport</strong> networks. As part of the agreement, WBD also negotiated a deal for BT Group to distribute Discovery+ to its television and <strong>BT Sport</strong> subscribers. WBD would rebrand <strong>BT Sport</strong> as TNT Sports, deriving ...",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport International 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/63601-30",
    "snippet": "Eurosport International is a Private company. The current valuation of Eurosport International is .",
    "published": null
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "Eurosport 1 is a television sports network channel which is a division of Eurosport and a subsidiary of EMEA version of <strong>Warner Bros. Discovery</strong>. Discovery took a 20% minority interest share in December 2012, and became majority shareholder in ...",
    "published": "October 31, 2025"
  },
  {
    "title": "Eurosport - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/eurosport",
    "snippet": "Eurosport is a pan-European television sports network, owned and operated by <strong>Discovery Communications</strong>.",
    "published": null
  },
  {
    "title": "Eurosport owner takes 20% share in GCN parent, U.S. expansion planned",
    "url": "https://cyclingindustry.news/eurosport-takes-20-share-in-gcn-parent-u-s-expansion-planned/",
    "snippet": "Thursday, 4 December 2025 · FeaturedNews · Monday, 27 February 2017 Mark Sutton · As part of a fresh funding drive, Eurosport-owner <strong>Discovery Communications</strong> has taken a 20% stake in Global Cycling Network and Global Mountain Biking Network ...",
    "published": "February 27, 2017"
  }
]