[
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "On 3 March 1996, the PP won the early parliamentary elections and formed a government with the support of the Basque Nationalist Party (EAJ-PNV), Convergence and Union (CiU) and the Canarian Coalition (CC). Rajoy, a long-time associate of newly elected prime minister <strong>José María Aznar</strong>, made the ...",
    "published": "March 8, 2004"
  },
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "Mariano Rajoy (born March 27, 1955, Santiago de Compostela, Spain) is a Spanish politician who served as prime minister of Spain from 2011 to 2018.",
    "published": "December 6, 2011"
  },
  {
    "title": "Pedro Sanchez | Historica Wiki | Fandom",
    "url": "https://historica.fandom.com/wiki/Pedro_Sanchez",
    "snippet": "<strong>Pedro Sanchez Perez-Castejon</strong> (born 29 February 1972) was Prime Minister of Spain from 1 June 2018, succeeding Mariano Rajoy. He was the leader of the PSOE from 2017, and he took power after Rajoy was ousted in a vote of no-confidence.",
    "published": "October 29, 2024"
  },
  {
    "title": "Mariano Rajoy former President of Spain (2011 to 2018).",
    "url": "https://clubmadrid.org/who/members/rajoy-mariano/",
    "snippet": "Afterwards, in 1993, he was reelected to Congress, and from 1996, he served in the PP government of the new Spanish President, <strong>José María Aznar</strong> (1996-2004), heading the Ministries of Education, Culture, Interior; and as a Vice President between 2001 and 2003.",
    "published": "November 21, 2019"
  },
  {
    "title": "First government of Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/First_government_of_Mariano_Rajoy",
    "snippet": "Rajoy&#x27;s first government saw a number of cabinet changes during its tenure: On 28 April 2014, <strong>Miguel Arias Cañete</strong> stepped down as Minister of Agriculture, Food and Environmental Affairs in order to run as the People&#x27;s Party (PP)&#x27;s leading candidate ...",
    "published": "August 29, 2025"
  }
]