[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Kaptur began her career in urban planning, working as an urban planner on the Toledo-Lucas County Plan Commissions from <strong>1969 to 1975</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "<strong>In 1981, while pursuing a doctorate in urban planning and development finance at MIT, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican</strong>. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the ...",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Kaptur was assigned to the following committees:[Source] ... The primary will occur on May 5, 2026. The general election will occur on November 3, 2026. General election candidates will be added here following the primary. Incumbent Marcy Kaptur is running in the Democratic primary for U.S.",
    "published": null
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "Marcy Kaptur, the Representative from Ohio - in Congress from <strong>1983 through Present</strong>",
    "published": null
  },
  {
    "title": "The Honorable Marcy Kaptur (D-OH) Biography",
    "url": "https://www.congress.gov/115/meeting/house/108368/witnesses/HHRG-115-VR03-Bio-K000009-20180613.pdf",
    "snippet": "Congresswoman Kaptur also is the first Democratic woman ever to serve on the powerful Defense · Subcommittee. There, she is a strong advocate for national security, energy independence and adequate ... She is also a member of the Interior Subcommittee where she fights for clean water programs that protect · our Great Lakes. Earlier in her congressional career, she served on the Appropriations Financial Services",
    "published": null
  }
]