[
  {
    "title": "Kamala D. Harris | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/kamala-harris/H001075",
    "snippet": "Kamala D. Harris, the Senator from California - in Congress from <strong>2017 through 2021</strong>",
    "published": null
  },
  {
    "title": "Kamala Harris - Ballotpedia",
    "url": "https://ballotpedia.org/Kamala_Harris",
    "snippet": "Click here for Harris&#x27; 2020 presidential campaign overview. See also: United States Senate election in California, 2016 · Heading into the election, Ballotpedia rated California&#x27;s U.S. Senate race as safely Democratic. California&#x27;s U.S. Senate seat was open following the retirement of incumbent Barbara Boxer (D). Thirty-four candidates filed to run to replace Boxer, including seven Democrats, 12 Republicans, and 15 third-party candidates. Two Democrats, Kamala Harris and Loretta Sanchez, defeated the other 32 candidates to advance to the general election.",
    "published": null
  },
  {
    "title": "Kamala Harris - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kamala_Harris",
    "snippet": "Harris was the junior U.S. senator from California from <strong>2017 to 2021</strong> after winning the 2016 Senate election. She was the second Black woman and first South Asian American U.S. senator. As a senator, Harris advocated for stricter gun control laws, the DREAM Act, federal legalization of cannabis, ...",
    "published": "1 week ago"
  },
  {
    "title": "Kamala Harris Isn’t Ready to Be Written Off - The New York Times",
    "url": "https://www.nytimes.com/2025/12/09/us/politics/kamala-harris-interview-107-days-book-2028.html",
    "snippet": "The day after it ended, Ms. Harris called Senator Jon Ossoff of Georgia, who is the party’s most endangered incumbent and had opposed the vote to reopen, to offer her support in any way he needed, according to two people who described the call.",
    "published": "2 weeks ago"
  },
  {
    "title": "Vice President Kamala Harris [D, 2021-2025], former Vice President of the United States - GovTrack.us",
    "url": "https://www.govtrack.us/congress/members/kamala_harris/412678",
    "snippet": "Harris was Vice President of the United States and was a Democrat. She served from <strong>2021 to 2025</strong>. She was previously a senator from California as a Democrat from 2017 to Jan. 18, 2021.",
    "published": null
  }
]