[
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The International Mathematical Union is administered by an executive committee (EC) which conducts the business of the Union. The EC consists of <strong>the President, two vice-presidents, the Secretary, six Members-at-Large, all elected for a term of four years, and the Past President</strong>.",
    "published": "February 24, 2025"
  },
  {
    "title": "| International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/",
    "snippet": "The book &quot;Mathematicians of the World, Unite!&quot; by G. Curbera is now electronically available on the IMU website. For more information click here · If you want to subscribe to IMU News, please click on the button. ... In preparation for the IMU General Assembly in July 2026, the Adhering Organizations of IMU Members are asked to appoint and certify their delegations to the Secretary General. See AO CL 9/2025.",
    "published": null
  },
  {
    "title": "IMU News 132: July 2025 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/imu-news/archive/2025/imu-news-132-july-2025",
    "snippet": "From 1991 to 1998 <strong>Jacob Palis</strong> served as the Secretary General of the International Mathematical Union (IMU) and later, from 1999 to 2002, as its President. He vigorously promoted international collaboration and capacity-building efforts. His leadership extended well beyond the IMU: he headed ...",
    "published": null
  },
  {
    "title": "Home | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/?id=2113",
    "snippet": "The Mathematical Congress of the ... July 2025 in Miami, USA. Further information can be found via the congress website www.mca2025.org. Mathematical Physicist and CDC Member <strong>Mahouton Norbert Hounkonnou</strong> selected as the winner of the 2023 Tate Medal for International Leadership in Physics ...",
    "published": null
  },
  {
    "title": "ICMI Newsletter - March 2025 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/icmi/icmi-newsletter-march-2025",
    "snippet": "I am especially thankful that <strong>Frederick Leung</strong> remains on the EC (ex officio) as past President, so that I can draw on his advice and example of wise leadership over the past four years. With this Editorial, then, I want to send my warmest greetings to our international mathematics education ...",
    "published": null
  }
]