[
  {
    "title": "The Past Presidents of the IAAF | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/the-past-presidents-of-the-iaaf",
    "snippet": "Among Lord Burghley&#x27;s many significant achievements were assisting the admission of the Soviet Union into international sporting bodies after World War II and dealing with the difficult issue of a divided Germany. Under Burghley - although he was also officially known as the 6th Marquess of Exeter after the death of his father in 1956 - athletics also enhanced its position within the Olympic movement and strengthened its financial position from the distribution of International Olympic Committee television revenues. However, his final years as IAAF president before standing down in 1976 were turbulent, with many countries outside Europe were clamouring for a greater say in the decision making of the Federation.",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "The process to found World Athletics began in Stockholm, Sweden, on 18 July 1912 soon after the completion of the 1912 Summer Olympics in that city. At that meeting, 27 representatives from 17 national federations agreed to meet at a congress in Berlin, Germany, the following year, overseen by Sigfrid Edström who was to become the fledgling organisation&#x27;s first president.",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "Among Lord Burghley&#x27;s many significant achievements were assisting the admission of the Soviet Union into international sporting bodies after World War II and dealing with the difficult issue of a divided Germany. Under Burghley - although he was also officially known as the 6th Marquess of Exeter after the death of his father in 1956 - athletics also enhanced its position within the Olympic movement and strengthened its financial position from the distribution of International Olympic Committee television revenues. However, his final years as IAAF president before standing down in 1976 were turbulent, with many countries outside Europe clamouring for a greater say in the decision making of the Federation.",
    "published": null
  },
  {
    "title": "Coe re-elected and will preside over historic gender equal Council | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/sebastian-coe-president-congress-2023-gender-equal-council",
    "snippet": "In 2019, Restrepo, the 1992 Olympic 400m bronze medallist from Colombia, became the first woman to be elected as a World Athletics Vice President. As part of the widespread reforms adopted by the World Athletics Congress at the end of 2016, World Athletics added minimum gender targets into its constitution to establish parity at all levels in the sport’s governance.",
    "published": null
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "Development Commission: Chair – Kids&#x27; Athletics work stream, Member – Technical Officials Education work stream, Member – Coaches Education workstream ... Chairman, Organising Committee - Asian Athletics Championships (2013 - Pune, India) &amp; (2017 - Odisha, India), and Member, Organising Committee - Permit Meetings in India · National Olympic Committee – Vice President and Acting President (2017–2022)",
    "published": null
  }
]