[
  {
    "title": "Hawker Siddeley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Siddeley",
    "snippet": "<strong>During the Second World War, Hawker Siddeley was one of the United Kingdom&#x27;s most important aviation concerns</strong>, producing numerous designs including the famous Hawker Hurricane fighter plane that, along with the Supermarine Spitfire, was Britain&#x27;s front-line defence in the Battle of Britain.",
    "published": "August 29, 2025"
  },
  {
    "title": "Hawker Aircraft - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Aircraft",
    "snippet": "<strong>Hawker had its roots in the aftermath of the First World War, which resulted in the bankruptcy of the Sopwith Aviation Company</strong>. Sopwith test pilot Harry Hawker and three others, including Thomas Sopwith, bought the assets of Sopwith and formed H. G. Hawker Engineering in 1920.",
    "published": "2 weeks ago"
  },
  {
    "title": "Hawker Siddeley Group PLC | Science Museum Group Collection",
    "url": "https://collection.sciencemuseumgroup.org.uk/people/ap17246/hawker-siddeley-group-plc",
    "snippet": "During the late 1950s the British government decided that the number of aircraft manufacturers should be decreased as the number of contracts being offered was being reduced. As a result of this Hawker Siddeley merged all of its aviation interests, Hawker, Avro, Gloster, Armstrong Whitworth and Armstrong Siddeley, into a single division, Hawker Siddeley Aviation during October 1958.",
    "published": null
  },
  {
    "title": "Hawker Siddeley - Graces Guide",
    "url": "https://www.gracesguide.co.uk/Hawker_Siddeley",
    "snippet": "WW2 Hawker Siddeley was <strong>one of the United Kingdom&#x27;s most important aviation concerns</strong>, producing numerous designs including the famous Hawker Hurricane fighter plane that, along with the Supermarine Spitfire, was Britain&#x27;s front-line defence in the Battle of Britain.",
    "published": null
  },
  {
    "title": "Hawker Siddeley | BAE Systems | United Kingdom",
    "url": "https://www.baesystems.com/en-uk/heritage/hawker-siddeley",
    "snippet": "The Hawker Siddeley brand was known worldwide with interests in railways (both diesel and electric) and rapid transport systems and <strong>the name of its founder Harry Hawker still continued in aviation until 2012 as the Hawker Beechcraft Corporation</strong>.",
    "published": null
  }
]