[
  {
    "title": "Transitional Sovereignty Council - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Transitional_Sovereignty_Council",
    "snippet": "Following more than half a year ... in April 2019 by a coup d&#x27;état, <strong>the TMC and the Forces of Freedom and Change alliance (FFC) made a July 2019 Political Agreement and completed it by the August 2019 Draft Constitutional Declaration</strong>....",
    "published": "November 11, 2025"
  },
  {
    "title": "Sudanese transition to democracy (2019–2021) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudanese_transition_to_democracy_(2019–2021)",
    "snippet": "On 4 August 2019, the Draft Constitutional Declaration was initially signed by Ahmed Rabee for the FFC and by the deputy head of the TMC, Mohamed Hamdan Dagalo (&quot;Hemedti&quot;), in the presence of Ethiopian and African Union mediators, and it was signed more formally by Rabee and Hemedti on 17 August in the presence of international heads of state and government. The transition was interrupted on 25 October 2021 when the Sudanese military, led by General Abdel Fattah al-Burhan, took control of the government in a military coup.",
    "published": "2 weeks ago"
  },
  {
    "title": "Sudan’s New Transitional Government Presents Chance to Restore Long-Term Stability in Darfur, United Nations, African Union Officials Tell Security Council | UN Meetings Coverage and Press Releases",
    "url": "https://press.un.org/en/2019/sc13929.doc.htm",
    "snippet": "As for the joint African Union-United Nations political strategy requested by resolution 2479 (2019), there is need for ample and meaningful consultations with the Transitional Government, he said ... France), applauding the close cooperation between the African Union and the United Nations, described the signing of the 17 August agreement as a major step, also welcoming the nomination of a new Prime Minister. Noting that women and young people have been driving Sudan’s revolution, she emphasized that they must be fully involved in the process going forward.",
    "published": null
  },
  {
    "title": "Transitional Military Council (2019) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Transitional_Military_Council_(2019)",
    "snippet": "The Transitional Military Council ... d&#x27;état that took place during the Sudanese Revolution, and was formally headed by <strong>Abdel Fattah al-Burhan</strong>, Inspector of the Sudanese Armed Forces, after Ahmed Awad Ibn Auf resigned as leader ...",
    "published": "1 month ago"
  },
  {
    "title": "Sudan: Political Process to Form a Transitional Civilian Government and the Shift in Disorder Trends, Situation Update - April 2023 - Sudan | ReliefWeb",
    "url": "https://reliefweb.int/report/sudan/sudan-political-process-form-transitional-civilian-government-and-shift-disorder-trends-situation-update-april-2023",
    "snippet": "<strong>Since the ouster of former President Omar al-Bashir in April 2019, Sudan has experienced a turbulent political transition</strong>.",
    "published": null
  }
]