[
  {
    "title": "Alexander De Croo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_De_Croo",
    "snippet": "De Croo was born in Vilvoorde and studied business engineering at the Vrije Universiteit Brussel before <strong>attaining an MBA at Northwestern University in the United States</strong>. He worked for Boston Consulting Group before starting his own company, Darts-ip, in 2006.",
    "published": "1 week ago"
  },
  {
    "title": "Alexander De Croo",
    "url": "https://www.senate.be/www/?MIval=showSenator&ID=4565&LANG=nl",
    "snippet": "Geboren te Vilvoorde op 3 november 1975 Handelsingenieur (VUB - Solvay Business School) Master in Business Administration (Kellog School of Management - Chicago) <strong>Gewezen zaakvoerder Directeur-generaal van het Ontwikkelingsprogramma van de Verenigde Naties (UNDP) 2009-2012 : voorzitter van de</strong> ...",
    "published": null
  },
  {
    "title": "H.E. Mr. Alexander De Croo | Generation Unlimited",
    "url": "https://www.generationunlimited.org/he-mr-alexander-de-croo",
    "snippet": "In 2019, when he was sworn in as ... A business engineer by training, Alexander De Croo <strong>obtained an MBA from the Kellogg School of Management, Northwestern University,</strong> ......",
    "published": null
  },
  {
    "title": "In Conversation with Alexander De Croo",
    "url": "https://fordschool.umich.edu/event/2025/conversation-alexander-de-croo",
    "snippet": "A business engineer by training, De Croo <strong>obtained an MBA from the Kellogg School of Management, Northwestern University, Chicago in 2004.</strong>",
    "published": null
  },
  {
    "title": "Alexander De Croo | ITIF",
    "url": "https://itif.org/person/alexander-de-croo/",
    "snippet": "<strong>Graduated in Business Engineering, Alexander De Croo completed an MBA at the Kellogg School of Management (Northwestern University) in Chicago (United States), in 2004.</strong> Between 1999 and 2006, he was employed as a strategy consultant at The Boston ...",
    "published": null
  }
]