[
  {
    "title": "Olena Zelenska - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olena_Zelenska",
    "snippet": "The purpose of the summits is to ... world; to discuss the current problems and activities of the First Ladies and Gentlemen to solve them; to make the voice of every first lady and gentleman more influential. After the 2022 Russian invasion of Ukraine, Zelenska was described ...",
    "published": "2 weeks ago"
  },
  {
    "title": "President's wife news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/wife",
    "snippet": "We Are Working in a Way That Ensures Every Single Day Is Used for Ukraine, and There Should Still Be Relevant News This Year – Address by the President ... The First Lady of Ukraine, <strong>Olena Zelenska</strong>, summarized this year’s results of implementing ...",
    "published": "1 day ago"
  },
  {
    "title": "First Lady of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/First_Lady_of_Ukraine",
    "snippet": "First Lady of Ukraine (Ukrainian: перша пані України, romanized: persha pani Ukrainy or перша леді України, persha ledi Ukrainy) is the unofficial title attributed to the wife of the president of Ukraine.",
    "published": "August 31, 2025"
  },
  {
    "title": "4,804 Olena Zelenska Photos & High Res Pictures - Getty Images",
    "url": "https://www.gettyimages.com/photos/olena-zelenska",
    "snippet": "The President of Ukraine, Volodymyr Zelenskyy and the first lady of Ukraine, <strong>Olena Zelenska</strong> stand together on the stage during the Raising the Flag...",
    "published": null
  },
  {
    "title": "A Conversation with Olena Zelenska, the First Lady of Ukraine | Ukrainian Research Institute",
    "url": "https://www.huri.harvard.edu/news/conversation-olena-zelenska-first-lady-ukraine",
    "snippet": "In the words of HURI director Serhii Plokhii, Zelenska’s visit acknowledges HURI’s past five decades of achievements, and helps launch its journey “for the next 50 years.” · While visiting the Widener Library and meeting university librarian Martha Whitehead, the First Lady donated books to Harvard’s Ukrainica collection, which is the largest collection of Ukrainian material outside of Europe.",
    "published": null
  }
]