[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "<strong>In 2002, he was elected to the regional council of the Moscow branch of Yabloko</strong>. In 2003, he headed the Moscow subdivision of the election campaign of the party for the parliamentary election held in December. In April 2004, Navalny became Chief of Staff of the Moscow branch of Yabloko, where ...",
    "published": "1 day ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice ... of the Russian Federation. <strong>In 2000, while he was still a student, Navalny joined Yabloko, a political party that promoted liberal democracy and a market economy</strong>....",
    "published": "March 7, 2023"
  },
  {
    "title": "Russia’s ‘Last Liberal Party’ Cuts Ties With Navalny Supporters - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/10/18/russias-last-liberal-party-cuts-ties-with-navalny-supporters-a75327",
    "snippet": "Russian liberal party Yabloko announced Monday it will cut ties with members who had backed jailed Kremlin critic Alexei Navalny’s anti-Kremlin voting initiative, a move that underlines bitter divisions in the country’s fragmented opposition.",
    "published": "September 10, 2025"
  },
  {
    "title": "The Two Layers of Alexei Navalny | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/two-layers-alexei-navalny",
    "snippet": "<strong>His first political home in the early 2000s was the Yabloko party, founded in 1993 on the ideals that blended traditional European social democracy with elements of economic liberalism</strong>.",
    "published": null
  },
  {
    "title": "‘We consider Alexey Navalny’s ideas destructive and dangerous for Russia’ | openDemocracy",
    "url": "https://www.opendemocracy.net/en/odr/yablokov-russia-navalny-rybakov/",
    "snippet": "Today, the Yabloko party is the only officially registered political force that actually opposes the Russian government. While police violence against protesters has raised the stakes against participants of opposition protests, criminal prosecutions of potential participants in this year’s parliamentary elections have severely reduced the ranks of the Russian opposition - including, of course, Alexey Navalny.",
    "published": "July 8, 2021"
  }
]