[
  {
    "title": "France rushes emergency budget law to avert shutdown after talks collapse | Reuters",
    "url": "https://www.reuters.com/world/french-pm-races-pass-stopgap-budget-law-avoid-shutdown-2025-12-22/",
    "snippet": "[1/2]<strong>French Prime Minister Sebastien Lecornu leaves the Elysee Palace, after a cabinet meeting with President Emmanuel Macron on a special law to allow spending and borrowing into the new year</strong>, after budget talks failed, in Paris, France, December ...",
    "published": "1 day ago"
  },
  {
    "title": "2024–2025 French political crisis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–2025_French_political_crisis",
    "snippet": "On 13 December, <strong>Macron appointed Democratic Movement leader François Bayrou as prime minister</strong>. According to Le Monde, the appointment of Bayrou was decided on at the last minute, with Macron originally telling Bayrou that he would not be named Prime Minister, only to be forced to appoint Bayrou ...",
    "published": "3 days ago"
  },
  {
    "title": "French PM ups pressure on government to avoid budget deadlock",
    "url": "https://www.lemonde.fr/en/politics/article/2025/12/20/french-pm-ups-pressure-on-government-to-avoid-budget-deadlock_6748704_5.html",
    "snippet": "After a joint committee failed to reach an agreement on France&#x27;s contentious budget bill, <strong>the government plans to present a special law on Monday to ensure the continuity of the state</strong>.",
    "published": "3 days ago"
  },
  {
    "title": "France’s Haddad Confident Parliament Will Adopt Budget in 2026 - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-12-22/france-s-haddad-confident-parliament-will-adopt-budget-in-2026",
    "snippet": "Send a tip to our reporters · ... minister for European affairs says he’s confident that <strong>Parliament will adopt a 2026 budget once negotiations resume in January</strong>....",
    "published": "1 day ago"
  },
  {
    "title": "French National Assembly passes emergency budget bill to avert government shutdown - France 24",
    "url": "https://www.france24.com/en/live-news/20251223-french-national-assembly-passes-emergency-budget-bill-to-avert-government-shutdown",
    "snippet": "The law, which was due to be voted on in the upper house Senate in the evening, <strong>allows the state to roll over 2025 spending limits into the new year and to collect taxes and ‍issue debt</strong>.",
    "published": "4 hours ago"
  }
]