[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Die_Linke",
    "snippet": "&#x27;The Left&#x27;), also known as the ... political party in Germany. The party was <strong>founded in 2007 as the result of the merger of the Party of Democratic Socialism (PDS) and Labour and Social Justice – The Electoral Alternative</strong>....",
    "published": "January 7, 2007"
  },
  {
    "title": "Left Party | Germany, Politics, Origin, & Election Results | Britannica",
    "url": "https://www.britannica.com/topic/Left-Party-political-party-Germany",
    "snippet": "The Left (Die Linke) is a German political party that <strong>ruled East Germany as the Socialist Unity Party of Germany (SED) and now contests elections in united Germany</strong>.",
    "published": "November 10, 2006"
  },
  {
    "title": "Die Linke | Parties in the German Bundestag",
    "url": "https://www.deutschland.de/en/topic/politics/die-linke-parties-in-the-german-bundestag",
    "snippet": "Profile: Die Linke (i.e. the Left) was <strong>formed in 2007 from the merger of the PDS – the democratic successor to the East German party SED – and the left-wing SPD breakaway group WASG</strong>.",
    "published": "May 8, 2025"
  },
  {
    "title": "The Unlikely Revival of Germany’s Far Left - CEPA",
    "url": "https://cepa.org/article/the-unlikely-revival-of-germanys-far-left/",
    "snippet": "<strong>Tracing its roots back to East Germany and the Kremlin puppet Socialist Unity Party (SED),</strong> the old Die Linke simply found issues like the war in Ukraine and the Covid-19 pandemic too divisive to solve.",
    "published": "February 24, 2025"
  },
  {
    "title": "A Successful Model? Die Linke (the Left Party — Germany) | SpringerLink",
    "url": "https://link.springer.com/chapter/10.1057/9781137265111_5",
    "snippet": "Die Linke is the direct successor to the ruling Socialist Unity Party (SED) of the former German Democratic Republic. It has undergone a significant political transformation, firstly as the Party of Democratic Socialism (PDS), embracing the democratic red, green, feminist and pacifist politics typical of the new European left in the 1990s.",
    "published": null
  }
]