[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "The IAU is composed of individual members, who include both professional astronomers and junior scientists, and national members, such as professional associations, national societies, or academic institutions. Individual members are organised into divisions, committees, and working groups centered on particular subdisciplines, subjects, or initiatives. As of May 2024, the Union had 85 national members and 12,734 individual members, spanning 90 countries and territories.",
    "published": "3 weeks ago"
  },
  {
    "title": "Vote in the 2025 AAS Election! | American Astronomical Society",
    "url": "https://aas.org/posts/news/2025/01/vote-2025-aas-election",
    "snippet": "The Nominating Committee prepares slates of candidates for Officers and Trustees as specified in the Bylaws. Current Committee Members: <strong>Kelsey Johnson</strong>, Chair (June 2024-June 2025); Lori Allen and Margaret Meixner (Feb 2023-Feb 2025); Susana Deustua and Vivian U (Feb 2024-Feb 2026).",
    "published": null
  },
  {
    "title": "USNC/IAU Committee | American Astronomical Society",
    "url": "https://aas.org/comms/usnc-iau-committee",
    "snippet": "Chair: <strong>Martha P. Haynes</strong> ... Secretary: Alice K. B. Monet · NASEM Staff Officer: Ana Ferreras, Category V (Ex officio, non-voting) Charge: Effects appropriate participation by the United States in International Astronomical Union through the National Academy of Sciences-National Research Council.",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://iauarchive.eso.org/",
    "snippet": "Name Approved for the Moon: <strong>Mons Kocher</strong> Mon, Mar 17, 2025 00:00:00 The IAU Working Group for Planetary System Nomenclature has approved the name <strong>Mons Kocher</strong> for a feature on the Moon.",
    "published": null
  },
  {
    "title": "International Astronomical Union",
    "url": "https://www.iau.org/",
    "snippet": "Don&#x27;t miss the dedicated panel discussion &quot;Science in Action: Grassroots Pathways to Development&quot; on 10 November! Read more ... <strong>Anne Thieme</strong> joins the IAU Secretariat as Membership Coordinator in November 2025. Read more · Become a part of the largest international union of professional ...",
    "published": null
  }
]