[
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "<strong>Fabien Galthié</strong> (French pronunciation: ... the head coach of the France national team. His usual position was at scrum-half. He played much of his club rugby for Colomiers, and later on in his career, Stade Français. Galthié won 64 caps for France, including playing in four Rugby World Cups, ...",
    "published": "1 month ago"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "From <strong>Daniel Dubroca</strong> to Fabien Galthie, who has been the men&#x27;s France rugby coach since 1990. Fabien Galthié with his head bowed (Getty Images)",
    "published": "May 30, 2025"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "After the 2023 Rugby World Cup, Ghezal, Labit and Giroud left the France coaching staff and were replaced respectively by Stade Français forwards coach <strong>Laurent Sempéré, former international centre Patrick Arlettaz and Nicolas Jeanjean</strong>, who became the head of high performance.",
    "published": "2 weeks ago"
  },
  {
    "title": "Fabien Galthie: Ten things you should know about the France head coach",
    "url": "https://www.rugbyworld.com/countries/france-countries/fabien-galthie-ten-things-you-should-know-about-the-france-head-coach-134810",
    "snippet": "3. Overall Galthie played in 64 Tests for France between 1991 and 2003, scoring ten tries during his international career. 4. <strong>Galthie started coaching in 2004 with his first post at his former team Stade Francais</strong>.",
    "published": "January 12, 2024"
  },
  {
    "title": "France rugby union team: Fixtures, squad and head coach",
    "url": "https://news.bet365.com/en-gb/article/france-rugby-union-team-profile/2025012409221201023",
    "snippet": "The top tryscorer in the Six Nations in both 2022 and 2023, Bordeaux Begles wing Penaud is a gamechanger for this France side who time and time again is on hand to apply the finishing touches for <strong>Fabien Galthe</strong>&#x27;s side. A distinguished former player himself, receiving 64 international caps for ...",
    "published": null
  }
]