[
  {
    "title": "Marcelo Ebrard - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Ebrard",
    "snippet": "Marcelo Luis Ebrard Casaubón (Spanish: [maɾˈselo eˈβɾaɾð]; born 10 October 1959) is a Mexican politician and internationalist who has served as the <strong>secretary of economy</strong> since 2024. A member of the National Regeneration Movement (Morena), he previously served as secretary of foreign ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Cabinet Profile: Marcelo Ebrard, Secretary of the Economy | Mexico News Report",
    "url": "https://mexiconewsreport.com/index.php/2025/02/19/cabinet-profile-marcelo-ebrard-secretary-of-the-economy/",
    "snippet": "Marcelo Ebrard serves as <strong>Secretary of the Economy</strong> (Secretario de Economía) in the cabinet of President Claudia Sheinbaum.",
    "published": null
  },
  {
    "title": "Marcelo Ebrard _ AcademiaLab",
    "url": "https://academia-lab.com/encyclopedia/marcelo-ebrard/",
    "snippet": "Marcelo Luis Ebrard Casaubón (Mexico City, October 10, 1959) is a Mexican politician and internationalist. He is a member of the Morena party. He was <strong>Secretary of Foreign Affairs of Mexico from December 1, 2018 until his resignation on June 12, 2023</strong> during the presidency of Andrés Manuel ...",
    "published": null
  },
  {
    "title": "Who is Marcelo Ebrard? A video guide",
    "url": "https://mexiconewsdaily.com/business/a-video-guide-to-who-is-marcelo-ebrard/",
    "snippet": "With what appears to be the early stages of a trade war underway between Mexico and the United States, who is Marcelo Ebrard, the man tasked with responding to U.S. President Donald Trump? With tariffs threatening some of Mexico’s key industries and the peso taking a punch from market volatility, the stakes are higher than ever. The second-most senior politician in the ruling Morena party, Economy Minister Marcelo Ebrard will help President Claudia Sheinbaum to formulate a solution that will safeguard jobs, promote growth and protect Mexico from retaliation by its largest trading partner.",
    "published": "March 5, 2025"
  },
  {
    "title": "Marcelo Ebrard - SD Regional Chamber",
    "url": "https://sdchamber.org/bios/marcelo-ebrard/",
    "snippet": "@m_ebrard Ebrard was announced <strong>Secretary of Foreign Affairs</strong> after the presidential elections. He was previously served as president of the United Nations Global Network on Safer Cities.",
    "published": "March 25, 2019"
  }
]