[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "Scott John Morrison (born 13 May 1968) is an Australian former politician who served as the 30th prime minister of Australia from <strong>2018 to 2022</strong>. He held office as the leader of the Liberal Party and was the member of parliament (MP) for the New South Wales division of Cook from 2007 until his ...",
    "published": "1 week ago"
  },
  {
    "title": "Scott Morrison: timeline | naa.gov.au",
    "url": "https://www.naa.gov.au/explore-collection/australias-prime-ministers/scott-morrison/timeline",
    "snippet": "Some records include terms and views that are not appropriate today. They reflect the period in which they were created and are not the views of the National Archives. Scott Morrison was the Prime Minister of Australia from <strong>2018 to 2022</strong>.",
    "published": null
  },
  {
    "title": "Scott Morrison | naa.gov.au",
    "url": "https://www.naa.gov.au/explore-collection/australias-prime-ministers/scott-morrison",
    "snippet": "He was elected leader of the Liberal Party and Prime Minister–designate on <strong>24 August 2018,</strong> and was sworn in as Prime Minister of Australia on that day. ... Explore the stories of each prime minister&#x27;s time in office through official and personal records held by the National Archives.",
    "published": null
  },
  {
    "title": "Morrison government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Morrison_government",
    "snippet": "The Morrison government was the federal executive government of Australia, led by Prime Minister Scott Morrison of the Liberal Party of Australia, between <strong>2018 and 2022</strong>. The Morrison government commenced on 24 August 2018, when it was sworn ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "He became prime minister in <strong>August 2018</strong> following a challenge by the right wing of the party to the leadership of Malcolm Turnbull, who stepped down as party leader and prime minister.",
    "published": "August 30, 2018"
  }
]