[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "In January 2015, Sergio Mattarella, a veteran left-wing Christian Democrat and founding member of the PD, whose candidacy had been proposed by Renzi and unanimously endorsed by the party&#x27;s delegates, was elected President of Italy during a presidential election triggered by President Giorgio Napolitano&#x27;s resignation.",
    "published": "1 day ago"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "The party was founded in 2007 as a result of the convergence of <strong>the Democrats of the Left (direct heirs of the Italian Communist Party) and the Margherita (heir to part of Christian Democracy).</strong>",
    "published": null
  },
  {
    "title": "Democratic Party | political party, Italy | Britannica",
    "url": "https://www.britannica.com/topic/Democratic-Party-political-party-Italy",
    "snippet": "…party, known simply as the Democratic Party (Partito Democratico), emerged when <strong>the DS merged with the centrist Daisy (Margherita) party</strong>. Soon afterward the FI joined with the AN to create the new center-right People of Freedom (Popolo della ...",
    "published": null
  },
  {
    "title": "Democratic Party - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q47729",
    "snippet": "Partito Democratico (Italian) 1 ... · participant in · 2020 Italian regional elections · 0 references · founded by · <strong>Walter Veltroni</strong> · 0 references · position held by head of the organization ·...",
    "published": null
  },
  {
    "title": "The Democrats (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Democrats_(Italy)",
    "snippet": "The party was launched in 1999 by <strong>Romano Prodi</strong>, a few months after his dismissal as Prime Minister and leader of The Olive Tree coalition. Three parties merged into The Democrats: the Democratic Union, Italy of Values and The Network.",
    "published": "October 26, 2024"
  }
]