[
  {
    "title": "Le programme de Jean-Luc Mélenchon en version courte - Le programme",
    "url": "https://programme.lafranceinsoumise.fr/programme-version-courte/",
    "snippet": "« L’Union Populaire, au travers de son programme l’Avenir En Commun et de son nouveau livret Santé, confirme son leadership dans ce domaine. » · Laurent Thines, praticien hospitalier en neurochirurgie au CHRU de Besançon, Collectif Inter-Hôpitaux · « Les engagements de Jean-Luc Mélenchon pour les animaux se sont traduits par des actes grâce aux députés insoumis.",
    "published": "January 30, 2024"
  },
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "Jean-Luc Antoine Pierre Mélenchon ... Assembly for the 4th constituency of Bouches-du-Rhône from 2017 to 2022 and <strong>led the La France Insoumise group in the National Assembly from 2017 to 2021</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "Beginning in late 2018, Mélenchon and the leadership of La France Insoumise made a significant shift by <strong>abandoning their sovereigntist and ultra-secularist stances</strong>. This decision led to the expulsion of key members, marking a clear change in the party&#x27;s ideological direction.",
    "published": "5 days ago"
  },
  {
    "title": "France in Crisis: an Interview with Jean Luc Melenchon and La France Insoumise - CounterPunch.org",
    "url": "https://www.counterpunch.org/2025/10/29/france-in-crisis-an-interview-with-jean-luc-melenchon-and-la-france-insoumise/",
    "snippet": "The personality most identified with it is Jean Luc Melenchon, who has <strong>run for president three times, the last time in 2022, when he gathered 21.9 percent of the votes</strong>, finishing third after second-placer Marine Le Pen of National Rally and ...",
    "published": "October 29, 2025"
  },
  {
    "title": "La France insoumise - Accueil - La France insoumise",
    "url": "https://lafranceinsoumise.fr/",
    "snippet": "JE REJOINS J&#x27;habite hors de France À LA UNE Le programme l&#x27;Avenir en commun édition 2025 Retrouvez le programme À LA UNE Signez la pétition pour la",
    "published": "September 16, 2025"
  }
]