[
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "<strong>Marcelo Nuno Duarte Rebelo de Sousa GColTE GCIH ComSE</strong> (European Portuguese: [mɐɾˈsɛlu ʁɨˈβelu ðɨ ˈsozɐ]; born 12 December 1948) is a Portuguese politician and academic who has been the president of Portugal since 2016. He is a member of the Social Democratic Party, though he suspended ...",
    "published": "6 days ago"
  },
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "<strong>Marcelo Rebelo de Sousa</strong> was elected President of the Republic for the first time on 24 January 2016 and took office on 9 March. He was re-elected for a second term on 24 January 2021 and took office on 9 March of the same year.",
    "published": null
  },
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "This and other abilities imply ... instead as a sort of &quot;moderating power&quot; among the traditional three. The current president of Portugal is <strong>Marcelo Rebelo de Sousa</strong>, who took office on 9 March 2016....",
    "published": "1 week ago"
  },
  {
    "title": "Presidential Election 2021 Portugal",
    "url": "https://www.robert-schuman.eu/en/monitor/1876",
    "snippet": "Incumbent President of the Republic, <strong>Marcelo Rebelo de Sousa</strong> was re-elected on 24 January for a second term as Portugal&#x27;s head of State in the first round of voting. He took 60.7% of the vote, well ahead of Ana Gomes (Socialist Party), who was ...",
    "published": null
  },
  {
    "title": "Portugal's president invites caretaker PM to lead new government | Reuters",
    "url": "https://www.reuters.com/world/europe/portugals-president-invites-caretaker-pm-lead-new-government-2025-05-29/",
    "snippet": "LISBON, May 29 (Reuters) - Portugal&#x27;s president named <strong>Luis Montenegro</strong>, head of the centre-right Democratic Alliance (AD) that won a snap national election on May 18, as the prime minister on Thursday and invited him to form his second minority ...",
    "published": "May 29, 2025"
  }
]