[
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "The two-year mandate will start on <strong>1 January 2026</strong>. Solomon is no newcomer to the Academy board, since she served for 6 years as deputy chair herself alongside outgoing chair Mike Downey, and was a regular board member before.",
    "published": "2 weeks ago"
  },
  {
    "title": "Romania’s Ada Solomon elected chair of European Film Academy board | News | Screen",
    "url": "https://www.screendaily.com/news/romanias-ada-solomon-elected-chair-of-european-film-academy-board/5211635.article",
    "snippet": "Romanian producer Ada Solomon has ... Darras have both been elected as deputy chairs. Their two-year mandate will start on <strong>January 1, 2026</strong>....",
    "published": "2 weeks ago"
  },
  {
    "title": "Romanian Producer Ada Solomon Elected New Chair of EFA’s Board - FilmNewEurope.com",
    "url": "https://filmneweurope.com/news/region/item/127511-romanian-producer-ada-solomon-elected-new-chair-of-efa-s-board",
    "snippet": "BERLIN: Romanian producer Ada Solomon ... Petit and French consultant Matthieu Darras. Their two-year mandate will start on <strong>1 January 2026</strong>....",
    "published": "2 weeks ago"
  },
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "<strong>Founded in 1989</strong> by Ingmar Bergman and a group of leading European filmmakers, the European Film Academy promotes the interests of the continent’s film industry. Its leadership has included Wim Wenders, Agnieszka Holland, and, since 2024, Juliette ...",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "The two-year mandate will start on <strong>1 January 2026</strong>. Solomon has served on the Academy board for six years as deputy chair herself alongside outgoing chair Mike Downey, and was a regular board member before.",
    "published": "2 weeks ago"
  }
]