[
  {
    "title": "Westfalenstadion - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Westfalenstadion",
    "snippet": "In order to reduce debt, the naming rights to the stadium was sold to an insurance company, Signal Iduna.. Since 2005, the stadium has been known as the &quot;<strong>Signal Iduna Park</strong>&quot;. During the 2006 FIFA World Cup, the stadium was called &quot;FIFA World Cup Stadium, Dortmund&quot; since Signal Iduna was not FIFA&#x27;s sponsor.",
    "published": "1 week ago"
  },
  {
    "title": "Signal Iduna Park (2025) - All You Need to Know BEFORE You Go (with Reviews)",
    "url": "https://www.tripadvisor.com/Attraction_Review-g187372-d1965679-Reviews-Signal_Iduna_Park-Dortmund_North_Rhine_Westphalia.html",
    "snippet": "By far the most exciting and iconic stadium I&#x27;ve ever been to, considering the background and the team it hosts. The atmosphere outside is crazy, the look inside is impressive. High and steep stands, wherever you are you are attached to the field and enjoy a great view. Not to mention the vast parking areas for cars and bicycles, equipped with kits for any needs.",
    "published": null
  },
  {
    "title": "SIGNAL IDUNA PARK - Informationen",
    "url": "https://www.signal-iduna-park.de/en/infos.htm",
    "snippet": "The page summarises information and useful tips on how to get there, parking options and much more. Before you enter the ground and the barcode on your ticket is scanned at the turnstiles, you have to undergo a short security check where you and your bag are checked for dangerous objects. These include, among other things, bottles, laser pointers, fireworks and of course weapons of any kind. All details can be found in the stadium regulations. At SIGNAL IDUNA PARK, cashless payments can be made at all stationary sales stands using a debit or credit card and the usual mobile payment providers.",
    "published": null
  },
  {
    "title": "Signal Iduna Park: Borussia Dortmund’s Yellow Walled home | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/signal-iduna-park-borussia-dortmund-s-stadium-yellow-wall-5280",
    "snippet": "The Signal Iduna Park is <strong>a monster of a stadium</strong>. Borussia Dortmund’s 81,365-capacity home is one of the world’s most iconic grounds, boasting the highest average attendance in Europe and providing an atmosphere envied across sports for the ...",
    "published": "March 22, 2024"
  },
  {
    "title": "SIGNAL-IDUNA-PARK - Updated December 2025 - 253 Photos & 119 Reviews - Strobelallee 50, Dortmund, Nordrhein-Westfalen, Germany - Stadiums & Arenas - Yelp",
    "url": "https://www.yelp.com/biz/signal-iduna-park-dortmund",
    "snippet": "119 reviews and 253 photos of SIGNAL-IDUNA-PARK &quot;Home stadio of Borussia Dortmund know for it&#x27;s great atmosphere. It became even more entertaining with the new trainer Jürgen Klopp who is known for entertaining soccer from Mainz. Furthermore it is interessting to watch games against local rival Schalke 04&quot;",
    "published": "January 25, 2020"
  }
]