[
  {
    "title": "| International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/",
    "snippet": "The book &quot;Mathematicians of the World, Unite!&quot; by G. Curbera is now electronically available on the IMU website. For more information click here · If you want to subscribe to IMU News, please click on the button. ... In preparation for the IMU General Assembly in July 2026, the Adhering Organizations of IMU Members are asked to appoint and certify their delegations to the Secretary General. See AO CL 9/2025.",
    "published": null
  },
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The International Mathematical Union is administered by an executive committee (EC) which conducts the business of the Union. The EC consists of the President, two vice-presidents, the Secretary, six Members-at-Large, all elected for a term of four years, and the Past President.",
    "published": "February 24, 2025"
  },
  {
    "title": "IMU News 132: July 2025 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/imu-news/archive/2025/imu-news-132-july-2025",
    "snippet": "The framed photograph is from 2002, when Chairman Jiang Zemin and Vice-Premier Li Lanqing received mathematicians during the ICM in Beijing, including Palis, then the President of the IMU. Photo credit: Paula Dugin · <strong>Jacob Palis</strong> passed away on May 7, 2025, at the age of 85, in Rio de Janeiro, ...",
    "published": null
  },
  {
    "title": "ICMI Newsletter - March 2023 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/icmi/icmi-newsletter-march-2023",
    "snippet": "The International Commission on Mathematical Instruction (ICMI) launches the first two steps of the Process of Election of the ICMI Executive Committee (EC) for the 2025-2028 term in office: <strong>Professor Abraham Arcavi</strong> was appointed as the Chairperson of the Nominating Committee (NC) that is in ...",
    "published": null
  },
  {
    "title": "ICM 2026 - International Congress of Mathematicians in Philadelphia",
    "url": "https://www.mathunion.org/icm/icm-2026",
    "snippet": "The ICM Structure Committee for ICM 2026 was constituted in late 2022 with Terence Tao continuing as Chair. It issued a report regarding the ICM 2026 scientific program in October 2023. In August 2025, <strong>Martin Hairer</strong> assumed the role of Chair, with Terence Tao continuing as a regular member-at-large.",
    "published": null
  }
]