[
  {
    "title": "Ines Schwerdtner und Jan van Aken als Linken-Vorsitzende gewählt | tagesschau.de",
    "url": "https://www.tagesschau.de/inland/innenpolitik/neue-fuehrungsspitze-die-linke-100.html",
    "snippet": "<strong>Ines Schwerdtner und Jan van Aken sind neue Vorsitzende der Linkspartei</strong>.",
    "published": "October 19, 2024"
  },
  {
    "title": "Bundesparteitag in Halle: Ines Schwerdtner und Jan van Aken führen künftig die Linke | rbb24",
    "url": "https://www.rbb24.de/politik/beitrag/2024/10/ines-schwerdtner-jan-van-aken-neue-linke-vorsitzende-vorsitzende.html",
    "snippet": "<strong>Die Publizistin Schwerdtner erhielt 79,8 Prozent der Stimmen, der frühere Bundestagsabgeordnete van Aken sogar 88,0 Prozent</strong>. Das neue Führungs-Duo tritt damit die Nachfolge von Janine Wissler und Martin Schirdewan an, die beide nicht mehr ...",
    "published": null
  },
  {
    "title": "Die Linke: Ines Schwerdtner und Jan van Aken zu neuen Vorsitzenden gewählt - DER SPIEGEL",
    "url": "https://www.spiegel.de/politik/deutschland/die-linke-ines-schwerdtner-und-jan-van-aken-zu-neuen-vorsitzenden-gewaehlt-a-891affc4-8c68-476e-8885-85c8c84f0bd9",
    "snippet": "<strong>Die Journalistin Ines Schwerdtner und der frühere Bundestagsabgeordnete Jan van Aken sind neue Vorsitzende der Linken</strong>. Das neue Führungsduo wurde bei einem Bundesparteitag in Halle mit großer Mehrheit gewählt.",
    "published": "October 19, 2024"
  },
  {
    "title": "Schwerdtner und van Aken sind neue Vorsitzende der Linkspartei | politik&kommunikation",
    "url": "https://www.politik-kommunikation.de/personalwechsel/schwerdtner-und-van-aken-sind-neue-vorsitzende-der-linkspartei/",
    "snippet": "<strong>Ines Schwerdtner und Jan van Aken wurden am 19. Oktober zu den neuen Vorsitzenden der Partei Die Linke gewählt</strong>. Auf dem Parteitag in Halle (Saale) wurden die beiden mit 79,8 beziehungsweise 88,0 Prozent der Stimmen gewählt.",
    "published": "October 21, 2024"
  },
  {
    "title": "Ines Schwerdtner und Jan van Aken: Linken-Vorsitzende ...",
    "url": "https://www.handelsblatt.com/politik/deutschland/ines-schwerdtner-und-jan-van-aken-linken-vorsitzende-spenden-ihr-gehalt/100081508.html",
    "snippet": "Please enable JavaScript to continue using this application",
    "published": null
  }
]