[
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman bin Abdulaziz Al Saud (Arabic: سلمان بن عبد العزيز آل سعود; born 31 December 1935) is <strong>King of Saudi Arabia</strong>, a position he has held since 2015. He was also Prime Minister of Saudi Arabia from 2015 to 2022. He is the 25th son of King Abdulaziz, the founder of Saudi Arabia.",
    "published": "November 3, 2025"
  },
  {
    "title": "King Salman bin Abdulaziz Al Saud – House of Saud",
    "url": "https://houseofsaud.com/king-salman-bin-abdulaziz-al-saud/",
    "snippet": "The newly appointed King Salman issued the statement “His Highness Salman bin Abdulaziz Al Saud and all members of the family and the nation mourn Custodian of the Two Holy Mosques King Abdullah bin Abdulaziz, who <strong>passed away</strong> at exactly 1am ...",
    "published": null
  },
  {
    "title": "How rich is Saudi Arabia’s King Salman bin Abdulaziz Al Saud? Net worth in 2025 | World News - The Times of India",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/how-rich-is-saudi-arabias-king-salman-bin-abdulaziz-al-saud-net-worth-in-2025/articleshow/125961000.cms",
    "snippet": "While <strong>King Salman remains the official head of state</strong>, Mohammed bin Salman is widely seen as the de facto ruler driving the Vision 2030 agenda. Born as the 25th son of King Abdulaziz, Salman grew up in Marabba Palace in Riyadh.",
    "published": "7 hours ago"
  },
  {
    "title": "Salman bin Abdulaziz al-Saud | Today's latest from Al Jazeera",
    "url": "https://www.aljazeera.com/tag/salman-bin-abdulaziz-al-saud/",
    "snippet": "World leaders from US President Barack Obama to fellow Arab monarchs hail late king and his government’s policies. Salman, <strong>defence minister since 2011</strong>, takes the throne at age of 79 after demise of his half-brother King Abdullah.",
    "published": null
  },
  {
    "title": "Salman bin Abdul-Aziz Al-Saud - The Muslim 500",
    "url": "https://themuslim500.com/profiles/hm-king-salman-bin-abdul-aziz-al-saud/",
    "snippet": "HM King Salman bin Abdul-Aziz Al-Saud was proclaimed the <strong>seventh King of the Kingdom of Saudi Arabia</strong> in January 2015, following the death of his half-brother, King Abdullah. Prior to this, he served as Crown Prince from June 2012 and held numerous ...",
    "published": "May 27, 2018"
  }
]