[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Ventura ran for governor of Minnesota in 1998 as the Reform Party of Minnesota nominee (<strong>he later joined the Independence Party of Minnesota when the Reform Party broke from its association with the Reform Party of the United States of America</strong>).",
    "published": "3 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Ventura ran for governor of Minnesota in 1998. <strong>Ventura was elected as a member of the Reform Party, but later left and reorganized the Minnesota Reform Party as the Independence Party</strong>.[1] He did not seek a second term as governor.[2]",
    "published": null
  },
  {
    "title": "Governorship of Jesse Ventura | MNopedia",
    "url": "https://www.mnhs.org/mnopedia/search/index/event/governorship-jesse-ventura",
    "snippet": "This proposal went nowhere, but in his second and third legislative sessions, Ventura continued to have some successes: in tax reductions, reform of the property tax system, and more participation by the state in basic funding of the K-12 school system. He also prevailed in keeping planning for light rail transit alive, over Republican hostility. In 2000, he left the Minnesota Reform Party to lead the state’s new Independence Party.",
    "published": "April 14, 2025"
  },
  {
    "title": "Minnesota shouldn’t have to wait 25 more years for another third-party victory - MinnPost",
    "url": "https://www.minnpost.com/community-voices/2023/11/minnesota-shouldnt-have-to-wait-25-more-years-for-another-third-party-victory/",
    "snippet": "<strong>Ventura went on to leave the Reform Party and created his own party, the Independence Party of Minnesota</strong>. After his exit from the political scene, the Independence Party lacked the celebrity and notoriety of Jesse Ventura and has struggled to ...",
    "published": "February 6, 2024"
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "Citing political infighting and poor leadership, Ventura <strong>left the Reform Party in 2000 and subsequently joined the Independence Party</strong>. He decided not seek a second term as governor.",
    "published": "January 14, 2009"
  }
]