[
  {
    "title": "Mediocredito Centrale|Invitalia",
    "url": "https://www.invitalia.it/en/chi-siamo/il-gruppo/mediocredito-centrale",
    "snippet": "Mediocredito Centrale - Banca del Mezzogiorno was acquired by Invitalia in <strong>August 2017</strong> to develop synergies with the offer of incentives to enterprises and to promote growth policies.",
    "published": null
  },
  {
    "title": "Mediocredito Centrale 2025 Company Profile: Valuation, Funding & Investors | PitchBook",
    "url": "https://pitchbook.com/profiles/company/62465-14",
    "snippet": "Mediocredito Centrale has raised $963M. <strong>Invitalia has invested in Mediocredito Centrale</strong>.",
    "published": null
  },
  {
    "title": "Mcc. Melchiorre (FdI): Scritta pagina storica per Pmi - Agenparl",
    "url": "https://agenparl.eu/2025/05/27/mcc-melchiorre-fdi-scritta-pagina-storica-per-pmi/",
    "snippet": "Una testimonianza concreta in tal senso è rappresentata dall’accordo siglato tra Mediocredito centrale (Mcc), <strong>banca pubblica controllata da Invitalia</strong>, e Agart, la società partecipata dalle confederazioni",
    "published": "May 27, 2025"
  },
  {
    "title": "Legge di bilancio, molte le novità per Invitalia e MedioCredito Centrale - Invitalia",
    "url": "https://www.invitalia.it/chi-siamo/area-media/notizie-e-comunicati-stampa/legge-di-bilancio-novita-per-invitalia-e-mcc",
    "snippet": "Viene incrementa la dotazione del Fondo per la crescita sostenibile di 100 milioni di euro per ciascuno degli anni dal 2025 al 2035 per il finanziamento degli Accordi per l’innovazione gestiti da MedioCredito Centrale.",
    "published": null
  },
  {
    "title": "Invitalia: l'Agenzia nazionale per lo sviluppo d'impresa - Invitalia",
    "url": "https://www.invitalia.it/eng/who-we-are/the-agency/the-group",
    "snippet": "Banca del Mezzogiorno – Mediocredito Centrale BdM-MCC was <strong>acquired by Invitalia in August 2017</strong> to generate synergies by providing incentives in support of enterprises and to promote growth policies.",
    "published": null
  }
]