[
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "Askar Akayev was forced from office by the Tulip Revolution of 2005 and Kurmanbek Bakiyev was forced from office by the Kyrgyz Revolution of 2010. <strong>Almazbek Atambayev was peacefully succeeded by Sooronbay Jeenbekov in 2017.</strong> However, Jeenbekov resigned from office due to the 2020 Kyrgyzstani ...",
    "published": "November 11, 2025"
  },
  {
    "title": "Presidents Of Kyrgyzstan Since 1991 - WorldAtlas",
    "url": "https://www.worldatlas.com/articles/presidents-of-kyrgyzstan-since-1991.html",
    "snippet": "<strong>Askar Akayev was the president of Kyrgyzstan from October 27, 1990, until being overthrown on March 24, 2005.</strong> Akayev was a compromised candidate in the October 1991 elections after two presidential candidates were disqualified for not obtaining ...",
    "published": "April 25, 2019"
  },
  {
    "title": "Sadyr Japarov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sadyr_Japarov",
    "snippet": "Prior to Japarov taking charge, Kyrgyzstan was known for having a relatively open political climate compared to other post-Soviet states of Central Asia. He reintroduced a presidential system via constitutional and government system referendums which increased his executive powers to absolute and reduced the parliament&#x27;s influence, as well as creating the People&#x27;s Kurultai which resulted in Kyrgyzstan facing democratic backsliding.",
    "published": "2 weeks ago"
  },
  {
    "title": "List of leaders of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_leaders_of_Kyrgyzstan",
    "snippet": "The first column consecutively numbers the individuals who have served as president, while the second column consecutively numbers the presidential terms or administrations. President of Kyrgyzstan · Vice President of Kyrgyzstan · Prime Minister of Kyrgyzstan ·",
    "published": "October 3, 2025"
  },
  {
    "title": "Kyrgyzstan - Travels of the President - Travels - Department History - Office of the Historian",
    "url": "https://history.state.gov/departmenthistory/travels/secretary/kyrgyzstan",
    "snippet": "Kyrgyzstan - Travels of the President - Travels - Department History",
    "published": null
  }
]