[
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: ... Party (Партия Прогресса, Partiya Progressa), is a <strong>banned opposition political party</strong> in Russia founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018 by Alexei Navalny, who was also the founder ...",
    "published": "September 30, 2025"
  },
  {
    "title": "The political opposition in Russia - European Parliament",
    "url": "https://www.europarl.europa.eu/meetdocs/2014_2019/plmrep/COMMITTEES/AFET/DV/2020/11-27/Russian_opposition_background_note_2020_final_EN.pdf",
    "snippet": "Russia of the Future, initially known as the People&#x27;s Alliance and then as the Progress Party, is a · political party of the opposition in Russia. It was founded on 15 December 2012 by Leonid Volkov,",
    "published": null
  },
  {
    "title": "Russia of the Future - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q54553317",
    "snippet": "political party in Russia",
    "published": null
  },
  {
    "title": "Russian opposition party that wants Ukraine ceasefire vows to keep campaigning despite crackdown | Reuters",
    "url": "https://www.reuters.com/business/media-telecom/russian-opposition-party-that-wants-ukraine-ceasefire-vows-keep-campaigning-2025-12-15/",
    "snippet": "But <strong>two of the party&#x27;s deputy leaders, Maxim Kruglov and Lev Shlosberg, have been placed in pre-trial detention</strong> in recent months and accused of spreading lies about the Russian army, something they deny, and a third - Boris Vishnevsky - has ...",
    "published": "1 day ago"
  },
  {
    "title": "United Russia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/United_Russia",
    "snippet": "<strong>United Russia</strong> refused participate in any broadcast political debates, but on 1 October, it approved a program in which it promised to continue Putin&#x27;s political course. The electoral program was called &quot;Putin&#x27;s Plan: A Worthy Future for a Great ...",
    "published": "1 day ago"
  }
]