[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "On April 14, 1972, Trudeau&#x27;s father and mother hosted a gala at the National Arts Centre, at which visiting U.S. president Richard Nixon said, &quot;I&#x27;d like to toast the future prime minister of Canada, to <strong>Justin Pierre Trudeau</strong>&quot; to which Pierre Trudeau responded that should his son ever assume ...",
    "published": "4 days ago"
  },
  {
    "title": "Justin Trudeau | Biography, Facts, Resignation, & Father | Britannica",
    "url": "https://www.britannica.com/biography/Justin-Trudeau",
    "snippet": "He is the son of four-term prime minister <strong>Pierre Trudeau</strong>. His ‘rock star’ candidacy for the premiership in the 2015 election (‘Trudeaumania’) helped return the Liberals to relevance with a 184-seat majority.",
    "published": "June 7, 2013"
  },
  {
    "title": "Pierre Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pierre_Trudeau",
    "snippet": "In 1967, Trudeau was appointed as minister of justice and attorney general, during which time he liberalized divorce and abortion laws and decriminalized homosexuality. Trudeau&#x27;s outgoing personality and charisma caused a sensation, termed &quot;Trudeaumania&quot;, which helped him win the leadership of the Liberal Party in 1968. He then succeeded Pearson and became prime minister of Canada.",
    "published": "1 week ago"
  },
  {
    "title": "Prime Ministers of Canada",
    "url": "https://lop.parl.ca/sites/ParlInfo/default/en_CA/People/primeMinisters",
    "snippet": "This page provides general details on Canada&#x27;s prime ministers since 1867. For more information on an individual prime minister, including their electoral history and parliamentary roles, click on their name to view their complete profile",
    "published": null
  },
  {
    "title": "Pierre Elliott Trudeau | Biography, Accomplishments, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Pierre-Elliott-Trudeau",
    "snippet": "His terms in office were marked by the establishment of diplomatic relations with China (1970) and improved relations with France, the defeat of the French separatist movement, constitutional independence from the British Parliament, and the formation of a new Canadian constitution with the principal additions of a bill of rights and an amending formula. His son, Justin Trudeau, followed in his father’s footsteps, becoming Canadian prime minister in 2015.",
    "published": "July 28, 1999"
  }
]