[
  {
    "title": "Vincent Kompany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Vincent_Kompany",
    "snippet": "With two defeats, two goalless ... decided to step down from managerial duties on the pitch, to focus primarily on being a player. Head coach <strong>Simon Davies</strong> would be placed in charge of tactical changes and substitutions, while Kompany would be given the captain&#x27;s arm ...",
    "published": "2 days ago"
  },
  {
    "title": "The origins of Bayern Munich manager Vincent Kompany - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cwye2169wxvo",
    "snippet": "... German football journalist Seb Stafford-Bloor says it is over-simplistic to claim he has, &quot;failed upwards&quot; by taking the job in Munich. He compares Kompany&#x27;s appointment to <strong>Jurgen Klopp</strong> being hired by Borussia Dortmund in 2008, having led ...",
    "published": "February 12, 2025"
  },
  {
    "title": "Bundesliga | From Zlatko Čajkovski to Vincent Kompany: A history of Bayern Munich coaches",
    "url": "https://amp.bundesliga.com/en/bundesliga/news/a-history-of-bayern-munich-s-coaches-nagelsmann-flick-guardiola-heynckes-15694",
    "snippet": "<strong>Niko Kovac</strong> had already won the Bundesliga title as a player with Bayern, before repeating the feat as coach. Jupp Heynckes Tenures: 9 October 2017 - 30 June 2018; 1 July 2011 - 30 June 2013; 27 April 2009 - 30 June 2009; 1 July 1987 - 8 October ...",
    "published": "July 24, 2024"
  },
  {
    "title": "Vincent Kompany: 10 things on the Bayern Munich head coach | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/10-things-vincent-kompany-bayern-munich-coach-guardiola-man-city-27605",
    "snippet": "Bayern&#x27;s supervisory board member Karl-Heinz Rummenigge later revealed that the club even spoke to their former coach about the 38-year-old&#x27;s credentials: &quot;Pep gave us a big helping hand. He was full of praise, and his opinion means a lot to us.&quot; Kompany (r.) and Guardiola have a shared history together from their days at Manchester City.",
    "published": "April 2, 2025"
  },
  {
    "title": "Vincent Kompany: Who is Bayern’s new coach?",
    "url": "https://fcbayern.com/en/news/2024/05/vincent-kompany-who-is-bayern-new-coach",
    "snippet": "The central defender would then have spells at Hamburg and Manchester City before one final stint back at his boyhood club, which was also his first job as a coach. The 38-year-old was most recently in charge of English side Burnley. Kompany won 89 caps at senior level for Belgium, competing at two World Cups (2014 and 2018), as well as the 2008 Olympic Games in Beijing. Find out more about Bayern’s new Belgian boss here. Vincent Jean Mpoy Kompany first joined Anderlecht’s academy in 1992 before making his senior debut at the age of 17 in 2003.",
    "published": "May 29, 2024"
  }
]