[
  {
    "title": "Zaza Pachulia | Center | Atlanta Hawks",
    "url": "https://www.nba.com/player/2585/zaza-pachulia",
    "snippet": "Follow the action on NBA scores, schedules, stats, news, teams, and players. Buy tickets or watch the games anywhere with NBA League Pass.",
    "published": null
  },
  {
    "title": "Zaza Pachulia (Georgia) - Basketball Stats, Height, Age | FIBA Basketball",
    "url": "https://www.fiba.basketball/en/players/129927-zaza-pachulia",
    "snippet": "Explore the career and performances of Zaza Pachulia. Access all stats, latest news, photos, videos and achievements.",
    "published": null
  },
  {
    "title": "Zaza Pachulia News, Rumors, Updates - National Basketball Association | FOX Sports",
    "url": "https://www.foxsports.com/nba/zaza-pachulia-player",
    "snippet": "Get the latest NBA news on Zaza Pachulia. Stay up to date with National Basketball Association player news, rumors, updates, analysis, social feeds, and more at FOX Sports.",
    "published": null
  },
  {
    "title": "Warriors center Zaza Pachulia sidelined at least a week - NBA - ESPN",
    "url": "https://www.espn.com/espn/wire?section=nba&id=18600075",
    "snippet": "Pachulia said he knew he had hurt his shoulder on the play but finished the game. Once he cooled down, he noticed the pain. &quot;It&#x27;s not bad for him to miss a few games here and get some rest,&quot; coach Steve Kerr said. &quot;He&#x27;s definitely going to miss the next several games and we&#x27;ll go from there. I don&#x27;t think it&#x27;s anything that&#x27;s going to linger too long.&quot; He has made big strides since mid-December, so this is a minor setback -- though Pachulia is determined to make it a positive and use the time while receiving treatment to stay in shape and work to get stronger.",
    "published": null
  },
  {
    "title": "Zaza Pachulia NBA Stats & News",
    "url": "https://www.rotowire.com/basketball/player/zaza-pachulia-2391",
    "snippet": "His averages of 5.4 points, 4.7 rebounds and 1.6 assists were all down from a season prior, extending a three-year trend of shrinking production. With the Warriors set to move on from Pachulia, <strong>the big man now joins the Pistons on a one-year deal for the veteran&#x27;s minimum.</strong>",
    "published": null
  }
]