[
  {
    "title": "R. Nicholas Burns - Former Under Secretary of State for Political Affairs",
    "url": "https://georgewbush-whitehouse.archives.gov/government/nburns-bio.html",
    "snippet": "From 1995 to 1997, <strong>Ambassador Burns</strong> was Spokesman of the Department of State and Acting Assistant Secretary for Public Affairs for Secretary of State Warren Christopher and Secretary Madeleine Albright. In this position, he gave daily press conferences on U.S.",
    "published": null
  },
  {
    "title": "Under Secretary for Political Affairs - United States Department of State",
    "url": "https://www.state.gov/bureaus-offices/under-secretary-for-political-affairs/",
    "snippet": "The Under Secretary for Political Affairs serves as the day-to-day manager of overall regional and bilateral policy issues, and oversees the bureaus for Africa, East Asia and the Pacific, Europe and Eurasia, the Near East, South and Central Asia, the Western Hemisphere, Counterterrorism and ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Under Secretaries of State for Political Affairs - Principal Officers - People - Department History - Office of the Historian",
    "url": "https://history.state.gov/departmenthistory/people/principalofficers/under-secretary-for-political-affairs",
    "snippet": "In an Act of July 13, 1972, Congress established separate and permanent positions at the Under Secretary of State level for Economic Affairs and for Political Affairs in the Foreign Relations Authorization Act (Public Law 92-352; 86 Stat. 490). The Under Secretary for Political Affairs, assists the Secretary and Deputy Secretary (previously the Under Secretary) in the formulation and conduct of U.S.",
    "published": null
  },
  {
    "title": "Under Secretary of State for Political Affairs - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Under_Secretary_of_State_for_Political_Affairs",
    "snippet": "Prior to the creation of the position of under secretary of state for political affairs in August 1959, the deputy under secretary for political affairs assisted the secretary and under secretary of state in the formulation and conduct of U.S. foreign policy.",
    "published": "September 17, 2025"
  },
  {
    "title": "David Hale (diplomat) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hale_(diplomat)",
    "snippet": "<strong>David Maclain Hale</strong> (born 1961) is an American diplomat and career ambassador, who previously served as the United States Under Secretary of State for Political Affairs. He is currently a Distinguished Diplomatic Fellow at the Middle East Institute.",
    "published": "November 16, 2025"
  }
]