[
  {
    "title": "Stellantis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stellantis",
    "snippet": "Stellantis N.V. is a multinational ... Fiat and the US-based Chrysler, completed in stages between 2009 and 2014. Stellantis is headquartered in <strong>Hoofddorp, Netherlands</strong>, while the CEO now operates from Auburn Hills, Michigan....",
    "published": "2 days ago"
  },
  {
    "title": "Fiat Chrysler Automobiles - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_Chrysler_Automobiles",
    "snippet": "FCA&#x27;s mass-market brands operated through two main subsidiaries: <strong>FCA Italy (previously Fiat Group Automobiles) with headquarters in Turin</strong>, and FCA US (previously Chrysler Group) in Auburn Hills, Michigan. The company&#x27;s portfolio included brands Abarth, Alfa Romeo, Chrysler, Dodge, Fiat, Fiat ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Chrysler - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chrysler",
    "snippet": "FCA US, LLC, doing business as Stellantis North America and known historically as Chrysler (/ˈkraɪslər/ KRY-slər), is one of the &quot;Big Three&quot; automobile manufacturers in the United States, headquartered in <strong>Auburn Hills, Michigan</strong>. It is the American subsidiary of the multinational automotive ...",
    "published": "1 week ago"
  },
  {
    "title": "Goodbye Fiat Chrysler Automobiles, Hello Stellantis: - MoparInsiders",
    "url": "https://moparinsiders.com/goodbye-fiat-chrysler-automobiles-hello-stellantis/",
    "snippet": "Under its new identity, Stellantis ... Opel, Peugeot, RAM, and Vauxhall. The new company headquarters will be based in <strong>Amsterdam, Netherlands</strong>. According to our sources, most of the current operations of the former FCA entity will ...",
    "published": "October 18, 2023"
  },
  {
    "title": "Stellantis | History, Brands, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Stellantis",
    "snippet": "Stellantis is a multinational automotive company formed in 2021 by the merger of Fiat Chrysler and PSA Group (known legally as Peugeot S.A.). The company has 14 well-known automobile brands, including Dodge, Jeep, and Maserati. Stellantis is headquartered in Amsterdam.",
    "published": null
  }
]