[
  {
    "title": "Socialist Party (France) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Socialist_Party_(France)",
    "snippet": "The PS is a member of the Party of European Socialists, Progressive Alliance and Socialist International. The PS was founded in 1969 from a merger of the French Section of the Workers&#x27; International (SFIO), the Convention of Republican Institutions led by <strong>François Mitterrand</strong>, and other groups.",
    "published": "4 weeks ago"
  },
  {
    "title": "Socialist Party (PS) | Britannica",
    "url": "https://www.britannica.com/topic/Socialist-Party-France",
    "snippet": "Its predecessor parties, formed in the 19th century, drew inspiration from political and social theorists such as <strong>Charles Fourier, Henri de Saint-Simon, François-Noël Babeuf, Auguste Blanqui, and Louis Blanc</strong>.",
    "published": "July 20, 1998"
  },
  {
    "title": "Socialist Party, France - Oxford Reference",
    "url": "https://www.oxfordreference.com/display/10.1093/oi/authority.20110803100515255",
    "snippet": "Formed in 1905, the SFIO (Section Française de l&#x27;Internationale Ouvrière, French Section of the Socialist International) united the hitherto fragmented socialist groups. These included the Marxists under J. Guesde, the revolutionary socialists, and the pragmatic socialists whose outstanding figure was Jaurès. The party had considerable success, gaining 104 seats in the Chamber of Deputies in 1914.",
    "published": null
  },
  {
    "title": "Socialist Party of France (1902) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Socialist_Party_of_France_(1902)",
    "snippet": "The Socialist Party of France (Parti socialiste de France) was a socialist political party. The party was founded in 1902 during a congress in Commentry by the merger of the Marxist French Workers&#x27; Party led by <strong>Jules Guesde and the Blanquist Socialist Revolutionary Party of Édouard Vaillant</strong>.",
    "published": "September 21, 2025"
  },
  {
    "title": "French Socialist Party (1902) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/French_Socialist_Party_(1902)",
    "snippet": "The PSF came from the merger of the possibilist Federation of the Socialist Workers of France (FTSF), Jean Allemane&#x27;s Revolutionary Socialist Workers&#x27; Party (POSR), and some independent socialist politicians like <strong>Jean Jaurès</strong>, who went on to become the party&#x27;s leader.",
    "published": "4 days ago"
  }
]