[
  {
    "title": "John Garamendi - Ballotpedia",
    "url": "https://ballotpedia.org/John_Garamendi",
    "snippet": "Garamendi earned a B.A. from the University of California at Berkeley in 1966 and an M.B.A. from Harvard University in 1970. His career experience includes working as the <strong>deputy secretary of the United States Department of the Interior</strong>, a businessman, and a rancher.",
    "published": null
  },
  {
    "title": "John Garamendi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Garamendi",
    "snippet": "John Raymond Garamendi (/ˌɡærəˈmɛndi/ GARR-ə-MEN-dee; born January 24, 1945) is an American businessman, politician and <strong>member of the Democratic Party</strong> who has represented areas of Northern California between San Francisco and Sacramento, including the cities of Fairfield and Vacaville ...",
    "published": "2 weeks ago"
  },
  {
    "title": "About John Garamendi | Congressman John Garamendi",
    "url": "https://garamendi.house.gov/about",
    "snippet": "<strong>From 1991 to 1995, and again from 2003 to 2006, Garamendi served as the California Insurance Commissioner</strong>, earning a reputation as the most effective protector of consumer interests in the nation. He successfully forced insurance companies to pay claims to policyholders and significantly curtailed ...",
    "published": "August 22, 2023"
  },
  {
    "title": "John Garamendi | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/john-garamendi/G000559",
    "snippet": "John Garamendi, the Representative from California - <strong>in Congress from 2009 through Present</strong>",
    "published": null
  },
  {
    "title": "John Garamendi for Congress | John Garamendi",
    "url": "https://www.garamendi.org/",
    "snippet": "<strong>Elected to the state legislature in 1974</strong>, Garamendi’s first legislation was the Rural Health Act of California to ensure that underserved residents in rural communities had access to quality health care.",
    "published": null
  }
]