[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "Can <strong>made his debut for die Werkself on 31 August 2013</strong>, coming on as an 80th-minute substitute for Stefan Reinartz in a 2–0 defeat at FC Schalke 04. His first goal for the club came on 26 October when he scored the winner against FC Augsburg in a 2–1 victory.",
    "published": "2 days ago"
  },
  {
    "title": "Emre Can",
    "url": "https://www.bvb.de/de/en/teams/football/player/emre-can.html",
    "snippet": "The years abroad were cool.” ... for the starting line-up after a change of coach in the 2019/20 season. Emre Can has <strong>played for all of Germany&#x27;s youth national teams since the U15s</strong> and made his debut for the senior national team on 4 September 2015 in his hometown of Frankfurt ...",
    "published": null
  },
  {
    "title": "Liverpool career stats for Emre Can - LFChistory - Stats galore for Liverpool FC!",
    "url": "https://www.lfchistory.net/Players/Player/Profile/1272",
    "snippet": "Other clubs: <strong>Bayern Munich (2009-13), Bayer Leverkusen (2013-14), Juventus (2018-), Borussia Dortmund (loan 2020), Borussia Dortmund (2020-)</strong> ... International debut: 04.09.2015 vs. Poland · International caps: 37/1 (20/1 at LFC) - 29.06.2021 ... Emre Can was born in Frankfurt am Main, the ...",
    "published": null
  },
  {
    "title": "Emre Can – Exceptional talent at Borussia Dortmund and Germany's national team",
    "url": "https://www.emrecan.com/index.en.html",
    "snippet": "I have almost spent my whole youngster career at <strong>FC Bayern Munich</strong>. From the U17 to the first team, I have gone through all stages in this great club which is one of the biggest sports clubs worldwide.",
    "published": null
  },
  {
    "title": "Liverpool FC — Emre Can",
    "url": "https://www.liverpoolfc.com/info/emre-can",
    "snippet": "<strong>2014-15 saw Can emerge as one of the Premier League&#x27;s best young players</strong>, with assured performances in both defence and defensive midfield belying his tender years. His first Liverpool goal came against Chelsea in November 2014, and he continued ...",
    "published": null
  }
]