[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "If so, the president may serve as both the head of state and de facto head of government, while the prime minister serves as his deputy, acting as a link between the legislature and the executive. The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 ...",
    "published": "1 day ago"
  },
  {
    "title": "Welcome to the website of the French Presidency",
    "url": "https://www.elysee.fr/en/",
    "snippet": "5 December 2025 Joint Statement between the French Republic and the People’s Republic of China on the situation on Ukraine and the situation on Palestine. 25 November 2025 Chairs’ statement following 25 November Coalition of the Willing Leaders’ meeting.",
    "published": null
  },
  {
    "title": "France has a new government. Here’s what it needs to do now | PBS News",
    "url": "https://www.pbs.org/newshour/world/france-has-a-new-government-heres-what-it-needs-to-do-now",
    "snippet": "The government, put together by newly named Prime Minister <strong>Francois Bayrou</strong>, includes members of the outgoing conservative-dominated team and new figures from centrist or left-leaning backgrounds.",
    "published": "December 23, 2024"
  },
  {
    "title": "France: 2025, Looking Ahead - L&E Global",
    "url": "https://leglobal.law/countries/france/looking-ahead-2025-france/",
    "snippet": "The unstable political situation in France makes it difficult to anticipate future legislative changes in 2025. Following the fall of the government formed under former Prime Minister Michel Barnier, a new government was announced on 23 December 2024 under the new Prime Minister, <strong>François Bayrou</strong>.",
    "published": "June 26, 2025"
  },
  {
    "title": "Emmanuel Macron | Biography, Political Party, Age, Presidency, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Emmanuel-Macron",
    "snippet": "9, 2025, 5:08 PM ET (AP) Show less ... <strong>Emmanuel Macron</strong> (born December 21, 1977, Amiens, France) is a French banker and politician who was elected president of France in 2017. Macron was the first person in the history of the Fifth Republic to ...",
    "published": "May 12, 2017"
  }
]