[
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "Lecornu was appointed Prime Minister on 9 September 2025 by President Emmanuel Macron. He succeeded <strong>François Bayrou</strong>, who was forced to resign on the same day following the failure of a vote of confidence in the National Assembly the day before. Shortly after his appointment, Le Figaro and ...",
    "published": "1 week ago"
  },
  {
    "title": "Sondage : Sébastien Lecornu rechute lourdement dans l’opinion",
    "url": "https://www.lefigaro.fr/politique/sondage-sebastien-lecornu-sans-soutien-populaire-20251204",
    "snippet": "Les augmentations d’impôts et de taxes, touchant les classes moyennes, le comportement des élus du bloc central qui annoncent, notamment chez Horizons d’Édouard Philippe, qu’ils ne peuvent voter mardi prochain en faveur du projet de loi de financement de la sécurité sociale, jusqu’aux propos du premier ministre estimant que ce n’est pas le budget du gouvernement, mais celui des parlementaires, ont contribué à brouiller le message. Résultat pour Sébastien Lecornu, les sympathisants Républicains (57 % ne lui font pas confiance, + 14 points)…",
    "published": "3 weeks ago"
  },
  {
    "title": "Et si Sébastien Lecornu était l’homme de 2027 ?",
    "url": "https://www.lepoint.fr/politique/et-si-sebastien-lecornu-etait-lhomme-de-2027-W6EUTKLUMNHAJDNH5QZVDA6ZKQ/",
    "snippet": "Dans le grand flou des offres qui commence à inquiéter même les plus militants, Lecornu le Français moyen, le petit provincial, l’homme des territoires, n’aurait-il pas une carte à jouer ? Et surtout, ne serait-il le seul à pouvoir rassembler la droite, le centre et une partie de la gauche, pour éviter l’arrivée au pouvoir du Rassemblement national ? Cela, sans agiter la rengaine éculée du Front républicain ? Et si c’était lui ? Grand paradoxe : Sébastien Lecornu est la face inversée d’Emmanuel Macron, flamboyant jusqu’à l’arrogance, brillant jusqu’à l’outrance.",
    "published": "1 day ago"
  },
  {
    "title": "Lecornu lives to fight another day, but the outlook for France remains bleak – POLITICO",
    "url": "https://www.politico.eu/article/sebastien-lecornu-france-budget/",
    "snippet": "It all looked rather bleak for France a little over a week ago, as President Emmanuel Macron’s former Prime Minister <strong>Edouard Philippe</strong> seemingly wrecked his successor’s deficit-cutting strategy.",
    "published": "2 weeks ago"
  },
  {
    "title": "French PM Lecornu faces high-stakes dilemma on 2026 budget",
    "url": "https://www.lemonde.fr/en/politics/article/2025/12/22/french-pm-lecornu-faces-high-stakes-dilemma-on-2026-budget_6748756_5.html",
    "snippet": "&quot;Special law&quot; or Article 49.3? Less than 48 hours before Parliament hit the deadline to decide on a 2026 state budget bill, the answer is still uncertain. Officially, French Prime Minister Sébastien Lecornu refuses to use Article 49.3, a constitutional measure that allows the government to pass a bill without a vote.",
    "published": "13 hours ago"
  }
]