[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "A season later, he was signed by Premier League club Liverpool for £9.75 million where he made over 150 appearances across all tiers of competition and would join Juventus in 2018. <strong>In 2020 he was loaned to Borussia Dortmund; a few weeks later he moved to the team under a permanent deal</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Borussia Dortmund holt Emre Can von Juventus Turin | Bundesliga",
    "url": "https://www.bundesliga.com/de/bundesliga/news/borussia-dortmund-juventus-turin-transfer-emre-can-9686",
    "snippet": "Wie der Verein am Dienstag vor dem 2:1-Sieg im Champions-League-Achtelfinale gegen Paris St. Germain bekannt gab, <strong>wird der von Juventus Turin zunächst ausgeliehene Nationalspieler im Sommer fest verpflichtet</strong>.",
    "published": "February 17, 2020"
  },
  {
    "title": "Emre Can: Borussia Dortmund complete permanent transfer with Juventus | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11899/11937316/emre-can-borussia-dortmund-complete-permanent-transfer-with-juventus",
    "snippet": "<strong>Borussia Dortmund have signed Emre Can on a four-year deal after activating an option to make the midfielders loan from Juventus permanent</strong>.",
    "published": "February 18, 2020"
  },
  {
    "title": "Emre Can joins Borussia Dortmund on a permanent basis - Juventus",
    "url": "https://www.juventus.com/en/news/articles/emre-can-joins-borussia-dortmund-on-a-permanent-basis2",
    "snippet": "Turin, 18 February 2020 - Juventus ... provided by the contract, <strong>the obligation for the definitive acquisition of the registration rights of the player Emre Can by Borussia Dortmund GmbH &amp; Co.</strong>...",
    "published": null
  },
  {
    "title": "Emre Can joins Borussia Dortmund from Juventus on initial loan | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11899/11922322/emre-can-joins-borussia-dortmund-from-juventus-on-initial-loan",
    "snippet": "<strong>Borussia Dortmund have signed Emre Can from Juventus on Deadline Day on an initial loan</strong>.",
    "published": "February 1, 2020"
  }
]