[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Soon afterwards, some of Navalny&#x27;s personal emails were posted online by a pro-government blogger. On 26 June 2012, it was announced that Navalny&#x27;s comrades would establish a new political party based on e-democracy; Navalny declared he did not plan to participate in this project at the moment.",
    "published": "2 days ago"
  },
  {
    "title": "Alexei Navalny’s wife and political heir still has ‘big hopes’ for Russia",
    "url": "https://www.politico.eu/article/alexei-navalny-yulia-navalnaya-political-heir-big-hopes-russia/",
    "snippet": "Even after Navalny’s death, Russian authorities have continued to crack down on associates of the late politician.",
    "published": "5 days ago"
  },
  {
    "title": "Alexei Navalny’s rise from blogger to Putin’s chief rival: Timeline",
    "url": "https://thehill.com/policy/international/4473313-alexei-navalny-life-death-timeline/",
    "snippet": "Navalny also joins the Russian ... <strong>liberal political party</strong>. In 2001, Navalny goes to work for the headquarters for deputy elections of the State Duma, the lower house of Russia’s federal parliament.",
    "published": "February 16, 2024"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "Despite his expulsion from the <strong>Yabloko party</strong>, Navalny continued being active in politics, protesting against corruption and fraud during the parliamentary elections, and against Vladimir Putin, who Navalny predicted would run.",
    "published": null
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. In 2000, while he was still a student, Navalny joined <strong>Yabloko</strong>, ...",
    "published": "March 7, 2023"
  }
]