[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "In 1992, she was awarded a Ph.D. ... of Dallas L. Rabenstein. Larive <strong>began her career as a professor in the chemistry department at the University of Kansas, and later joined the faculty of the University of California, Riverside, in 2005.</strong>...",
    "published": "July 15, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Larive is a first-generation college graduate, earning her bachelor’s of science from South Dakota State University and her master’s from Purdue University, both in chemistry. She earned her Ph.D. in analytical chemistry from UC Riverside while raising her daughters, Erin and Megan, with her husband, Jim. Siendo la undécima rectora de la Universidad de California en Santa Cruz, Cynthia ...",
    "published": null
  },
  {
    "title": "UC Riverside Provost Cynthia K. Larive to become UC Santa Cruz’s 11th chancellor | University of California",
    "url": "https://www.universityofcalifornia.edu/press-room/uc-riverside-provost-cynthia-k-larive-become-uc-santa-cruzs-11th-chancellor",
    "snippet": "Cynthia K. Larive as the eleventh chancellor of UC Santa Cruz. Currently the provost and executive vice chancellor at UC Riverside, Larive has served the UC community for <strong>nearly a decade and a half</strong> as a faculty member, ...",
    "published": "November 8, 2021"
  },
  {
    "title": "Provost Cynthia K. Larive | Inside UCR",
    "url": "https://insideucr.ucr.edu/tag/provost-cynthia-k-larive",
    "snippet": "UC Riverside on Facebook UC Riverside on X UC Riverside on YouTube UC Riverside on Instagram UC Riverside on LinkedIn · When Cynthia K. Larive <strong>joined UC Riverside as a bioanalytical chemistry professor in 2005</strong>, she had no aspirations of an administrative role.",
    "published": null
  },
  {
    "title": "UCR Today: Cynthia K. Larive Named as UCR Provost",
    "url": "https://ucrtoday.ucr.edu/49547",
    "snippet": "Cindy Larive, left, <strong>started her faculty career at UCR in 2005.</strong> J.D. Warren Tel: (951) 827-4756 E-mail: john.warren@ucr.edu · Archived under: Inside UCR, Science/Technology, chemistry, Cynthia K. Larive, executive vice chancellor, first generation, ...",
    "published": "October 24, 2017"
  }
]