[
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "Marcelo Nuno Duarte Rebelo de Sousa GColTE GCIH ComSE (European Portuguese: [mɐɾˈsɛlu ʁɨˈβelu ðɨ ˈsozɐ]; born 12 December 1948) is a Portuguese politician and academic who has been the president of Portugal since 2016. He is a member of the Social Democratic Party, though he suspended his party membership for the duration of his presidency.",
    "published": "6 days ago"
  },
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "Prior to the Carnation Revolution, the powers of the presidency varied widely; some presidents were virtual dictators (such as Pais, and Carmona in his early years), while others were little more than figureheads (such as Carmona in his later years, Craveiro Lopes, and Américo Tomás). During the Estado Novo, the president was nominally vested with near-dictatorial powers, but in practice supreme power was held by the President of the Council of Ministers (António de Oliveira Salazar and Marcelo Caetano).",
    "published": "1 week ago"
  },
  {
    "title": "Portuguese presidents after Salazar's Estado Novo",
    "url": "https://euamoportugal.com/en/blogs/categories/history/portuguese-presidents",
    "snippet": "It was as &#x27;resident&#x27; commentator for the TVI television channel, however, that Professor Marcelo reached the homes of millions of Portuguese, building a reputation that earned him election in 2016, with 52% of the vote - over 2.4 million votes. The fate repeated itself in 2021, with 60.7% of the vote - over 2.5 million votes. Before Marcelo Rebelo de Sousa&#x27;s period as President of the Republic, Portugal lived, however, a decade marked by a strong economic crisis and its consequent recession.",
    "published": null
  },
  {
    "title": "Marcelo Rebelo de Sousa | president of Portugal | Britannica",
    "url": "https://www.britannica.com/biography/Marcelo-Rebelo-de-Sousa",
    "snippet": "Other articles where Marcelo Rebelo de Sousa is discussed: <strong>Aníbal Cavaco Silva</strong>: …succeeded by fellow Social Democrat Marcelo Rebelo de Sousa.",
    "published": null
  },
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "Marcelo Rebelo de Sousa was elected President of the Republic for the first time on 24 January 2016 and took office on 9 March. He was re-elected for a second term on 24 January 2021 and took office on 9 March of the same year. ... This tool also allows you to translate all the contents of this website into English and 17 other languages, including the News area, which is only available in Portuguese.",
    "published": null
  }
]