[
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://grokipedia.com/page/Anke_Domscheit-Berg",
    "snippet": "She <strong>served as a member of the Bundestag for Die Linke from 2017 to 2025</strong>, elected initially on the party list without prior membership before formally joining the party.[1] Wait, no wiki, skip that.",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anke_Domscheit-Berg",
    "snippet": "Anke Domscheit-Berg (née Domscheit; born 17 February 1968 in Premnitz) is a German politician and activist. She was <strong>a member of the Bundestag from 2017 to 2025</strong>. In 2017, she was elected on the party list of The Left, without being a party member. She joined the party in 2021 following her ...",
    "published": "August 13, 2025"
  },
  {
    "title": "Digitalexpertin vergleicht neue KI-Verordnung mit zahnlosem Tiger | MDR.DE",
    "url": "https://www.mdr.de/nachrichten/deutschland/politik/domscheit-berg-kritik-ki-gesetz-100.html",
    "snippet": "Wer ist Anke Domscheit-Berg Anke Domscheit-Berg ist eine deutsche Publizistin, ehemalige Unternehmerin und Politikerin. Von 2017-2025 war sie als digitalpolitische Sprecherin für &quot;Die Linke&quot; im Bundestag. <strong>Bei der Bundestagswahl 2025 trat sie nicht erneut an</strong>.",
    "published": "August 4, 2025"
  },
  {
    "title": "Anke Domscheit-Berg - Aktivistin, Publizistin, Mitglied des Deutschen Bundestages",
    "url": "https://mdb.anke.domscheit-berg.de/",
    "snippet": "<strong>Mitglied des Deutschen Bundestages Oktober 2017 – März 2025</strong> Mein BlogMedienecho ... Highlights aus den aktuellen Presseberichten. ... „Wir haben kein Geldmangelproblem und mehr Geld hilft nicht“, sagt auch Anke Domscheit-Berg, (Linksfraktion). Es brauche eher ein zentralgesteuertes ...",
    "published": "March 24, 2025"
  },
  {
    "title": "Anke Domscheit-Berg - Profil bei abgeordnetenwatch.de",
    "url": "https://www.abgeordnetenwatch.de/profile/anke-domscheit-berg",
    "snippet": "Anke Domscheit-Berg war <strong>Abgeordnete Bundestag 2021 - 2025</strong> (Fraktion: Die Linke. (Gruppe)) - ihre Antworten auf Ihre Fragen, Abstimmungsverhalten und Nebentätigkeiten finden Sie in diesem Profil.",
    "published": null
  }
]