[
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "Beginning in late 2018, Mélenchon and the leadership of La France Insoumise made a significant shift by abandoning their sovereigntist and ultra-secularist stances. This decision led to the expulsion of key members, marking a clear change in the party&#x27;s ideological direction. The 2022 L&#x27;Avenir en commun programme for the Popular Union includes a number of proposals, such as replacing capitalism. In August 2025, during the congress of France Insoumise, in Châteauneuf-sur-Isère, near Valence in the Drôme, the party called for a strike for 10 September 2025, to oppose the 2026 budget bill, presented by François Bayrou.",
    "published": "5 days ago"
  },
  {
    "title": "The Rise of France Insoumise",
    "url": "https://jacobin.com/2025/11/france-insoumise-hegemonic-left-democracy",
    "snippet": "France Insoumise activity does not have a single form. This is why, when it comes to forming a space of identified leadership for the movement, we wanted to represent this confederal structure. We thus have a national coordination of spaces. This is a body in which each space recognized by France Insoumise is represented and comes together once a week to discuss short-term objectives that the movement needs to take positions on.",
    "published": null
  },
  {
    "title": "Métropole de Lyon. Métropolitaines 2026 : la France Insoumise dévoile ses têtes de liste",
    "url": "https://www.leprogres.fr/elections/2025/12/09/metropolitaines-2026-la-france-insoumise-devoile-ses-tetes-de-liste",
    "snippet": "« <strong>La France insoumise portera un programme de rupture, et présente une liste pour faire mieux à la Métropole, avec des mesures concrètes pour changer la vie des gens</strong> » annonce le parti de Jean-Luc Mélenchon dans un communiqué.",
    "published": "2 weeks ago"
  },
  {
    "title": "France in Crisis: an Interview with Jean Luc Melenchon and La France Insoumise - CounterPunch.org",
    "url": "https://www.counterpunch.org/2025/10/29/france-in-crisis-an-interview-with-jean-luc-melenchon-and-la-france-insoumise/",
    "snippet": "La France Insoumise describes its orientation as democratic socialist and ecosocialist. The following is a composite interview. When he visited Paris in July 2025, Walden Bello interviewed some of the leaders of LFI, including Nadege Abomangoli, vice president of the National Assembly; Aurelie Trouve, chairwoman of the Economic Affairs Committee of the Assembly; and members of parliament Arnaud Le Gall, Aurelien Tache, and Aurelien Saintoul.",
    "published": "October 29, 2025"
  },
  {
    "title": "La France Insoumise Reaffirms Political Commitm... | France in English",
    "url": "https://franceinenglish.com/p/la-france-insoumise-reaffirms-political-commitments-ahead-of-2025-elections",
    "snippet": "• La France Insoumise pledges to uphold commitments made in June 2024. • Party leaders emphasize voter connection and accountability. • Political strategy focuses on social justice and environmental issues. • LFI aims for stronger representation in upcoming elections. Ahead of the upcoming partial legislative elections in 2025, La France Insoumise (LFI) has reiterated its dedication to the political commitments made to voters during the June 2024 elections.",
    "published": "August 29, 2025"
  }
]