[
  {
    "title": "Marcus Morris Sr. News, Rumors, Updates - New York Knicks | FOX Sports",
    "url": "https://www.foxsports.com/nba/marcus-morris-player",
    "snippet": "Signs with New York Marcus Morris will join <strong>the Knicks</strong> on a one-year deal, Shams Charania of The Athletic reports. Impact Morris rejoins <strong>the Knicks</strong> after appearing in 49 games between the 76ers and Cavaliers last season where he averaged 6.4 points and 2.7 rebounds in 16.7 minutes per game.",
    "published": null
  },
  {
    "title": "Marcus Morris Sr. Player Contract, Stats, Age and More | Lines.com",
    "url": "https://www.lines.com/nba/players/marcus-morris-sr-847",
    "snippet": "Notably, he played a crucial role in the <strong>Los Angeles Clippers</strong>&#x27; playoff runs, showcasing his scoring ability and defensive acumen. His career-high average of 19.6 points per game during the 2019-2020 season with the New York Knicks stands out as a testament to his offensive prowess.",
    "published": "August 4, 2025"
  },
  {
    "title": "Marcus Morris Sr. | New York Knicks | NBA.com",
    "url": "https://www.nba.com/player/202694/marcus-morris-sr",
    "snippet": "Morris will join <strong>the Knicks</strong> on a one-year deal, Shams Charania of The Athletic reports.",
    "published": null
  },
  {
    "title": "r/LAClippers on Reddit: Breaking: Marcus Morris Sr. Returns to the Clippers on Four-Year Deal",
    "url": "https://www.reddit.com/r/LAClippers/comments/1jp1bmc/breaking_marcus_morris_sr_returns_to_the_clippers/",
    "snippet": "225 votes, 43 comments. Breaking: Marcus Morris Sr. Returns to the Clippers on Four-Year Deal The <strong>Los Angeles Clippers</strong> have officially re-signed…",
    "published": "April 1, 2025"
  },
  {
    "title": "Who is Marcus Morris Sr.? | RevUpSports.com",
    "url": "https://revupsports.com/athletes/basketball/marcus-morris-sr/",
    "snippet": "He plays as a power forward/small forward for the <strong>Los Angeles Clippers</strong> of the National Basketball Association (NBA). Morris began his NBA career in 2011 after being selected 14th overall by the Houston Rockets. He has since played for several teams, including the Phoenix Suns, Detroit Pistons, ...",
    "published": null
  }
]