[
  {
    "title": "American Airlines Center",
    "url": "https://www.americanairlinescenter.com/",
    "snippet": "The <strong>American Airlines Center</strong> is the Dallas area&#x27;s Premier Sports and Entertainment arena, and home to the NHL&#x27;s Dallas Stars and NBA&#x27;s Dallas Mavericks.",
    "published": null
  },
  {
    "title": "American Airlines Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/American_Airlines_Center",
    "snippet": "<strong>American Airlines Center (AAC)</strong> is a multi-purpose indoor arena located in the Victory Park neighborhood in downtown Dallas, Texas. The arena serves as the home of the Dallas Stars of the National Hockey League and Dallas Mavericks of the National Basketball Association.",
    "published": "1 week ago"
  },
  {
    "title": "American Airlines Center",
    "url": "https://www.irvingtexas.com/listing/american-airlines-center/601/",
    "snippet": "The premier sports and entertainment venue of the Southwest. <strong>The American Airlines Center (AAC)</strong> is a multi-purpose arena, located in the Victory Park neighborhood, near downtown Dallas, Texas.",
    "published": null
  },
  {
    "title": "Mavericks eye downtown Dallas for arena, resort-style site | Fort Worth Star-Telegram",
    "url": "https://www.star-telegram.com/sports/spt-columns-blogs/mac-engel/article312571992.html",
    "snippet": "“If I have to hear one more time about the scars of the Cowboys playing where they play now when they should be in <strong>Fair Park</strong>,” Welts said. “We have an opportunity to solidify the Mavericks as Dallas’ team that’s in Dallas.”",
    "published": "October 21, 2025"
  },
  {
    "title": "Dallas Mavericks: Everything to Know Before the Game | Visit Dallas",
    "url": "https://www.visitdallas.com/blog/dallas-mavericks/",
    "snippet": "Built in 2001, <strong>the AAC</strong> is a premier sports and entertainment arena that’s home to both the Dallas Mavericks and Dallas Stars, as well as concerts by some of the biggest names in music.",
    "published": null
  }
]