[
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed bin Salman was born on 31 August 1985 to Prince Salman bin Abdulaziz (later King of Saudi Arabia) and his third wife, <strong>Fahda bint Falah Al Hithlain</strong>. He is the eldest of his mother&#x27;s six children and the eighth child and seventh son of his father. His full siblings include Prince Turki ...",
    "published": "11 hours ago"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman is the third oldest living head of state, the oldest living monarch, and Saudi Arabia&#x27;s first head of state born after the unification of Saudi Arabia. He has a reported personal wealth of at least US$18 billion, which makes him the third wealthiest royal in the world. Salman is a son of King Abdulaziz and Hassa bint Ahmed Al Sudairi, making him one of the Sudairi Seven.",
    "published": "November 3, 2025"
  },
  {
    "title": "Fahda bint Falah Al Hithlain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fahda_bint_Falah_Al_Hithlain",
    "snippet": "<strong>Princess Fahda bint Falah Al Hithlain Alajmi</strong> (Arabic: فهدة بنت فلاح آل حثلين العجمي) is the third spouse of Salman bin Abdulaziz Al Saud, the King of Saudi Arabia. She is a member of the Al-Ajman tribe.",
    "published": "1 month ago"
  },
  {
    "title": "MEED | King Salman bin Abdulaziz al-Saud",
    "url": "https://www.meed.com/king-salman-bin-abdulaziz-al-saud/",
    "snippet": "King Salman has three wives and 13 children. Several sons hold prominent positions, including Prince Sultan, president of the Saudi Tourism Authority; Deputy Oil Minister Prince Abdulaziz; and Prince Faisal, governor of Medina.",
    "published": null
  },
  {
    "title": "Saudi Royal Family Tree – House of Saud",
    "url": "https://houseofsaud.com/saudi-royal-family-tree/",
    "snippet": "He is also one of the seven sons born to Ibn Saud’s favorite wife, <strong>Hassa bint Ahmed al-Sudairi</strong>. In 1962, he became governor of Riyadh Province and ruled the province until he became defense minister in 2011.",
    "published": null
  }
]