[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Alexei Anatolyevich Navalny (Russian: Алексей Анатольевич Навальный, IPA: [ɐlʲɪkˈsʲej ɐnɐˈtolʲjɪvʲɪtɕ nɐˈvalʲnɨj]; 4 June 1976 – 16 February 2024) was a <strong>Russian opposition leader</strong>, anti-corruption activist and political prisoner.",
    "published": "1 day ago"
  },
  {
    "title": "True Beliefs and Opportunism: Navalny’s Tangled Political Development - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/02/01/true-beliefs-and-opportunism-navalnys-tangled-political-development-a72797",
    "snippet": "Macron&#x27;s office said the French president urged Putin to release Navalny “one year after the assassination attempt of which he was the victim.” · The ally of jailed Kremlin critic Alexei Navalny has been handed a court-ordered curfew and forced to end her bid for parliament.",
    "published": "September 1, 2025"
  },
  {
    "title": "Navalny’s Future Russia Did Not Include Everyone | Davis Center",
    "url": "https://daviscenter.fas.harvard.edu/insights/navalnys-future-russia-did-not-include-everyone",
    "snippet": "In addition to his anti-regime activism, the <strong>opposition politician</strong> often embraced nationalist positions central to beliefs espoused by Vladimir Putin, writes REECA alum Kimberly St. Julian-Varnon.",
    "published": null
  },
  {
    "title": "Alexei Navalny, Russia's most outspoken Putin critic - BBC News",
    "url": "https://www.bbc.com/news/world-europe-16057045",
    "snippet": "<strong>Anti-corruption</strong> campaigner Alexei Navalny was long the most prominent face of Russian opposition to President Vladimir Putin.",
    "published": "February 16, 2024"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "The <strong>People&#x27;s Alliance party</strong> was founded on 15 December 2012 at the party&#x27;s founding congress. Initially, Russian opposition figure Alexei Navalny declined to join the political party which was formed mostly by his followers.",
    "published": "September 30, 2025"
  }
]