[
  {
    "title": "Alexander Van der Bellen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_Van_der_Bellen",
    "snippet": "<strong>Alexander &quot;Sascha&quot; Van der Bellen</strong> (German: [alɛkˈsandɐ fan deːɐ̯ ˈbɛlən]; born 18 January 1944), also referred to by the abbreviation VdB, is an Austrian politician serving as the president of Austria since 2017. He previously served as a professor of economics at the University of ...",
    "published": "6 days ago"
  },
  {
    "title": "Austrian Federal President Alexander Van der Bellen",
    "url": "https://www.bundespraesident.at/en/index",
    "snippet": "Since 1946, the Leopoldine Wing of the Hofburg has been home to the Office of the Federal President of the Republic of Austria. 1 sudoku puzzle is part of Federal President <strong>Alexander Van der Bellen</strong>’s morning coffee routine.",
    "published": null
  },
  {
    "title": "President of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Austria",
    "snippet": "Since the institution of the popular ... incumbent Alexander Van der Bellen won it in 2017. The most notable presidential power is the appointment of the chancellor, the vice chancellor and the ministers, which collectively form the Cabinet of Austria....",
    "published": "1 week ago"
  },
  {
    "title": "The Federal President of the Republic of Austria — Austria in USA",
    "url": "https://www.austria.org/the-federal-president",
    "snippet": "Dr. Alexander Van der Bellen was inaugurated as the Federal President of the Republic of Austria on January 26, 2017, and re-elected in October 2022 for a second six-year term. As a member of the Green Party, he served as Federal Spokesperson from 1997 to 2008, as well as the Chairman of the ...",
    "published": null
  },
  {
    "title": "Alexander Van der Bellen",
    "url": "https://wsa-global.org/person/alexander-van-der-bellen/",
    "snippet": "<strong>Alexander Van der Bellen</strong>, born 18 January 1944, also referred to by the abbreviation VDB, is the current president of Austria.",
    "published": "March 3, 2025"
  }
]