[
  {
    "title": "David Hurley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley",
    "snippet": "2025–: Chancellor of the Australian University of Theology · Hurley is an Honorary Patron of the ACT Veterans Rugby Club, Patron of Transport Heritage NSW, Patron of the Australian World Orchestra, and the Australian Future Leaders Foundation. As of 2020 he is one of three patrons of the Australian Indigenous Education Foundation.",
    "published": "October 31, 2025"
  },
  {
    "title": "Australian University of Theology - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Australian_University_of_Theology",
    "snippet": "In October 2024, the tribunal decision ... 20 December 2024&quot;. Based on updates to its constitution in early 2025, it was renamed as Australian University of Theology. David Hurley became the <strong>inaugural chancellor</strong>....",
    "published": "November 8, 2025"
  },
  {
    "title": "Faculty of Theology and Philosophy at ACU",
    "url": "https://www.acu.edu.au/about-acu/faculties-directorates-and-staff/faculty-of-theology-and-philosophy",
    "snippet": "The Hon Justice Martin Daubney AM and Ms Virginia Bourke have been appointed to the positions of Chancellor and Pro-Chancellor of Australian Catholic University (ACU).",
    "published": null
  },
  {
    "title": "General the Honourable David Hurley",
    "url": "https://www.directory.gov.au/people/david-hurley",
    "snippet": "Please note that Directory.gov.au is being progressively updated following the 2025 Federal Election, the Administrative Arrangements Order (AAO) on 13 May 2025 and the amendment to the AAO on 26 June 2025 · Your guide to the structures, organisations and key people in the Australian Government",
    "published": null
  },
  {
    "title": "Our Staff – Australian University of Theology",
    "url": "https://aut.edu.au/about/staff/",
    "snippet": "Professor James Dalziel joined as Dean and CEO in June 2020. In 2025, Professor Dalziel’s role became the Vice-Chancellor of the University. Prior to his appointment, Professor Dalziel was Dean of Education at Morling College and a Professor of the University of Divinity.",
    "published": null
  }
]