[
  {
    "title": "Chancellor Larive assumes position as new Board Chair for Monterey Bay Economic Partnership - News",
    "url": "https://news.ucsc.edu/2022/04/chancellor-larive-mbep/",
    "snippet": "“MBEP’s goals — equitable economic development, high-quality educational and health-care systems, and environmental preservation — align with what many of us in this region are working toward,” Chancellor Cynthia Larive said. “Convening local leaders and working together is how we can advance this vision and ensure our communities thrive.” · Campus News · Share on Facebook · Share on LinkedIn · Share on Reddit · Print this Page · Campus News · October 10, 2025 ·",
    "published": "March 18, 2025"
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "<strong>UC Santa Cruz Chancellor</strong> Cynthia Larive. Credit: Carolyn Lagattuta / UC Santa Cruz · Posted inEducation · by Hillary Ojeda August 22, 2025August 22, 2025 · Click to email a link to a friend (Opens in new window) Email · Click to share on ...",
    "published": "August 22, 2025"
  },
  {
    "title": "UC chancellors get big raises, putting them between $785,000 and nearly $1.2 million",
    "url": "https://www.latimes.com/california/story/2024-09-20/uc-chancellors-get-big-raises",
    "snippet": "<strong>UC Santa Cruz Chancellor</strong> Cynthia Larive will voluntarily forgo her base salary increase for 2024-25.",
    "published": "September 20, 2024"
  },
  {
    "title": "r/UCSC on Reddit: the chancellor is receiving a 28.5% pay increase.",
    "url": "https://www.reddit.com/r/UCSC/comments/1fw5ojy/the_chancellor_is_receiving_a_285_pay_increase/",
    "snippet": "Article states &quot;<strong>UC Santa Cruz Chancellor</strong> Cynthia Larive will voluntarily forgo her base salary increase for 2024-25.&quot; You should know that this is in reference to the 4% across-the-board increase that all staff got, not the upcoming 28.5% increase.",
    "published": "October 4, 2024"
  },
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the <strong>chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  }
]