[
  {
    "title": "Spouse of the President of the Republic, Suzanne Innes-Stubb, to visit Austria - Presidentti",
    "url": "https://www.presidentti.fi/en/spouse-of-the-president-of-the-republic-suzanne-innes-stubb-to-visit-austria/",
    "snippet": "Office of the President of the ... Innes-Stubb, will visit Vienna from 17 to 18 June 2025. Mrs Innes-Stubb will participate in a meeting jointly organised by <strong>Doris Schmidauer</strong>, spouse of Federal President of Austria Alexander Van der […]...",
    "published": "June 13, 2025"
  },
  {
    "title": "Austrian Federal President Alexander Van der Bellen",
    "url": "https://www.bundespraesident.at/en/index",
    "snippet": "Under <strong>Maria Theresa</strong> and her husband Francis I Stephen of Lorraine, the children’s bedrooms were located on the second floor of the Leopoldine Wing. Time and again, their successors adapted the rooms in the then-contemporary style, making them a fascinating reflection of Austria’s art and ...",
    "published": null
  },
  {
    "title": "Olena Zelenska Held a Video Meeting with the Spouse of the Federal President of Austria — Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/olena-zelenska-provela-videozustrich-iz-druzhinoyu-federalno-96245",
    "snippet": "21 February 2025 - 17:00 · First Lady of Ukraine Olena Zelenska held a video meeting with the spouse of the Federal President of the Republic of Austria <strong>Doris Schmidauer</strong>. Olena Zelenska thanked Austria for its support to Ukraine and praised ...",
    "published": "February 21, 2025"
  },
  {
    "title": "Alexander Van der Bellen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_Van_der_Bellen",
    "snippet": "After the Nehammer-led coalition talks collapsed after several weeks <strong>Van der Bellen</strong> reversed course and asked Herbert Kickl to attempt to form a coalition government with the People&#x27;s Party on 5 January 2025.",
    "published": "6 days ago"
  },
  {
    "title": "President of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Austria",
    "snippet": "The president of Austria (German: Bundespräsident der Republik Österreich, lit. &#x27;Federal President of the Republic of Austria&#x27;) is the head of state of the Republic of Austria. The office of the president was established in 1920 by the Constituent National Assembly of the first republic following ...",
    "published": "1 week ago"
  }
]