[
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "On 22 August 2023, his government appointed Stephen Gageler as chief justice of Australia. ... On 28 March 2025, Albanese called a federal election for 3 May. The first week of campaigning was dominated by the imposition of tariffs on Australia by U.S. President Donald Trump, to which Albanese ...",
    "published": "9 hours ago"
  },
  {
    "title": "The Hon Anthony Albanese MP has been re-appointed as ...",
    "url": "https://www.facebook.com/ausgov/posts/the-hon-anthony-albanese-mp-has-been-re-appointed-as-the-31st-prime-minister-of-/993683146271061/",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "2025 Australia election: Australian PM Anthony Albanese's new cabinet decoded; full list, who gets what - The Economic Times",
    "url": "https://economictimes.indiatimes.com/news/international/new-zealand/australian-pm-anthony-albaneses-new-cabinet-decoded-full-list-who-gets-what/articleshow/121128784.cms",
    "snippet": "Following a decisive victory in the 2025 federal election, <strong>Anthony Albanese was sworn in for a second term as Prime Minister</strong>, solidifying the Labor Party&#x27;s control. The new cabinet reflects both continuity and change, with key ministers retained ...",
    "published": "May 13, 2025"
  },
  {
    "title": "Australia Election 2025: Anthony Albanese Sworn In As PM, Labor Government Gets Second Term",
    "url": "https://www.ndtv.com/world-news/australia-election-2025-anthony-albanese-sworn-in-as-pm-labor-government-gets-second-term-8399346",
    "snippet": "<strong>Australian Prime Minister Anthony Albanese was sworn in for a second term on Tuesday</strong>, alongside his ministers, after a landslide win at a national election he said had returned the largest centre-left Labor government since federation in 1901.",
    "published": "May 13, 2025"
  },
  {
    "title": "Anthony Albanese’s Labor Party wins the 2025 Australian federal election in boost to renewables and storage",
    "url": "https://www.energy-storage.news/anthony-albaneses-labor-party-wins-the-2025-australian-federal-election-in-boost-to-renewables-and-storage/",
    "snippet": "<strong>Anthony Albanese (centre) is the first Australian prime minister to be re-elected since John Howard in 1998, 2001 and 2004.</strong> Image: Anthony Albanese (LinkedIn). Australia went to the polls on May 3, 2025, to elect its next federal government.",
    "published": "May 6, 2025"
  }
]