[
  {
    "title": "President of Georgia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Georgia",
    "snippet": "<strong>Salome Zourabichvili</strong> stated on 29 December and during the following weeks that she remained the president of Georgia. Protests against the ruling party have continued since the election, with hundreds of protesters arrested, beaten or tortured by the police and the ruling-party affiliated violent ...",
    "published": "4 weeks ago"
  },
  {
    "title": "Salomé Zourabichvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salom%C3%A9_Zourabichvili",
    "snippet": "On 9 January 2025, <strong>Zourabichvili</strong> held a press briefing at her new office on Chovelidze street, stating that she would continue to work to solve the crisis, meeting people around Georgia and internationally. She stated that she would attend the inauguration of Donald Trump and hold high-level ...",
    "published": "5 days ago"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "Kavelashvili, 53, who was the only candidate on the ballot, easily won the vote earlier in December given the Georgian Dream party’s control of a 300-seat electoral college that replaced direct presidential elections in 2017.",
    "published": "December 29, 2024"
  },
  {
    "title": "Georgia: Government",
    "url": "https://globaledge.msu.edu/countries/georgia/government",
    "snippet": "By Country · Georgia · Government · Chief of State: <strong>President Salome Zourabichvili</strong> · Head of Government: Prime Minister Irakli Kobakhidze · Government Name: Georgia ·",
    "published": null
  },
  {
    "title": "Homepage | Georgia Secretary of State",
    "url": "https://sos.ga.gov/",
    "snippet": "Secretary Raffensperger secures fair and accessible elections for all Georgians. Check the Facts · December 10, 2025 · Notice is hereby given that a Special Election shall be held on January 20, 2026, in Crawford, Monroe, Peach, Upson... Read the full article ·",
    "published": null
  }
]