[
  {
    "title": "Catherine Cesarsky - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Catherine_Cesarsky",
    "snippet": "Cesarsky is a Member of the <strong>Academia Europaea</strong>, the International Academy of Astronautics, and a Foreign Member of the Royal Swedish Academy of Sciences. In 2010, she received an honorary degree from the University of Geneva.",
    "published": "December 25, 2024"
  },
  {
    "title": "Dr Catherine Cesarsky | SKAO",
    "url": "https://www.skao.int/en/540/dr-catherine-cesarsky",
    "snippet": "During her tenure as Director General of the European Southern Observatory from 1999 to 2007, Dr Cesarsky was responsible for the end of construction of the Very Large Telescope (VLT), the start of the <strong>Atacama Large Millimeter and sub millimetre array</strong> (ALMA) construction and the Extremely Large ...",
    "published": null
  },
  {
    "title": "Notice biographique de Catherine Cesarsky, Membre de l’Académie des sciences",
    "url": "https://www.academie-sciences.fr/pdf/membre/CesarskyC_bio0210.pdf",
    "snippet": "<strong>Catherine Cesarsky</strong> a pris la tête de la Direction des Sciences de la matière au CEA, puis la direction · de l&#x27;ESO avec des responsabilités considérables. À l&#x27;ESO, elle a mené à bien la mise en route de · l’exploitation du VLT qui a affirmé le rôle de leader des pays européens ...",
    "published": null
  },
  {
    "title": "ESOblog: In conversation with Catherine Cesarsky: the former ESO Director General talks new projects, leadership and future scientific advances",
    "url": "https://www.eso.org/public/france/blog/in-conversation-with-catherine-cesarsky/",
    "snippet": "She then joined ESO as Director General between 1999 and 2007, where she oversaw the signing of agreements to build ALMA and launched plans to build the ELT. From 2006 to 2009, Catherine Cesarsky was President of the International Astronomical Union, before becoming High Commissioner for CEA, ...",
    "published": null
  },
  {
    "title": "Catherine Cesarsky - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q2941858",
    "snippet": "https://id.lib.harvard.edu/alma/990037074190203941/catalog · doctoral student · Pierre-Olivier Lagage · 1 reference · Theses.fr person ID · 069136106 · social classification · married · 0 references · member of · <strong>French Academy of Sciences</strong> ...",
    "published": null
  }
]