[
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Since independence was proclaimed on 1 January 1956, six individuals (and three multi-member sovereignty councils) have served as head of state of Sudan, currently under the title President of the Republic of Sudan. Prior to independence, Sudan was governed as a condominium by Egypt and the United Kingdom, under the name Anglo-Egyptian Sudan.",
    "published": "November 14, 2025"
  },
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "On 10 November 2023, al-Burhan condemned Israel&#x27;s actions in the Gaza Strip during the Gaza war, saying that &quot;We declare our full solidarity with the Palestinian people and their right to establish their legitimate state on the 1967 borders.&quot; On 16 January 2025, the U.S. Treasury Department imposed sanctions on al-Burhan. According to sources the reasons were: &quot;targeting of civilians and civilian infrastructure and denial of aid access, as well as refusal to participate in peace talks&quot;. In addition, he was accused of &quot;destabilizing Sudan and undermining the goal of a democratic transition&quot; to a civilian-led government.",
    "published": "3 weeks ago"
  },
  {
    "title": "Kamil Idris government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kamil_Idris_government",
    "snippet": "The <strong>Kamil Idris</strong> government is the internationally recognised cabinet of the Republic of Sudan formed when <strong>Kamil Idris</strong> was appointed as prime minister of Sudan by the president of the Transitional Sovereignty Council, Abdel Fattah al-Burhan on 31 May 2025. Sudanese president Omar al-Bashir was ...",
    "published": "1 month ago"
  },
  {
    "title": "List of heads of government of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_government_of_Sudan",
    "snippet": "The current prime minister is <strong>Kamil Idris</strong>. He was appointed by the Transitional Sovereignty Council on 31 May 2025. ... ^ Briefly interrupted following the 2021 coup d&#x27;état, when Abdel Fattah al-Burhan served as head of state and there was ...",
    "published": "October 23, 2025"
  },
  {
    "title": "Republic of The Sudan | African Union",
    "url": "https://au.int/en/countryprofiles-15",
    "snippet": "2025 Year of Reparations: Justice for Africans &amp; People of African Descent through Reparations. #YearOfReparations ... Agenda 2063 is Africa’s development blueprint to achieve inclusive and sustainable socio-economic development over a 50-year period. ... WE, the Heads of State and Government of the African Union Member States (Full List of Attending Heads of State and Government), gathered",
    "published": null
  }
]