[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "In August 2010, the blog became a licensed feature of The New York Times online and was renamed FiveThirtyEight: Nate Silver&#x27;s Political Calculus. <strong>In July 2013, ESPN acquired FiveThirtyEight</strong>, hiring Silver as editor-in-chief and a contributor for ESPN.com; the new publication launched on March ...",
    "published": "November 19, 2025"
  },
  {
    "title": "Nate Silver of FiveThirtyEight’s advice to founders | Fortune",
    "url": "https://fortune.com/2023/08/15/fivethirtyeight-nate-silver-advice-founders-disney-espn-abc-acquisition-departure/",
    "snippet": "Silver’s first commercial deal as a founder was to license FiveThirtyEight to the New York Times’ Upshot sectionfrom 2010 to 2013. When his three-year contract with the Times expired, Disney’s ESPN acquired the brand and website. In 2018, the site moved within the Disney portfolio to ABC News as ESPN revised its digital strategy.",
    "published": "August 15, 2023"
  },
  {
    "title": "Prediction: Change Coming for ESPN’s FiveThirtyEight - The New York Times",
    "url": "https://www.nytimes.com/2018/01/25/business/media/espn-fivethirtyeight.html",
    "snippet": "The New York Times licensed its content from 2010 to 2013, with politics as its main focus, though it also provided numbers-crunching analyses of sports, economics and other disciplines. <strong>ESPN bought the site and its URL in 2013.</strong>",
    "published": "January 26, 2018"
  },
  {
    "title": "Publishers Daily: ABC News Buys 'FiveThirtyEight'",
    "url": "https://www.mediapost.com/publications/article/317771/abc-news-buys-fivethirtyeight.html",
    "snippet": "<strong>FiveThirtyEight was purchased by ESPN in 2013.</strong>",
    "published": null
  },
  {
    "title": "ABC News Takes Over Nate Silver’s FiveThirtyEight",
    "url": "https://variety.com/2018/tv/news/abc-news-ffivethirtyeight-espn-nate-silver-1202755646/",
    "snippet": "In 2010, Silver moved the FiveThirtyEight blog to The New York Times, but ended up leaving for ESPN three years later, FiveThirtyEight gained national renown for its predictions of outcomes for primaries and elections, but ran into headwinds in 2016, when it gave overwhelming odds for victory to Democratic presidential candidate Hillary Clinton.",
    "published": "April 17, 2018"
  }
]