[
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed is the <strong>first child of King Salman bin Abdulaziz and his third wife, Fahda bint Falah Al Hithlain</strong>. After obtaining a law degree from King Saud University, he became an advisor to his father in 2009. He was appointed deputy crown prince and defense minister after his father became king ...",
    "published": "11 hours ago"
  },
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "Mohammed bin Salman The son of <strong>Salman ibn Abdulaziz</strong>, Mohammed bin Salman, became the de facto ruler of Saudi Arabia during his father&#x27;s reign and, as crown prince, became poised to be the first member of his generation to lead Saudi Arabia.",
    "published": "July 17, 2019"
  },
  {
    "title": "Crown Prince Mohammed bin Salman’s people | Middle East Institute",
    "url": "https://mei.edu/publications/crown-prince-mohammed-bin-salmans-people",
    "snippet": "Crown Prince Mohammed bin Salman has surrounded himself with those who would indulge him and pose little threat. His circle comprises younger, less experienced but presumably loyal princes in key ministerial positions as well as a few select, savvy, experienced older half-brothers and uncles loyal to his father.",
    "published": null
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "In April 2015, three months after becoming king, Salman appointed <strong>a full nephew, Muhammad bin Nayef</strong>, as the new Crown Prince to replace his youngest brother Prince Muqrin. Furthermore, he made his son, Mohammed bin Salman, the Deputy Crown Prince.",
    "published": "November 3, 2025"
  },
  {
    "title": "Sara bint Mashour Al Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sara_bint_Mashour_Al_Saud",
    "snippet": "Princess Sara married Prince Mohammed on 6 April 2008. They have <strong>five children, three boys and two girls: Prince Salman, Prince Mashour, Princess Fahda, Princess Noura and Prince Abdulaziz</strong> (born April 2021). According to Ali al-Ahmed of Institute for Gulf Affairs, based on the anonymous sources ...",
    "published": "1 week ago"
  }
]