[
  {
    "title": "Gianni Infantino",
    "url": "https://www.forbes.com/profile/gianni-infantino/",
    "snippet": "A big proponent of Video Assistant Referee (VAR), Infantino successfully push for the feature to be present for the first time at the 2018 World Cup. Infantino took the helm at FIFA in February 2016, a few months after his predecessor, <strong>Sepp Blatter</strong> ...",
    "published": null
  },
  {
    "title": "Gianni Infantino: FIFA's First Italian President | Al Majalla",
    "url": "https://en.majalla.com/node/271741",
    "snippet": "Infantino took over as FIFA president in February 2016, just months after his predecessor, <strong>Sepp Blatter</strong>, resigned after a 17-year scandal-plagued reign. In June 2019, he was re-elected as FIFA President.",
    "published": null
  },
  {
    "title": "Gianni Infantino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gianni_Infantino",
    "snippet": "In 2024, FIFA decided, with Infantino&#x27;s approval, that Infantino&#x27;s name would be engraved on the 2025 FIFA Club World Cup trophy. The trophy also included the following passage, &quot;We are witness to a new age. The golden era of club football: the era of the FIFA Club World Cup. The pinnacle of all club competitions. Inspired by the FIFA president Gianni Infantino.&quot;",
    "published": "4 days ago"
  },
  {
    "title": "Infantino’s lickspittle World Cup draw promises a tournament autocrats will love | World Cup 2026 | The Guardian",
    "url": "https://www.theguardian.com/football/2025/dec/08/gianni-infantino-world-cup-draw-2026-trump",
    "snippet": "Friday’s ceremony in Washington DC was cringe-inducing and craven enough to make football fans nostalgic for the reign of <strong>Sepp Blatter</strong>",
    "published": "2 weeks ago"
  },
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "The current president is Swiss-Italian Gianni Infantino, elected on 26 February 2016 during an extraordinary session of the FIFA Congress.",
    "published": "November 20, 2025"
  }
]