[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "During the 1979–80 French Rugby ... until his retirement at the end of 1987–88 season. He <strong>started coaching immediately after he retired from playing rugby in 1988, where he became the head coach of Auch until 1995</strong>....",
    "published": "January 1, 2025"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Appointed in <strong>December 2017</strong> after a year with Bordeaux Begles, Jacques Brunel’s first game as France rugby coach saw his side lose 15-13 to Ireland following a last-minute Johnny Sexton drop goal.",
    "published": "May 30, 2025"
  },
  {
    "title": "Jacques Brunel | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/12984",
    "snippet": "After Guy Noves sacking December 2017 Brunel was named as the France national coach. In round 4 of the 2018 Six Nations under Brunel, France defeated England for the first time since 2015, running out 22–16 victors, and had it not been because of a defeat to Wales (14–13) in the final round, France could have finished second. Brunel lead France to the Rugby World Cup in Japan where they reached the quarter-finals before being knocked out by Wales.",
    "published": null
  },
  {
    "title": "Jacques Brunel | Rugby Union | Players and Officials | ESPN Scrum",
    "url": "http://en.espn.co.uk/france/rugby/player/153670.html",
    "snippet": "He repeated this achievement two years later with Pau before being welcomed into the French national set-up. From <strong>2001 to 2007</strong> Brunel coached the forwards under France head coach Bernard Laporte.",
    "published": null
  },
  {
    "title": "Fabien Galthie to replace Jacques Brunel as France’s rugby coach",
    "url": "https://www.france24.com/en/20190428-france-rugby-fabien-galthie-jacques-brunel-coach-world-cup",
    "snippet": "France is alone among Europe&#x27;s leading rugby union nations in never having employed a foreign head coach. The 65-year-old Brunel has experienced a difficult tenure since <strong>replacing the sacked Guy Noves in 2017,</strong> winning only five games in 16 fixtures.",
    "published": "April 28, 2019"
  }
]