[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "<strong>Mélenchon has been labelled a populist by numerous diverse people</strong>, with the Socialist Party senator Luc Carvounas saying he goes to &quot;the summits of demagoguery and populism&quot;, and the magazine Slate stating that Mélenchon&#x27;s rhetoric is &quot;shocking&quot; and implying his entire political life is based ...",
    "published": "2 days ago"
  },
  {
    "title": "Jean-Luc Mélenchon Casts a Long Shadow Over the Stagnant French Left",
    "url": "https://foreignpolicy.com/2025/04/25/melenchon-french-left-politics-progressive-coalition-2027-election/",
    "snippet": "Jean-Luc Mélenchon, one of France’s most hated politicians, casts a shadow over the left at a critical juncture.",
    "published": "May 13, 2025"
  },
  {
    "title": "France in Crisis: an Interview with Jean Luc Melenchon and La France Insoumise - CounterPunch.org",
    "url": "https://www.counterpunch.org/2025/10/29/france-in-crisis-an-interview-with-jean-luc-melenchon-and-la-france-insoumise/",
    "snippet": "In the nine years since its founding in 2016, <strong>La France Insoumise</strong> (LFI) has become the leading left formation in France, with its current parliamentary representation at 71, ahead of the traditional parties of the left, the Socialist Party and ...",
    "published": "October 29, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon Explains How His Party Took Down a Right-Wing Government | The Nation",
    "url": "https://www.thenation.com/article/world/jean-luc-melenchon-interview/",
    "snippet": "Jean-Luc Mélenchon, founder of the left-wing party <strong>La France Insoumise</strong>, speaks during the meeting “From France to New York: fighting the right, building the left” hosted by the Democratic Socialists of America in Brooklyn, New York, on ...",
    "published": "May 21, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon – POLITICO",
    "url": "https://www.politico.eu/person/jean-luc-melenchon/",
    "snippet": "... Responses to the 96-year-old’s death have become something of a political Rorschach test in France. ... <strong>The Socialists have taken timid steps toward emancipation from far-left firebrand Jean-Luc Mélenchon</strong>.",
    "published": null
  }
]