[
  {
    "title": "Marcelo Ebrard - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Ebrard",
    "snippet": "He launched the creation of new police groups, such as the Citizen Protection Program and the Cardholder Crime Protection Unit. He became a member of the <strong>Party of the Democratic Revolution</strong> on 12 September 2004. Ebrard, the city&#x27;s chief of police, and Ramón Huerta, the Federal Secretary of ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Marcelo Ebrard",
    "url": "https://grokipedia.com/page/Marcelo_Ebrard",
    "snippet": "By 2000, he began aligning with Andrés Manuel López Obrador (AMLO), then a PRD-affiliated figure, though formal affiliation with the <strong>Party of the Democratic Revolution (PRD)</strong>—formed in 1989 by PRI dissidents protesting electoral fraud—occurred ...",
    "published": null
  },
  {
    "title": "Ebrard announces possible split with Mexico’s ruling Morena party | Courthouse News Service",
    "url": "https://www.courthousenews.com/ebrard-announces-possible-split-with-mexicos-ruling-morena-party/",
    "snippet": "18 — and said he would hit the ... press team later stressed that <strong>he explicitly did not announce the formation of a new political party, but rather a “national political movement.”</strong>...",
    "published": null
  },
  {
    "title": "APEC summit, internet coverage, 2024 presidential candidates for MC and Morena | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/apec-summit-internet-coverage-2024-presidential-candidates-mc-and-morena",
    "snippet": "Regarding a potential 2024 presidential run with <strong>Movimiento Ciudadano</strong>, Ebrard mentioned he would adhere to his current position, respecting the party&#x27;s stance. Ebrard&#x27;s statements came after his decision not to participate in <strong>Movimiento Ciudadano</strong>&#x27;s ...",
    "published": null
  },
  {
    "title": "Marcelo Ebrard _ AcademiaLab",
    "url": "https://academia-lab.com/encyclopedia/marcelo-ebrard/",
    "snippet": "Together with Manuel Camacho Solís, the former head of the Department of the Federal District, Marcelo Ebrard founded the <strong>Democratic Center Party</strong>, a centrist party that sought to expose nationalism and democracy as its main cards. The party participated in the 2000 elections with Camacho as ...",
    "published": null
  }
]