[
  {
    "title": "Arteta's update on Rice, Timber, Trossard & Saliba | Press conference | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/artetas-update-rice-timber-trossard-saliba",
    "snippet": "<strong>Mikel Arteta has delivered the latest news on the fitness of several first team players as we prepare to host Wolves in the Premier League on Saturday, December 13.</strong> The boss was first asked about central defender William Saliba, who has missed ...",
    "published": null
  },
  {
    "title": "Six players miss return to Arsenal training as Mikel Arteta given fresh headache | Football London",
    "url": "https://www.football.london/arsenal-fc/news/five-players-miss-return-arsenal-33064897",
    "snippet": "Arsenal manager Mikel Arteta with Kai Havertz as the German fights to return from second major injury of the year(Image: Stuart MacFarlane/Arsenal FC via Getty Images) Arsenal’s players have returned to training at the Sobha Realty Training Centre after being granted a couple of days&#x27; recovery following the victory over Wolves.",
    "published": "5 hours ago"
  },
  {
    "title": "Arsenal: Mikel Arteta hits out at 'passive' and 'unacceptable' defending as Gunners survive scare to beat Wolves | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13483124/arsenal-mikel-arteta-hits-out-at-passive-and-unacceptable-defending-as-gunners-survive-scare-to-beat-wolves",
    "snippet": "Arsenal conceded a 90th-minute equaliser to Premier League bottom club Wolves but a second own goal of the game from the visitors in the 94th minute saw the Gunners eventually prevail to go five points clear at the top of the table ... Highlights from the Premier League match between Arsenal and Wolves. Mikel Arteta branded elements of Arsenal&#x27;s performance against Wolves as &quot;unacceptable&quot;, slamming their &quot;passive&quot; and &quot;horrible defensive habits&quot; as they allowed their visitors to equalise late on.",
    "published": "2 days ago"
  },
  {
    "title": "Every word from Mikel Arteta's post-Wolves presser | Press conference | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/every-word-mikel-artetas-post-wolves-presser",
    "snippet": "After enduring a rollercoaster of emotions in the final few minutes of our 2-1 win against Wolves, <strong>Mikel Arteta took his seat in the Emirates Stadium press conference room for post-match media duties.</strong>",
    "published": null
  },
  {
    "title": "Arsenal FC - Transfer news, results, fixtures, video & audio",
    "url": "https://www.bbc.com/sport/football/teams/arsenal",
    "snippet": "... Pundits Alan Shearer and Danny ... fixtures. ... <strong>Mikel Arteta has said that Ben White &quot;felt something in his hamstring&quot; and that it is &quot;not good news&quot; after the right-back was substituted in the first half</strong>....",
    "published": null
  }
]