[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Trudeau was born in Ottawa, Ontario, during the first premiership of his father, Pierre Trudeau. He attended Collège Jean-de-Brébeuf and holds a <strong>Bachelor of Arts degree in English from McGill University and a Bachelor of Education degree from the University of British Columbia</strong>.",
    "published": "4 days ago"
  },
  {
    "title": "Justin Trudeau | Biography, Facts, Resignation, & Father | Britannica",
    "url": "https://www.britannica.com/biography/Justin-Trudeau",
    "snippet": "After studying at <strong>Collège Jean-de-Brébeuf, the same private French-language Jesuit school in Montreal that his father had attended, Trudeau earned a B.A. in English from McGill University (1994).</strong>",
    "published": "1 week ago"
  },
  {
    "title": "Prime Minister of Canada Justin Trudeau | UN Office for Partnerships",
    "url": "https://unpartnerships.un.org/prime-minister-canada-justin-trudeau",
    "snippet": "This background helped spark his passion for public service and shaped his conviction that diversity is Canada’s strength. Justin <strong>studied literature at McGill University, graduating with a Bachelor of Arts (B.A.) in 1994</strong>.",
    "published": null
  },
  {
    "title": "Justin Trudeau | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/justin-trudeau",
    "snippet": "Trudeau attended <strong>Collège Jean-de-Brébeuf in Montreal</strong>, the same Jesuit-founded, French-language private school that his father had attended. He then studied English literature at McGill University, earning a BA in 1994.",
    "published": null
  },
  {
    "title": "Justin Trudeau educational qualifications: From Literature Buff to Canada’s PM - Times of India",
    "url": "https://timesofindia.indiatimes.com/education/news/justin-trudeau-educational-qualifications-from-literature-buff-to-canadas-pm/articleshow/117020437.cms",
    "snippet": "With a <strong>Bachelor of Arts in English Literature from McGill University and a Bachelor of Education from the University of British Columbia</strong>, Trudeau’s academic path was rooted in the humanities and teaching.",
    "published": "January 7, 2025"
  }
]