[
  {
    "title": "Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Google",
    "snippet": "Google was founded on <strong>September 4, 1998</strong>, by American computer scientists Larry Page and Sergey Brin. Together, they own about 14% of its publicly listed shares and control 56% of its stockholder voting power through super-voting stock. The company went public via an initial public offering ...",
    "published": "3 days ago"
  },
  {
    "title": "History of Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Google",
    "snippet": "Convinced that the pages with the ... their thesis as part of their studies and laid the foundation for their search engine. <strong>The first version of Google was released in August 1996</strong> on the Stanford website and used nearly half of Stanford&#x27;s entire network bandwidt...",
    "published": "14 hours ago"
  },
  {
    "title": "How we started and where we are today - Google - About Google",
    "url": "https://about.google/company-info/our-story/",
    "snippet": "Over the next few years, Google ... Valley investors as well. In <strong>August 1998, Sun co-founder Andy Bechtolsheim wrote Larry and Sergey a check for $100,000, and Google Inc. was officially born</strong>....",
    "published": null
  },
  {
    "title": "Google | History & Facts; Products & Services | Britannica Money",
    "url": "https://www.britannica.com/money/Google-Inc",
    "snippet": "Google is an American search engine company, <strong>founded in 1998 by Sergey Brin and Larry Page</strong>. Since 2015, Google has been a subsidiary of the holding company Alphabet, Inc. More than 70% of worldwide online search requests are handled by Google, ...",
    "published": null
  },
  {
    "title": "Google Is Founded | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/history/google-founded",
    "snippet": "<strong>&quot;Google Is Founded&quot; details the establishment of Google by Stanford University graduate students Sergey Brin and Larry Page in 1998</strong>. The narrative begins in the mid-1990s when the internet was becoming increasingly popular but lacked effective ...",
    "published": null
  }
]