[
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "Rebelo de Sousa has previously served as a government minister, parliamentarian in the Assembly of the Portuguese Republic, legal scholar, journalist, political analyst, law professor, and pundit. Born in Lisbon, Marcelo Rebelo de Sousa is the eldest son of <strong>Baltasar Rebelo de Sousa</strong> (1921–2001) ...",
    "published": "6 days ago"
  },
  {
    "title": "Marcelo Rebelo de Sousa - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q6756617",
    "snippet": "Real Decreto 580/2016, de 25 de noviembre, por el que se concede el Collar de la Orden de Isabel la Católica a Su Excelencia Señor Marcelo Nuno Duarte Rebelo de Sousa, Presidente de la República Portuguesa (Spanish)",
    "published": null
  },
  {
    "title": "Marcelo Rebelo de Sousa facts for kids",
    "url": "https://kids.kiddle.co/Marcelo_Rebelo_de_Sousa",
    "snippet": "In this Portuguese name, the first or maternal family name is Duarte and the second or paternal family name is Rebelo de Sousa. Marcelo Nuno Duarte Rebelo de Sousa (born 12 December 1948) is a Portuguese politician who became the President of Portugal in 2016.",
    "published": null
  },
  {
    "title": "Marcelo Rebelo de Sousa - Infogalactic: the planetary knowledge core",
    "url": "https://infogalactic.com/info/Marcelo_Rebelo_de_Sousa",
    "snippet": "He is the 20th and current president ... analyst, law professor, and pundit. ... Born in Lisbon, Marcelo Rebelo de Sousa is the eldest son of <strong>Baltasar Rebelo de Sousa</strong> (1921–2001) and his wife Maria das Neves Fernandes Duarte (1921–2003)....",
    "published": null
  },
  {
    "title": "Marcelo Rebelo de Sousa – The President of Portugal - EUDNE",
    "url": "https://eudne.com/marcelo-rebelo-de-sousa-the-president-of-portugal/",
    "snippet": "During his election campaign, Marcelo pledged to recover the political divisions and the difficulties deriving from Portugal’s 2011-14 bailout. Unlike his predecessor, <strong>Aníbal Cavaco Silva</strong>, he had never held a top public office state position",
    "published": "November 8, 2021"
  }
]