[
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "In February 2024, Albanese announced his engagement to <strong>Haydon</strong> after proposing to her at The Lodge in Canberra. On 29 November 2025, Albanese and <strong>Haydon</strong> were married in a private ceremony at The Lodge. Albanese is the first prime minister of Australia to be engaged or wed while in office.",
    "published": "20 hours ago"
  },
  {
    "title": "Jodie Haydon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jodie_Haydon",
    "snippet": "<strong>Jodie Haydon</strong> (born 1978 or 1979) is an Australian financial services professional and women&#x27;s advocate. She is the wife of the 31st (and current) prime minister of Australia, Anthony Albanese. <strong>Jodie Haydon</strong> was born in 1978 or 1979 in Bankstown, Sydney, and grew up on the Central Coast of New ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Spouse or partner of the prime minister of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Spouse_or_partner_of_the_prime_minister_of_Australia",
    "snippet": "The spouse of prime minister Anthony Albanese is <strong>Jodie Haydon</strong>.",
    "published": "5 days ago"
  },
  {
    "title": "Australian prime minister Albanese becomes first to wed in office",
    "url": "https://www.bbc.com/news/articles/ce865kpdzz8o",
    "snippet": "Australian Prime Minister Anthony Albanese has married his partner <strong>Jodie Haydon</strong>, becoming the country&#x27;s first leader to tie the knot while in office.",
    "published": "3 weeks ago"
  },
  {
    "title": "Australian prime minister, Anthony Albanese, marries partner Jodie Haydon | Anthony Albanese | The Guardian",
    "url": "https://www.theguardian.com/australia-news/2025/nov/29/australian-prime-minister-anthony-albanese-marries-jodie-haydon-wedding-canberra",
    "snippet": "The Australian prime minister, Anthony Albanese, has married his partner, <strong>Jodie Haydon</strong>, in Canberra, making him the first Australian leader to tie the knot in office.",
    "published": "3 weeks ago"
  }
]