[
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "Christopher Ruddy (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and <strong>majority owner of Newsmax Media</strong>.",
    "published": "5 days ago"
  },
  {
    "title": "Christopher Ruddy | Long Island University",
    "url": "https://liu.edu/roosevelt/~/link.aspx?_id=CBEEEDD71542408AA2E0F8E91B527511&_z=z",
    "snippet": "Newsmax Media, Inc., Chief Executive Officer &amp; President · Christopher Ruddy is <strong>CEO and President of Newsmax Media Inc.</strong>, a leading digital and television news media company. Ruddy, who grew up near Sagamore Hill, has been a long-time member of the Theodore Roosevelt Association and often reference ...",
    "published": null
  },
  {
    "title": "Chris Ruddy '87C | St. John's University",
    "url": "https://www.stjohns.edu/news-media/success-stories/chris-ruddy-87c",
    "snippet": "Ruddy how to field inquiries and learn to quickly respond and communicate with the masses—skills that would help to define the multimedia business he later built. As the <strong>Founder, Chief Executive Officer, and President of Newsmax Media Inc.</strong>, Mr.",
    "published": null
  },
  {
    "title": "Newsmax CEO urges FCC to preserve national TV ownership cap",
    "url": "https://thedesk.net/2025/07/chris-ruddy-newsmax-fcc-ownership-caps/",
    "snippet": "The letter was signed by Christopher Ruddy, the <strong>CEO of Newsmax</strong>, who warned that lifting the ownership caps could benefit broadcast networks like ABC, CBS, Fox and NBC, who would not be restrained from acquiring affiliated stations.",
    "published": "July 24, 2025"
  },
  {
    "title": "Newsmax CEO Blasts Efforts to End Ownership Caps | TV Tech",
    "url": "https://www.tvtechnology.com/news/newsmax-ceo-blasts-efforts-to-end-ownership-caps",
    "snippet": "In the filing Ruddy also argued that the “Commission cannot legally alter the Horizontal Ownership Cap. As Newsmax explained, and as other parties argued in convincing detail, the statutory language reveals a crystal clear congressional intent to set the Horizontal Cap at 39% and prevent the Commission from changing the rule without express authorization from Congress.”",
    "published": "August 22, 2025"
  }
]