[
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "He worked in these roles for more than nine years in total. He was the <strong>Minister of Production, Interior Minister, and Minister of Justice</strong>. He also served as the President&#x27;s Cabinet Chief.",
    "published": null
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "<strong>Chief of the Cabinet of Ministers and Candidate for Governor of the Province of Buenos Aires</strong> (Frente para la Victoria) Aníbal Fernández is a candidate for governor of the Province of Buenos Aires and currently chief of staff of the Minister’s ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández jura como nuevo ministro de Seguridad argentino",
    "url": "https://www.infodefensa.com/texto-diario/mostrar/3206150/anibal-fernandez-jura-como-nuevo-ministro-seguridad-argentino",
    "snippet": "El nuevo <strong>ministro, contador público, y abogado</strong>, toma las riendas de la cartera por segunda vez, si tenemos en cuenta que entre 2007 y 2009 fue ministro de Justicia, Seguridad y Derechos Humanos, durante la presidencia de Cristina Fernández ...",
    "published": "September 21, 2021"
  },
  {
    "title": "Aníbal Fernández - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.m.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "Aníbal Domingo Fernández (born January 9, 1957) is an Argentine politician, public accountant and lawyer affiliated and militant of the Justicialist Party, Since 2021 to 2023, he has served as <strong>Argentina&#x27;s Minister of Security</strong>, in the cabinet ...",
    "published": "August 13, 2025"
  },
  {
    "title": "Aníbal Fernández (Politician) - Age, Birthday, Bio, Facts, Family, Net Worth, Height & More | AllFamous.org",
    "url": "https://allfamous.org/people/anibal-fernandez-19570126.html",
    "snippet": "Argentine politician and lawyer ... he has held several government positions, including <strong>Minister of Production, Minister of Justice, and Minister of the Interior</strong>....",
    "published": "March 20, 2023"
  }
]