[
  {
    "title": "FC Versailles 78 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FC_Versailles_78",
    "snippet": "The club is an official academy of the French Football Federation. Since 2024, the club has been partially owned by French Formula One driver <strong>Pierre Gasly</strong>. FC Versailles was formed in 1989 as the result of a merger between Racing Club Versailles and Companion Sports Versailles.",
    "published": "3 weeks ago"
  },
  {
    "title": "r/formula1 on Reddit: Pierre Gasly becomes the 3rd partner owner of FC Versailles",
    "url": "https://www.reddit.com/r/formula1/comments/1bhvt10/pierre_gasly_becomes_the_3rd_partner_owner_of_fc/",
    "snippet": "<strong>Pierre Gasly</strong> arriving at the track wearing the football jersey from the club he part owns, FC Versailles",
    "published": "March 18, 2024"
  },
  {
    "title": "Formula 1 driver Pierre Gasly becomes French football club's co-owner",
    "url": "https://www.aa.com.tr/en/sports/formula-1-driver-pierre-gasly-becomes-french-football-clubs-co-owner/3168580",
    "snippet": "Formula 1 driver <strong>Pierre Gasly</strong> has become co-owner of FC Versailles, a semi-professional French football club based near Paris.",
    "published": null
  },
  {
    "title": "Pierre Gasly explains his other job: Football team co-owner",
    "url": "https://www.motorsport.com/f1/news/pierre-gasly-football-fc-versailles-co-owner-interview/10659881/",
    "snippet": "Alpine&#x27;s <strong>Pierre Gasly</strong> talks about becoming co-owner of French football club FC Versailles and needing more than &#x27;just Formula 1&#x27;.",
    "published": "October 10, 2024"
  },
  {
    "title": "F1 driver Pierre Gasly invests in French third-tier football club FC Versailles - Sportstar",
    "url": "https://sportstar.thehindu.com/motorsport/f1/pierre-gasly-f1-driver-invests-fc-versailles-french-third-tier-club-details/article67967091.ece",
    "snippet": "Formula One driver and Paris St Germain fan <strong>Pierre Gasly</strong> has become an investor in third-tier French semi-professional football club FC Versailles. The 28-year-old, who drives for Renault-owned Alpine, was announced on the club’s website on ...",
    "published": "March 19, 2024"
  }
]