[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The paper was founded with the 1897 merger of the Summit Beacon, first published in 1839, and the Akron Evening Journal, founded in 1896. In 1903, the Beacon Journal was purchased by Charles Landon Knight. His son <strong>John S. Knight</strong> inherited the paper, in 1933, on Charles&#x27; death.",
    "published": "September 20, 2025"
  },
  {
    "title": "Timeline of Beacon Journal history",
    "url": "https://www.beaconjournal.com/story/lifestyle/2014/09/19/timeline-beacon-journal-history/10338934007/",
    "snippet": "22 story “Caught the Fiend.” In 1913, Peck is pardoned by the governor, who points to grave doubts about Peck’s guilt or his opportunities to establish his innocence. 1903 — The Beacon Journal is sold to <strong>Major T.J. Kirkpatrick</strong> and Charles ...",
    "published": "September 19, 2014"
  },
  {
    "title": "Knight-ridder Inc | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/social-sciences-and-law/economics-business-and-labor/businesses-and-occupations/knight-ridder-inc",
    "snippet": "A second publication was acquired in 1892 when <strong>Herman Ridder</strong> purchased the Staats-Zeitung, the nation&#x27;s largest German-language paper, also based in New York. The Knight group began in 1903 when Charles Landon (C.L.) Knight bought the Akron Beacon Journal, in Ohio, which the company still owns.",
    "published": null
  },
  {
    "title": "Akron Beacon Journal",
    "url": "https://grokipedia.com/page/Akron_Beacon_Journal",
    "snippet": "Post-Civil War transitions saw ownership flux amid operational challenges, including fires that destroyed offices in June 1848 and December 1856, prompting sales—first to <strong>John Teesdale</strong> in 1848—and a rename to Summit County Beacon after the ...",
    "published": null
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "The Akron paper was owned by <strong>the Knight family</strong> for nearly seven decades starting in 1907, and then the Knight Ridder company beginning in 1974. That company sold the Beacon Journal to McClatchy Co.",
    "published": "April 11, 2018"
  }
]