[
  {
    "title": "Maurizio Sarri - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Maurizio_Sarri",
    "snippet": "He won several individual awards while managing the Naples-based club; after finishing as league runners-up in <strong>2017–18</strong>, Sarri moved to English club Chelsea, where he won the UEFA Europa League in his only season with the club. He returned to Italy to coach Juventus in 2019, with whom he went ...",
    "published": "1 week ago"
  },
  {
    "title": "Maurizio Sarri - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/maurizio-sarri/profil/trainer/10073",
    "snippet": "Avg. term as coach : <strong>1.23 Years</strong>",
    "published": null
  },
  {
    "title": "Maurizio Sarri is the new Juventus coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/maurizio-sarri-is-the-new-juventus-coach",
    "snippet": "<strong>In 2001, after spending several years in the world of football, Sarri began his career as a full-time coach</strong>. Thus, began an adventure that, since 2005, has taken him to the Serie B championship, leading Pescara, Arezzo and Avellino.",
    "published": null
  },
  {
    "title": "Manager - Maurizio Sarri",
    "url": "https://mauriziosarri.com/en/mister",
    "snippet": "After two seasons in the Seconda Categoria, coaching first Stia and then Faellese, during which he familiarised himself with the new position, Maurizio Sarri achieved his first positive results in Promozione (the 6th level of Italian football), taking Cavriglia into Eccellenza (the 5th level) in the 1994/95 Championship, and then doing the same for Antella, in 1996/97. Over this period the manager continued to build his ideas, gradually bringing them into full focus both on and off the pitch.",
    "published": null
  },
  {
    "title": "Maurizio Sarri Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/15999/Maurizio-Sarri/overview",
    "snippet": "Sarri was appointed Chelsea head coach in the summer of 2018 and he led Chelsea to third place in the Premier League and also won the first major trophy of his managerial career as the Blues won the UEFA Europa League. The Italian returned to his native country prior to the <strong>2019/20 season</strong> to take ...",
    "published": null
  }
]