[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Jesse Ventura (born James George Janos; July 15, 1951) is an American politician, political commentator, actor, media personality, and retired professional wrestler. After achieving fame in the World Wrestling Federation (WWF, now WWE), he served as the 38th governor of Minnesota from 1999 to 2003.",
    "published": "2 days ago"
  },
  {
    "title": "Jesse Ventura | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/jesse-ventura",
    "snippet": "During the 1990s, Ventura became increasingly involved in state politics. He joined the <strong>Minnesota Independence Party (later affiliated with H. Ross Perot as the Minnesota Reform Party)</strong> and supported MIP candidate Dean Barkley for the US Senate.",
    "published": null
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Biden received 306 electoral votes and President Donald Trump (R) received 232 electoral votes. In the national popular vote, Biden received 81.2 million votes and Trump received 74.2 million votes. The <strong>Green Party</strong> of Alaska nominated Ventura as its nominee rather than Howie Hawkins, the national ...",
    "published": null
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th Governor of Minnesota on November 3, 1998 defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He served as Governor for one term. Shocking the political establishment, Ventura became the only <strong>Reform Party</strong> candidate to ...",
    "published": null
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "During the 2020 presidential election, Ventura expressed interest in becoming the <strong>Green Party</strong>’s nominee but ultimately decided not to run. He remained involved in politics, and in 2024 he appeared at several campaign events for Robert F.",
    "published": "January 14, 2009"
  }
]