[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "The Democratic Party (Italian: Partito Democratico, PD) is a social democratic political party in Italy. The party&#x27;s secretary is Elly Schlein, elected in the 2023 leadership election, while the party&#x27;s president is Stefano Bonaccini. The PD was established in 2007 upon the merger of various ...",
    "published": "1 day ago"
  },
  {
    "title": "Partito Democratico (Italia) - Wikipedia",
    "url": "https://it.wikipedia.org/wiki/Partito_Democratico_(Italia)",
    "snippet": "Il Partito Democratico (PD) è un partito politico italiano di centro-sinistra, fondato il 14 ottobre 2007. Esso nasce come fusione dei due principali partiti del centro-sinistra del periodo, ossia <strong>i Democratici di Sinistra e la Margherita</strong>. È descritto come un partito socialdemocratico, ...",
    "published": "1 week ago"
  },
  {
    "title": "Democratic Party - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q47729",
    "snippet": "Partito Democratico (Italian) 1 ... · participant in · 2020 Italian regional elections · 0 references · founded by · <strong>Walter Veltroni</strong> ·...",
    "published": null
  },
  {
    "title": "The Birth of a Party: The Case of the Italian Partito Democratico1 : South European Society and Politics: Vol 13, No 3",
    "url": "https://www.tandfonline.com/doi/abs/10.1080/13608740802349472",
    "snippet": "This article discusses the birth of the Democratic Party in October 2007 through the merger of the Democrats of the Left and the Daisy. It examines the long history of the merger and the brief hist...",
    "published": null
  },
  {
    "title": "Italy: Political parties at a glance",
    "url": "https://politpro.eu/en/italy/parties",
    "snippet": "Forza Italia is a center-right ... 1994 by <strong>Silvio Berlusconi. It represents conservative and economically liberal positions and has been involved in several government coalitions. After its dissolution in 2009, the party was re-established in 2013. Since the death of Berlusconi in June 2023, Foreign Minister Antonio Tajani has led the party. ... The Partito Democratico (PD) is a social-democratic party in Italy, founded in 2007 through the merger of the Democrats of the Left and the Margherita</strong>...",
    "published": "September 13, 2019"
  }
]