[
  {
    "title": "Mohamed Seddik Aït Messaoudène — Wikipédia",
    "url": "https://fr.wikipedia.org/wiki/Mohamed_Seddik_Aït_Messaoudène",
    "snippet": "Mohamed Seddik Aït Messaoudène, (en arabe : محمد الصديق آيت مسعودان), est professeur en cardiologie et homme politique algérien. <strong>Il est ministre de la Santé à partir du 14 septembre 2025</strong>. Son père Saïd Aït Messaoudène a été le premier pilote de l’Algérie ...",
    "published": "October 26, 2025"
  },
  {
    "title": "Mohamed Seddik Aït Messaoudène : un brillant cardiologue au chevet de la santé en Algérie",
    "url": "https://www.tsa-algerie.com/qui-est-mohamed-seddik-ait-messaoudene-nouveau-ministre-de-la-sante/",
    "snippet": "C’est sans doute l’une des surprises de la nouvelle équipe gouvernementale en Algérie dévoilée dimanche 14 septembre : <strong>la nomination du Professeur Mohamed Seddik Aït Messaoudène à la tête du ministère de la Santé</strong>.",
    "published": "September 16, 2025"
  },
  {
    "title": "Mohamed Seddik Ait Messaoudene prend ses fonctions de ministre de la Santé",
    "url": "https://www.aps.dz/sante-science-technologie/191689-mohamed-seddik-ait-messaoudene-prend-ses-fonctions-de-ministre-de-la-sante",
    "snippet": "ALGER - M. <strong>Mohamed Seddik Ait Messaoudene a pris, lundi, ses fonctions de ministre de la Santé</strong>, en remplacement de M. Abdelhak Saihi, nommé ministre du Travail, de l&#x27;Emploi et de la Sécurité sociale, dans le cadre de la nomination du nouveau ...",
    "published": "September 15, 2025"
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health,_Population_and_Hospital_Reform",
    "snippet": "The Ministry of Health, Population and Hospital Reform (MSPRH) is the health ministry of Republic of Algeria. It is located in El Madania, a municipality of Algiers. The Ministry is responsible for public health facilities and population monitoring. The Minister is a member of the Council of ...",
    "published": "April 15, 2025"
  },
  {
    "title": "Mohamed Seddik Ait Messaoudene prend ses fonctions de ministre de la Santé – الشروق أونلاين",
    "url": "https://www.echoroukonline.com/mohamed-seddik-ait-messaoudene-prend-ses-fonctions-de-ministre-de-la-sante",
    "snippet": "A noter que M. Ait Messaoudene avait occupé, avant sa nomination à la tête du ministère de la Santé, les postes de chef de service de cardiologie au CHU Mustapha Pacha et de directeur de la formation au ministère, ainsi que de président du Conseil scientifique de l’Agence nationale de sécurité sanitaire (ANSS).",
    "published": "September 16, 2025"
  }
]