[
  {
    "title": "Jonathan Kodjia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jonathan_Kodjia",
    "snippet": "Jonathan Adjo Kodjia (born 22 October 1989) is a professional footballer who plays as a forward for <strong>Championnat National club Versailles</strong>. Born in France, he represents the Ivory Coast national team. Kodjia started his career at Reims and gained experience in the Championnat National (French ...",
    "published": "October 3, 2025"
  },
  {
    "title": "Jonathan Kodjia",
    "url": "https://grokipedia.com/page/Jonathan_Kodjia",
    "snippet": "On 1 July 2022, Jonathan Kodjia joined <strong>Umm Salal</strong> on a free transfer, signing a one-year contract with the Qatar Stars League club following the expiration of his deal at Al-Gharafa.[1] This move marked his continued presence in Qatari football, ...",
    "published": null
  },
  {
    "title": "Jonathan Kodjia - Ivory Coast | Player Profile | Sky Sports Football",
    "url": "https://www.skysports.com/football/player/139810/jonathan-kodjia",
    "snippet": "<strong>Aston Villa</strong> have signed striker Jonathan Kodjia from Bristol City for £15m, a Championship record fee.",
    "published": null
  },
  {
    "title": "Jonathan Kodjia: Bristol City forward has £10m-plus price tag, says owner Steve Lansdown - BBC Sport",
    "url": "https://www.bbc.com/sport/football/36942088",
    "snippet": "Ivory Coast international Jonathan Kodjia will not be sold for less than £10m, says Bristol City owner <strong>Steve Lansdown</strong>.",
    "published": null
  },
  {
    "title": "Jonathan Kodjia Stats, Goals, Records, Assists, Cups and more | FBref.com",
    "url": "https://fbref.com/en/players/ecf44e09/Jonathan-Kodjia",
    "snippet": "Check out the latest domestic and international stats, match logs, goals, height, weight and more for Côte d&#x27;Ivoire men&#x27;s national team, Aston Villa FC and Bristol City FC playing for Jonathan Kodjia in the Africa Cup of Nations, Premier League and Ligue 2",
    "published": null
  }
]