[
  {
    "title": "United States Secretary of State - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/United_States_Secretary_of_State",
    "snippet": "The United States secretary of state (SecState) is a member of the executive branch of the federal government of the United States and the head of the U.S. Department of State, equivalent to a minister of foreign affairs.",
    "published": "1 week ago"
  },
  {
    "title": "The Secretary of State - United States Department of State",
    "url": "https://www.state.gov/secretary/",
    "snippet": "Secure .gov websites use HTTPS A lock ( ) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites. ... The Secretary of State, appointed by the President with the advice and consent of the Senate, is the President&#x27;s chief foreign affairs adviser. The Secretary carries out the President&#x27;s foreign policies through the State Department...",
    "published": "October 24, 2025"
  },
  {
    "title": "U.S. Department of State - Ballotpedia",
    "url": "https://ballotpedia.org/U.S._Department_of_State",
    "snippet": "The Department of State is a United States executive department formed in 1789 to assist the president in foreign and domestic diplomatic affairs. <strong>Marco Rubio</strong> is the current secretary of state.",
    "published": null
  },
  {
    "title": "United States Department of State - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/United_States_Department_of_State",
    "snippet": "The position is currently held by <strong>Marco Rubio</strong>, who was appointed by President Donald Trump and confirmed by the U.S. Senate on January 20, 2025, by a vote of 99–0. As of 2024, the State Department maintains 271 diplomatic posts worldwide, ...",
    "published": "4 days ago"
  },
  {
    "title": "Marco Rubio - United States Department of State",
    "url": "https://www.state.gov/biographies/marco-rubio/",
    "snippet": "<strong>Secretary Rubio</strong> was the first cabinet member who was confirmed in the second Trump Administration. He received a historic unanimous vote of 99-0 in the U.S. Senate. Rubio was sworn in as the 72nd Secretary of State on January 21, 2025.",
    "published": "January 29, 2025"
  }
]