[
  {
    "title": "Antonio Filosa Announces New Stellantis Leadership Team on First Day as CEO | Stellantis",
    "url": "https://www.stellantis.com/en/news/press-releases/2025/june/antonio-filosa-announces-new-stellantis-leadership-team",
    "snippet": "AMSTERDAM – <strong>Antonio Filosa</strong> today takes up the role as Chief Executive Officer of Stellantis N.V. and announces his new Stellantis Leadership Team, effective",
    "published": null
  },
  {
    "title": "Stellantis Announces Antonio Filosa – 25-Year Veteran of the Company – to Be Its New Chief Executive Officer | Stellantis",
    "url": "https://www.stellantis.com/en/news/press-releases/2025/may/stellantis-announces-antonio-filosa-25-year-veteran-of-the-company-to-be-its-new-chief-executive-officer",
    "snippet": "<strong>Antonio Filosa</strong> – who currently serves as Chief Operating Officer for the Americas and Chief Quality Officer – to assume C",
    "published": null
  },
  {
    "title": "Stellantis Leadership Team - Company | Stellantis",
    "url": "https://www.stellantis.com/en/company/governance/stellantis-leadership-team",
    "snippet": "<strong>Joao Laranjo</strong> is Chief Financial Officer (CFO), with responsibility for Financial Services, mergers and acquisitions and joint ventures. He is a member of the Stellantis Leadership Team.",
    "published": null
  },
  {
    "title": "Stellantis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stellantis",
    "snippet": "Amid internal friction with the board and worsening financial performance, Tavares resigned in December 2024, two years before his contract was set to expire. On 28 May 2025, the board unanimously appointed <strong>Antonio Filosa</strong>, a longtime executive ...",
    "published": "2 days ago"
  },
  {
    "title": "Stellantis CEO says investments at risk in Europe after EU auto package | Reuters",
    "url": "https://www.reuters.com/sustainability/climate-energy/stellantis-ceo-says-investments-risk-europe-after-eu-auto-package-2025-12-20/",
    "snippet": "The new package of measures for the auto industry proposed earlier this week by the European Union puts at risk manufacturers&#x27; investments in the region, Stellantis CEO <strong>Antonio Filosa</strong> told the Financial Times in an interview on Saturday.",
    "published": "2 days ago"
  }
]