[
  {
    "title": "Svenja Huth",
    "url": "https://grokipedia.com/page/Svenja_Huth",
    "snippet": "Svenja Huth (born 25 January 1991) is a German professional footballer who plays as an attacking midfielder for VfL Wolfsburg in the Frauen-Bundesliga.[1][2] A versatile and experienced player known for her vision and set-piece delivery, she represented the Germany women&#x27;s national team from 2011 to 2024, earning 88 caps and scoring 14 goals while serving as vice-captain.[3][4] Huth&#x27;s club career began with 1.",
    "published": null
  },
  {
    "title": "Svenja Huth | Steckbrief, Bilder und News | WEB.DE",
    "url": "https://web.de/magazine/sport/thema/svenja-huth",
    "snippet": "Den verfehlte die Stürmerin nach vier Jahren bei <strong>Turbine Potsdam</strong> gleich in ihrer ersten Wolfsburger Saison 2019/20 nur knapp. Im Finale gab es ein 1:3 gegen die Frauen von Olympique Lyon.",
    "published": null
  },
  {
    "title": "Svenja Huth - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Svenja_Huth",
    "snippet": "Svenja Anette Huth (German pronunciation: [huːt]; born 25 January 1991) is a German professional footballer who plays as a forward for Frauen-Bundesliga club VfL Wolfsburg. Huth started playing football at <strong>TSG Kälberau</strong> at the age of seven, and at the age of 14 came to the youth department ...",
    "published": "July 29, 2025"
  },
  {
    "title": "Svenja Huth: Privates und Karriere – Die Fußballerin im Porträt | swp.de",
    "url": "https://www.swp.de/panorama/personen/svenja-huth-baby-bruder-groesse-die-ehemalige-nationalspielerin-im-portraet-77670293.html",
    "snippet": "2015 wechselte sie zu <strong>Turbine Potsdam</strong> – doch vorher gewann sie noch die Champions League mit dem FFC Frankfurt. Bei Turbine schoss sie insgesamt 33 Tore. 2019 wechselte Svenja Huth zum VfL Wolfsburg, wo sie noch heute spielt.",
    "published": "November 21, 2024"
  },
  {
    "title": "Svenja Huth stats and ratings | Sofascore",
    "url": "https://www.sofascore.com/football/player/svenja-huth/68254",
    "snippet": "Svenja Huth career statistics, match ratings, heatmap and goals are available on Sofascore for current and previous seasons. Last player match was VfL Wolfsburg - <strong>Eintracht Frankfurt</strong> (2 - 3) and Svenja Huth received 6.8 Sofascore rating.",
    "published": null
  }
]