[
  {
    "title": "Julian Nagelsmann - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Julian_Nagelsmann",
    "snippet": "Nagelsmann ended his tenure at Bayern with a <strong>71.4% win rate</strong>, with only Pep Guardiola, Hansi Flick and Carlo Ancelotti averaging more Bundesliga points than him.",
    "published": "3 days ago"
  },
  {
    "title": "Julian Nagelsmann: News & coaching profile - FC Bayern Munich",
    "url": "https://fcbayern.com/en/teams/first-team/former-players/julian-nagelsmann",
    "snippet": "Julian Nagelsmann was born on 23 July 1987 and has been head coach at Bayern since <strong>July 2021</strong>. Info, honours and news here.",
    "published": null
  },
  {
    "title": "Julian Nagelsmann: 10 things on the coach hoping to lead Germany to FIFA World Cup success | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/julian-nagelsmann-10-things-on-bayern-munich-s-coach-rb-leipzig-baby-mourinho-5300",
    "snippet": "Nagelsmann signed a five-year deal at Bayern; that his tenure ended after just <strong>18 months</strong> does not mean it should be written off as a failure though. He won the 2021/22 Bundesliga title with three games to spare, and over the course of his time ...",
    "published": "March 10, 2025"
  },
  {
    "title": "Julian Nagelsmann sacked as Bayern Munich head coach with Thomas Tuchel appointed | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/12841732/julian-nagelsmann-sacked-as-bayern-munich-head-coach-with-thomas-tuchel-appointed",
    "snippet": "Nagelsmann <strong>won 60 of his 84 games in charge since taking over in July 2021 but has lifted just one Bundesliga trophy and two German Super Cups across his tenure</strong>. Bayern lost 2-1 against Bayer Leverkusen before the international break and host ...",
    "published": "March 24, 2023"
  },
  {
    "title": "Julian Nagelsmann - Coach on the hunt for success",
    "url": "https://www.ispo.com/en/heroes/julian-nagelsmann",
    "snippet": "He <strong>took over FC Bayern Munich in 2021 and was appointed national coach in 2023</strong>. Despite his rapid rise, Nagelsmann remained down-to-earth and is committed to social projects, particularly in youth soccer.",
    "published": "March 5, 2025"
  }
]