[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "Prior to the creation of Eurosport, the European Broadcasting Union had acquired substantial amounts of sports rights, yet its members were only able to broadcast a fraction of them. This provided the impetus for setting up the Eurosport Consortium, made up of several EBU members, to establish an outlet where these rights could be exploited.",
    "published": "2 weeks ago"
  },
  {
    "title": "Eurosport International CEO, Founder, Key Executive Team, Board of Directors & Employees",
    "url": "https://www.cbinsights.com/company/eurosport-international/people",
    "snippet": "Eurosport International has 5 executives. Eurosport International&#x27;s founder is <strong>Olivier Ou Ramdane</strong>.",
    "published": null
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "Early in the station&#x27;s history, professional wrestling from both sides of the Atlantic was covered, with the WWF&#x27;s Superstars of Wrestling as well as New Catch filmed mostly in France by the European Wrestling Federation with some German/Austrian footage by the Catch Wrestling Association and featuring a mixture of British, French and German wrestlers (many of them veterans of coverage on Britain&#x27;s ITV and France&#x27;s Antenne 2 and FR3 channels.) In June 2015, it was announced that Eurosport had secured the pan-European rights (except Russia) to the winter and summer Olympic Games between 2018 and 2024.",
    "published": "1 week ago"
  },
  {
    "title": "Eurosport | Warner Bros. Entertainment Wiki | Fandom",
    "url": "https://warnerbros.fandom.com/wiki/Eurosport",
    "snippet": "Eurosport is a group of pay television networks in Europe and parts of Asia. Owned by Warner Bros. Discovery through its TNT Sports International unit, it operates two main channels—Eurosport 1 and Eurosport 2—across most of its territories, and streams on Max and Discovery+. Originally a joint venture between the European Broadcasting Union and Sky established in 1989, it was briefly shut down in 1991 following complaints by competitor Screensport.",
    "published": null
  },
  {
    "title": "Eurosport - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/eurosport",
    "snippet": "Eurosport is a pan-European television sports network, owned and operated by Discovery Communications.",
    "published": null
  }
]