[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "He <strong>liberalised the Indian economy, allowing it to speed up development dramatically</strong>. During his term as prime minister, Singh continued to encourage growth in the Indian market, enjoying widespread success in these matters. Singh, along with his finance minister, P. Chidambaram, presided over ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "Singh’s academic credentials were further strengthened by his years on the faculty of Punjab University and the prestigious Delhi School of Economics. He also served briefly at the UNCTAD Secretariat, presaging his later role as Secretary General of the South Commission in Geneva between 1987 and 1990. In 1971, Dr.",
    "published": null
  },
  {
    "title": "Dr. Manmohan Singh: India’s son, the Pride of the World",
    "url": "https://inc.in/congress-sandesh/tribute/dr-manmohan-singh-india-s-son-the-pride-of-the-world",
    "snippet": "During the tenure of economist Dr. Manmohan Singh, <strong>the Indian economy grew at the rate of 8.9 percent</strong>. In 2007, India achieved a GDP growth rate of 9 percent and became the second fastest growing economy in the world.",
    "published": null
  },
  {
    "title": "DR. MANMOHAN SINGH",
    "url": "https://inc.in/our-inspiration/dr-manmohan-singh",
    "snippet": "Dr Singh’s commitment to development and his many achievements have been recognized through the many honours that have been conferred upon him. These include the Padma Vibhushan in 1987, the Euro Money Award for Finance Minister of the Year in 1993, the Asia Money Award for Finance Minister of the Year in both 1993 and 1994 and the Jawaharlal Nehru Birth Centenary Award of the Indian Science Congress in 1995. However, Dr Manmohan Singh is known not only for his vision that led India to become an economic powerhouse but also for his hard-work and his humble, soft-spoken demeanor.",
    "published": null
  },
  {
    "title": "Dr. Manmohan Singh, Early Life, Contributions, Awards, Death",
    "url": "https://vajiramandravi.com/current-affairs/dr-manmohan-singh/",
    "snippet": "Dr. Manmohan Singh, the man known to be the architect of opening the Indian Economy to the world, passed away on 26th December 2024.",
    "published": "August 27, 2025"
  }
]