[
  {
    "title": "Mikel Arteta on injury crisis: Arsenal in 'really dangerous circle' as Max Dowman also sidelined | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13481715/mikel-arteta-on-injury-crisis-arsenal-in-really-dangerous-circle-as-max-dowman-also-sidelined",
    "snippet": "Mikel Arteta says Arsenal are caught in a &quot;really dangerous circle&quot; after a consistent spate on injuries across this season; Max Dowman is the latest Gunners player to be ruled out, but Arteta denies over-training is to blame; Arsenal play Club Brugge in the Champions League on Wednesday · Wednesday 10 December 2025 21:19, UK ·",
    "published": "6 days ago"
  },
  {
    "title": "Arteta's update on Rice, Timber, Trossard & Saliba | Press conference | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/artetas-update-rice-timber-trossard-saliba",
    "snippet": "Declan Rice was another absentee from this week’s Champions League victory, as he recovered from illness, with Mikel&#x27;s prognosis being: “Let’s see how he is today.",
    "published": null
  },
  {
    "title": "Mikel Arteta - footballlondon",
    "url": "https://www.football.london/all-about/mikel-arteta",
    "snippet": "Arsenal have been tipped to win the Premier League this season but Mikel Arteta&#x27;s side have been told one thing they need to do to get their hands on the trophy ... football.london looks at the potential Arsenal changes made for their trip to Sunderland on Saturday ... Crystal Palace&#x27;s Carabao Cup quarter-final against Arsenal will be played on December 23, just two days after the Eagles&#x27; Premier League trip to Elland Road",
    "published": null
  },
  {
    "title": "Arsenal press conference: Mikel Arteta on Rice, Saliba, Timber, Gyokeres, Jesus and injury news - football.london",
    "url": "https://www.football.london/arsenal-fc/news/arsenal-press-conference-live-mikel-33043356",
    "snippet": "Mikel Arteta faces the media ahead of his Arsenal side&#x27;s Premier League clash with Wolves, with updates expected on injury news and the status of key players like William Saliba",
    "published": "4 days ago"
  },
  {
    "title": "Mikel Arteta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikel_Arteta",
    "snippet": "Commenting on granting the award to Arteta, the Spanish ambassador to the UK, Jose Pascual Marco, said: “Mikel is a respected and loved figure in the Spanish and British football community. Through the universal language of football, he has succeeded in making the friendship between the two countries stronger.” · In August 2025, Arteta was appointed a global ambassador and director of performance for sportswear company Under Armour.",
    "published": "16 hours ago"
  }
]