[
  {
    "title": "Brooklands Museum :: Brooklands Stories: Sir Thomas Sopwith",
    "url": "https://www.brooklandsmuseum.com/discover/our-history/brooklands-stories/brooklands-stories-sir-thomas-sopwith/",
    "snippet": "In the 1930’s he bought the Gloster Aircraft company and <strong>established the Hawker Siddeley Group of companies</strong>. In 1936 he started work on a new fighter which became the Hawker Hurricane, a major contributor to the RAF’s success in the Battle of Britain, accounting for over 60% of the enemy ...",
    "published": null
  },
  {
    "title": "Hawker Siddeley Group Public Limited Company | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/books/politics-and-business-magazines/hawker-siddeley-group-public-limited-company",
    "snippet": "Hawker Siddeley is still associated with the romance of the early days of aviation. <strong>Its founder</strong>, Tommy Sopwith, produced the famous Sopwith Camel that shot down Germany’s World War I flying ace, the Red Baron. In World War II the company produced the Hawker Hurricane, which played a crucial ...",
    "published": null
  },
  {
    "title": "Sir Thomas Sopwith: exploring the life of the aviation pioneer | Great British Life",
    "url": "https://www.greatbritishlife.co.uk/magazines/hampshire/23259947.sir-thomas-sopwith-exploring-life-aviation-pioneer/",
    "snippet": "In 1941 Hawker Siddeley also developed the first British jet engine, the Meteor, the only Allied jet flown operationally during WW2 which played a key role in combating the German V1 Doodlebug flying bomb. Avro, the manufacturer of the Lancaster, merged into Hawker Siddeley in the year that Sopwith became its president and he was knighted in 1953.",
    "published": "January 18, 2023"
  },
  {
    "title": "HAWKER AIRCRAFT, HAWKER SIDDELEY & BRITISH ...",
    "url": "https://www.kingstonaviation.org/wp-content/uploads/sites/18/Brief_History_Banner__11A_Layout_1.pdf",
    "snippet": "In 1920 the Sopwith Aviation team re-started as H. G. Hawker Engineering Co., named after their pilot · Harry Hawker. New aircraft were sold in small numbers until Sydney Camm became Chief Designer in 1925. 3,000 of Sydney Camm’s Hart and Fury biplanes were built through the 1930s, making Hawker very · proﬁtable. Hawker’s success allowed Tommy Sopwith to buy other British aircraft companies and form",
    "published": null
  },
  {
    "title": "Notice of Death - Tommy Sopwith (1932 to 2019) - The British Racing Drivers' Club",
    "url": "https://brdc.co.uk/notice-of-death-tommy-sopwith-1932-to-2019/",
    "snippet": "The son of the aviation pioneer and America’s Cup challenger Sir Thomas Sopwith, who was also involved in the early days of motor racing at Brooklands, after completing his National Service Tommy went to work for Hawker Siddeley and its car subsidiary Armstrong Siddeley in the Development Department in 1953.",
    "published": "February 17, 2025"
  }
]