[
  {
    "title": "Angela Merkel | Book, Biography, Putin, Education, Freedom, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Angela-Merkel",
    "snippet": "Merkel finished (1973) high school in Templin, East Germany, and received (1978) a bachelor’s degree in physics at Karl Marx University (now the University of Leipzig). She then worked at the Central Institute of Physical Chemistry of the Academy of Sciences in East Berlin, earning (1986) a doctorate for her thesis on quantum chemistry. During her time as the first female chancellor of Germany, Merkel was a leading figure in European politics, championing austerity as the path to recovery for Europe’s damaged economies.",
    "published": "December 7, 2005"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "Unlike its predecessor the German Confederation, the North German Confederation did have an office of Bundeskanzler (federal Chancellor), which was given to the Minister-President of Prussia Otto von Bismarck. In 1871 the North German Confederation transformed into the German Empire, with the federal chancellor becoming Reichskanzler (imperial chancellor).",
    "published": "3 weeks ago"
  },
  {
    "title": "Who Is Angela Merkel? What Is She Known For?",
    "url": "https://www.investopedia.com/angela-merkel-7559368",
    "snippet": "Merkel was born in West Germany, raised in East Germany, and <strong>studied chemistry</strong>. She entered politics in 1990, just after the fall of the Berlin Wall in 1989. She was elected chancellor—the leader of Germany—in September 2005, and she is ...",
    "published": "January 7, 2025"
  },
  {
    "title": "Angela Merkel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Angela_Merkel",
    "snippet": "Merkel opposed mandatory vaccinations, ... and education. During the German presidency of the European Council, Merkel spearheaded negotiations for the Next Generation EU reconstruction package. On 29 October 2018, Merkel announced that she would not seek reelection as leader of CDU at their party conference in December 2018, but intended to remain as chancellor until the ...",
    "published": "1 week ago"
  },
  {
    "title": "List of chancellors of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_chancellors_of_Germany",
    "snippet": "The office was created in the North German Confederation in 1867, when Otto von Bismarck became the first chancellor. With the unification of Germany and establishment of the German Empire in 1871, the Confederation evolved into a German nation-state and its leader became known as the chancellor ...",
    "published": "2 weeks ago"
  }
]