[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "A €50 million release clause was also included in Can&#x27;s contract, only valid for clubs outside of Italy and starting from his third year of contract; this was the first time that Juventus had added a release clause to one of its player&#x27;s contracts. He made his Serie A debut on 18 August, coming on as a substitute in a 3–2 away win against Chievo Verona.",
    "published": "2 days ago"
  },
  {
    "title": "Emre Can",
    "url": "https://www.bvb.de/de/en/teams/football/player/emre-can.html",
    "snippet": "The years abroad were cool.” <strong>He moved to Juventus in the Italian Serie A for the 2018/19 season</strong>, where he played a decisive role in winning the 2019 championship as a regular starter, but was only selected twice for the starting line-up after a change of coach in the 2019/20 season.",
    "published": null
  },
  {
    "title": "Emre Can signs for Juventus! - Juventus",
    "url": "https://www.juventus.com/en/news/articles/emre-can-signs-for-juventus",
    "snippet": "Juve will be the Frankfurt native’s fourth club of his senior career, after starting out with Bayern Munich and everyone at Juventus Football Club would like to extend a big welcome to Emre Can.",
    "published": null
  },
  {
    "title": "Emre Can: Who is the Borussia Dortmund and Germany all-action midfielder? | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/emre-can-juventus-liverpool-bayern-munich-bayer-leverkusen-6141",
    "snippet": "Injury denied him a chance to make ... ever-present in his first season, <strong>missing just nine league games - all through injury - and contributing to Juventus lifting an eighth consecutive Scudetto</strong>, as part of a side featuring Cristiano ...",
    "published": "June 1, 2024"
  },
  {
    "title": "Emre Can - Juventus - Player Profile & Stats",
    "url": "https://www.playmakerstats.com/player/emre-can/161816?epoca_id=148",
    "snippet": "Emre Can is a 31-year-old Football player, born in Frankfurt am Main, Germany on 1994-01-12, who <strong>plays as a Midfielder</strong> for Juventus in Italy.",
    "published": null
  }
]