[
  {
    "title": "Prime Minister of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Ukraine",
    "snippet": "She replaced <strong>Denys Shmyhal</strong>, who had been sworn in on 4 March 2020 following the resignation of Oleksiy Honcharuk. On 15 July 2025, Shmyhal submitted his resignation, a day after President Volodymyr Zelenskyy announced a government reshuffle and proposed replacing Shmyhal with Svyrydenko as ...",
    "published": "3 weeks ago"
  },
  {
    "title": "List of prime ministers of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Ukraine",
    "snippet": "<strong>Denys Shmyhal</strong> is the current prime minister of Ukraine since 4 March 2020.",
    "published": "3 weeks ago"
  },
  {
    "title": "What Will a Change of Prime Minister Mean for Ukraine? | Carnegie Endowment for International Peace",
    "url": "https://carnegieendowment.org/russia-eurasia/politika/2025/07/ukraine-government-reshuffle?lang=en",
    "snippet": "His predecessors did not last nearly as long because traditionally in Ukraine, tensions between the president and prime minister were often the main drama in domestic politics, such as President Leonid Kravchuk versus Prime Minister <strong>Leonid Kuchma</strong>, ...",
    "published": null
  },
  {
    "title": "Yulia Tymoshenko | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Yulia-Tymoshenko",
    "snippet": "<strong>Yulia Tymoshenko</strong> (born November 27, 1960, Dnipropetrovsk, Ukraine, U.S.S.R. [now in Ukraine]) is a Ukrainian businesswoman and politician who served as prime minister of Ukraine (2005, 2007–10).",
    "published": "January 23, 2009"
  },
  {
    "title": "Conflict in Ukraine: A timeline (current conflict, 2022 - present) - House of Commons Library",
    "url": "https://commonslibrary.parliament.uk/research-briefings/cbp-9847/",
    "snippet": "A timeline covering events during the prior eight years is available in Commons Library research briefing CBP-9476, Conflict in Ukraine: A timeline (2014 – eve of 2022 invasion). Note: There was a change of government in the UK following the General Election on 4 July 2024. All references to the Prime Minister and other ministers, and UK government policies, are correct as of the date of each entry. Note: On 20 January 2025 the Trump administration took office in the US.",
    "published": "15 hours ago"
  }
]