[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The McClatchy Company bought Knight Ridder in June 2006 with intentions of selling 12 Knight Ridder newspapers. <strong>On August 2, 2006, McClatchy sold the Beacon Journal to Black Press</strong>. In 2018, GateHouse Media bought the newspaper. On November 11, 2013, the Akron Beacon Journal printed its last ...",
    "published": "1 week ago"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media | Crain's Cleveland Business",
    "url": "https://www.crainscleveland.com/article/20180411/news/157966/akron-beacon-journal-sold-gatehouse-media",
    "snippet": "<strong>GateHouse Media</strong> has purchased the Akron Beacon Journal and its website, Ohio.com, from Black Press Group Ltd.",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal",
    "url": "https://grokipedia.com/page/Akron_Beacon_Journal",
    "snippet": "In August 2006, <strong>Black Press Ltd., a Canadian media company, acquired the Akron Beacon Journal from McClatchy Co. for $165 million</strong>, marking a shift to foreign ownership amid early signs of U.S.",
    "published": null
  },
  {
    "title": "Black Press buys Akron Beacon Journal for $165 million - Poynter",
    "url": "https://www.poynter.org/reporting-editing/2006/black-press-buys-akron-beacon-journal-for-165-million/",
    "snippet": "Akron Beacon Journal The Akron Beacon Journal will become the largest newspaper owned by <strong>the private, family-owned Black Press of British Columbia, Canada</strong>. The Beacon Journal, with a Sunday circulation of about 179,000, is about twice the size of Black Press’ largest paper, the Honolulu ...",
    "published": "June 8, 2006"
  },
  {
    "title": "Gatehouse Media purchases Akron Beacon Journal - cleveland.com",
    "url": "https://www.cleveland.com/akron/2018/04/gatehouse_media_purchases_akro.html",
    "snippet": "We will expect nothing less from the Beacon, as the institution enters the next chapter of its long history in the Akron community.&quot; The Beacon was purchased in 2006 for $165 million by <strong>Black Press Group</strong>, a Canadian publisher.",
    "published": "April 11, 2018"
  }
]