[
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "Mahathir bin Mohamad (Jawi: محاضر بن محمد; IPA: [mahaðɪ(r) bɪn mohamad]; born 10 July 1925) is a Malaysian politician, author and doctor who served as the fourth and seventh prime minister of Malaysia from 1981 to 2003 and again from 2018 to 2020.",
    "published": "3 days ago"
  },
  {
    "title": "Malaysia’s ex-PM Mahathir quits Pejuang party he founded, picks GTA as new political platform | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/malaysia-ex-pm-mahathir-quits-the-pejuang-party-he-founded-chooses-gta-as-new-political-platform",
    "snippet": "KUALA LUMPUR - Malaysia’s former premier Mahathir Mohamad has quit <strong>Parti Pejuang Tanah Air</strong>, a Malay party he founded just over two years ago, indicating a split in political direction with his son Mukhriz Mahathir, who currently heads the party.",
    "published": "November 22, 2024"
  },
  {
    "title": "Mahathir bin Mohamad | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mahathir-bin-Mohamad",
    "snippet": "Last updated Dec. 3, 2025 •History ... Mahathir bin Mohamad (born July 10, 1925, Alor Setar, Kedah [Malaysia]) is a Malaysian politician who served as prime minister of Malaysia (1981–2003; 2018–20), overseeing the country’s transition to an industrialized nation.",
    "published": "July 20, 1998"
  },
  {
    "title": "Mahathir Mohamad, the leader who transformed Malaysia, turns 100",
    "url": "https://www.economist.com/asia/2025/07/10/mahathir-mohamad-the-leader-who-transformed-malaysia-turns-100",
    "snippet": "MAHATHIR MOHAMAD, Malaysia’s prime minister from 1981 to 2003 and again from 2018 to 2020, resembles other statesmen he hobnobbed with back in the 1980s—such as Ronald Reagan, Margaret Thatcher, Lee Kuan Yew and Deng Xiaoping. All of them had distinctive policies; all presided over an economic transformation; all were larger than life.",
    "published": "July 10, 2025"
  },
  {
    "title": "Nearly 100, Malaysia’s Mahathir Mohamad Reflects on Trump and Today’s World | TIME",
    "url": "https://time.com/7282169/mahathir-mohamad-malaysia-prime-minister-hundred-years-trump-world-interview/",
    "snippet": "In clawing back power from Malaysia’s nine royal families, Mahathir consolidated power in the position of Prime Minister as well as the president of UMNO, its oldest national political party.",
    "published": "May 2, 2025"
  }
]