[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Afterwards, she joined the Carter administration as a <strong>domestic policy advisor on urban affairs</strong> and helped advance several housing and neighborhood revitalization bills through Congress. Following her time in Washington D.C., Kaptur went to Massachusetts to do graduate work.",
    "published": "1 week ago"
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "In 1981, while pursuing a <strong>doctorate in urban planning and development finance at MIT</strong>, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the ...",
    "published": "May 27, 2025"
  },
  {
    "title": "Rep. Marcy Kaptur - D Ohio, 9th, In Office - Biography | LegiStorm",
    "url": "https://www.legistorm.com/person/bio/51457/Marcia_Carolyn_Kaptur.html",
    "snippet": "See more about Rep. Marcy Kaptur - D Ohio, 9th, In Office, including dates served, biography, salaries paid, personal financial disclosures, office information, staff directories and other biographical information.",
    "published": null
  },
  {
    "title": "Marcy Kaptur – Alumni Park",
    "url": "https://www.alumnipark.com/exhibits/featured/marcy-kaptur/",
    "snippet": "Kaptur earned a master’s degree in urban planning from Michigan and began doctoral work at the Massachusetts Institute of Technology. But in 1982, she ran for Congress, and she defeated Republican Ed Weber.",
    "published": null
  },
  {
    "title": "About Marcy",
    "url": "https://marcykaptur.com/about-marcy/",
    "snippet": "JavaScript is disabled in your browser · Please enable JavaScript to proceed · A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser",
    "published": null
  }
]