[
  {
    "title": "Australia PM Albanese faces Israel pressure after Bondi Beach attack | Reuters",
    "url": "https://www.reuters.com/world/asia-pacific/australia-pm-albanese-faces-israel-pressure-after-bondi-beach-attack-2025-12-15/",
    "snippet": "Australia&#x27;s Prime Minister Anthony Albanese <strong>visits the scene of the attack on a Jewish holiday celebration at Sydney&#x27;s Bondi Beach, in Sydney, Australia, December 15, 2025</strong>.",
    "published": "1 day ago"
  },
  {
    "title": "Anthony Albanese vows to deploy all resources against antisemitism as criticism mounts after Bondi attack | Anthony Albanese | The Guardian",
    "url": "https://www.theguardian.com/australia-news/2025/dec/15/anthony-albanese-vows-to-deploy-all-resources-against-antisemitism-as-criticism-mounts-following-bondi-attack-ntwnfb",
    "snippet": "<strong>Anthony Albanese says his government will dedicate “every single resource required” to eradicate antisemitism in Australia after the Bondi terror shooting</strong>, after envoy Jillian Segal and the Coalition accused Labor of not doing enough to ...",
    "published": "2 days ago"
  },
  {
    "title": "Anthony Albanese ‘ready for the fight’ to tighten firearms laws as National party and gun groups push back | Bondi beach terror attack | The Guardian",
    "url": "https://www.theguardian.com/australia-news/2025/dec/16/anthony-albanese-ready-for-the-fight-to-tighten-firearms-laws-as-national-party-and-gun-groups-push-back-ntwnfb",
    "snippet": "Tue 16 Dec 2025 01.23 ESTLast modified on Tue 16 Dec 2025 01.35 EST · Share · Anthony Albanese says he is “ready for the fight” to tighten Australia’s firearms laws after the Bondi beach terror attack, as the gun lobby and the National party push back against changes they claim are attempts to divert attention from radicalisation.",
    "published": "13 hours ago"
  },
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "In May 2024, the government legislated a vehicle emission standard for new vehicles sold in Australia from 1 July 2025, in an effort to introduce more fuel efficient vehicles to the Australian market. Albanese&#x27;s government took office during a massive surge in electricity prices exacerbated by the global energy crisis and the Russo-Ukrainian War. On 9 December 2022, Albanese convened a meeting of the National Cabinet and announced a coordinated plan to introduce temporary caps on gas and coal prices.",
    "published": "2 hours ago"
  },
  {
    "title": "Australian prime minister praises Bondi hero Ahmed al-Ahmed as ‘best of our country’ | Bondi beach terror attack | The Guardian",
    "url": "https://www.theguardian.com/australia-news/2025/dec/16/australian-prime-minister-albanese-visits-ahmed-al-ahmed-hospital-bondi-hero-ntwnfb",
    "snippet": "Anthony Albanese met Ahmed’s parents during his near-half hour visit to the hospital on Tuesday and said they were “very proud” of their son who the prime minister described as “the best of our country”.",
    "published": "10 hours ago"
  }
]