[
  {
    "title": "Akron Beacon Journal 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/153167-50",
    "snippet": "<strong>Akron Beacon Journal was acquired by Gannett Company</strong>.",
    "published": null
  },
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The Akron Beacon Journal is a morning newspaper in Akron, Ohio, United States. <strong>Owned by Gannett</strong>, it is the sole daily newspaper in Akron and is distributed throughout Northeast Ohio. The paper&#x27;s coverage focuses on local news.",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal newspaper in Akron Ohio - MondoTimes.com",
    "url": "https://www.mondotimes.com/1/world/us/35/1910/4784",
    "snippet": "The Akron Beacon Journal is one of the highest circulation newspapers in the USA. This newspaper is owned by <strong>Gannett Company, Inc.</strong>",
    "published": null
  },
  {
    "title": "Akron Beacon Journal and other NEO Gannett papers pare back to printing six days a week | Ideastream Public Media",
    "url": "https://www.ideastream.org/news/arts-culture/2022-01-17/akron-beacon-journal-and-other-papers-pare-back-to-printing-six-days-a-week",
    "snippet": "<strong>All of the papers are owned by Gannett</strong>. ... Arts &amp; Culture newspaperAkron Beacon JournalRecord-CourierCity of WoosterCantonMansfieldDoverGannettFrom WKSU ... Kabir Bhatia is a senior reporter for Ideastream Public Media&#x27;s arts &amp; culture team.",
    "published": "January 17, 2022"
  },
  {
    "title": "Akron Beacon Journal - Bias and Credibility - Media Bias/Fact Check",
    "url": "https://mediabiasfactcheck.com/akron-beacon-journal/",
    "snippet": "<strong>The Akron Beacon Journal is owned by Gannett (Gatehouse Media),</strong> which publishes USA Today. In August 2019, Gatehouse Media purchased and merged with Gannett, becoming the largest newspaper chain in the USA.",
    "published": "October 7, 2023"
  }
]