[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist ... spectroscopy (NMR) and mass spectrometry. She was previously a <strong>professor of chemistry and provost and executive vice chancellor at the University of California, Riverside</strong>....",
    "published": "July 15, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Siendo la undécima <strong>rectora de la Universidad de California en Santa Cruz</strong>, Cynthia Larive encabeza una institución mundialmente reconocida por sus investigaciones de alto impacto, en pos de soluciones interdisciplinarias a los mayores retos mundiales, y por su compromiso con la justicia social ...",
    "published": null
  },
  {
    "title": "Cynthia Larive to become 11th chancellor of UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2019/05/chancellor-designate/",
    "snippet": "Currently the provost and executive vice chancellor at UC Riverside, Larive has served the UC community for nearly a decade and a half as a <strong>faculty member, administrator and leader</strong>.",
    "published": "May 13, 2025"
  },
  {
    "title": "UC Riverside Provost Cynthia K. Larive to become UC Santa Cruz’s 11th chancellor | University of California",
    "url": "https://www.universityofcalifornia.edu/press-room/uc-riverside-provost-cynthia-k-larive-become-uc-santa-cruzs-11th-chancellor",
    "snippet": "Cynthia K. Larive as the <strong>eleventh chancellor of UC Santa Cruz</strong>. Currently the provost and executive vice chancellor at UC Riverside, Larive has served the UC community for nearly a decade and a half as a faculty member, ...",
    "published": "November 8, 2021"
  },
  {
    "title": "r/UCSC on Reddit: the chancellor is receiving a 28.5% pay increase.",
    "url": "https://www.reddit.com/r/UCSC/comments/1fw5ojy/the_chancellor_is_receiving_a_285_pay_increase/",
    "snippet": "Article states &quot;UC Santa Cruz Chancellor Cynthia Larive will voluntarily forgo her base salary increase for 2024-25.&quot; You should know that this is in reference to the 4% across-the-board increase that all staff got, not the upcoming 28.5% increase.",
    "published": "October 4, 2024"
  }
]