[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "In May 2015, Schlein announced through a post on Facebook that she was leaving the PD, being in deep disagreement with the new political line of the party imposed by the party secretary and Italy&#x27;s prime minister Matteo Renzi, and joined Possible, <strong>the party founded by Civati</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Elly Schlein – POLITICO",
    "url": "https://www.politico.eu/person/elly-schlein/",
    "snippet": "Schlein, secretary of the <strong>center-left Democratic Party</strong>, has railed against the prime minister for her politics. ... Fading Italian firebrand pins his election chances on a 3km crossing that’s been mooted since Roman times.",
    "published": null
  },
  {
    "title": "Biography - Elly Schlein",
    "url": "https://www.ellyschlein.it/en/biography",
    "snippet": "She is later elected to the party’s national Assembly and national Board. Elly Schlein is a candidate in the European elections: this is a new challenge, an uphill path which, she knows, needs to involve and engage citizens through collective mobilization, taking it step by step.",
    "published": "February 16, 2022"
  },
  {
    "title": "Why Elly Schlein is freaking out Italy’s ‘soft’ socialists",
    "url": "https://www.politico.eu/article/elly-schlein-italy-soft-socialist-democratic-party-leader/",
    "snippet": "Right-wing hardliners could not dream of an easier target than Elly Schlein, the new leader of Italy’s <strong>center-left Democratic Party (PD).</strong>",
    "published": "March 2, 2023"
  },
  {
    "title": "4 Things to Know About Elly Schlein, Face of Italy's Largest Opposition Party | ITALY Magazine",
    "url": "https://www.italymagazine.com/featured-story/4-things-know-about-elly-schlein-face-italys-largest-opposition-party",
    "snippet": "On March 12, 37-year-old Elly Schlein will officially take the helm of Italy&#x27;s struggling <strong>Partito Democratico</strong> (Democratic Party or PD). Here&#x27;s a rundown of her biography and basic stats.",
    "published": "March 9, 2023"
  }
]