[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Through the 1920s, Alfa Romeo produced several successful road and race cars, and was well represented in prominent European motorsport events, notably winning the inaugural AIACR World Manufacturers&#x27; Championship at the 1925 Grand Prix season. Nevertheless, the company soon faced financial troubles, leading to Romeo&#x27;s contentious departure in 1928 and Italian government ownership in 1933.",
    "published": "3 weeks ago"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "When <strong>Cavalier Ugo Stella</strong> purchased the shares of an italian automotive plant in Milan, the company’s legacy of sport-oriented vehicles began. The name Alfa is actually an acronym for, “Anonima Lombarda Fabbrica Automobili” – A.L.F.A.",
    "published": "April 26, 2021"
  },
  {
    "title": "History of Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Alfa_Romeo",
    "snippet": "<strong>In 1933 ownership of Alfa Romeo passed, through IRI, to the Italian state</strong> because of the heavy debt the company had incurred with banks since the previous decade.",
    "published": "October 20, 2025"
  },
  {
    "title": "Who Owns Alfa Romeo? | Alfa Romeo of Plano",
    "url": "https://www.alfaofplano.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "From 2007 on, Alfa Romeo was owned by <strong>Fiat Chrysler Automobiles (FCA).</strong> However, on January 16, 2021, FCA merged its operations with the French PSA Group, Peugeot S.A., to form Stellantis, now recognized as the fourth largest automaker globally.",
    "published": "August 25, 2025"
  },
  {
    "title": "Who Owns Alfa Romeo | Alfa Romeo FIAT of Santa Monica",
    "url": "https://www.alfaromeousaofsantamonica.com/the-ownership-history-of-alfa-romeo/",
    "snippet": "While Alfa Romeo is a long-respected ... “Who owns Alfa Romeo now?” <strong>Fiat-Chrysler Automobiles (FCA) purchased the automaker in 2007 and then later merged with the PSA group to form Stellantis</strong>....",
    "published": "January 11, 2025"
  }
]