[
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Previously, he served in the National Senate as representative for the province of Buenos Aires. Fernández <strong>initiated his career as consultant to the Budget Committee for the Senators Chambers of the province of Buenos Aires in 1983</strong>.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anibal_Fernandez",
    "snippet": "He served as <strong>Minister of Production under Eduardo Duhalde, as Interior Minister under Néstor Kirchner, as Minister of Justice under Cristina Fernández de Kirchner, and as the President&#x27;s Cabinet Chief from 2009 to 2011.</strong> Most recently, he served as interventor of the state-owned mining company ...",
    "published": "March 27, 2025"
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "<strong>After the 2009 mid-term elections, Aníbal Fernández was chosen to become the President&#x27;s Cabinet Chief. He held this important position from July 8, 2009, until December 10, 2011.</strong>",
    "published": null
  },
  {
    "title": "Argentina - Politics",
    "url": "https://www.globalsecurity.org/military/world/argentina/president-fernandez-a.htm",
    "snippet": "Alberto Fernandez is not to be confused with former Justice Minister Anibal Fernandez (AF), whom Argentine President Cristina Fernandez de Kirchner&#x27;s (CFK) promoted to Cabinet Chief in September 2009.",
    "published": null
  },
  {
    "title": "Aníbal Fernández (Politician) - Age, Birthday, Bio, Facts, Family, Net Worth, Height & More | AllFamous.org",
    "url": "https://allfamous.org/people/anibal-fernandez-19570126.html",
    "snippet": "He served as Minister of Production under Eduardo Duhalde, Interior Minister under Néstor Kirchner, Justice Minister under Cristina Fernández de Kirchner and <strong>Chief of Staff for the President from 2009 to 2011</strong> ..",
    "published": "March 20, 2023"
  }
]