[
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "At the urging of Prime Minister ... to &quot;support a smooth exit&quot; from the EU, and to a further two months for an orderly transition to his successor, <strong>Andrew Bailey</strong>....",
    "published": "2 days ago"
  },
  {
    "title": "Mark Carney: An experienced and pragmatic economist to succeed Trudeau (and take on Trump) | International | EL PAÍS English",
    "url": "https://english.elpais.com/international/2025-03-11/an-experienced-and-pragmatic-economist-to-succeed-trudeau-and-take-on-trump.html",
    "snippet": "The change at the head of the Liberal Party, staged this Sunday with a vote in which the economist and former governor of two central banks, Mark Carney, <strong>obtained 89.6% of support to succeed Prime Minister Justin Trudeau</strong>, was another great symbol. Once the succession was confirmed, Carney, ...",
    "published": "March 11, 2025"
  },
  {
    "title": "I quit Mark Carney’s cabinet. This is what I hope happens next",
    "url": "https://www.thestar.com/opinion/contributors/i-quit-mark-carneys-cabinet-this-is-what-i-hope-happens-next/article_9d6ae260-89ed-48ca-854b-7aace652a5ee.html",
    "snippet": "Steven Guilbeault is the Liberal member of Parliament for Laurier–Sainte-Marie. He previously served as the minister of Canadian identity and culture under Mark Carney.",
    "published": "5 days ago"
  },
  {
    "title": "Who is Liberal leader Mark Carney, Canada's new prime minister?",
    "url": "https://www.bbc.com/news/articles/c3911lv1pzko",
    "snippet": "The former Bank of England boss, Mark Carney, has <strong>won Canada&#x27;s election to become the country&#x27;s next prime minister</strong>.",
    "published": "April 29, 2025"
  },
  {
    "title": "Mark Carney to become Canada’s new Prime Minister : NPR",
    "url": "https://www.npr.org/2025/03/09/nx-s1-5322459/mark-carney-canada-new-prime-minister",
    "snippet": "Mark Carney to become Canada’s new Prime Minister <strong>Carney, 59, will succeed Justin Trudeau</strong>, who announced in January that he would step down amid low approval ratings following a decade in office.",
    "published": "March 9, 2025"
  }
]