[
  {
    "title": "Maresca provides latest on Palmer, Fofana and Delap | News | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/news/article/enzo-maresca-delivers-chelsea-team-news-ahead-of-everton-december-2025",
    "snippet": "Enzo Maresca has said <strong>Cole Palmer and Wesley Fofana should be available for tomorrow&#x27;s Premier League clash with Everton</strong>.",
    "published": null
  },
  {
    "title": "Enzo Maresca: Chelsea boss refuses to explain public outburst but insists he is committed to the club | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11668/13483601/enzo-maresca-chelsea-boss-refuses-to-explain-public-outburst-but-insists-he-is-committed-to-the-club",
    "snippet": "Football · Chelsea boss Enzo Maresca refused to explain the comments he made after beating Everton on Saturday; Maresca said the days before the 2-0 win were his &quot;worst 48 hours&quot; as Chelsea boss; watch Cardiff vs Chelsea live on Sky Sports on Tuesday, kick-off 8pm · Monday 15 December 2025 18:48, UK ·",
    "published": "1 day ago"
  },
  {
    "title": "This was the most ‘Chelsea’ Chelsea have been under Enzo Maresca - The Athletic",
    "url": "https://www.nytimes.com/athletic/6850345/2025/12/01/chelsea-enzo-maresca-arsenal/",
    "snippet": "Enzo Maresca&#x27;s side played like an old-school Chelsea team Darren Walsh/Chelsea FC via Getty Images) ... Dec. 1, 2025 ... For those who remember Enzo Maresca in his playing days, it can be difficult to square the perception of Maresca the player with the perception of Maresca the coach.",
    "published": "2 weeks ago"
  },
  {
    "title": "Enzo Maresca addresses the expectations at Chelsea after his outburst - VAVEL International",
    "url": "https://www.vavel.com/en/football/2025/12/16/chelsea-fc/1244741-enzo-maresca-addresses-the-expectations-at-chelsea-after-hisoutburst.html",
    "snippet": "But I think it&#x27;s something normal when you are a Chelsea player or Chelsea manager. “The target for this club is to improve. And we&#x27;re going to try to improve what we did last season.” ... Enzo Maresca explains why Chelsea need to ‘pay attention’ in the Carabao Cup quarter-final 34 minutes ago",
    "published": "10 hours ago"
  },
  {
    "title": "Enzo Maresca has created a big problem and might not be at Chelsea next season, says Jamie Carragher | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13483864/enzo-maresca-has-created-a-big-problem-and-might-not-be-at-chelsea-next-season-says-jamie-carragher",
    "snippet": "Enzo Maresca refused to clarify who his recent cryptic comments were about in a press conference on Monday ahead of Chelsea&#x27;s Carabao Cup quarter-final against Cardiff, live on Sky Sports; Jamie Carragher compares the situation to Mo Salah&#x27;s recent Liverpool outburst · Monday 15 December 2025 19:44, UK ·",
    "published": "1 day ago"
  }
]