[
  {
    "title": "Anke Domscheit-Berg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anke_Domscheit-Berg",
    "snippet": "<strong>Her mandate ended in 2025 because she did not run for re-election</strong>. Previously, she was a member of the Pirate Party Germany and the Greens. She is married to Daniel Domscheit-Berg. Anke Domscheit-Berg grew up as daughter of an art historian and a doctor in Müncheberg, East Germany.",
    "published": "August 13, 2025"
  },
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://grokipedia.com/page/Anke_Domscheit-Berg",
    "snippet": "Anke Domscheit-Berg joined the Pirate Party Germany (Piratenpartei Deutschland) in May 2012, motivated by its emphasis on digital civil liberties, copyright reform, and government transparency, which resonated with her prior work in open data initiatives and whistleblower platforms.[40] Her entry followed years of affiliation with the Greens, reflecting a shift toward a party prioritizing net neutrality and privacy amid growing concerns over state surveillance post-Snowden revelations.[19] In the 2013 federal election, she secured the second position on the party&#x27;s Brandenburg state list, camp",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg | The Guardian",
    "url": "https://www.theguardian.com/profile/anke-domscheit-berg",
    "snippet": "Anke Domscheit-Berg is chairwoman of the State of Brandenburg Pirate Party and a candidate for the Bundestag at the upcoming elections. She is an open government activist, consultant and writer",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg | NEXT Conference",
    "url": "https://nextconf.eu/person/anke-domscheit-berg/",
    "snippet": "Anke Domscheit-Berg is <strong>member of the Pirate Party and regional party leader of the PIRATEN Brandenburg</strong>. As longtime activist and journalist, she is specializing in upheavals due to the digital society, the dangers of a police state and the ...",
    "published": "May 3, 2014"
  },
  {
    "title": "Anke und Daniel Domscheit-Berg, Internet Activists",
    "url": "https://amp.dw.com/en/anke-und-daniel-domscheit-berg-internet-activists/a-17370803",
    "snippet": "After a falling-out with Julian ... to causes she believes in after a couple of burn-outs and hospital stays.<strong>She&#x27;s now a member of the Pirate Party</strong> and campaigns for greater political transparency and for more women in top ...",
    "published": "January 31, 2014"
  }
]