[
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The International Mathematical Union is administered by an executive committee (EC) which <strong>conducts the business of the Union</strong>. The EC consists of the President, two vice-presidents, the Secretary, six Members-at-Large, all elected for a term of four years, and the Past President.",
    "published": "February 24, 2025"
  },
  {
    "title": "IMU Executive Committee | International Mathematical Union Leadership 2023-2026",
    "url": "https://www.mathunion.org/organization/imu-executive-committee",
    "snippet": "The International Mathematical Union is administered by an Executive Committee (EC) which, in accordance with the IMU Statutes and subject to the direction and review of the members, <strong>conducts the business of the Union</strong>.",
    "published": null
  },
  {
    "title": "What is the IMU? Understanding the International Mathematical Union",
    "url": "https://www.mathunion.org/outreach/publications-about-imu/what-imu",
    "snippet": "Members of the Executive Committee serve for four years, long enough to organize the ICM, and are elected from a slate of candidates proposed by the sitting Executive Committee and the IMU member nations. The Executive Committee <strong>oversees all of the operations that go into organizing the ICM</strong>.",
    "published": null
  },
  {
    "title": "ICMI Executive Committee | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/icmi/organization/icmi-executive-committee",
    "snippet": "The document below describes the general responsibilities, the composition, the duties and the commitments of all the Executive Committee (EC) members.",
    "published": null
  },
  {
    "title": "IMU Leadership 2011-2014 | International Mathematical Union Executive Committee",
    "url": "https://www.mathunion.org/organization/imu-representatives/imu-leadership-2011-2014",
    "snippet": "Explore the IMU leadership and executive committee members from 2011 to 2014, including presidents, vice presidents, and commission members.",
    "published": null
  }
]