[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 and resigned on 6 October 2025, but was re-appointed on 10 October.",
    "published": "18 hours ago"
  },
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "He resigned on 6 October 2025 after just 26 days in office, making his tenure as prime minister the shortest in the history of the French Fifth Republic.",
    "published": "18 hours ago"
  },
  {
    "title": "France’s prime minister faces crunch vote in parliament | Politics News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/12/9/frances-prime-minister-faces-crunch-vote-in-parliament",
    "snippet": "<strong>Sébastien Lecornu</strong> faces a vital test to his premiership over the social security budget bill.",
    "published": "1 week ago"
  },
  {
    "title": "France's new prime minister takes office amid anti-government protests | Reuters",
    "url": "https://www.reuters.com/world/europe/frances-new-prime-minister-takes-office-amid-anti-government-protests-2025-09-10/",
    "snippet": "Item 1 of 5 France&#x27;s newly-appointed Prime Minister <strong>Sebastien Lecornu</strong> reacts as he speaks at the end of the handover ceremony at the Hotel Matignon in Paris on September 10, 2025.",
    "published": "September 10, 2025"
  },
  {
    "title": "2024–2025 French political crisis - Infogalactic: the planetary knowledge core",
    "url": "https://infogalactic.com/info/2024-2025_French_political_crisis",
    "snippet": "Prime minister <strong>François Bayrou</strong> (right), during a meeting with European commissionner Magnus Brunner. On 13 December, Macron appointed Democratic Movement leader <strong>François Bayrou</strong> as Prime Minister.[41] According to Le Monde, the appointment of Bayrou was decided on at the last minute, with ...",
    "published": null
  }
]