[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Jesse Ventura (born James George ... Federation (WWF, now WWE), he served as the 38th governor of Minnesota from 1999 to 2003. He was <strong>elected governor with the Reform Party</strong> and is the party&#x27;s only candidate to win a major government office....",
    "published": "2 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Ventura (Green Party of Alaska) lost in the general election on November 3, 2020. ... Ventura ran for governor of Minnesota in 1998. <strong>Ventura was elected as a member of the Reform Party, but later left and reorganized the Minnesota Reform Party as the Independence Party</strong>.[1] He did not seek a ...",
    "published": null
  },
  {
    "title": "Governorship of Jesse Ventura | MNopedia",
    "url": "https://www.mnhs.org/mnopedia/search/index/event/governorship-jesse-ventura",
    "snippet": "In November 1998 Jesse Ventura, ... 37 percent of the vote, on the ticket of the Reform Party, <strong>a tiny organization with no track record of victory</strong>....",
    "published": "April 14, 2025"
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "<strong>In 1998 Ventura ran for governor of Minnesota as the Reform Party candidate</strong>. Support for his campaign quickly grew, in part owing to his offbeat television ads (in one a Jesse Ventura action figure battled another figure named Evil Special Interest ...",
    "published": "January 14, 2009"
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th ... served as Governor for one term. Shocking the political establishment, <strong>Ventura became the only Reform Party candidate to ever win the office of Minnesota Governor</strong>....",
    "published": null
  }
]