[
  {
    "title": "McClatchy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/McClatchy",
    "snippet": "<strong>McClatchy became a co-owner on February 12, 1866, and majority stock owner on June 26, 1872</strong>. At that time the firm&#x27;s name was changed to McClatchy &amp; Co. His son Charles K. McClatchy soon joined his father as junior partner, and succeeded him upon his death in 1883.",
    "published": "10 hours ago"
  },
  {
    "title": "McClatchy | History",
    "url": "https://www.mcclatchy.com/about/history",
    "snippet": "It all <strong>started on February 3, 1857</strong>, when James McClatchy helped launch the company’s first newspaper in the wake of the California Gold Rush.",
    "published": null
  },
  {
    "title": "McClatchy Company records, 1857-2002 inclusive, bulk 1923-1970 bulk - OAC",
    "url": "https://oac.cdlib.org/findaid/ark:/13030/kt4p3025zf",
    "snippet": "The bulk of the McClatchy Newspapers and Broadcasting Collection is comprised of materials related to the operations of the McClatchy Newspapers, especially those of the Sacramento Bee, and the numerous broadcasting endeavors of the McClatchy Company during the first half of the 20th century; also present are materials concerning the McClatchy family and California&#x27;s Central Valley region. Prominent in the material related to the newspapers and broadcast stations are historical documents and publications regarding the company&#x27;s day-to-day operations, its dealings with its employees, as well as",
    "published": null
  },
  {
    "title": "McClatchy | Home Page",
    "url": "https://www.mcclatchy.com/",
    "snippet": "History · Leadership · News · Employees · Pension · Leadership · News · News industry leaders join Austin Tice’s brother in call for journalist’s release from Syria · McClatchy Acquired by Chatham Asset Management, LLC · nancy-a-meyer-named-president-of-the-miami-herald ·",
    "published": null
  },
  {
    "title": "The McClatchy Company - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/the-mcclatchy-company",
    "snippet": "In 1979, McClatchy expanded into the Northwest with the purchase of the Anchorage Daily News and the Tri-City Herald in Kennewick, Wash. In 1986, The News Tribune in Tacoma, Wash., was added to McClatchy’s growing family of newspapers. The company went public in February 1988 and its Class A common shares are listed on The New York Stock Exchange under the symbol MNI.",
    "published": null
  }
]