[
  {
    "title": "Gannett Co Inc Locations - Headquarters & Offices – GlobalData - GlobalData",
    "url": "https://www.globaldata.com/company-profile/gannett-co-inc/locations/",
    "snippet": "Gannett Co Inc headquarters address, phone number and website information and details on other Gannett Co Inc&#x27;s locations and subsidiaries.",
    "published": null
  },
  {
    "title": "Contact - Gannett",
    "url": "https://www.gannett.com/contact/",
    "snippet": "Have questions or feedback? We’d love to hear from you · Gannett Co., Inc. 1675 Broadway, 23rd Floor <strong>New York, NY 10019</strong> Tel: (703) 854-6000",
    "published": "April 3, 2024"
  },
  {
    "title": "USA Today Co. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gannett",
    "snippet": "In December 2022, presiding Judge, Deborah A. Chimes acquiesced to Gannett&#x27;s demands that NY Workers Compensation Board – despite the existence of the Child Victims Act as NY State law – determine if Plaintiffs have a valid cause of action for damages or whether they are limited to benefits under the Worker’s Compensation Law. This despite the fact that the Workers Compensation Board has no mechanism to consider this question of justice and legal rights, as the Board is tasked by the state of New York solely to: &quot; administer workers’ compensation, disability benefits and Paid Family Leave.&quot;",
    "published": "1 week ago"
  },
  {
    "title": "Gannett Company, Inc. | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/books/politics-and-business-magazines/gannett-company-inc",
    "snippet": "The company also owns and operates over 130 web sites in the United States and another 80 in the United Kingdom. Headquartered in <strong>Arlington, Virginia</strong>, Gannett maintains offices in 43 states, the District of Columbia, Guam, the United Kingdom, Belgium, Germany, Italy, and Hong Kong.",
    "published": null
  },
  {
    "title": "Gannett/USA TODAY Headquarters - Hines",
    "url": "https://www.hines.com/properties/gannettusa-today-headquarters-mclean",
    "snippet": "In April 1997, Hines was retained by Gannett Co., Inc. to serve as development manager for its new headquarters facility located on 25 acres in the <strong>Tysons Corner area of Fairfax County, Virginia</strong>.",
    "published": null
  }
]