[
  {
    "title": "Abdullah of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdullah_of_Saudi_Arabia",
    "snippet": "On <strong>13 June 1982</strong> King Khalid died, and Fahd bin Abdulaziz became King. Abdullah became Crown Prince the same day who also maintained his position as head of the National Guard. During his years as crown prince, Abdullah bin Abdulaziz was described as a supporter of accommodation.",
    "published": "October 12, 2025"
  },
  {
    "title": "Saudi Arabia's King Abdullah bin Abdulaziz dies - BBC News",
    "url": "https://www.bbc.com/news/world-middle-east-30945324",
    "snippet": "In recent months Abdullah&#x27;s age and failing health had led to increasing focus on the issue of the Saudi royal succession. The crown has traditionally passed between Ibn Saud&#x27;s sons, but few are still alive. King Salman&#x27;s appointment of Mohammed bin Nayef - a grandson of Ibn Saud - as deputy crown prince effectively smoothes the line of succession for years to come.",
    "published": "January 23, 2015"
  },
  {
    "title": "Abdullah of Saudi Arabia | King, Biography, History, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Abdullah-of-Saudi-Arabia",
    "snippet": "Notable among his decisions were ... with overseeing girls’ education. Upon Abdullah’s death in 2015, <strong>his half-brother Salman was appointed king</strong>....",
    "published": "August 11, 2005"
  },
  {
    "title": "Death of Saudi Arabia’s King Abdullah: a succession story",
    "url": "https://theconversation.com/death-of-saudi-arabias-king-abdullah-a-succession-story-36652",
    "snippet": "The passing of King Abdullah of Saudi Arabia will change little in the kingdom and its relations with the West. The monarch had been ailing and reclusive for some years and his anointed successor (and…",
    "published": "March 4, 2025"
  },
  {
    "title": "After King Abdullah's Death, Saudi Arabia's Line to Throne in Spotlight",
    "url": "https://www.nbcnews.com/storyline/saudi-arabia-succession/after-king-abdullahs-death-saudi-arabias-line-throne-spotlight-n292101",
    "snippet": "<strong>Just hours after Abdullah&#x27;s death early Friday at age 90, the new monarch also elevated his youngest half-brother, Deputy Crown Prince Muqrin, 69, as crown prince</strong>. To replace Muqrin, Salman nominated nephew Mohammed bin Nayef, 55, as deputy ...",
    "published": "June 11, 2015"
  }
]