[
  {
    "title": "Saudi Arabia Strengthens Leadership Role Within the International Renewable Energy Agency - SolarQuarter",
    "url": "https://solarquarter.com/2025/12/11/saudi-arabia-strengthens-leadership-role-within-the-international-renewable-energy-agency/",
    "snippet": "- 11th December 2025 · 0 · 183 · Share · Facebook · Twitter · Pinterest · WhatsApp · Linkedin · ReddIt · Email · Print · Telegram · Copy URL · The Ministry of Energy announced that the Kingdom of Saudi Arabia has reinforced its leadership presence within the International Renewable Energy Agency (IRENA) as its newly appointed permanent representative formally submitted his credentials in Abu Dhabi.",
    "published": "5 days ago"
  },
  {
    "title": "Saudi Arabia Digital Infrastructure Boosted by Khazna’s Entry and Leadership Appointment - TechAfrica News",
    "url": "https://techafricanews.com/2025/12/09/saudi-arabia-digital-infrastructure-boosted-by-khaznas-entry-and-leadership-appointment/",
    "snippet": "December 9, 2025 · 3 min read · Author: Jennifer Onyeagoro · F · E · In his new role, <strong>Bin Hassan</strong> will strengthen Khazna’s presence in Saudi Arabia, deepen partnerships with local clients, and drive sustainable capacity growth in the country ...",
    "published": "1 week ago"
  },
  {
    "title": "Unlocking the leadership potential in Saudi Arabia’s transformation | Arab News PK",
    "url": "https://www.arabnews.pk/node/2626253",
    "snippet": "December 15, 2025 ... London Business School is proud to have supported the transformation and growth of almost 1,000 female Saudi leaders. (LBS) ... Saudi Arabia’s Vision 2030 calls for an ambitious process of transformation to diversify the economy, empower citizens and foster a vibrant society and environment for both local and international investors.",
    "published": "2 days ago"
  },
  {
    "title": "World Report 2025: Saudi Arabia | Human Rights Watch",
    "url": "https://www.hrw.org/world-report/2025/country-chapters/saudi-arabia",
    "snippet": "<strong>Crown Prince Mohammed bin Salman</strong> has consolidated political and economic power, including as chairman of Saudi Arabia’s Public Investment Fund (PIF), a sovereign wealth fund that has facilitated and benefited from rights abuses.",
    "published": "January 16, 2025"
  },
  {
    "title": "Saudi Arabia Emerges as Global Leader in Volunteerism and Nonprofit Innovation",
    "url": "https://forbes.kz/articles/saudi-arabia-emerges-as-global-leader-in-volunteerism-and-nonprofit-innovation-93b1f9",
    "snippet": "<strong>Riyadh has firmly placed itself on the global map of social impact and volunteerism leadership</strong> with the successful conclusion of the Beyond Profit International Nonprofit Forum, organized by the National Center for the Non-Profit Sector (NCNP) ...",
    "published": "5 days ago"
  }
]