[
  {
    "title": "Dirk Helbing - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Dirk_Helbing",
    "snippet": "Since June 2015 he was <strong>affiliate professor at the faculty of Technology, Policy and Management at TU Delft</strong> for some years, where he led the PhD school in &quot;Engineering Social Technologies for a Responsible Digital Future&quot;. Dirk Helbing started out as a physicist.",
    "published": "1 week ago"
  },
  {
    "title": "Prof.dr. Dirk Helbing",
    "url": "https://www.tudelft.nl/en/tpm/research/projects/engineering-social-technologies-for-a-responsible-digital-future/profdr-dirk-helbing/",
    "snippet": "As a <strong>visiting scientist at Tel Aviv University and the Weizmann Institute in Israel, the Eötvös University in Budapest, and Xerox PARC in California</strong>, he focused on various complex systems - from panicking pedestrians to traffic jams, and from ...",
    "published": null
  },
  {
    "title": "Dirk Helbing",
    "url": "https://www.edx.org/bio/dirk-helbing",
    "snippet": "Dirk Helbing is <strong>Professor of Computational Social Science at the Department of Humanities, Social and Political Sciences and affiliate of the Computer Science Department at ETH Zurich</strong>. He earned a PhD in physics and was Managing Director of the Institute of Transport &amp; Economics at Dresden ...",
    "published": null
  },
  {
    "title": "Prof. Dr. Dirk Helbing | ETH Zurich",
    "url": "https://istp.ethz.ch/people/person-detail.dhelbing.html",
    "snippet": "Dirk Helbing <strong>started as a physicist</strong>. With his diploma thesis, he initiated the area of pedestrian, crowd, and evacuation modeling and simulation. During his PhD and habilitation in physics, he helped to establish the fields of socio-, econo- and traffic physics.",
    "published": null
  },
  {
    "title": "Dirk Helbing - ETH Zurich | LinkedIn",
    "url": "https://www.linkedin.com/in/dirk-helbing-58b291b1/",
    "snippet": "Dirk Helbing is Professor of Computational Social Science at the Department of… · Experience: ETH Zurich · Education: University of Stuttgart · Location: Zurich · 500+ connections on LinkedIn. View Dirk Helbing’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": "5 days ago"
  }
]