[
  {
    "title": "BC Partners to acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/bc-partners-acquire-com-hem",
    "snippet": "London – BC Partners, a leading international private equity firm, today announces that <strong>it has signed an agreement to acquire Com Hem</strong>, Sweden’s leading TV, broadband and telephony company, from The Carlyle Group (“Carlyle”) and Providence Equity Partners (“Providence”). Financial ...",
    "published": null
  },
  {
    "title": "BC Partners to acquire Com Hem — BC Partners",
    "url": "https://www.bcpartners.com/news/bc-partners-to-acquire-com-hem/",
    "snippet": "July 21, 2011 – BC Partners, a leading international private equity firm, today announces that <strong>it has signed an agreement to acquire Com Hem</strong>, Sweden’s leading TV, broadband and telephony company, from The Carlyle Group (“Carlyle”) and ...",
    "published": "April 28, 2025"
  },
  {
    "title": "BC Partners - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/BC_Partners",
    "snippet": "The acquisition became an issue of the media and legal dispute with the company&#x27;s previous owner, Empreno Ventures, which asked BC Partners to wait until judicial resolution. On November 7, BC Partners was added to a lawsuit by Empreno seeking to ban the sale of Vivacom. In early 2021, the firm entered into talks with Inter Milan owner Suning about potentially buying the football club. In August 2025...",
    "published": "October 22, 2025"
  },
  {
    "title": "Com Hem 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10876-33",
    "snippet": "<strong>Com Hem has raised $1.35B</strong>. Ardian, BC Partners, EQT, Kinnevik, and Providence Equity Partners are 5 of 7 investors who have invested in Com Hem.",
    "published": null
  },
  {
    "title": "BC Partners - 2025 Investor Profile, Portfolio, Team & Exits - Tracxn",
    "url": "https://tracxn.com/d/private-equity/bc-partners/__Qik_uYeUiUViOWrvdusErwMyiuQ6_f5AqPg9eQMI41k",
    "snippet": "It is primarily based in London, United Kingdom. As of Dec 2025, BC Partners has a portfolio of 146 companies, comprising 82 funding rounds and <strong>68 acquisitions</strong>. In the last 12 months, it has participated in 2 acquisitions.",
    "published": "2 weeks ago"
  }
]