[
  {
    "title": "Patricia Bullrich - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Patricia_Bullrich",
    "snippet": "She currently serves as a National Senator for the Autonomous City of Buenos Aires since December 2025, representing La Libertad Avanza. She previously served as the Minister of National Security from 2023 to 2025 under president Javier Milei and from 2015 to 2019 under president Mauricio Macri.",
    "published": "5 days ago"
  },
  {
    "title": "Ministry of National Security (Argentina) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Security_(Argentina)",
    "snippet": "The Ministry was created in 2010 by decree of then-President Cristina Fernández de Kirchner; matters of national security had previously been part of the Ministry of Justice&#x27;s portfolio.",
    "published": "October 19, 2025"
  },
  {
    "title": "Argentina cabinet reshuffle: Milei appoints new security and defense ministers - Buenos Aires Herald",
    "url": "https://buenosairesherald.com/politics/argentina-cabinet-reshuffle-milei-appoints-new-security-and-defense-ministers",
    "snippet": "I thank [Milei] for trusting you and upholding the only doctrine that has put Argentina in order: a hardline approach, clear rules, and a constant truth: whoever does it, pays for it.” · Monteoliva was previously Córdoba’s provincial security minister during Juan Schiaretti’s governorship, but was replaced in December 2013 after a series of police strikes led to a wave of lootings.",
    "published": "1 month ago"
  },
  {
    "title": "OAS :: Member State :: Argentina",
    "url": "https://www.oas.org/en/member_states/member_state.asp?sCode=ARG",
    "snippet": "Minister of Security (<strong>Ministro de Seguridad</strong>): Dr.",
    "published": null
  },
  {
    "title": "Ministries of the Argentine Republic - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministries_of_the_Argentine_Republic",
    "snippet": "The 1983 Law on Ministries passed by then-president Raúl Alfonsín set the precedent for secretariats of state with ministerial rank. These secretaries respond directly to the presidency.",
    "published": "1 week ago"
  }
]