[
  {
    "title": "Revolution of Dignity - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Revolution_of_Dignity",
    "snippet": "The Revolution of Dignity (Ukrainian: Революція гідності, romanized: Revoliutsiia hidnosti), also known as the Maidan Revolution or the Ukrainian Revolution, <strong>took place in Ukraine in February 2014 at the end of the Euromaidan protests</strong>. Scores of protesters were killed by government ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Ukraine - Maidan, Protest, Revolution | Britannica",
    "url": "https://www.britannica.com/place/Ukraine/The-Maidan-protest-movement",
    "snippet": "Street protests erupted in Kyiv, and Lutsenko and Klitschko emerged as the leaders of the largest demonstrations since <strong>the Orange Revolution</strong>. Police violently dispersed crowds in Kyiv’s Maidan Nezalezhnosti (“Independence Square”), and, ...",
    "published": "October 5, 2025"
  },
  {
    "title": "Contemporary Ukraine in Revolution and Conflict (2004-2014) - The War in Ukraine - LibGuides at University of Connecticut",
    "url": "https://guides.lib.uconn.edu/ukraine/contemporary",
    "snippet": "<strong>The Euromaidan Protests/Maidan Revolution/Revolution of Dignity/Revolution of Honour</strong> was a student protest movement that sought to force the pro-Kremlin Ukrainian President Viktor Yanukovych to sign an agreement of association with the European Union. The mass protests were focused in and around ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Ukraine's revolution: Making sense of a year of chaos - BBC News",
    "url": "https://www.bbc.com/news/world-europe-30131108",
    "snippet": "Ukrainian novelist Andrey Kurkov looks back on the tumultuous events of the last year, beginning with the Kiev protests and ending with civil war in the east.",
    "published": "November 21, 2014"
  },
  {
    "title": "Understanding Ukraine’s Euromaidan Protests - Open Society Foundations",
    "url": "https://www.opensocietyfoundations.org/explainers/understanding-ukraines-euromaidan-protests",
    "snippet": "In late November 2013, Ukrainians ... Union. As the protests in Kyiv’s Independence Square, or Maidan, continued into 2014, <strong>the government began cracking down on the demonstrators</strong>. The size of the protests only grew in reaction and turned into what was termed “the revolution ...",
    "published": null
  }
]