[
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Norvig is a <strong>councilor of the Association for the Advancement of Artificial Intelligence</strong> and co-author, with Stuart J. Russell, of Artificial Intelligence: A Modern Approach, now the leading college text in the field.",
    "published": "1 month ago"
  },
  {
    "title": "Peter Norvig - Stanford HAI",
    "url": "https://hai.stanford.edu/people/peter-norvig",
    "snippet": "Get the latest news, advances in research, policy work, and education program updates from HAI in your inbox weekly. ... Peter Norvig is a Distinguished Education Fellow at Stanford&#x27;s Human-Centered Artificial Intelligence Institute and a researcher at Google Inc; previously he directed Google&#x27;s ...",
    "published": null
  },
  {
    "title": "Peter Norvig: Today's Most Pressing Questions in AI Are ...",
    "url": "https://hai.stanford.edu/news/peter-norvig-todays-most-pressing-questions-ai-are-human-centered",
    "snippet": "... The AI expert, who joins Stanford HAI as a Distinguished Education Fellow, discusses building inclusive education and broadening access to students. Artificial intelligence expert Peter Norvig is <strong>joining the Stanford Institute for Human-Centered AI this fall as a Distinguished Education Fellow</strong>, ...",
    "published": null
  },
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "Excited to share the news that Sarah Akhtar and Katherine McConachie have joined the Quill.org team to advance our mission forward of helping… ... By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. ... By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. “Peter is well known to most in this field as a great visionary.",
    "published": "2 weeks ago"
  },
  {
    "title": "Peter Norvig",
    "url": "https://norvig.com/",
    "snippet": "<strong>Distinguished Education Fellow at Stanford HAI, Research Director at Google</strong>. Co-author of Artificial Intelligence: A Modern Approach, the leading AI textbook used in 1,500+ universities worldwide. peter@norvig.com / resume / github / medium / photo gallery / legacy homepage",
    "published": null
  }
]