[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Die_Linke",
    "snippet": "&#x27;The Left&#x27;), also known as the Left Party (German: Linkspartei, pronounced [ˈlɪŋkspaʁˌtaɪ] ⓘ), is a democratic socialist political party in Germany. The party was founded in <strong>2007</strong> as the result of the merger of the Party of Democratic Socialism (PDS) and Labour and Social Justice – ...",
    "published": "January 7, 2007"
  },
  {
    "title": "Welcome: Die Linke English pages",
    "url": "https://en.die-linke.de/welcome/",
    "snippet": "As a socialist party, DIE LINKE stands for alternatives, for a better future. We are a new left party, a democratic socialist left, comprised of those of different political, ideological and religious backgrounds, of women and men, old and young, immigrants, those with disabilities.",
    "published": null
  },
  {
    "title": "Left Party | Germany, Politics, Origin, & Election Results | Britannica",
    "url": "https://www.britannica.com/topic/Left-Party-political-party-Germany",
    "snippet": "The Left (Die Linke) is a German political party that ruled East Germany as the Socialist Unity Party of Germany (SED) and now contests elections in united Germany.",
    "published": "November 10, 2006"
  },
  {
    "title": "Die Linke - Rosa Luxemburg Stiftung",
    "url": "https://rosaluxna.org/die-linke/",
    "snippet": "The “Left Party” (Die Linke) was <strong>founded in 2007</strong> as merger of the primarily East German “Party of Democratic Socialism” (PDS) and the West German “Electoral Alternative for Jobs and Social Justice” (WASG).",
    "published": "September 11, 2019"
  },
  {
    "title": "Die Linke | Parties in the German Bundestag",
    "url": "https://www.deutschland.de/en/topic/politics/die-linke-parties-in-the-german-bundestag",
    "snippet": "Die Linke has its origins in the Socialist Unity Party of Germany in the former GDR. Read what has become of it now.",
    "published": "May 8, 2025"
  }
]