[
  {
    "title": "Bundesliga-Fußball mit Eintracht Frankfurt, Frauen | FRANKFURT.DE - DAS OFFIZIELLE STADTPORTAL",
    "url": "https://frankfurt.de/themen/sport/sportevents/bundesliga-fussball-1-ffc-frankfurt",
    "snippet": "<strong>Im Stadion am Brentanobad an der Ludwig-Landmann-Straße</strong> residiert das Eintracht Frankfurt Frauenteam, Fußball-Bundesligist, bis 2020 unter dem Namen 1. FFC Frankfurt mehrfacher deutscher Meister und Champions-League-Sieger 2015.",
    "published": null
  },
  {
    "title": "1. FFC Frankfurt - Home",
    "url": "https://www.ffc-frankfurt.de/",
    "snippet": "1. FFC Frankfurt Homepage 1. FFC-Mädchenfußballschule 1. FFC Frankfurt facebook 1.",
    "published": null
  },
  {
    "title": "Eintracht Frankfurt (women) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eintracht_Frankfurt_(women)",
    "snippet": "In addition to the first team, the department would include up to five women&#x27;s teams competing at various levels of women&#x27;s football. Eintracht plays their homegames in the <strong>Stadion am Brentanobad</strong>, a stadium in the Rödelheim district of Frankfurt they share with the men&#x27;s team of Rot-Weiss ...",
    "published": "5 days ago"
  },
  {
    "title": "Pros - Eintracht Frankfurt Pros",
    "url": "https://en.eintracht.de/",
    "snippet": "Eintracht Frankfurt Fußball Aktiengesellschaft <strong>Im Herzen von Europa 1 60528 Frankfurt am Main</strong> · Accessibility on home match days: 3.5 hours before the start of the game",
    "published": null
  },
  {
    "title": "Waldstadion (Frankfurt) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Waldstadion_(Frankfurt)",
    "snippet": "The home stadium of the football club Eintracht Frankfurt, it was opened in 1925. The stadium has been upgraded several times since then; the most recent remodelling was its redevelopment as a football-only stadium in preparation for the 2005 FIFA Confederations Cup and 2006 FIFA World Cup. With a capacity of 59,500 spectators for league matches, it is the seventh largest football stadium in Germany. The stadium was one of the nine venues of 2011 FIFA Women&#x27;s World Cup, and hosted four matches including the final.",
    "published": "3 weeks ago"
  }
]