[
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "On August 29, 2019, Pachulia retired from playing and re-joined the Warriors as a front office consultant in their basketball operations department. He won his third NBA championship after the Warriors defeated the Boston Celtics in six games in the 2022 NBA Finals. Pachulia legally changed his first name from Zaur to Zaza.",
    "published": "November 6, 2025"
  },
  {
    "title": "Zaza Pachulia Stats, Height, Weight, Position, Draft Status and more | Basketball-Reference.com",
    "url": "https://www.basketball-reference.com/players/p/pachuza01.html",
    "snippet": "&gt; Zaza Pachulia · Welcome · Your Account · Logout · Ad-Free Login · Create Account · The most viewed basketball player and team in your state is here! Check it out. Pronunciation: \\Za-Za Pa-CHUL-e-ya\\ Zaur Pachulia · Position: Center ▪ Shoots: Right ·",
    "published": null
  },
  {
    "title": "Zaza Pachulia | Center | Atlanta Hawks",
    "url": "https://www.nba.com/player/2585/zaza-pachulia",
    "snippet": "Follow the action on NBA scores, schedules, stats, news, teams, and players. Buy tickets or watch the games anywhere with NBA League Pass.",
    "published": null
  },
  {
    "title": "Zaza Pachulia NBA Stats & News",
    "url": "https://www.rotowire.com/basketball/player/zaza-pachulia-2391",
    "snippet": "<strong>There was no outlook written for Zaza Pachulia in 2025</strong>. Check out the latest news below for more on his current fantasy value. ... Signed a one-year, $2.39 million contract with the Pistons in July of 2018. ... The Warriors announced last week that Pachulia joined the organization as a business ...",
    "published": null
  },
  {
    "title": "Zaza Pachulia, Basketball Player, Stats, Height, Age | Proballers",
    "url": "https://www.proballers.com/basketball/player/18527/zaza-pachulia",
    "snippet": "All the stats of Zaza Pachulia during his basketball career. And information about his date of birth, age, height, games, teams, teammates, shoots...",
    "published": null
  }
]