[
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "While Modi was training with the RSS, he also met Vasant Gajendragadkar and Nathalal Jaghda, Bharatiya Jana Sangh leaders who in 1980 helped found the BJP&#x27;s Gujarat unit. As a teenager, he was enrolled in the National Cadet Corps. In a custom traditional to Narendra Modi&#x27;s caste, his family arranged a betrothal to Jashodaben Chimanlal Modi, leading to their marriage when she was 17 and he was 18.",
    "published": "20 hours ago"
  },
  {
    "title": "Narendra Modi | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Narendra-Modi",
    "snippet": "Narendra Modi Timeline Early Life and Education Political Career and Rise to Power Key Policies and Reforms Major Challenges and Criticisms Impact on India and Global Relations",
    "published": "4 days ago"
  },
  {
    "title": "Narendra Modi Biography, Age, Education and Political Career",
    "url": "https://www.studyiq.com/articles/narendra-modi-biography/",
    "snippet": "Higher Secondary Education: He completed his higher secondary education at a school in Vadnagar. Bachelor’s Degree: Narendra Modi earned a <strong>Bachelor of Arts (BA) degree from the University of Delhi</strong>, where he studied political science and received ...",
    "published": "September 16, 2025"
  },
  {
    "title": "The education of Narendra Modi, India's strongest leader",
    "url": "https://studyinternational.com/news/the-education-of-narendra-modi/",
    "snippet": "India has seen a wave of national reforms during the three consecutive terms of its prime minister, Narendra Damodardas Modi. One sector – and perhaps the most important one – is education.",
    "published": "May 23, 2025"
  },
  {
    "title": "BJP on X: \"PM Modi's educational degrees made public by Shri @AmitShah : BA from Delhi University & MA from Gujarat university. https://t.co/6A4pzGXLRl\" / X",
    "url": "https://x.com/BJP4India/status/729596646124863488",
    "snippet": "PM Modi&#x27;s educational degrees made public by Shri · @AmitShah : <strong>BA from Delhi University &amp; MA from Gujarat university</strong>. Narendra Modi and 2 others · 4:59 AM · May 9, 2016 · 1.7K · 5.1K · 6.9K · 920 · Read 1.7K replies · Sign up now to ...",
    "published": null
  }
]