[
  {
    "title": "Mary Earps’ Manchester United return: Jeers, cheers, selfies and a painful defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6802703/2025/11/13/mary-earps-manchester-united-psg/",
    "snippet": "United, in contrast, are one of three sides (along with Barcelona and Lyon, who have won nine of the past 10 Champions Leagues between them) with a maximum nine points at the halfway point in the league phase ahead of tough fixtures away to Wolfsburg next Wednesday and home against Lyon on December 10. At the full-time whistle, as “Glory, glory Man United” blared out, Earps took a swig from her water bottle, picked up her towel and shook hands with United head coach Marc Skinner.",
    "published": "November 13, 2025"
  },
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She and Paris Saint-Germain lost 5–2 on aggregate to Juventus in the 2024–25 UEFA Women&#x27;s Champions League qualifying rounds. On 12 November 2025, <strong>Earps returned to Manchester United</strong> in the Champions League for the first time since her move, where they lost 2-1.",
    "published": "3 days ago"
  },
  {
    "title": "Local Legends: Mary Earps MBE - From Nottingham To National Icon - Impact Magazine",
    "url": "https://impactnottingham.com/2025/12/local-legends-mary-earps-mbe-from-nottingham-to-national-icon/",
    "snippet": "Non-League Football in Nottingham: The Ultimate Student Guide December 3, 2025 · by Sam Bunce · Local Legends: Mary Earps MBE – From Nottingham To National… December 3, 2025 · by Sam Bunce · Sean Dyche: Restoring Order at Nottingham Forest December 1, 2025 ·",
    "published": "3 weeks ago"
  },
  {
    "title": "GOAL's World-Class Club 2025: Mary Earps loses elite status as new Lionesses hero Hannah Hampton earns inclusion among the planet's best women's footballers | Goal.com US",
    "url": "https://www.goal.com/en-us/lists/goal-womens-world-class-club-2025/blt0650996b3bcffa81",
    "snippet": "After losing her spot as England No.1 and enduring some ups and downs in her first year at PSG, <strong>Mary Earps falls back outside of the world-class category for now</strong>. In Germany, Alex Popp&#x27;s career is winding down and she isn&#x27;t returning goals at ...",
    "published": "August 5, 2025"
  },
  {
    "title": "Why is Mary Earps not playing for England at Women’s Euro 2025?",
    "url": "https://www.the-independent.com/sport/football/mary-earps-england-retirement-euro-2025-b2783108.html",
    "snippet": "Follow live: England at risk of ... career just five weeks before the Euros. She will continue playing for her club, <strong>Paris Saint-Germain</strong>, and last month took part in the TV coverage of the annual charity match Soccer ...",
    "published": "July 9, 2025"
  }
]