[
  {
    "title": "Sahle-Work Zewde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sahle-Work_Zewde",
    "snippet": "Sahle-Work Zewde (Amharic: ሣህለ ወርቅ ዘውዴ; born 21 February 1950) is an Ethiopian diplomat who served as president of Ethiopia from <strong>2018 to 2024</strong>, the first woman to hold the office. She was elected as president unanimously by members of the Federal Parliamentary Assembly on 25 ...",
    "published": "September 26, 2025"
  },
  {
    "title": "Sahle-Work Zewde becomes Ethiopia's first female president",
    "url": "https://www.bbc.com/news/world-africa-45976620",
    "snippet": "Ms Sahle-Work is an experienced diplomat who has now become <strong>Africa&#x27;s only female head of state</strong>. Her election to the ceremonial position comes a week after Prime Minister Abiy Ahmed appointed a cabinet with half the posts taken up by women.",
    "published": "October 25, 2018"
  },
  {
    "title": "Sahle-Work Zewde | Archives of Women's Political Communication",
    "url": "https://awpc.cattcenter.iastate.edu/directory/sahle-work-zewde/",
    "snippet": "Sahle-Work Zewde assumed office as president of Ethiopia on <strong>October 25, 2018,</strong> the first woman to hold that office. Zewde was born on February 21, 1950, in Addis Ababa, Ethiopian Empire (now Ethiopia).",
    "published": null
  },
  {
    "title": "Who is Sahle-Work Zewde, Ethiopia’s first female president? | Women's Rights News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2018/10/27/who-is-sahle-work-zewde-ethiopias-first-female-president",
    "snippet": "Election of first woman to presidency has raised hopes among women’s rights groups for more gender equality in Ethiopia. <strong>Sahle-Work Zewde arrives at the parliament to be elected as the president of Ethiopia in Addis Ababa</strong> [EPA]",
    "published": "October 27, 2018"
  },
  {
    "title": "Biography - H.E. Sahle-Work Zewde",
    "url": "https://www.itu.int/en/ITU-D/Conferences/WTDC/WTDC21/R2A/Pages/partner2connect/biography-sahle-work-zewde.aspx",
    "snippet": "President of Ethiopia · ​Sahle-Work Zewde was elected as the fifth President and first woman President of the Federal Democratic Republic of Ethiopia on <strong>25 October 2018</strong>",
    "published": null
  }
]