[
  {
    "title": "Possible (political party) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Possible_(political_party)",
    "snippet": "Possible (Italian: Possibile, Pos) is a left-wing political party in Italy, launched in Rome on 21 June 2015. The party&#x27;s founder is <strong>Giuseppe Civati</strong>, a former prominent member of the Democratic Party (PD).",
    "published": "April 4, 2025"
  },
  {
    "title": "List of political parties in Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_political_parties_in_Italy",
    "snippet": "The beginning of 1921 saw the foundation of the Communist Party of Italy, born from a split of the Italian Socialist Party. Also in 1921, <strong>Benito Mussolini</strong> gave birth to the National Fascist Party, and the next year, through the March on Rome, ...",
    "published": "October 18, 2025"
  },
  {
    "title": "Italy: Political parties at a glance",
    "url": "https://politpro.eu/en/italy/parties",
    "snippet": "“2019 Chapel Hill Expert Survey.” - University of North Carolina, Chapel Hill. ... Brothers of Italy (FdI) is a national-conservative party in Italy, founded in 2012 by <strong>Giorgia Meloni, Guido Crosetto and Ignazio La Russa</strong>.",
    "published": "September 13, 2019"
  },
  {
    "title": "Italian Popular Party | History & Politics | Britannica",
    "url": "https://www.britannica.com/topic/Italian-Popular-Party",
    "snippet": "In January 1919 a Sicilian priest, <strong>Luigi Sturzo</strong>, founded the original Italian Popular Party. Its tight organization and discipline won it quick success. In 1919 the party won 101 of 508 seats in the Chamber of Deputies, and PPI ministers were ...",
    "published": "July 20, 1998"
  },
  {
    "title": "Italy's 5-Star leader dumps party founder, comedian Grillo | Reuters",
    "url": "https://www.reuters.com/world/europe/italys-5-star-leader-dumps-party-founder-comedian-grillo-2024-10-24/",
    "snippet": "ROME, Oct 24 (Reuters) - Italy&#x27;s 5-Star Movement will sever ties with its founder, comedian <strong>Beppe Grillo</strong>, due to his &quot;acts of sabotage&quot;, party leader and former premier Giuseppe Conte said in book excerpts published on Thursday.",
    "published": "October 24, 2024"
  }
]