[
  {
    "title": "Chairperson Welcomes Appointment of New President of the Federal Democratic Republic of Ethiopia, Commends Tenure of Former President Zewde | African Union",
    "url": "https://au.int/en/pressreleases/20241007/chairperson-welcomes-appointment-new-president-ethiopia",
    "snippet": "The Chairperson also commends outgoing President H.E Sahlework Zewde for her historic and impactful leadership during her six-year tenure of Office as President. The Chairperson further reiterates the continued support of the African Union Commission to the Federal Democratic Republic of Ethiopia&#x27;s journey to deepen the country’s democracy and sustainable development. ... H.E. Moussa Faki Mahamat - Former Chairperson ... 2025 Year of Reparations: Justice for Africans &amp; People of African Descent through Reparations.",
    "published": null
  },
  {
    "title": "Ethiopia situation update (19 March 2025) | ACLED",
    "url": "https://acleddata.com/update/ethiopia-situation-update-19-march-2025",
    "snippet": "The rift within the TPLF, which ... the TPLF president — has hindered the interim administration from fulfilling its responsibilities. The internal dispute within the TPLF escalated in January 2025 after two major developments. First, the National Election Board of Ethiopia (NEBE) issued a statement on 26 December ...",
    "published": null
  },
  {
    "title": "New Ethiopian President Extends A Hand | Global Finance Magazine",
    "url": "https://gfmag.com/economics-policy-regulation/ethiopia-president-taye-astke-selassie/",
    "snippet": "As a close ally of Abiy, Taye risks blemishing his reputation in taking up the largely ceremonial role of president, according to Abdalla Ahmed Ibrahim, director at the East Africa Center for Research and Strategic Studies in Nairobi. But he also has the credentials needed to argue that the Abiy’s government now wants to extend a hand to its rivals at home and abroad, “promoting national unity and international relations,” Ibrahim adds. Internally, Ethiopia is grappling with ethnic tensions.",
    "published": "October 25, 2024"
  },
  {
    "title": "President of Ethiopia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ethiopia",
    "snippet": "The position is largely ceremonial with executive power vested in the Council of Ministers chaired by the prime minister. The current president is <strong>Taye Atske Selassie</strong>, who took office on 7 October 2024.",
    "published": "3 weeks ago"
  },
  {
    "title": "Ethiopia: New president signals willingness to dialogue",
    "url": "https://www.dw.com/en/ethiopia-new-president-signals-willingness-to-dialogue/a-70436953",
    "snippet": "The veteran diplomat replaced the ... ... Ethiopia&#x27;s former foreign minister <strong>Taye Atske Selassie, has taken up the largely ceremonial role of president after parliamentary approval</strong>....",
    "published": "October 9, 2024"
  }
]