[
  {
    "title": "Front Office | Team | New York Knicks",
    "url": "https://www.nba.com/knicks/front-office",
    "snippet": "Meet the New York Knicks Executive Management, Coaching Staff, Basketball Operations, Team Security, and Medical Staff. Learn about the broadcast and team in...",
    "published": null
  },
  {
    "title": "Who is James Dolan? Knicks owner makes waves after decision to fire Tom Thibodeau",
    "url": "https://www.usatoday.com/story/sports/nba/knicks/2025/06/03/knicks-owner-everything-to-know-james-dolan/84015908007/",
    "snippet": "<strong>Dolan</strong> is officially listed as the executive chairman and chief executive officer of Madison Square Garden Sports and Madison Square Garden Entertainment. He is the owner of both the New York Knicks and the NHL&#x27;s New York Rangers.",
    "published": "June 3, 2025"
  },
  {
    "title": "New York Knicks 2025 Playoff Run Redeems Even Team Owner James Dolan - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-05-22/new-york-knicks-2025-playoff-run-redeems-even-team-owner-james-dolan",
    "snippet": "Despite a gut-wrenching overtime loss on Wednesday night, the New York Knicks are closer to winning an NBA championship than they have been in 25 years. And many fans are feeling fond — and maybe even proud — of the team owner they’ve long loved to hate.",
    "published": "May 22, 2025"
  },
  {
    "title": "James L. Dolan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/James_L._Dolan",
    "snippet": "As the companies&#x27; chairman, Dolan oversees all operations within the company and supervises day-to-day operations of its professional sports teams, the New York Knicks and New York Rangers, as well as their regional sports networks, which include MSG Network and MSG Plus. Dolan was previously CEO of Cablevision, founded by his father, until its sale in June 2016 to European telecom conglomerate Altice. Dolan is one of six children of Cablevision founder Charles Dolan and his wife, Helen Ann Dolan, and nephew of Cleveland Guardians owner Larry J.",
    "published": "3 weeks ago"
  },
  {
    "title": "James Dolan Addresses Future Ownership of Knicks",
    "url": "https://www.si.com/nba/knicks/onsi/news/james-dolan-future-ownership-new-york-knicks",
    "snippet": "Current Knicks owner <strong>James Dolan</strong> addressed the future of owner during his appearance on the &quot;Roommates Show&quot; podcast, telling franchise face Jalen Brunson that he intends to keep both the Knicks and the NHL&#x27;s New York Rangers within the family.",
    "published": "March 16, 2025"
  }
]