[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She and Paris Saint-Germain lost 5–2 on aggregate to Juventus in the 2024–25 UEFA Women&#x27;s Champions League qualifying rounds. On 12 November 2025, Earps returned to <strong>Manchester United</strong> in the Champions League for the first time since her move, where they lost 2-1.",
    "published": "1 month ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in 2024, Mary took on a new challenge by joining French giants <strong>Paris Saint-Germain</strong>. Earps called time on her spell with the Lionesses in May 2025, after collecting a total of 53 caps.",
    "published": null
  },
  {
    "title": "Local Legends: Mary Earps MBE - From Nottingham To National Icon - Impact Magazine",
    "url": "https://impactnottingham.com/2025/12/local-legends-mary-earps-mbe-from-nottingham-to-national-icon/",
    "snippet": "Her talent was then identified by scouts at Leicester City, but she was forced to transfer to her hometown team, <strong>Nottingham Forest</strong>, to make her senior breakthrough in the 2010/11 season.",
    "published": "2 weeks ago"
  },
  {
    "title": "Mary Earps Biography: Transfer, Age, Net Worth, Parents, Height, Salary, Football Team, Spouse",
    "url": "https://www.thecityceleb.com/biography/public-figure/footballer/mary-earps-biography-transfer-age-net-worth-parents-height-salary-football-team-spouse/",
    "snippet": "Mary Alexandra Earps MBE is an English footballer and goalkeeper for <strong>Paris Saint-Germain</strong> and the England national team. She was…",
    "published": "January 24, 2025"
  },
  {
    "title": "England goalkeeper Mary Earps announces international retirement before Euro 2025 - The Athletic",
    "url": "https://www.nytimes.com/athletic/6384495/2025/05/27/mary-earps-england-retirement/",
    "snippet": "Goalkeeper Mary Earps has announced her retirement from international football and will not be part of Sarina Wiegman’s England squad at the 2025 European Championship. Earps was capped 53 times by the national team and was an integral part of England’s Euro 2022 triumph and run to the 2023 World Cup final.",
    "published": "May 27, 2025"
  }
]