[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Commission 46 is a Committee of the Executive Committee of the IAU, playing a special role in the discussion of astronomy development with governments and scientific academies. The IAU is affiliated with the International Council of Scientific Unions (ICSU), a non-governmental organization representing a global membership that includes both national scientific bodies and international scientific unions.",
    "published": "3 weeks ago"
  },
  {
    "title": "International Astronomical Union",
    "url": "https://www.iau.org/",
    "snippet": "Don&#x27;t miss the dedicated panel discussion &quot;Science in Action: Grassroots Pathways to Development&quot; on 10 November! Read more ... <strong>Anne Thieme</strong> joins the IAU Secretariat as Membership Coordinator in November 2025. Read more · Become a part of the largest international union of professional ...",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://iauarchive.eso.org/",
    "snippet": "A key UN body on which IAU and SKAO are represented included on its agenda discussions of the impact of satellite constellations on astronomy for the first time ... <strong>The IAU will change its digital interface in 2025</strong>.",
    "published": null
  },
  {
    "title": "The International Astronomical Union | Paris | Facebook",
    "url": "https://www.facebook.com/InternationalAstronomicalUnion/",
    "snippet": "The International Astronomical Union, Paris. 26,811 likes · 309 talking about this · 132 were here. Our mission is to promote and safeguard the science of astronomy through international cooperation.",
    "published": null
  },
  {
    "title": "U.S. National Committee for the International Astronomical ...",
    "url": "https://www.nationalacademies.org/our-work/us-national-committee-for-the-international-astronomical-union-usnc-iau",
    "snippet": "This site requires JavaScript to be enabled",
    "published": null
  }
]