[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "In 2011, she was one of the founders of the association of university students known as Progrè, an association that dealt with deepening and sensitising public opinion on issues related to migration policies and the prison reality. In <strong>April 2013</strong>, Romano Prodi, former Prime Minister of Italy ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Biography - Elly Schlein",
    "url": "https://www.ellyschlein.it/en/biography",
    "snippet": "On <strong>6 May 2015,</strong> after the approval of the “Italicum”, education and school reforms, the Jobs Act, and due to irremediable fractures between Elly’s political views and the policies taken by Renzi’s government, she decides to leave the Democratic Party together with Pippo Civati and many ...",
    "published": "February 16, 2022"
  },
  {
    "title": "Why Elly Schlein is freaking out Italy’s ‘soft’ socialists",
    "url": "https://www.politico.eu/article/elly-schlein-italy-soft-socialist-democratic-party-leader/",
    "snippet": "“My PD is no longer there, this is another party — it no longer belongs to the center left, but to the hard left,” he said. As a youth leader in 2013, Schlein became the figurehead of Occupy PD, a protest movement set up by disaffected progressives angered over 101 center-left parliamentarians who voted against their own social democrat grandee Romano Prodi’s bid to become the president of Italy. “With Elly Schlein, the PD has occupied itself,” quipped Allegranti.",
    "published": "March 2, 2023"
  },
  {
    "title": "Elly Schlein: The first woman and LGBTIQ+ leader of Italy’s left | openDemocracy",
    "url": "https://www.opendemocracy.net/en/5050/italy-left-elly-schlein-woman-lgbtiq-democratic-party/",
    "snippet": "<strong>Schlein even quit the party in 2015,</strong> while serving as a member of the European Parliament, when PD leader and then prime minister Matteo Renzi tried to push through economically liberal reforms.",
    "published": "March 9, 2023"
  },
  {
    "title": "Italy's left picks 'anti-Meloni' politician Elly Schlein to lead the party | Euronews",
    "url": "https://www.euronews.com/my-europe/2023/02/27/the-anti-meloni-meet-elly-schlein-italys-breakout-left-wing-star",
    "snippet": "Come the following year, and increasingly opposed to the labour reforms of the then-PM and party leader, Renzi, <strong>she ultimately parted ways with the PD and joined a splinter party, Possible (Possibile).</strong>",
    "published": "March 1, 2023"
  }
]