[
  {
    "title": "Francesco Farioli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Francesco_Farioli",
    "snippet": "Francesco Farioli (Italian pronunciation: [faˈrjɔːli]; born 10 April 1989) is an Italian football manager. He is currently the head coach of Primeira Liga club Porto. Farioli started his coaching career in Turkey with spells at <strong>Fatih Karagümrük</strong> and Alanyaspor. He then had one season in ...",
    "published": "20 hours ago"
  },
  {
    "title": "Ajax appoint Francesco Farioli as new head coach - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/40202239/ajax-new-manager-francesco-farioli-head-coach-nice",
    "snippet": "Getty · The Italian manager, who is Ajax&#x27;s first foreign coach since Dane <strong>Morten Olsen</strong> in 1999, recently completed his first full season at Nice and guided the team to a fifth-place finish in Ligue 1. Farioli had previously held jobs at Turkish ...",
    "published": "May 23, 2024"
  },
  {
    "title": "Francesco Farioli new Ajax head coach",
    "url": "https://english.ajax.nl/articles/francesco-farioli-new-ajax-head-coach/",
    "snippet": "The Italian studied philosophy before entering the world of football. He began his career as a goalkeeping coach under <strong>Roberto De Zerbi</strong> and took his first steps as a head coach in Turkey at the age of thirty.",
    "published": null
  },
  {
    "title": "Ajax appoint Francesco Farioli, 35, as new head coach - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cneexzvp8jko",
    "snippet": "The Dutch club, external said they had reached an agreement with Nice to bring in the 35-year-old Italian, who will start his new role on 11 June. Farioli was manager at Turkish sides <strong>Fatih Karagumruk and Alanyaspor</strong> before ...",
    "published": "May 23, 2024"
  },
  {
    "title": "Rebuilding Ajax: How Francesco Farioli Has Transformed the Dutch Giants | Opta Analyst",
    "url": "https://theanalyst.com/articles/ajax-francesco-farioli-rebuild-eredivisie-title",
    "snippet": "After such a disastrous campaign, they appointed Francesco Farioli to replace interim coach John van ‘t Schip. That appointment was somewhat unexpected, as Farioli became the club’s first non-Dutch head coach since Danish manager <strong>Morten Olsen</strong> in ...",
    "published": "May 29, 2025"
  }
]