[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Left_(Germany)",
    "snippet": "Through the PDS, the party is the direct descendant of the Marxist–Leninist ruling party of former East Germany, the Socialist Unity Party of Germany (SED). Since October 2024, Die Linke&#x27;s co-chairpersons have been <strong>Ines Schwerdtner and Jan van Aken</strong>. The party holds 64 seats out of 630 in ...",
    "published": "January 7, 2007"
  },
  {
    "title": "The Improbable Resurgence of Die Linke",
    "url": "https://jacobin.com/2025/02/die-linke-germany-renewal-strategy/",
    "snippet": "Nor have the party faithful exactly rallied around a coherent strategy: while one Die Linke campaign slogan boasts “Everyone wants to govern, we want to change,” in the eastern state of Saxony, its tiny parliamentary group, decimated after its worst-ever election result last September, has decided to tolerate a minority government led by the Christian Democrats (CDU). Contrary to the leadership’s (understandable) claims that internal harmony reigns following Sahra Wagenknecht’s departure, the deep strategic and political rifts within Die Linke have hardly been healed.",
    "published": null
  },
  {
    "title": "Is Die Linke’s Comeback Built to Last?",
    "url": "https://jacobin.com/2025/05/die-linke-germany-cdu-afd",
    "snippet": "Germany’s socialist party Die Linke has been revitalized by its recent election breakthrough. With the Social Democrats cravenly backing <strong>Friedrich Merz</strong>’s conservative and militarist agenda, Die Linke has to offer a bold oppositional message.",
    "published": null
  },
  {
    "title": "Can Germany’s Die Linke Revive Itself?",
    "url": "https://jacobin.com/2024/12/germany-die-linke-wagenknecht-afd",
    "snippet": "In October, Die Linke elected new leadership, which promises to reconnect with working-class voters. With German elections planned for early 2025, they face a race against time to change the party’s culture.",
    "published": null
  },
  {
    "title": "After Germany’s Election, the Left Can Hope Again",
    "url": "https://jacobin.com/2025/02/germany-election-die-linke-left",
    "snippet": "Leading the way alongside Reichinnek were confident new faces in the party leadership: <strong>Ines Schwerdtner (formerly editor in chief of the German-language Jacobin) as well as Jan van Aken</strong>.",
    "published": null
  }
]