[
  {
    "title": "José Antonio Kast - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jos%C3%A9_Antonio_Kast",
    "snippet": "José Antonio Kast Rist (born 18 January 1966) is a Chilean politician, lawyer, and the <strong>president-elect of Chile</strong> after winning the 2025 presidential election. He served in the Chamber of Deputies from 2002 to 2018, representing districts in the capital, Santiago.",
    "published": "16 hours ago"
  },
  {
    "title": "José Antonio Kast Triumphs in Chile with 58% of the Vote; Boric Congratulates Conservative Leader in Historic Victory Restoring Order and Traditional Values - Gateway Hispanic",
    "url": "https://gatewayhispanic.com/2025/12/jose-antonio-kast-triumphs-chile-58-vote-boric/",
    "snippet": "Right wing candidate Jose Antonio Kast is <strong>elected President of Chile</strong> 🇨🇱 with nearly 60% of the vote as polls expected Communist Party nominee Jeannette Jara loses. This is a great victory for free enterprise, and great for the USA. ...",
    "published": "1 week ago"
  },
  {
    "title": "Chile shifts sharply right as José Antonio Kast wins the presidency",
    "url": "https://www.npr.org/2025/12/14/nx-s1-5644074/chile-kast-right",
    "snippet": "José Antonio Kast, a far-right politician, who has praised Chile&#x27;s dictatorship, has <strong>won the presidency</strong>, signaling a sharp rightward shift fueled by fears over crime, migration, and the economy.",
    "published": "1 week ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "The son of a Nazi party member and an admirer of Pinochet, Kast built his campaign on a promise to expel tens of thousands of undocumented migrants ... The ultra-conservative former congressman José Antonio Kast has been elected as Chile’s next president.",
    "published": "1 week ago"
  },
  {
    "title": "Chile elects Kast as president in sharp rightward shift | Reuters",
    "url": "https://www.reuters.com/world/americas/chile-votes-presidential-race-expected-lurch-country-right-2025-12-14/",
    "snippet": "SANTIAGO, Dec 14 (Reuters) - Jose Antonio Kast <strong>won Chile&#x27;s presidential election</strong> on Sunday, leveraging voter fears over rising crime and migration to steer the country in its sharpest rightward shift since the end of the military dictatorship ...",
    "published": "1 week ago"
  }
]