[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "Christopher Ruddy started Newsmax.com on September 16, 1998, supported by a group of investors including the family of former Central Intelligence Agency Director William J. Casey. Later, <strong>Richard Mellon Scaife</strong>, Ruddy&#x27;s former employer at the Pittsburgh Tribune-Review, invested in the fledgling ...",
    "published": "1 week ago"
  },
  {
    "title": "Investor Relations | Newsmax Media, Inc.",
    "url": "https://ir.newsmax.com/overview/default.aspx",
    "snippet": "Newsmax Inc. is a holding company that owns <strong>100% of the equity interests of its operating company Newsmax Media, Inc.</strong>",
    "published": null
  },
  {
    "title": "newsmax inc.",
    "url": "https://www.sec.gov/Archives/edgar/data/2026478/000121390025021989/ea0233655-253g1_newsmax.htm",
    "snippet": "Newsmax Inc. has no direct operations and no significant assets other than its ownership of <strong>Newsmax Media</strong>. We depend on <strong>Newsmax Media</strong> for payments to generate the funds necessary to meet our financial obligations.",
    "published": null
  },
  {
    "title": "NYSE: NMAX Newsmax Inc Stock Ownership - Who owns ...",
    "url": "https://www.wallstreetzen.com/stocks/us/nyse/nmax/ownership",
    "snippet": "Newsmax (NYSE: NMAX) is owned by <strong>2.95% institutional shareholders, 93.91% Newsmax insiders, and 3.15% retail investors</strong>. Ruddy Revocable Trust Dated October 12 2007 Christopher is the largest individual Newsmax shareholder, owning 39.24M shares representing 30.39% of the company.",
    "published": "1 week ago"
  },
  {
    "title": "Christopher Ruddy | Long Island University",
    "url": "https://liu.edu/roosevelt/~/link.aspx?_id=CBEEEDD71542408AA2E0F8E91B527511&_z=z",
    "snippet": "<strong>Christopher Ruddy</strong> is CEO and President of Newsmax Media Inc., a leading digital and television news media company. Ruddy, who grew up near Sagamore Hill, has been a long-time member of the Theodore Roosevelt Association and often reference Theodore Roosevelt in his commentaries on current U.S.",
    "published": null
  }
]