[
  {
    "title": "James L. Dolan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/James_L._Dolan",
    "snippet": "In 1994, Paramount Communications, the owner of Madison Square Garden, was acquired by Viacom, who in turn sold the MSG properties to Cablevision and ITT Corporation, which had 50% ownership each. ITT sold its share to Cablevision three years later. In 1999, Dolan was given an increased role in managing Cablevision&#x27;s sports properties and is now the primary manager of these assets. The teams under his domain include most notably the National Basketball Association&#x27;s New York Knicks, the National Hockey League&#x27;s New York Rangers, and the American Hockey League&#x27;s Hartford Wolf Pack.",
    "published": "3 weeks ago"
  },
  {
    "title": "New York Knicks - Owners - RetroSeasons.com",
    "url": "https://www.retroseasons.com/teams/new-york-knicks/history/owners/",
    "snippet": "Alongside the Boston Celtics, the Knicks are one of two original NBA teams still located in its original city. The team, established by Ned Irish in 1946, was one of the founding members of the Basketball Association of America (BAA), which became the NBA after merging with the rival National Basketball League (NBL) in 1949.",
    "published": "March 21, 2023"
  },
  {
    "title": "James Dolan | Madison Square Garden Sports Executive Chairman and CEO",
    "url": "https://www.msgsports.com/leadership/james-l-dolan/",
    "snippet": "James L. Dolan is Executive Chairman of <strong>Madison Square Garden Sports Corp.</strong>, which features New York Knicks and New York Rangers franchises.",
    "published": "June 21, 2024"
  },
  {
    "title": "Unveiling the Owners of the New York Knicks: A Deep Dive into NBA Team Ownership",
    "url": "https://aigardenplanner.com/blog/post/unveiling-the-owners-of-the-new-york-knicks-a-deep-dive-into-nba-team-ownership-1948",
    "snippet": "Explore the ownership dynamics of the New York Knicks, from The Madison Square Garden Company to key investors. Delve into the financial implications and complexities of owning a major sports franchise.",
    "published": "January 21, 2025"
  },
  {
    "title": "New York Knicks - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/New_York_Knicks",
    "snippet": "The New York Knickerbockers, shortened and more commonly referred to as the New York Knicks, are an American professional basketball team based in the New York City borough of Manhattan. The Knicks compete in the National Basketball Association (NBA) as a member of the Atlantic Division of ...",
    "published": "5 days ago"
  }
]