[
  {
    "title": "German Research Foundation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/German_Research_Foundation",
    "snippet": "In 1937, the Notgemeinschaft der ... (DFG). Even before the election of the National Socialist German Workers&#x27; Party (Nazi party) to power in 1933, projects funded by the NG had worked diligently on Nazi-aligned research, especially German ethnographic research in Eastern Europe that would lay the foundations for the Hitlerite &quot;Lebensraum&quot; and extermination policies; during the National Socialist period, the NG leadership showed itself ...",
    "published": "October 2, 2025"
  },
  {
    "title": "Ca",
    "url": "https://nrm.dfg.ca.gov/FileHandler.ashx?DocumentID=35774",
    "snippet": "CALIFORNIA DEPARTMENT OF FISH AND WILDLIFE EXECUTIVE OVERVIEW 11/19/2025 · <strong>Admin: Administration, (A): Acting, Asst.: Assistant, Consrvtn: Conservation, Dep: Deputy, Dir: Director, Div: Division</strong>",
    "published": null
  },
  {
    "title": "Research Program Management: Funding Geo Sciences--My Work as DFG Program Director | Science | AAAS",
    "url": "https://www.science.org/content/article/research-program-management-funding-geo-sciences-my-work-dfg-program-director",
    "snippet": "To keep them motivated requires a further skill: Cooperative team leadership. That is not always easy! And there are some negative points: You will not accumulate riches in this type of job, and career opportunities are very limited. On the other hand, the work I do is independent to a high degree because DFG has an extremely flat structure.",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - DFG Member Organisations",
    "url": "https://www.dfg.de/en/about-us/statutory-bodies/general-assembly/membersmap",
    "snippet": "The map below shows the 99 current member organisations of the DFG, including universities, other research institutions, academies of sciences and humanities, and scientific associations · List of members for download(Download)",
    "published": null
  },
  {
    "title": "Deutsche Forschungsgemeinschaft (DFG) - German ...",
    "url": "https://www.linkedin.com/company/deutsche-forschungsgemeinschaft",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  }
]