[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "<strong>Arnon Milchan</strong> founded his company as Embassy International Pictures N.V., which held the name for seven years until it was changed to Regency International Pictures.",
    "published": "4 days ago"
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between <strong>Arnon Milchan</strong>, Scriba &amp; Deyle and Canal+ to finance 20 films in five years, with New Regency Productions acting as its production and sales arm.",
    "published": "3 weeks ago"
  },
  {
    "title": "Regency Enterprises | Corus Entertainment Fandom | Fandom",
    "url": "https://corusentertainment.fandom.com/wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises (commonly referred to as Regency onscreen and credited as Monarchy Enterprises S.á.r.l.) is an American entertainment company formed by <strong>Arnon Milchan</strong>. It was founded in 1991 as the successor to Regency International Pictures ...",
    "published": "October 29, 2024"
  },
  {
    "title": "Regency Enterprises (Creator) - TV Tropes",
    "url": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/RegencyEnterprises",
    "snippet": "Regency Enterprises (commonly referred to as Regency onscreen) is an American entertainment company formed by <strong>Arnon Milchan</strong>. It was founded in 1991 as the successor to Regency International Pictures formerly known as Embassy International …",
    "published": "October 2, 2025"
  },
  {
    "title": "Regency Enterprises",
    "url": "https://zims-en.kiwix.campusafrica.gos.orange.com/wikipedia_en_all_nopic/A/Regency_Enterprises",
    "snippet": "This company originally had no ... This company produced films such as Once Upon a Time in America and Q&amp;A. This company was shut down in 1991. <strong>Arnon Milchan</strong> rebranded Regency International Pictures and renamed it to Regency Enterprises....",
    "published": null
  }
]