[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... nation&#x27;s head of government. The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "In his address marking Ukrainian Armed Forces Day, President of Ukraine <strong>Volodymyr Zelenskyy</strong> spoke about Ukrainian warriors honored through murals in Ukraine and around the world. ... The parties covered multiple aspects and went through key ...",
    "published": "1 week ago"
  },
  {
    "title": "Yulia Svyrydenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yulia_Svyrydenko",
    "snippet": "<strong>Yulia Anatoliivna Svyrydenko</strong> (Ukrainian: Юлія Анатоліївна Свириденко, IPA: [ˈjul⁽ʲ⁾ijɐ ɐnɐˈtɔl⁽ʲ⁾ijiu̯nɐ swɪrɪˈdɛnko]; born 25 December 1985) is a Ukrainian politician who has served as the 19th prime minister of Ukraine since 17 July 2025.",
    "published": "3 weeks ago"
  },
  {
    "title": "PM's engagements with President Zelenskyy of Ukraine, President Macron of France, Chancellor Merz of Germany and European partners: 8 December 2025 - GOV.UK",
    "url": "https://www.gov.uk/government/news/pms-engagements-with-president-zelenskyy-of-ukraine-president-macron-of-france-chancellor-merz-of-germany-and-european-partners-8-december-2025",
    "snippet": "The Prime Minister welcomed the President of Ukraine, <strong>Volodymyr Zelenskyy</strong>, the President of France, Emmanuel Macron, and the Chancellor of Germany, Friedrich Merz, to Downing Street today.",
    "published": "1 week ago"
  },
  {
    "title": "Leaders’ statement on Ukraine - Consilium",
    "url": "https://www.consilium.europa.eu/en/press/press-releases/2025/12/15/leaders-statement-on-ukraine/",
    "snippet": "15 December 2025 21:10 · This statement was adopted by President Costa, President von der Leyen, Prime Minister Frederiksen, President Stubb, President Macron, Chancellor Merz, Prime Minister Meloni, Prime Minister Schoof, Prime Minister Støre, Prime Minister Tusk, Prime Minister Kristersson, and Prime Minister Starmer. The Leaders welcomed significant progress on President Trump’s efforts to secure a just and lasting peace in Ukraine.",
    "published": null
  }
]