[
  {
    "title": "Daring Fireball: ABC Shuts Down FiveThirtyEight, and Pulls the Plug on Its Website",
    "url": "https://daringfireball.net/2025/03/abc_shuts_down_fivethirtyeight",
    "snippet": "He offered no explanation for why the Disney-owned network had decided to shutter FiveThirtyEight, which it acquired in 2018 along with data whiz and then-editor Nate Silver. He took no questions. He simply thanked the employees for their work, told them a human resources staffer would follow up, and ended the meeting. The entire affair, I’m told, lasted about 15 minutes. Soon after, employees had their access to ABC News’ systems shut off and the FiveThirtyEight website was pulled offline.",
    "published": null
  },
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "In July 2013, <strong>ESPN acquired FiveThirtyEight</strong>, hiring Silver as editor-in-chief and a contributor for ESPN.com; the new publication launched on March 17, 2014. Afterwards, the FiveThirtyEight blog covered a broad spectrum of subjects including politics, sports, science, economics, and popular culture.",
    "published": "1 month ago"
  },
  {
    "title": "FiveThirtyEight is shutting down completely – FlowingData",
    "url": "https://flowingdata.com/2025/03/05/fivethirtyeight-is-shutting-down-completely",
    "snippet": "Disney is cutting news jobs, and FiveThirtyEight, which was absorbed by ABC News and <strong>owned by Disney</strong>, is going with them. FiveThirtyEight employees were laid off this morning. It’s unclear what will happen to past projects and the brand itself, ...",
    "published": "March 5, 2025"
  },
  {
    "title": "r/fivethirtyeight on Reddit: Future of the subreddit after 538’s disbandment",
    "url": "https://www.reddit.com/r/fivethirtyeight/comments/1j3v5li/future_of_the_subreddit_after_538s_disbandment/",
    "snippet": "While we have <strong>no formal affiliation with 538</strong>, our sub is named after them, and their data-centric approach to politics and other subjects has formed the core of this subreddit’s identity since its inception.",
    "published": "March 5, 2025"
  },
  {
    "title": "ABC News eliminating 538 amid layoffs",
    "url": "https://thehill.com/business/5177667-abc-news-group-eliminates-538/",
    "snippet": "ABC News Group is eliminating its political arm, 538, which specializes in polling, surveys and data, amid wider layoffs at the Walt Disney parent company, according to information obtained by The …",
    "published": "March 5, 2025"
  }
]