[
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "<strong>Mariano Rajoy</strong> (born March 27, 1955, Santiago de Compostela, Spain) is a Spanish politician who served as prime minister of Spain from 2011 to 2018. Rajoy was raised in the Galicia region of northern Spain.",
    "published": "December 6, 2011"
  },
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "Although the position of deputy ... García Hernández, Antonio Barrera de Irimo and Licinio de la Fuente). Since then, three more prime ministers (<strong>Adolfo Suárez</strong>, José Luis Rodríguez Zapatero and Pedro Sánchez) have had more than one deputy....",
    "published": "3 weeks ago"
  },
  {
    "title": "La Moncloa. Presidents of the Government of Spain since 1978 [Presidents since 1978]",
    "url": "https://www.lamoncloa.gob.es/lang/en/presidente/presidents/paginas/index.aspx",
    "snippet": "List of democratic presidents of the Government of Spain, since 1978.",
    "published": null
  },
  {
    "title": "Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pedro_S%C3%A1nchez",
    "snippet": "Pedro Sánchez Pérez-Castejón (Spanish pronunciation: [ˈpeðɾo ˈsantʃeθ ˈpeɾeθ kasteˈxon] ⓘ; born 29 February 1972) is a Spanish politician and economist who has served as Prime Minister of Spain since 2018. He has also been Secretary-General of the Spanish Socialist Workers&#x27; Party (PSOE) since July 2017, having previously held that office from 2014 to 2016, and has also been serving as the ninth president of the Socialist International since 2022.",
    "published": "3 days ago"
  },
  {
    "title": "List of prime ministers of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Spain",
    "snippet": "In contemporary Spain, the first prime minister of the Kingdom of Spain since the approval of the Constitution of 1978 was <strong>Adolfo Suárez</strong>. Due to the gradual evolution of the post, the title has been applied to early prime ministers retroactively.",
    "published": "5 days ago"
  }
]