[
  {
    "title": "Petro Poroshenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Petro_Poroshenko",
    "snippet": "Poroshenko had pressed for the elections since his victory in the <strong>May 2014 presidential election</strong>. On 27 August 2014, the party congress of All-Ukrainian Party of Peace and Unity adopted a new name: &quot;Petro Poroshenko Bloc&quot; (BPP).",
    "published": "2 days ago"
  },
  {
    "title": "Petro Poroshenko | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Petro-Poroshenko",
    "snippet": "Petro Poroshenko speaking before a joint session of the U.S. Congress, September 18, 2014.(more) It was against that backdrop that Ukraine held snap presidential elections. On <strong>May 25, 2014, Poroshenko coasted to a landslide victory</strong>, easily topping ...",
    "published": "February 13, 2015"
  },
  {
    "title": "2014 Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2014_Ukrainian_presidential_election",
    "snippet": "<strong>Snap presidential elections were held in Ukraine on 25 May 2014</strong> and resulted in Petro Poroshenko being elected President of Ukraine. Originally scheduled to take place on 29 March 2015, the date was brought forward following the 2014 Ukrainian revolution. Poroshenko won the elections with 55% ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Ukraine - Poroshenko, Administration, Reforms | Britannica",
    "url": "https://www.britannica.com/place/Ukraine/The-Poroshenko-administration",
    "snippet": "Although voting was seriously disrupted ... billionaire Petro Poroshenko <strong>won in a landslide, easily topping the 50 percent mark necessary to secure a victory in the first round of polling</strong>....",
    "published": "July 26, 1999"
  },
  {
    "title": "Who would win if Ukraine held elections now? | Euronews",
    "url": "https://www.euronews.com/2025/12/10/who-would-win-if-ukraine-held-elections-now",
    "snippet": "If that happens, Ukraine will be ready to conduct elections in the next 60 to 90 days,&quot; Zelenskyy stated. <strong>In 2019 Zelenskyy scored a landslide victory with over 73% of votes in the second round versus 24% for the former President Petro Poroshenko</strong>.",
    "published": "6 days ago"
  }
]