[
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "<strong>After Desai resigned in 1979, his former associate Charan Singh briefly held office until the Congress won the 1980 Indian general election and Indira Gandhi returned as prime minister</strong>. Her second term as prime minister ended five years later on 31 October 1984, when she was assassinated by ...",
    "published": "1 week ago"
  },
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "<strong>Since 1947, there have been 14 different prime ministers</strong>. The first few decades after 1947 saw the Indian National Congress&#x27; (INC) near complete domination over the political map of India. India&#x27;s first prime minister, Jawaharlal Nehru, took oath on 15 August 1947.",
    "published": "3 days ago"
  },
  {
    "title": "Prime Ministers of India",
    "url": "https://archivepmo.nic.in/",
    "snippet": "<strong>May 22, 2004 - 26th May 2014</strong> · Shri Atal Bihari Vajpayee",
    "published": null
  },
  {
    "title": "List of all Prime Ministers of India (1947-2025) | India PM List",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1",
    "snippet": "List of all Prime Ministers of India till 2025: <strong>Narendra Modi is the current and 14th Prime Minister of India who assumed office on 10 June 2024</strong>. Jawaharlal Nehru is the first and the longest-serving Prime Minister of India while Indira Gandhi ...",
    "published": "August 22, 2025"
  },
  {
    "title": "Prime Ministers of India - Complete List from 1947 to 2025",
    "url": "https://www.bankbazaar.com/voter-id/list-of-prime-ministers-in-india.html",
    "snippet": "The first Prime Minister of independent India was Pandit Jawahar Lal Nehru, who served from <strong>1947 to 1964</strong>. He represented the Indian National Congress and was the Member of Parliament for Phulpur.",
    "published": null
  }
]