[
  {
    "title": "Emre Can: Former Juventus Midfielder Departed Because Of Maurizio Sarri",
    "url": "https://www.forbes.com/sites/sammay/2020/03/12/emre-can-former-juventus-midfielder-departed-because-of-maurizio-sarri/",
    "snippet": "“<strong>Maurizio Sarri</strong> told me in a 20-second phone call that I wasn’t on the Champions League list&quot;, he said. “The main reason I left Juventus was because I wanted to play football again,” Can told German newspaper Kicker.",
    "published": "March 12, 2020"
  },
  {
    "title": "Emre Can praises Allegri's work: Tactically, when I have not played better - Telegrafi",
    "url": "https://telegrafi.com/en/Emre-Can-praises-Allegri's-work-tactically-when-I-haven't-played-well/",
    "snippet": "Juventus midfielder Emre Can has praised the tactical work of coach <strong>Max Allegri</strong>. Juventus last week eliminated Atletico Madrid from the Champions League, despite being two goals down to win 3-2 on aggregate.",
    "published": "March 21, 2019"
  },
  {
    "title": "Emre Can: 'I left Juventus because of Sarri' -Juvefc.com",
    "url": "https://www.juvefc.com/emre-can-i-left-juventus-because-of-sarri/",
    "snippet": "Former Juventus midfielder Emre Can has revealed he left the Bianconeri solely because of coach <strong>Maurizio Sarri</strong>.",
    "published": "March 11, 2020"
  },
  {
    "title": "Former coach of Emre Can reveals what may have influenced decision to join Juventus | English News | Calciomercato.com",
    "url": "https://www.calciomercato.com/en/news/former-coach-of-emre-can-reveals-what-may-have-influenced-his-de-86752",
    "snippet": "<strong>Toni Magliarisi</strong> smiles at the arrival of Emre Can at Juventus. This Italian immigrant in Germany was one of the first coaches of the German midfielder and now, on the pages of La Gazzetta dello Sport,",
    "published": null
  },
  {
    "title": "Emre Can: Who is the Borussia Dortmund and Germany all-action midfielder? | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/emre-can-juventus-liverpool-bayern-munich-bayer-leverkusen-6141",
    "snippet": "- 2019 Getty Images · Deployed exclusively as a central midfielder at the Bianconeri, he found his opportunities limited under <strong>Maurizio Sarri</strong> in the first half of the 2019/20 season, partly due to the presence of compatriot Sami Khedira, but ...",
    "published": "June 1, 2024"
  }
]