[
  {
    "title": "Prime Minister of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Canada",
    "snippet": "The prime minister serves at His Majesty&#x27;s pleasure, meaning the post does not have a fixed term, and once appointed and sworn in by the governor general, the prime minister remains in office until they resign, are dismissed, or die. While the lifespan of a parliament is constitutionally limited to five years, a 2007 amendment to the Canada Elections Act, Section 56.1(2) limited the term of a Parliament to four years, with election day being set as the third Monday in October of the fourth calendar year after the previous polling date.",
    "published": "October 20, 2025"
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "The Right Honourable <strong>Mark Carney</strong>, Prime Minister of Canada<strong>Mark Carney</strong> is Canada’s 24th Prime Minister. He was elected Leader of the Liberal Party of Canada and sworn in as Prime Minister in March 2025.",
    "published": null
  },
  {
    "title": "Prime Minister of Canada - YouTube",
    "url": "https://www.youtube.com/@CanadianPM",
    "snippet": "This is the official YouTube channel for <strong>Mark Carney</strong>, Prime Minister of Canada. The Prime Minister of Canada is also featured on:twitter.com/CanadianPMVideos...",
    "published": null
  },
  {
    "title": "Prime Ministers of Canada",
    "url": "https://lop.parl.ca/sites/ParlInfo/default/en_CA/People/primeMinisters",
    "snippet": "This page provides general details on Canada&#x27;s prime ministers since 1867. For more information on an individual prime minister, including their electoral history and parliamentary roles, click on their name to view their complete profile.",
    "published": null
  },
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "<strong>Mark Joseph Carney</strong> (born March 16, 1965) is a Canadian politician and economist who has been serving as the 24th prime minister of Canada since 2025. He has also been leader of the Liberal Party and the member of Parliament (MP) for Nepean since ...",
    "published": "6 hours ago"
  }
]