[
  {
    "title": "Mark A. Aguiar - Princeton University",
    "url": "https://collaborate.princeton.edu/en/persons/mark-a-aguiar/",
    "snippet": "View Scopus Profile · Economics · Bendheim Center for Finance · Julis-Rabinowitz Center for Public Policy &amp; Finance · h-index · 3760 · Citations · 21 · h-index · Calculated based on number of publications stored in Pure and citations from Scopus · 20052025 · Research activity per year · Dive into the research topics where Mark A. Aguiar is active.",
    "published": null
  },
  {
    "title": "Mark A. Aguiar",
    "url": "https://jrc.princeton.edu/people/mark-aguiar",
    "snippet": "Mark A. Aguiar is the <strong>Walker Professor of Economics and International Finance at Princeton University</strong>. His research focuses on models of consumption and savings with applications in both open- and closed-economy macroeconomics.",
    "published": null
  },
  {
    "title": "Mark Aguiar | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is a <strong>consultant at the Federal Reserve Bank of Minneapolis and the Walker Professor of Economics and International Finance at Princeton University</strong>. Previously, he was a professor of economics at the University of Rochester and a ...",
    "published": null
  },
  {
    "title": "Mark Aguiar - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Aguiar",
    "snippet": "Mark Armando Aguiar (born 1966) is an <strong>American economist who has served as the Walker Professor of Economics and International Finance at Princeton University since 2015.</strong> Born in 1966, Aguiar graduated magna cum laude from Brown University with a BA in history and Chinese in 1988.",
    "published": "October 23, 2025"
  },
  {
    "title": "Research - Mark Aguiar",
    "url": "https://markaguiar.github.io/",
    "snippet": "Aguiar, Mark, Manuel Amador, Emmanuel Farhi and Gita Gopinath (2014): “Sovereign Debt Booms in Monetary Unions,” American Economic Review: Papers and Proceedings, 104(5). PDF – Journal link – Code – BibTeX and abstract · The Life-Cycle Profile of Time Spent on Job Search",
    "published": null
  }
]