[
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "Sebastian Newbold Coe, Baron Coe, CH, KBE, Hon FRIBA (born 29 September 1956), often referred to as Seb Coe, is a British sports administrator, former politician and retired track and field athlete. As a middle-distance runner, Coe won four Olympic medals, including 1500 metres gold medals at the Olympic Games in 1980 and 1984.",
    "published": "November 18, 2025"
  },
  {
    "title": "Lord Sebastian COE",
    "url": "https://www.olympics.com/ioc/lord-sebastian-coe",
    "snippet": "Meet Lord Sebastian COE - IOC member since 2020. Member profile includes sports career, education and IOC history.",
    "published": null
  },
  {
    "title": "Sebastian Coe - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q188502",
    "snippet": "Lord Sebastian N. Coe CH KBE (1950s - living)",
    "published": null
  },
  {
    "title": "Sebastian Coe | Biography, Runner, Olympics, Steve Ovett, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Sebastian-Coe",
    "snippet": "Sebastian Coe is a British athlete, who won four Olympic medals and set eight world records in middle-distance running. His great rivalry with fellow Briton <strong>Steve Ovett</strong> dominated middle-distance racing for much of the 1980s. Coe studied economics ...",
    "published": "May 4, 1999"
  },
  {
    "title": "Sebastian Coe | GreatestBritons",
    "url": "https://greatestbritons.com/sebastian-coe-biography/",
    "snippet": "As President of athletics governing body, the IAAF, Coe has presided over an organisation which has many difficult issues to sort within the sport. Yet it will be his running prowess for which he will be remembered and that timeless footage of his celebrations when crossing the line to win the 1500 metres in Moscow, displaying a mix of sheer elation and relief. He is the oldest of four children who were encouraged to play sport by the family. When Sebastian was still very young the family moved to Warwickshire where he attended school in Stratford-Upon-Avon, before a further move saw Coe at a comprehensive school in Sheffield, South Yorkshire.",
    "published": "3 weeks ago"
  }
]