[
  {
    "title": "Patricia Bullrich - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Patricia_Bullrich",
    "snippet": "She currently serves as a National Senator for the Autonomous City of Buenos Aires since December 2025, representing La Libertad Avanza. She previously served as the Minister of National Security from 2023 to 2025 under president <strong>Javier Milei</strong> and from 2015 to 2019 under president Mauricio Macri.",
    "published": "5 days ago"
  },
  {
    "title": "Sabina Frederic - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sabina_Frederic",
    "snippet": "<strong>Sabina Andrea Frederic</strong> (born 13 October 1965) is an Argentine social anthropologist, university professor and politician. A specialist on military and security personnel, she was Argentina&#x27;s Minister of Security from 2019 to 2021, in the cabinet of President Alberto Fernández.",
    "published": "July 22, 2025"
  },
  {
    "title": "Sabina Frederic | Trigésimo noveno período de sesiones de la CEPAL",
    "url": "https://periododesesiones.cepal.org/39/es/sabina-frederic",
    "snippet": "<strong>Fue subsecretaria de Formación del Ministerio de Defensa de la Nación entre 2009 y 2011, y asesora del Ministerio de Seguridad de la Nación entre 2012 y 2014.</strong> Ministra de Seguridad de la Nación entre diciembre de 2019 y septiembre de 2021. Presidenta de la Agencia Argentina de Cooperación ...",
    "published": "October 31, 2022"
  },
  {
    "title": "Buenos Aires Times | Alberto Fernández unveils 21-strong Cabinet",
    "url": "https://www.batimes.com.ar/news/argentina/alberto-fernandez-unveils-21-strong-cabinet.phtml",
    "snippet": "Among the list of more traditionally ‘Kirchnerite’ figures in the Cabinet were Tristán Bauer (Culture Minister), Agustín Rossi (Defence Minister), Juan Cabandié (Environment &amp; Social Development Minister), Eduardo ‘Wado’ De Pedro (Interior Minister), Sabina Frederic (Security Minister), Elizabeth Gómez Alcorta (Women, Gender &amp; Diversity Minister) and Carlos Zannini (Treasury Attorney).",
    "published": "December 7, 2019"
  },
  {
    "title": "Presidency of Alberto Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Presidency_of_Alberto_Fern%C3%A1ndez",
    "snippet": "In compliance with the 2012 Gender ... non-binary gender on all official documentation. <strong>Fernández first appointed anthropologist Sabina Frederic as security minister</strong>....",
    "published": "November 7, 2025"
  }
]