[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to <strong>ABC News</strong> pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight. On March 5, 2025, 538 was shut down by <strong>ABC News</strong> and its staff were laid off.",
    "published": "November 19, 2025"
  },
  {
    "title": "ABC News eliminating 538 amid layoffs",
    "url": "https://thehill.com/business/5177667-abc-news-group-eliminates-538/",
    "snippet": "<strong>ABC News Group</strong> is eliminating its political arm, 538, which specializes in polling, surveys and data, amid wider layoffs at the Walt Disney parent company, according to information obtained by The Hill.",
    "published": "March 5, 2025"
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "In April 2023, amid widespread layoffs at Disney and ABC affecting FiveThirtyEight, Silver announced that his contract with ABC would not be extended. After Silver&#x27;s departure in May, a smaller FiveThirtyEight continued to operate under the data analytics division of ABC News, until being shut down in March 2025.",
    "published": "1 week ago"
  },
  {
    "title": "Daring Fireball: ABC Shuts Down FiveThirtyEight, and Pulls the Plug on Its Website",
    "url": "https://daringfireball.net/2025/03/abc_shuts_down_fivethirtyeight",
    "snippet": "On Wednesday morning, shortly after sending an all-staff memo announcing layoffs at <strong>ABC News</strong>, network president Almin Karamehmedovic joined a virtual meeting with the FiveThirtyEight team.",
    "published": null
  },
  {
    "title": "FiveThirtyEight joins ABC News - ABC News",
    "url": "https://abcnews.go.com/US/fivethirtyeight-joins-abc-news/story?id=54531745",
    "snippet": "<strong>ABC News</strong> announced today it has reached an agreement in principle to acquire the renowned data journalism organization FiveThirtyEight from ESPN.",
    "published": "April 17, 2018"
  }
]