[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "If so, the president may serve as both the head of state and de facto head of government, while the prime minister serves as his deputy, acting as a link between the legislature and the executive. The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 ...",
    "published": "1 week ago"
  },
  {
    "title": "Welcome to the website of the French Presidency",
    "url": "https://www.elysee.fr/en/",
    "snippet": "Find out all the news of the President <strong>Emmanuel Macron</strong> on the official website and discover our pages on the history of the French Republic.",
    "published": null
  },
  {
    "title": "France appoints new government under PM Lecornu",
    "url": "https://www.lemonde.fr/en/politics/article/2025/10/12/france-appoints-new-government-under-pm-lecornu_6746354_5.html",
    "snippet": "<strong>Sébastien Lecornu</strong>&#x27;s second cabinet in a week includes several members who served in previous governments. The far right and radical left both said they will file a no-confidence motion in parliament.",
    "published": "October 13, 2025"
  },
  {
    "title": "Opinion | France Needs a New France - The New York Times",
    "url": "https://www.nytimes.com/2025/12/22/opinion/france-macron-sixth-republic.html",
    "snippet": "But he is not out of the woods yet. Without a clear majority in the National Assembly, the government remains vulnerable to a motion of no confidence. That could force Mr. Macron to name yet another prime minister — the sixth of his second term — or call snap legislative elections.",
    "published": "1 day ago"
  },
  {
    "title": "France’s Endless Nightmare: A Nation Incapable of Reform - American Thinker",
    "url": "https://www.americanthinker.com/articles/2025/12/france_s_endless_nightmare_a_nation_incapable_of_reform.html",
    "snippet": "For <strong>President Emmanuel Macron</strong>, this could soon mean assembling yet another fragile government, as there is no indication France can lift itself out of its catastrophic stalemate.",
    "published": "2 weeks ago"
  }
]