[
  {
    "title": "Micheál Martin wounded, but his leadership of Fianna Fáil is intact after stormy meeting",
    "url": "https://www.irishexaminer.com/news/politics/arid-41761532.html",
    "snippet": "Micheál Martin’s leadership of Fianna Fáil has emerged wounded but intact after an internal party review into Jim Gavin’s disastrous presidential campaign largely put the blame at the candidate’s feet.",
    "published": "1 week ago"
  },
  {
    "title": "Micheál Martin survives Fianna Fáil showdown - for now – The Irish Times",
    "url": "https://www.irishtimes.com/politics/2025/12/17/micheal-martin-survives-fianna-fail-showdown-for-now/",
    "snippet": "Later Micheál Martin heads to Brussels for this week’s crucial EU summit, where heads of government will try to reach agreement on a package of funding for Ukraine. Politico is calling it the most important EU summit since the pandemic.",
    "published": "1 week ago"
  },
  {
    "title": "Micheál Martin ‘on borrowed time’ after Fianna Fáil’s review into botched Áras campaign failed to answer key questions | Irish Independent",
    "url": "https://m.independent.ie/irish-news/micheal-martin-on-borrowed-time-after-fianna-fails-review-into-botched-aras-campaign-failed-to-answer-key-questions/a961058796.html",
    "snippet": "<strong>Taoiseach Micheál Martin is on borrowed time</strong>, according to multiple Fianna Fáil sources, following a bruising party meeting and a review into its presidential campaign that many TDs believe failed to answer key questions around his handling ...",
    "published": "6 days ago"
  },
  {
    "title": "Micheál Martin seeks accountability over killing of Seán Rooney in Lebanon",
    "url": "https://www.bbc.com/news/articles/c62d15e2637o",
    "snippet": "Taoiseach (Irish Prime Minister) Micheál Martin has <strong>expressed &quot;annoyance and anger&quot; at the pace of the justice system over the death of an Irish soldier on a UN peacekeeping mission in 2022</strong>.",
    "published": "3 days ago"
  },
  {
    "title": "Micheál Martin told Jim Gavin he could not recommend Fianna Fáil support after tenant row revelations",
    "url": "https://www.irishexaminer.com/news/politics/arid-41761448.html",
    "snippet": "Jim Gavin was told by Taoiseach Micheál Martin that he could not recommend Fianna Fáil continue to back the former GAA boss due to the revelations over €3,300 owed to a former tenant.",
    "published": "1 week ago"
  }
]