[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "In 1948 they relocated to Amritsar, where he studied at Hindu College, Amritsar. He attended <strong>Panjab University, then in Hoshiarpur, Punjab</strong>, studying Economics and got his bachelor&#x27;s and master&#x27;s degrees in 1952 and 1954, respectively, standing first throughout his academic career.",
    "published": "2 days ago"
  },
  {
    "title": "Manmohan Singh Education: Former PM Schooling, Colleges, Degrees and Academic Achievements",
    "url": "https://www.jagranjosh.com/articles/manmohan-singh-education-qualification-1735280163-1",
    "snippet": "Singh completed his Master’s degree in Economics from <strong>Punjab University</strong> in 1954 with excellent results. Dr Manmohan Singh&#x27;s hunt for knowledge took him to the University of Cambridge in the United Kingdom, where he enrolled at St. John’s College.",
    "published": "December 27, 2024"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "Dr. Singh’s academic credentials were further strengthened by his years on the faculty of <strong>Punjab University and the prestigious Delhi School of Economics</strong>.",
    "published": null
  },
  {
    "title": "What are the educational degrees of former Prime Minister Dr. Manmohan Singh? - Quora",
    "url": "https://www.quora.com/What-are-the-educational-degrees-of-former-Prime-Minister-Dr-Manmohan-Singh",
    "snippet": "Manmohan Singh, the ex-Prime Minister of India had attended <strong>Punjab University, then in Hoshiarpur, Punjab</strong>, studying Economics and got his bachelor&#x27;s and master&#x27;s degrees in 1952 and 1954, respectively, standing first throughout his academic career.",
    "published": null
  },
  {
    "title": "CURRICULUM VITAE DR. MANMOHAN SINGH PRIME MINISTER OF INDIA ACADEMIC RECORD",
    "url": "https://www.visvabharati.ac.in/files/6340200114_Manmohan.pdf",
    "snippet": "DR. MANMOHAN SINGH",
    "published": null
  }
]