[
  {
    "title": "2024–2025 Belgian government formation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–2025_Belgian_government_formation",
    "snippet": "Incumbent Prime Minister Alexander De Croo announced his resignation and his party&#x27;s leader Tom Ongena declared that Open Flemish Liberals and Democrats would not be a part of the next federal government. <strong>Bart De Wever</strong> was sworn in as prime minister on 3 February 2025.",
    "published": "November 4, 2025"
  },
  {
    "title": "2024 Belgian federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024_Belgian_federal_election",
    "snippet": "As part of the agreement, the two parties would form a partnership during government formation talks at the federal level. On 31 January 2025, a governmental agreement was reached between the Arizona parties, with <strong>De Wever</strong> being sworn in as prime minister on 3 February 2025.",
    "published": "September 18, 2025"
  },
  {
    "title": "Belgium to form government after seven months of negotiations | Belgium | The Guardian",
    "url": "https://www.theguardian.com/world/2025/jan/31/belgium-to-form-government-after-seven-months-of-negotiations",
    "snippet": "The coalition government will be led by the conservative New Flemish Alliance party’s <strong>Bart De Wever</strong>",
    "published": "January 31, 2025"
  },
  {
    "title": "Government at a Glance 2025: Belgium",
    "url": "https://www.oecd.org/en/publications/government-at-a-glance-2025-country-notes_da3361e1-en/belgium_52bf90a7-en.html",
    "snippet": "These country-specific factsheets are based on the data from Government at a Glance 2025, on a wide array of public governance and public administration issues, ranging from trust in government, satisfaction with services, digital government, regulation, and procurement, to public employment ...",
    "published": null
  },
  {
    "title": "Belgium set for new government after months of negotiations | Reuters",
    "url": "https://www.reuters.com/world/europe/belgium-set-new-government-after-months-negotiations-vrt-news-2025-01-31/",
    "snippet": "Political parties in Belgium agreed on Friday to form a new government, the office of Belgian King Philippe said, ending almost eight months of complicated talks that followed the election victory of Flemish nationalist party N-VA.",
    "published": "January 31, 2025"
  }
]