[
  {
    "title": "Begoña Gómez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Begoña_Gómez",
    "snippet": "She was also strategy consultant and team training for Spain and Portugal from 1999 to 2018, professor in the Master in Marketing and Commercial Management at EAE Business School from 2009 to 2010, and coordinating partner of the Business Social Transformation WAS working group since 2018. Following her husband Pedro Sánchez&#x27; appointment as the Prime Minister of Spain in June 2018, Gómez obtained a University Chair in &quot;Competitive Social Transformation&quot; and became co-director of a new Master program in Competitive Social Transformation, and co-director of the fundraising title for the third sector (UCM and AEFR).",
    "published": "3 weeks ago"
  },
  {
    "title": "Pedro Sánchez Names Elma Saiz Spanish Government Spokeswoman - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-12-22/sanchez-names-elma-saiz-spanish-government-spokeswoman",
    "snippet": "Spanish Prime Minister Pedro Sánchez announced Monday that he is naming <strong>Elma Saiz</strong> as government spokesperson.",
    "published": "1 day ago"
  },
  {
    "title": "Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pedro_S%C3%A1nchez",
    "snippet": "Pedro Sánchez Pérez-Castejón (Spanish pronunciation: [ˈpeðɾo ˈsantʃeθ ˈpeɾeθ kasteˈxon] ⓘ; born 29 February 1972) is a Spanish politician and economist who has served as Prime Minister of Spain since 2018. He has also been Secretary-General of the Spanish Socialist Workers&#x27; Party (PSOE) since July 2017, having previously held that office from 2014 to 2016, and has also been serving as the ninth president of Socialist International since 2022.",
    "published": "1 day ago"
  },
  {
    "title": "Spanish PM's wife tells court she is innocent in corruption case | Reuters",
    "url": "https://www.reuters.com/world/europe/spanish-pms-wife-tells-court-she-is-innocent-corruption-case-2024-12-18/",
    "snippet": "Item 1 of 5 <strong>Begona Gomez</strong>, Spain&#x27;s Prime Minister Pedro Sanchez&#x27;s wife, looks on at a polling station during the European Parliament election, in Madrid, Spain, June 9, 2024.",
    "published": "December 18, 2024"
  },
  {
    "title": "Spanish court summons PM Sanchez's wife over corruption allegations | Reuters",
    "url": "https://www.reuters.com/world/europe/spanish-court-summons-pm-sanchezs-wife-over-corruption-allegations-2024-06-04/",
    "snippet": "The case was brought in a private ... as a candidate for a far-right party in European elections. Manos Limpias alleged that <strong>Begona Gomez</strong> used her influence as the wife of the prime minister to secure sponsors for a university ...",
    "published": "June 4, 2024"
  }
]