[
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "Volodymyr Zelensky (born January 25, 1978, Kryvyy Rih, Ukraine, U.S.S.R. [now in Ukraine]) is a Ukrainian actor and comedian who was <strong>elected president of Ukraine in 2019.</strong> Although he was a political novice, Zelensky’s anti-corruption platform ...",
    "published": "September 27, 2019"
  },
  {
    "title": "Volodymyr Zelensky’s biography — Official web site of the ...",
    "url": "https://www.president.gov.ua/en/president",
    "snippet": "Produced 10 feature length movies, won more than 30 awards of the National Television Award of Ukraine &quot;Teletriumph”. President Zelenskyy is a prize-winner of numerous international film festivals and media forums. From the outset of the hostilities in Donbas Volodymyr Zelenskyy and “KVARTAL 95” rendered support to the Armed Forces with funds, equipment and arranged shows on the front line and in different military units.",
    "published": "1 day ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "Due to this extension of his term, Zelenskyy is the second-longest serving president in Ukrainian history, after only Kuchma. Volodymyr Oleksandrovych Zelenskyy was born into a Jewish family on 25 January 1978 in Kryvyi Rih, an industrial city in the Dnipropetrovsk Oblast of Ukraine.",
    "published": "4 days ago"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "The First Lady of Ukraine, Olena Zelenska, summarized this year’s results of implementing the All-Ukrainian Mental Health Program “How Are You?”. ... The Head of State honored the memory of Poles who, at different times, gave their lives for the sake of their Motherland; he also made an entry in the book of remembrance. ... In Warsaw, President of Ukraine Volodymyr Zelenskyy held a meeting with President of Poland Karol Nawrocki.",
    "published": "3 days ago"
  },
  {
    "title": "Five Years of Zelensky’s Presidency | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/five-years-zelenskys-presidency",
    "snippet": "<strong>May 20, 2024</strong>, marked the end of President Volodymyr Zelensky’s fifth year in office. Until the next election, which, deferred for now, may occur once martial law is lifted, Zelensky will continue to serve as Ukraine’s president.",
    "published": null
  }
]