[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "On 1 July 2024, Earps joined Première Ligue club Paris Saint-Germain on a two-year contract until June 2026. She and Paris Saint-Germain lost 5–2 on aggregate to Juventus in the 2024–25 UEFA Women&#x27;s Champions League qualifying rounds. On 12 November 2025, Earps returned to <strong>Manchester United</strong> ...",
    "published": "3 days ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in 2024, Mary took on a new challenge by joining French giants <strong>Paris Saint-Germain</strong>. Earps called time on her spell with the Lionesses in May 2025, after collecting a total of 53 caps.",
    "published": null
  },
  {
    "title": "England goalkeeper Mary Earps announces international retirement before Euro 2025 - The Athletic",
    "url": "https://www.nytimes.com/athletic/6384495/2025/05/27/mary-earps-england-retirement/",
    "snippet": "She plays her club football for <strong>Paris Saint-Germain</strong>, who she joined in July after five years at Manchester United. Earps came fifth in Ballon d’Or voting in 2023 and won the 2023-24 FA Cup with United.",
    "published": "May 27, 2025"
  },
  {
    "title": "Who is Mary Earps? Everything you need to know about the England goalkeeper",
    "url": "https://www.fourfourtwo.com/features/mary-earps-everything-you-need-to-know",
    "snippet": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. ... Mary Earps is one of the best goalkeepers in the world and is currently plying her trade at <strong>Paris Saint-Germain</strong>.",
    "published": "October 18, 2024"
  },
  {
    "title": "Mary Earps signs for PSG following Manchester United exit - The Athletic",
    "url": "https://www.nytimes.com/athletic/5602915/2024/07/01/mary-earps-psg-transfer/",
    "snippet": "In a message to supporters upon leaving United, Earps said it was “the right time to make a change and embark on a new challenge” with the club “about to undergo a period of transition”. ... Earps is currently with the <strong>England squad</strong> ...",
    "published": "July 1, 2024"
  }
]