[
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "In May 2024, then-IOC President ... Paris, World Athletics should focus its funding on supporting athletes at the other end of the spectrum. When London announced its bid to hold the 2012 Olympics, Coe became an ambassador for the effort and a member of the board of the bid company. With the May 2004 resignation of chairman Barbara Cassani, ...",
    "published": "1 month ago"
  },
  {
    "title": "Coe acclaims championship for the ages | Reuters",
    "url": "https://www.reuters.com/sports/coe-acclaims-championship-ages-2025-09-21/",
    "snippet": "World Athletics Championships Tokyo 2025 - Opening Ceremony - Medal Ceremony - Japan National Stadium, Tokyo, Japan - September 13, 2025 World Athletics President Sebastian Coe ahead of the evening events REUTERS/Edgar Su/File Photo Purchase Licensing Rights, opens new tab",
    "published": "September 21, 2025"
  },
  {
    "title": "It will be 'big and punchy': Athletics chief Coe looks to future",
    "url": "https://www.france24.com/en/live-news/20250624-it-will-be-big-and-punchy-athletics-chief-coe-looks-to-future",
    "snippet": "Paris (AFP) – <strong>Sebastian Coe has two years left as World Athletics president</strong> and it promises to be lively as he says next year&#x27;s inaugural World Athletics Ultimate Team Championship will remind the world the sport is &quot;big and punchy and still ...",
    "published": "June 24, 2025"
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "Sebastian Coe is Chancellor of Loughborough University, Executive Chairman of CSM Sport and Entertainment and a member of the IOC Tokyo 2020 Coordination Committee and council member of the Association of Summer Olympic International Federations. He was Chairman of the London 2012 Organising Committee for the Olympic and Paralympic Games, having previously been Chairman of the London 2012 bid company. Seb set 12 world records during his athletics ...",
    "published": null
  },
  {
    "title": "World Athletics Convention inspires innovation action | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/world-athletics-convention-tokyo-2025-innovation-action",
    "snippet": "Inspired by the trail blazed by keynote speaker Bob Weis, World Athletics President Sebastian Coe reinforced the imperative that innovation drives the future of athletics during his opening speech for the World Athletics Convention",
    "published": null
  }
]