[
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "Presidents Daniel Burley Woolfall, Rodolphe Seeldrayers, and Arthur Drewry died during their term in office. The current president is Swiss-Italian <strong>Gianni Infantino</strong>, elected on 26 February 2016 during ...",
    "published": "1 month ago"
  },
  {
    "title": "Gianni Infantino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gianni_Infantino",
    "snippet": "Infantino&#x27;s conduct with regard to his contract with FIFA, if at all, constituted internal compliance issues rather than an ethical matter.&quot; While the investigatory chamber discharged Infantino, criticism of his conduct continued. Karl-Heinz Rummenigge, chairman of FC Bayern Munich, criticised Infantino for not fulfilling his promises regarding transparency, democracy and governance.",
    "published": "1 day ago"
  },
  {
    "title": "FIFA Council",
    "url": "https://inside.fifa.com/organisation/fifa-council",
    "snippet": "The final composition of the FIFA Council consists of 37 members: <strong>one President, elected by the FIFA Congress; eight vice presidents, and 28 other members elected by the member associations</strong> – each for a term of four years.",
    "published": null
  },
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/organisation/president",
    "snippet": "The official site of the international governing body of football with news, national associations, competitions, results, fixtures, development, organisation, world rankings, statistics, the International Football Association Board, history, laws of the game, futsal, publications, downloads, and contact details.",
    "published": null
  },
  {
    "title": "Organisation",
    "url": "https://inside.fifa.com/organisation",
    "snippet": "The official site of the international governing body of football with news, national associations, competitions, results, fixtures, development, organisation, world rankings, statistics, the International Football Association Board, history, laws of the game, futsal, publications, downloads, and contact details.",
    "published": null
  }
]