[
  {
    "title": "Sudha Sharma Gautam - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudha_Sharma_Gautam",
    "snippet": "Dr. Sudha Sharma Gautam (Nepali: डा. सुधा शर्मा गौतम) is a Nepalese politician and senior obstetrician-gynecologist who has served as a <strong>minister of health and population</strong> in the Sushila Karki led interim Government since 26 October 2025.",
    "published": "November 11, 2025"
  },
  {
    "title": "Health Minister announces first decision to provide psychological counseling to injured in Gen Z protests",
    "url": "https://english.nepalnews.com/s/health/health-minister-announces-first-decision-to-provide-psychological-counseling-to-injured-in-gen-z-protests/",
    "snippet": "KATHMANDU: Newly appointed <strong>Health and Population Minister</strong> Dr. Sudha Sharma Gautam has officially assumed her duties. Upon taking office, she announced her first decision: providing psychological counseling services to those injured during the ...",
    "published": null
  },
  {
    "title": "Dr Sudha Sharma",
    "url": "https://pata.org.np/more-detail/dr-sudha-sharma",
    "snippet": "She has served as President of ... Asian Federation of Obstetrics and Gynecology and <strong>Chair of Education Committee of the Asia Oceana Federation of Obstetrics and Gynecology</strong>....",
    "published": null
  },
  {
    "title": "Of being a woman in a man's world",
    "url": "https://kathmandupost.com/books/2021/01/16/of-being-a-woman-in-a-man-s-world",
    "snippet": "Though not able to do much under the circumstances, Gautam retaliated in his own way when he refused to accept the position he was offered in the Administrative Reforms Commission. She also admits her soft corner for liberal democracy and civil rights after her marriage to a fellow medico, Dr Bijay Sharma, with connections to the Koirala family.",
    "published": null
  },
  {
    "title": "Sudha Sharma Gautam - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q136650529",
    "snippet": "Nepalese <strong>Minister of Health and Population</strong> Since 2025",
    "published": null
  }
]