[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Left_(Germany)",
    "snippet": "Through the PDS, the party is the direct descendant of the Marxist–Leninist ruling party of former East Germany, the Socialist Unity Party of Germany (SED). Since October 2024, Die Linke&#x27;s co-chairpersons have been <strong>Ines Schwerdtner and Jan van Aken</strong>. The party holds 64 seats out of 630 in ...",
    "published": "January 7, 2007"
  },
  {
    "title": "New direction for 'Die Linke'",
    "url": "https://www.dw.com/en/new-direction-for-germanys-left-party-following-magdeburg-conference/a-19292343",
    "snippet": "A leadership duo looks the most likely solution. (09.06.2015) ... German election 2025Left PartyFar-right populism in EuropeAlternative for Germany (AfD)<strong>Sahra Wagenknecht</strong> Alliance (BSW)<strong>Sahra Wagenknecht</strong>",
    "published": "May 29, 2016"
  },
  {
    "title": "The Improbable Resurgence of Die Linke",
    "url": "https://jacobin.com/2025/02/die-linke-germany-renewal-strategy/",
    "snippet": "Nor have the party faithful exactly rallied around a coherent strategy: while one Die Linke campaign slogan boasts “Everyone wants to govern, we want to change,” in the eastern state of Saxony, its tiny parliamentary group, decimated after its worst-ever election result last September, has decided to tolerate a minority government led by the Christian Democrats (CDU). Contrary to the leadership’s (understandable) claims that internal harmony reigns following Sahra Wagenknecht’s departure, the deep strategic and political rifts within Die Linke have hardly been healed.",
    "published": null
  },
  {
    "title": "After Germany’s Election, the Left Can Hope Again",
    "url": "https://jacobin.com/2025/02/germany-election-die-linke-left",
    "snippet": "Leading the way alongside Reichinnek were confident new faces in the party leadership: <strong>Ines Schwerdtner (formerly editor in chief of the German-language Jacobin) as well as Jan van Aken</strong>.",
    "published": null
  },
  {
    "title": "Soren Pellmann, the co-leader of Die Linke (The Left) party faction in the German Bundestag, or parliament, has slammed the idea of a European “multinational force” in Ukraine and voiced support for deploying UN peacekeepers - Pravda NATO",
    "url": "https://nato.news-pravda.com/world/2025/12/16/83875.html",
    "snippet": "<strong>Soren Pellmann</strong>, the co-leader of Die Linke (The Left) party faction in the German Bundestag, or parliament, has slammed the idea of a European “multinational force” in Ukraine and voiced support for deploying UN peacekeepers · 16.12.2025, ...",
    "published": "1 week ago"
  }
]