[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Marcia Carolyn Kaptur (/ˈkæptər/ KAP-tər; born June 17, 1946) is an American politician serving as the U.S. representative for Ohio&#x27;s 9th congressional district since 1983. A member of the Democratic Party, Kaptur is the longest-serving woman in congressional history and the dean of Ohio&#x27;s congressional delegation since 2009 when Representative Ralph Regula retired.",
    "published": "1 week ago"
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "In 1981, while pursuing a doctorate in urban planning and development finance at MIT, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the 1982 recession to stage a nationally-recognized upset.",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Kaptur was born in Toledo, Ohio, ... Kaptur worked as an <strong>urban planner with the Toledo-Lucas County Plan Commissions from 1969 to 1975 before becoming director of planning at the National Center for Urban Ethnic Affairs from 1975 to 1977</strong>....",
    "published": null
  },
  {
    "title": "KAPTUR, Marcia Carolyn (Marcy) | US House of Representatives: History, Art & Archives",
    "url": "https://history.house.gov/People/Detail/16086",
    "snippet": "KAPTUR, Marcia Carolyn (Marcy), A Representative from Ohio; born in Toledo, Lucas County, Ohio, June 17, 1946; graduated from St. Ursula Academy, Toledo, Ohio, 1964; B.A., University of Wisconsin, Madison, Wis., 1968; M.A., University of Michigan, Ann Arbor, Mich., 1974; attended the University of Manchester, Manchester, England, 1974; post-graduate studies, Massachusetts Institute of Technology, Cambridge, Mass., 1981; urban planner, Toledo-Lucas County, Ohio, Plan Commissions, 1969-1975; director of planning, National Center for Urban Ethnic Affairs, 1975-1977; assistant director for urban affairs, domestic policy staff, Executive Office of the President, 1977-1979; elected as a Democrat to the Ninety-eighth and to the twenty-one succeeding Congresses (January 3, 1983-present).",
    "published": null
  },
  {
    "title": "The Honorable Marcy Kaptur (D-OH) Biography",
    "url": "https://www.congress.gov/115/meeting/house/108368/witnesses/HHRG-115-VR03-Bio-K000009-20180613.pdf",
    "snippet": "Congresswoman Kaptur, a native Toledoan, lives in the same modest house where she grew up. She is a Polish-American with humble, working class roots. Her family operated a small grocery store and · her mother later served on the original organizing committee of a trade union at the Champion Spark Plug ... After graduating from St. Ursula Academy, she became the first member of her family to attend college, earning a bachelor’s degree in history from the University of Wisconsin (1968) and later a master’s",
    "published": null
  }
]