[
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "From <strong>Daniel Dubroca</strong> to Fabien Galthie, who has been the men&#x27;s France rugby coach since 1990 and how succesful have they been?",
    "published": "May 30, 2025"
  },
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "His stint as coach came to an abrupt end at the end of 2014 due to poor relations with the President of Montpellier Rugby Club. In 2017–2018 he coached Toulon. In 2019 Galthié was appointed as vice-head coach of the French national team, having been scheduled to succeed <strong>Jacques Brunel</strong> as head ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Inside the journey which took France from global laughing stock to World Cup contenders",
    "url": "https://www.telegraph.co.uk/rugby-union/2023/09/08/france-rugby-world-cup-2023-fabien-galthie/",
    "snippet": "To mitigate for Brunel’s departure, the Fédération Française de Rugby (FFR) allowed the head coach’s successor, Fabien Galthié, to shadow the backroom staff at the tournament. As Brunel headed off into the sunset, Galthié could hit the ground running.",
    "published": "September 12, 2023"
  },
  {
    "title": "Fabien Galthié | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/11932",
    "snippet": "Galthié is a former French Rugby union scrum-half. He played for Colomiers and Stade Francais. Galthié won 64 caps for France, including 4 Rugby World Cup appearances, as well as captaining France at the 2003 World Cup. Former French national coach Ber…",
    "published": null
  },
  {
    "title": "Fabien Galthie’s right-hand man exits after France’s World Cup failure : Planet Rugby",
    "url": "https://www.planetrugby.com/news/fabien-galthies-right-hand-man-departs-after-frances-rugby-world-cup-failure-report",
    "snippet": "France head coach Fabien Galthie with <strong>Raphael Ibanez</strong> behind him. France are in search for a new team manager after reports stated <strong>Raphael Ibanez</strong> had left his position in the set-up.",
    "published": "November 20, 2023"
  }
]