[
  {
    "title": "Canadian Prime Minister Justin Trudeau and his wife announce their separation : NPR",
    "url": "https://www.npr.org/2023/08/03/1191789443/canadian-prime-minister-justin-trudeau-and-his-wife-announce-their-separation",
    "snippet": "TORONTO — Canadian Prime Minister Justin Trudeau and his wife, Sophie Gregoire Trudeau, announced Wednesday that <strong>they are separating after 18 years of marriage</strong>.",
    "published": "August 3, 2023"
  },
  {
    "title": "Does Anyone Care About Justin Trudeau’s Separation? - The New York Times",
    "url": "https://www.nytimes.com/2023/08/04/style/justin-trudeaus-separation.html",
    "snippet": "Like many public statements on ... conversations,” a joint post said, <strong>Justin Trudeau, the prime minister of Canada, had separated from his wife, Sophie Grégoire Trudeau</strong>....",
    "published": "August 4, 2023"
  },
  {
    "title": "Justin Trudeau and Sophie Grégoire Trudeau announce separation | CBC News",
    "url": "https://www.cbc.ca/news/politics/trudeau-gregoire-separation-1.6925254",
    "snippet": "<strong>Prime Minister Justin Trudeau and his wife, Sophie Grégoire Trudeau, have decided to separate</strong>, according to statements posted online by both of them.",
    "published": "August 3, 2023"
  },
  {
    "title": "Justin Trudeau separates from wife, Sophie - POLITICO",
    "url": "https://www.politico.com/news/2023/08/02/justin-trudeau-wife-separation-00109437",
    "snippet": "OTTAWA, Ont. — <strong>Canadian Prime Minister Justin Trudeau and Sophie Grégoire Trudeau are separating after 18 years of marriage</strong>, a high-profile split for Canada’s most recognizable political power couple.",
    "published": "August 3, 2023"
  },
  {
    "title": "Justin Trudeau and Sophie Grégoire Trudeau announce separation | Justin Trudeau | The Guardian",
    "url": "https://www.theguardian.com/world/2023/aug/02/justin-trudeau-sophie-gregoire-trudeau-separation",
    "snippet": "Canada’s prime minister, <strong>Justin Trudeau, and his wife, Sophie Grégoire Trudeau, are separating, the couple have announced on Instagram, with a statement that appeared to mark the end of their 18-year marriage</strong>.",
    "published": "August 4, 2023"
  }
]