[
  {
    "title": "Lamine Diack (footballer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lamine_Diack_(footballer)",
    "snippet": "Lamine Diack (born 15 November 2000) is a Senegalese professional footballer who plays as a defensive midfielder for Süper Lig club Hatayspor, on loan from Ligue 1 club Nantes. A product of the <strong>youth academy of the Oslo FA in Senegal</strong>, Diack transferred to the Macedonian club Shkupi on 7 June ...",
    "published": "September 11, 2025"
  },
  {
    "title": "Olympedia – Lamine Diack",
    "url": "https://www.olympedia.org/athletes/899103",
    "snippet": "Lamine Diack <strong>studied economics and law at College Van Vollenhoven in Dakar and the National School of Taxes in Paris</strong>. He was a top athlete in the long jump, winning the 1958 French Championships in long jump, and he held the West African record from 1957-60.",
    "published": null
  },
  {
    "title": "Lamine Diack - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lamine_Diack",
    "snippet": "Lamine Diack (7 June 1933 – 3 December 2021) was a Senegalese businessman, sports administrator, and athlete. He was president of the International Association of Athletics Federations (IAAF) from 1999 to 2015. He was the subject of numerous investigations into corruption during his tenure ...",
    "published": "October 18, 2025"
  },
  {
    "title": "Lamine Diack | MLSsoccer.com",
    "url": "https://www.mlssoccer.com/players/lamine-diack/",
    "snippet": "TRANSFER TRACKER STATUS: Loan ended The Colorado Rapids and FC Nantes have agreed to end Lamine Diack’s loan spell, the club announced Sunday.",
    "published": null
  },
  {
    "title": "IAAF President Lamine Diack speech for Helsinki IAAF Press Conference | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/iaaf-president-lamine-diack-speech-for-helsin",
    "snippet": "We have increased the testing before, during and after the competition and we will also focus our efforts on education, which is why we are glad to announce that the IAAF has worked with WADA and FINADA to bring the Athletes Outreach Education programme to the Athletes’ Village in Helsinki.",
    "published": null
  }
]