[
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "The first is the French financial ... businessman Eachran Gilmour; sources differ on whether they were ever married. <strong>Since 2006, her partner has been the entrepreneur Xavier Giocanti from Marseille</strong>, a fellow-student at Université Paris X....",
    "published": "2 weeks ago"
  },
  {
    "title": "Qui est Xavier Giocanti, le mari de Christine Lagarde ?",
    "url": "https://www.blog-introduction.fr/xavier-giocanti-mari-de-christine-lagarde/",
    "snippet": "D’origine marseillaise et homme d’affaires très connu dans le domaine immobilier, <strong>Xavier Giocanti</strong> fait les Unes des journaux depuis un certain temps. Même s’il a toujours préféré rester dans l’anonymat, il attire désormais les ...",
    "published": "April 20, 2025"
  },
  {
    "title": "Christine Lagarde, i figli Pierre Henri e Thomas dall'ex marito Wilfried: ora il compagno è Xavier Giocanti – Corriere dell'Umbria",
    "url": "https://corrieredellumbria.corr.it/news/esteri/29608270/christine-lagarde-chi-e-figli-pierre-henri-thomas-ex-marito-wilfried-compagno-xavier-giocanti-vegeteriana.html",
    "snippet": "Divorziata da Wilfried Lagarde, è madre di due figli: Pierre Henri Lagarde (nato nel 1986, imprenditore nel restauro) e Thomas Lagarde (nato nel 1988, architetto). <strong>Dal 2006, il suo compagno è Xavier Giocanti, uomo d&#x27;affari di Marsiglia</strong>.",
    "published": null
  },
  {
    "title": "Christine Lagarde",
    "url": "https://www.fembio.org/english/biography.php/woman/biography/christine-lagarde/",
    "snippet": "She has women-only meetings arranged ... by her partner, the Marseille business man Xavier Giocanti, <strong>a university friend whom she re encountered in 2006.</strong>...",
    "published": null
  },
  {
    "title": "241 Xavier Giocanti Photos & High Res Pictures - Getty Images",
    "url": "https://www.gettyimages.com/photos/xavier-giocanti",
    "snippet": "International Monetary Fund Managing Director Christine Lagarde and her husband Xavier Giocanti arrive to attend a dinner hosted by French President...",
    "published": null
  }
]