[
  {
    "title": "Home - Mediocredito Centrale",
    "url": "https://www.mcc.it/",
    "snippet": "MEDIOCREDITO CENTRALE per la sostenibilità ambientale · In questo momento è attiva la modalità di risparmio energetico del monitor ·",
    "published": "July 18, 2025"
  },
  {
    "title": "Il Gruppo Mediocredito Centrale aderisce alla Convenzione con il Ministero del Lavoro a supporto dei giovani imprenditori; oltre €576 milioni di incentivi - Il Giornale d'Italia",
    "url": "https://www.ilgiornaleditalia.it/news/mondo-imprese/756962/mediocredito-centrale-aderisce-alla-convenzione-con-il-ministero-del-lavoro-a-supporto-dei-giovani-imprenditori-oltre-576-milioni-di-incentivi.html",
    "snippet": "Il Gruppo Mediocredito Centrale (MCC) rafforza il proprio impegno a favore dello sviluppo economico e dell’inclusione lavorativa aderendo alla nuova Convenzione siglata dal Ministero del Lavoro e delle Politiche Sociali, da Invitalia e dall’ABI, dedicata al sostegno dell’imprenditoria giovanile.",
    "published": null
  },
  {
    "title": "Banca del Mezzogiorno (MedioCredito Centrale S.p.A.) | Devex",
    "url": "https://www.devex.com/organizations/banca-del-mezzogiorno-mediocredito-centrale-s-p-a-152951",
    "snippet": "Learn more about Banca del Mezzogiorno (MedioCredito Centrale S.p.A.)&#x27;s jobs, projects, latest news, contact information and geographical presence. MISSION Within the Invitalia Group, they have consolidated our institutional role, aimed at increas",
    "published": null
  },
  {
    "title": "Banca del Mezzogiorno MedioCredito Centrale - Overview, News & Similar companies | ZoomInfo.com",
    "url": "https://www.zoominfo.com/c/banca-del-mezzogiorno-mediocredito-centrale/430331052",
    "snippet": "A front-line source in Facilities ... operations within three months. Banca del Mezzogiorno <strong>MedioCredito Centrale will be decreasing investments and is expected to use a contingent workforce to support these efforts</strong>....",
    "published": null
  },
  {
    "title": "Updates on Banca del Mezzogiorno - MEF Department of Treasury",
    "url": "https://www.dt.mef.gov.it/en/doc_hp/aggiornam_bancamezzog.html",
    "snippet": "Within the context of the project, on 13 September 2010, ICCREA Holding Spa (the industrial company of the System of Banks of Cooperative Credit – BCC) and Poste Italiane announced that <strong>together they have begun to explore the possible acquisition of Mediocredito Centrale (MCC) from Unicredit</strong> ...",
    "published": null
  }
]