[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "FiveThirtyEight, also rendered as 538, was an American website that focused on opinion poll analysis, politics, economics, and sports blogging in the United States. The website, which took its name from the number of electors in the United States electoral college, was founded on <strong>March 7, 2008</strong>, as ...",
    "published": "November 19, 2025"
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "<strong>Nathaniel Read Silver</strong> (born January 13, 1978) is an American statistician, political analyst, author, sports gambler, and poker player who analyzes baseball, basketball, football, and elections. He is the founder of FiveThirtyEight and held the position of editor-in-chief there, along with ...",
    "published": "1 week ago"
  },
  {
    "title": "50 Facts About FiveThirtyEight - Facts.net",
    "url": "https://facts.net/general/50-facts-about-fivethirtyeight/",
    "snippet": "FiveThirtyEight, founded by <strong>Nate Silver</strong>, revolutionized data-driven journalism and election forecasting. Its innovative polling methodologies and insights have reshaped public perception of polling accuracy.",
    "published": "February 28, 2025"
  },
  {
    "title": "Nate Silver of FiveThirtyEight’s advice to founders | Fortune",
    "url": "https://fortune.com/2023/08/15/fivethirtyeight-nate-silver-advice-founders-disney-espn-abc-acquisition-departure/",
    "snippet": "FiveThirtyEight.com, named after the number of votes in the Electoral College, was founded in <strong>2008 by Silver</strong> as a data-driven news site that covered politics, economics, and sports—or, in other words, a blog.",
    "published": "August 15, 2023"
  },
  {
    "title": "FiveThirtyEight Media Bias | AllSides",
    "url": "https://www.allsides.com/news-source/fivethirtyeight-0",
    "snippet": "Sometimes referred to as 538, the website takes its name from the number of electors in the United States electoral college.[1] Established on <strong>March 7, 2008</strong>, as FiveThirtyEight.com, in August 2010 the blog became a licensed feature of The New York Times online and was renamed FiveThirtyEight: ...",
    "published": null
  }
]