[
  {
    "title": "Sara bint Mashour Al Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sara_bint_Mashour_Al_Saud",
    "snippet": "<strong>Sara bint Mashour Al Saud</strong> (Arabic: سارة بنت مشهور آل سعود) is a member of the Saudi royal family and wife of Saudi Crown Prince Mohammed bin Salman, who is her first cousin.",
    "published": "1 week ago"
  },
  {
    "title": "Who is Princess Sara bint Mashour bin Abdulaziz Al Saud, Wife of Crown Prince Mohammed bin Salman Al Saud of Saudi Arabia? 3 Facts You Need To Know",
    "url": "https://www.harpersbazaararabia.com/culture/royal-watch/princess-sara-bint-mashour-bin-abdulaziz-al-saud",
    "snippet": "On April 6, 2008 <strong>HRH Princess Sara bint Mashour bin Abdulaziz Al Saud</strong> married Crown Prince Mohammed bin Salman Al Saud.",
    "published": "October 23, 2023"
  },
  {
    "title": "The Trillionaire Life Of Saudi Prince Salman's Wife - YouTube",
    "url": "https://www.youtube.com/watch?v=RHrfoIZ5C70",
    "snippet": "The Trillionaire Life Of Saudi Prince Salman&#x27;s Wife<strong>Sara bint Mashoor bin Abdulaziz Al Saud</strong>, the mysterious wife of Mohammed bin Salman, lives a life of unpar...",
    "published": "February 19, 2025"
  },
  {
    "title": "Princess Sara bint Mashhour, wife of Crown Prince ...",
    "url": "https://x.com/SameeraAziz/status/1990558205752086812",
    "snippet": "<strong>Princess Sara bint Mashhour</strong>, wife of Crown Prince Mohammed bin Salman, has donated 10M SAR to support children with Type 1 diabetes — a strong reflection of Saudi compassion and humanitarian values.",
    "published": null
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed is the first child of King Salman bin Abdulaziz and his third wife, <strong>Fahda bint Falah Al Hithlain</strong>. After obtaining a law degree from King Saud University, he became an advisor to his father in 2009.",
    "published": "11 hours ago"
  }
]