[
  {
    "title": "BC Partners to acquire Com Hem — BC Partners",
    "url": "https://www.bcpartners.com/news/bc-partners-to-acquire-com-hem/",
    "snippet": "<strong>Carlyle and Providence acquired Com Hem from EQT in 2006</strong> and, in the same year, they acquired UPC, which was integrated with Com Hem.",
    "published": "April 28, 2025"
  },
  {
    "title": "BC Partners to acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/bc-partners-acquire-com-hem",
    "snippet": "I am convinced that we, with BC Partners as our new owner, will further develop our already strong position on the Swedish market”, says Tomas Franzén, CEO at Com Hem. <strong>Carlyle and Providence acquired Com Hem from EQT in 2006</strong> and, in the same year, they acquired UPC, which was integrated ...",
    "published": null
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - <strong>The Carlyle Group and Providence Equity Partners today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT</strong>. Financial details were not disclosed. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  },
  {
    "title": "BC Partners to acquire Com Hem - Private Equity Wire",
    "url": "https://www.privateequitywire.co.uk/bc-partners-acquire-com-hem/",
    "snippet": "I am convinced that we, with BC Partners as our new owner, will further develop our already strong position on the Swedish market”, says Tomas Franzén, CEO at Com Hem. <strong>Carlyle and Providence acquired Com Hem from EQT in 2006</strong> and, in the same year, they acquired UPC, which was integrated ...",
    "published": "July 24, 2011"
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners, the Owners of Com Hem, Agree to Acquire UPC Sweden | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-owners-com-hem-agree",
    "snippet": "London - Private equity firms <strong>The Carlyle Group and Providence Equity Partners have signed an agreement with Liberty Global to acquire UPC Sverige AB</strong>. Carlyle and Providence recently acquired Com Hem, Sweden’s leading cable operator. UPC Sverige AB is a supplier of TV and broadband services ...",
    "published": null
  }
]