[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "Martin was awarded &quot;Politician of the Year&quot; by the Journal for his performance and election result. <strong>He was elected again as Taoiseach in a 95–76 vote by the Dáil on 23 January 2025</strong> following a coalition agreement between Fianna Fáil, Fine Gael and with the support of several independent TDs.",
    "published": "2 weeks ago"
  },
  {
    "title": "Micheál Martin confident he will remain as Fianna Fáil leader as he receives presidential report - Irish Mirror",
    "url": "https://www.irishmirror.ie/news/irish-news/politics/micheal-martin-confident-remain-fianna-36408836",
    "snippet": "11:17, 16 Dec 2025 · View Image · Taoiseach Micheal Martin speaking to reporters before a Cabinet meeting at Government Buildings, Dublin. Photo by: Cillian Sherlock/PA Wire(Image: PA) Taoiseach Micheál Martin said he isn’t concerned his leadership is in trouble after receiving a review into his party’s failed presidential campaign.",
    "published": "26 minutes ago"
  },
  {
    "title": "Press remarks by President António Costa following the meeting with Taoiseach of Ireland, Micheál Martin - Consilium",
    "url": "https://www.consilium.europa.eu/en/press/press-releases/2025/12/09/press-remarks-by-president-antonio-costa-following-the-meeting-with-taoiseach-of-ireland-micheal-martin/",
    "snippet": "<strong>We are all conscious that the EU needs to adapt to a new geopolitical reality and our budget has to reflect that</strong>. We need to reach an agreement by the end of next year and the Irish Presidency will play a crucial role in making it happen.",
    "published": null
  },
  {
    "title": "Martin ‘confident’ in his leadership as Fianna Fail TDs receive election report - Kildare Live",
    "url": "https://www.leinsterleader.ie/news/national-news/1968529/martin-confident-in-his-leadership-as-fianna-fail-tds-receive-election-report.html",
    "snippet": "16 Dec 2025 10:01 AM · Taoiseach Micheal Martin has said <strong>his leadership of Fianna Fail is not in trouble</strong> as his parliamentary party is set to review a long-awaited report into its selection process for the presidential candidate.",
    "published": "2 hours ago"
  },
  {
    "title": "Martin 'absolutely' confident he will remain FF leader",
    "url": "https://www.rte.ie/news/politics/2025/1216/1549211-fianna-fail-review/",
    "snippet": "<strong>Taoiseach Micheál Martin has said he has absolute confidence in remaining as Fianna Fáil leader</strong> after receiving the review of his party&#x27;s presidential election campaign.",
    "published": "2 hours ago"
  }
]