[
  {
    "title": "Stade Raymond Kopa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stade_Raymond_Kopa",
    "snippet": "Stade Raymond Kopa is <strong>a football stadium in Angers, France</strong>. It is the home ground of Ligue 1 side Angers SCO and seats 19,800 people. The stadium is named after Raymond Kopa, who, after playing for Angers from 1949 to 1951, became one of the most prominent players of his era.",
    "published": "May 26, 2025"
  },
  {
    "title": "Stade - Angers SCO",
    "url": "https://angers-sco.fr/club/stade/",
    "snippet": "Le maire d’Angers, Christophe Béchu, annonce sa volonté de renommer le stade. C’est le 27 mars 2017 que la Ville adopte officiellement le nouveau nom de son enceinte. Elle s’appellera désormais le Stade Raymond Kopa !",
    "published": "September 15, 2025"
  },
  {
    "title": "Stade Raymond Kopa (Stade Jean Bouin) - Angers - The Stadium Guide",
    "url": "https://www.stadiumguide.com/stade-jean-bouin/",
    "snippet": "Club: Angers SCO | Opening: 1912 | Capacity: 16,500 seats | Description: Stade Raymond Kopa, previously called Stade Jean Bouin, <strong>opened in 1912</strong>. The stadium was initially called Stade Bessonneau and had an athletics track, which got removed ...",
    "published": "July 30, 2017"
  },
  {
    "title": "Stade Raymond-Kopa - Stade, bd Pierre de Coubertin, 49000 Angers (France) - Adresse, Horaire",
    "url": "https://fr.mappy.com/poi/50aef00284aef458ea754f06",
    "snippet": "Découvrez Stade Raymond-Kopa (<strong>bd Pierre de Coubertin, 49000 Angers</strong>) avec toutes les photos du quartier, le plan d&#x27;accès, les avis et les infos pratiques : horaires, ...",
    "published": null
  },
  {
    "title": "Notre avis sur le stade Raymond-Kopa, à Angers : en quête d'âme",
    "url": "https://www.lequipe.fr/Football/Actualites/Notre-avis-sur-le-stade-raymond-kopa-a-angers-en-quete-d-ame/1561173",
    "snippet": "<strong>Situé au sud-ouest du centre-ville d&#x27;Angers, dans le quartier Saint-Léonard, le stade Raymond-Kopa jouxte la célèbre piscine Jean-Bouin</strong>. L&#x27;enceinte s&#x27;appelait d&#x27;ailleurs également Jean-Bouin de 1968 à 2017, date à laquelle la ville a ...",
    "published": "May 14, 2025"
  }
]