[
  {
    "title": "Waldstadion (Frankfurt) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Waldstadion_(Frankfurt)",
    "snippet": "Waldstadion (German pronunciation: [ˈvalt.ʃtaːdi̯ɔn] ⓘ, Forest Stadium), currently known as <strong>Deutsche Bank Park</strong> for sponsorship purposes, is a retractable roof sports stadium in Frankfurt, Germany. The home stadium of the football club Eintracht Frankfurt, it was opened in 1925.",
    "published": "3 weeks ago"
  },
  {
    "title": "Eintracht Frankfurt - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eintracht_Frankfurt",
    "snippet": "Though the media usually refer to the ground by the official name, <strong>Deutsche Bank Park</strong>, Eintracht fans faithful typically use the original name, Waldstadion. Eintracht Frankfurt U21 is the reserve team of Eintracht Frankfurt. The team played as U23 (Under 23) to emphasize the character of the ...",
    "published": "3 days ago"
  },
  {
    "title": "Eintracht Frankfurt (women) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eintracht_Frankfurt_(women)",
    "snippet": "In addition to the first team, the department would include up to five women&#x27;s teams competing at various levels of women&#x27;s football. Eintracht plays their homegames in the <strong>Stadion am Brentanobad</strong>, a stadium in the Rödelheim district of Frankfurt they share with the men&#x27;s team of Rot-Weiss ...",
    "published": "5 days ago"
  },
  {
    "title": "PSD Bank Arena - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/PSD_Bank_Arena",
    "snippet": "The <strong>PSD Bank Arena</strong> (formerly known as Stadion am Bornheimer Hang) is a multi-use stadium in Bornheim, a district of Frankfurt am Main, Germany, and is best accessed by the Johanna-Tesch-Platz U-Bahn station (which is located on territory of ...",
    "published": "July 19, 2025"
  },
  {
    "title": "Stadion am Brentanobad, Frankfurt am Main | cityseeker",
    "url": "https://cityseeker.com/frankfurt-am-main/864950-stadion-am-brentanobad",
    "snippet": "The <strong>Stadion am Brentanobad</strong> lies in Frankfurt, Germany. This is a multi-use stadium which is used for many sports activities. Currently, it is the home ground of the FFC Frankfurt which is the German women&#x27;s association football club and Rot-Weiss ...",
    "published": null
  }
]