[
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Since independence was proclaimed on 1 January 1956, six individuals (and three multi-member sovereignty councils) have served as head of state of Sudan, currently under the title President of the Republic of Sudan. Prior to independence, Sudan was governed as a condominium by Egypt and the ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "On 16 January 2025, the U.S. Treasury Department imposed sanctions on <strong>al-Burhan</strong>. According to sources the reasons were: &quot;targeting of civilians and civilian infrastructure and denial of aid access, as well as refusal to participate in peace talks&quot;. In addition, he was accused of &quot;destabilizing ...",
    "published": "3 weeks ago"
  },
  {
    "title": "New York 23/09/2022 - H.E. Lt. Gen. Abdel Fattah Al-Burhan President of the Transitional Sovereign Council, Sudan | African Union",
    "url": "https://au.int/en/images/20220923/he-lt-gen-abdel-fattah-al-burhan-president-transitional-sudan",
    "snippet": "H.E. Lt. Gen. <strong>Abdel Fattah Al-Burhan</strong> President of the Transitional Sudan ... Discours de S.E. Mahmoud Ali Youssouf, Président de la Commission de l&#x27;Union africaine, à la conférence des Ministres africains de l&#x27;économie, de la planification et du développement économique March 17, 2025",
    "published": null
  },
  {
    "title": "Kamil Idris government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kamil_Idris_government",
    "snippet": "The Kamil Idris government is the internationally recognised cabinet of the Republic of Sudan formed when Kamil Idris was appointed as prime minister of Sudan by the president of the Transitional Sovereignty Council, <strong>Abdel Fattah al-Burhan</strong> on 31 ...",
    "published": "1 month ago"
  },
  {
    "title": "The next item on Donald Trump’s foreign policy agenda: Sudan - POLITICO",
    "url": "https://www.politico.com/news/2025/11/19/donald-trumps-foreign-policy-sudan-00660241",
    "snippet": "President <strong>Donald Trump</strong> and Crown ... at the Kennedy Center on November 19, 2025 in Washington, DC. | Win McNamee/Getty Images ... President <strong>Donald Trump</strong> on Wednesday signaled his intent to focus on an ongoing humanitarian crisis in Sudan, a ...",
    "published": "1 month ago"
  }
]