[
  {
    "title": "Steve Kerr - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Steve_Kerr",
    "snippet": "Kerr is the first head coach in NBA history to lead his team to 67 or more wins in three consecutive seasons. He was named one of the Top 15 Coaches in NBA History in 2022, when the league commemorated its 75th anniversary. In March 2025, Kerr overtook <strong>Al Attles</strong> as the Warriors coach with the ...",
    "published": "1 week ago"
  },
  {
    "title": "Steve Kerr Bio | The Official Website of The NBA Coaches Association",
    "url": "https://nbacoaches.com/steve-kerr/",
    "snippet": "<strong>STEVE KERR</strong> GOLDEN STATE WARRIORS HEAD COACH Steve Kerr is the Head Coach of the Golden State Warriors. On May 19, 2014, Kerr became the 25th Head Coach* in Warriors history.Steve Kerr was born on September 27, 1965, in Beirut, Lebanon.",
    "published": "October 17, 2025"
  },
  {
    "title": "Steve Kerr - Head Coach of the Golden State Warriors and NBA Champion",
    "url": "https://www.cacegypt.org/index.php/steve-kerr",
    "snippet": "<strong>Stephen Douglas Kerr</strong> (born September 27, 1965) is an American professional basketball coach and former player who is the head coach for the Golden State Warriors of the National Basketball Association (NBA) and the U.S. national team.",
    "published": null
  },
  {
    "title": "Warriors Head Coaches | StatMuse",
    "url": "https://www.statmuse.com/nba/ask/warriors-head-coaches",
    "snippet": "<strong>Steve Kerr</strong> has coached the Warriors from 2014-15 to 2025-26.",
    "published": null
  },
  {
    "title": "Golden State Warriors Team Info and News | NBA.com",
    "url": "https://www.nba.com/team/1610612744/warriors",
    "snippet": "Though Golden State ran with the same starting five for the third game in a row, head coach <strong>Steve Kerr</strong> continued to tinker with the back end of his rotation. For the first time all season, Hield found himself as the odd man out, even on a night ...",
    "published": null
  }
]