[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "Jacques Brunel (born 14 January 1954) is a French rugby union coach and former player. He was most recently the French national team head coach, having previously been assistant coach for his nation and had led the Italian national team between <strong>2011 and 2016.</strong>",
    "published": "January 1, 2025"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Coaching his side to the quarterfinals of their home Rugby World Cup a year ago, there is a sense that there is more to come from France as this talented group of players continues to mature. This could no more be seen than when France beat New Zealand 30-29 to register their third-straight win over the All Blacks in enthralling fashion. ... France’s head coach Jacques Brunel (L) before the Japan 2019 Rugby World Cup quarter-final match against Wales.",
    "published": "May 30, 2025"
  },
  {
    "title": "Jacques Brunel | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/12984",
    "snippet": "After Guy Noves sacking December 2017 Brunel was named as the France national coach. In round 4 of the 2018 Six Nations under Brunel, France defeated England for the first time since 2015, running out 22–16 victors, and had it not been because of a defeat to Wales (14–13) in the final round, France could have finished second. Brunel lead France to the Rugby World Cup in Japan where they reached the quarter-finals before being knocked out by Wales.",
    "published": null
  },
  {
    "title": "Fabien Galthie to replace Jacques Brunel as France’s rugby coach",
    "url": "https://www.france24.com/en/20190428-france-rugby-fabien-galthie-jacques-brunel-coach-world-cup",
    "snippet": "France is alone among Europe&#x27;s leading rugby union nations in never having employed a foreign head coach. <strong>The 65-year-old Brunel has experienced a difficult tenure since replacing the sacked Guy Noves in 2017,</strong> winning only five games in 16 fixtures.",
    "published": "April 28, 2019"
  },
  {
    "title": "Rugby Database Coach: Jacques Brunelcoached France games",
    "url": "https://www.rugbydatabase.co.nz/team/coach.php?teamId=45&coachId=179",
    "snippet": "Rugby Database coaching statistics for Jacques Brunel while coaching France including a full list of games",
    "published": null
  }
]