[
  {
    "title": "Mariano Rajoy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mariano_Rajoy",
    "snippet": "The government was accused of attempting to blame ETA for the attacks in order to stay on track to win the elections (as they were favored to do), but then the Prisa center-left media company broke news that Al‑Qaida, rather than ETA, was responsible. On <strong>14 March 2004</strong> the PSOE, under the ...",
    "published": "March 8, 2004"
  },
  {
    "title": "José Luis Rodríguez Zapatero - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/José_Luis_Rodríguez_Zapatero",
    "snippet": "The attacks might have changed the result but not the winner. The Socialist Party was going to win but with fewer votes. (Despite this claim, <strong>most polls before the attacks gave a victory to Mariano Rajoy</strong>.)",
    "published": "November 12, 2025"
  },
  {
    "title": "Mariano Rajoy | Historica Wiki | Fandom",
    "url": "https://historica.fandom.com/wiki/Mariano_Rajoy",
    "snippet": "Mariano Rajoy (born 27 March 1955) was <strong>Prime Minister of Spain from 20 December 2011 to 1 June 2018,</strong> succeeding Jose Luis Rodriguez Zapatero and preceding Pedro Sanchez. Leader of the People&#x27;s Party of Spain from 2004, he was forced to resign ...",
    "published": "October 29, 2024"
  },
  {
    "title": "José Luis Rodríguez Zapatero | Spanish PM, Socialist Leader | Britannica",
    "url": "https://www.britannica.com/biography/Jose-Luis-Rodriguez-Zapatero",
    "snippet": "In the general election on November ... administration until the formation of a government by PP leader Mariano Rajoy in <strong>December 2011.</strong>...",
    "published": "January 19, 2006"
  },
  {
    "title": "Mariano Rajoy | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mariano-Rajoy",
    "snippet": "From 1996 Rajoy served in the PP government of Prime Minister José María Aznar, holding, successively, the posts of minister of public administration, minister of education and culture, and minister of the interior, and in 2003 Aznar handpicked Rajoy as the party’s new leader.",
    "published": "December 6, 2011"
  }
]