[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: one to do business in the United States and legally named Regency Entertainment (USA), Inc., one to do business overseas and legally named Monarchy Enterprises S.á.r.l.",
    "published": "4 days ago"
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Its films were distributed by Warner Bros. until 1998, and by <strong>20th Century Fox (later under their current parent company The Walt Disney Studios</strong>) from 1999 onward (with some released by Columbia Pictures, Paramount Pictures, Focus Features, ...",
    "published": "3 weeks ago"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "<strong>Yariv Milchan</strong> (PRODUCER) is the Chairman and CEO of the Academy Award®-winning New Regency Productions where he oversees the day-to-day management, creative direction, and overall growth strategy of the company.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q466459",
    "snippet": "<strong>Monarchy Enterprises S.á.r.l.</strong>",
    "published": null
  },
  {
    "title": "Regency Enterprises | Corus Entertainment Fandom | Fandom",
    "url": "https://corusentertainment.fandom.com/wiki/Regency_Enterprises",
    "snippet": "New Regency Productions (<strong>80%)</strong> Regency Television Regency Enterprises (commonly referred to as Regency onscreen and credited as Monarchy Enterprises S.á.r.l.) is an American entertainment company formed by Arnon Milchan.",
    "published": "October 29, 2024"
  }
]