[
  {
    "title": "Indonesia president expects flood-stricken Sumatra to return to normal in 2-3 months as death toll exceeds 1,000 | Reuters",
    "url": "https://www.reuters.com/business/environment/indonesia-president-expects-flood-stricken-sumatra-return-normal-2-3-months-2025-12-15/",
    "snippet": "REUTERS/Willy Kurniawan/File Photo ... Prabowo Subianto said on Monday that <strong>activities in areas on Sumatra that were hit by deadly floods may return to normal in the next two to three months</strong>, after a disaster that claimed more than ...",
    "published": "1 day ago"
  },
  {
    "title": "Joint Statement on the Visit of H.E. Prabowo Subianto, President of the Republic of Indonesia, to Pakistan (8-9 December 2025)",
    "url": "https://mofa.gov.pk/press-releases/visit-of-he-prabowo-subianto-president-of-the-republic-of-indonesia-to-pakistan-8-9-december-2025-joint-statement",
    "snippet": "Prabowo Subianto, President of the Republic of Indonesia, <strong>paid an official visit to Pakistan on 8-9 December 2025</strong>. During the visit, President Prabowo Subianto held delegation level talks with Prime Minister Shehbaz Sharif and met with H.E.",
    "published": null
  },
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "In pursuit of those ends his government has launched large-scale populist spending programmes (such as the free nutritious meals scheme and rice-aid and electricity-discount policies) while simultaneously ordering a budget-efficiency sweep: a January 2025 presidential instruction cut Rp 306.6 trillion of spending to redirect funds into social programmes. To complement this, his government has shifted the revenue-mobilisation paradigm: the 2026 draft budget sets a growth target of 5.4 % (with a long-term aspiration of 8 %) and projects a deficit cap of ~2.5 % of GDP, emphasising better tax-to-GDP ratio rather than raw debt expansion. Prabowo Subianto’s decision to appoint Purbaya Yudhi Sadewa as Minister of Finance on 8 September 2025 signaled a change in economic policymaking, a departure from the fiscal-orthodoxy of his predecessor Sri Mulyani Indrawati.",
    "published": "2 days ago"
  },
  {
    "title": "Prabowo invites PM Shehbaz Sharif to boost Indonesia-Pakistan ties - ANTARA News",
    "url": "https://en.antaranews.com/news/395860/prabowo-invites-pm-shehbaz-sharif-to-boost-indonesia-pakistan-ties",
    "snippet": "Jakarta (ANTARA) - <strong>President Prabowo Subianto officially invited Pakistani Prime Minister Shehbaz Sharif to visit Indonesia</strong>, reciprocating his visit to Islamabad on December 8–9, 2025.",
    "published": "1 week ago"
  },
  {
    "title": "Putin meets Indonesia's Prabowo to discuss military and energy ties, wheat exports | Reuters",
    "url": "https://www.reuters.com/world/asia-pacific/putin-meets-indonesias-prabowo-discuss-military-energy-ties-wheat-exports-2025-12-10/",
    "snippet": "Russian President Vladimir Putin told Indonesian President Prabowo Subianto on Wednesday that <strong>Moscow was pleased with the developing military ties between the two countries and ready to help Jakarta in the field of nuclear energy</strong>.",
    "published": "1 week ago"
  }
]