[
  {
    "title": "Readout of the Secretary-General’s meeting with H.R.H. Prince Mohammed bin Salman bin Abdulaziz Al Saud, Crown Prince and Prime Minister of the Kingdom of Saudi Arabia | Secretary-General | United Nations",
    "url": "https://www.un.org/sg/en/content/sg/readouts/2025-12-10/readout-of-the-secretary-generals-meeting-hrh-prince-mohammed-bin-salman-bin-abdulaziz-al-saud-crown-prince-and-prime-minister-of-the-kingdom-of-saudi-arabia",
    "snippet": "The Secretary-General met with H.R.H. Prince Mohammed bin Salman bin Abdulaziz Al Saud, Crown Prince and Prime Minister of the Kingdom of Saudi Arabia.The Secretary-General commended the long-standing UN-Saudi partnership and support to multilateralism. The Secretary-General and the Crown Prince also exchanged views on a range of regional developments and an analysis of the",
    "published": "6 days ago"
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Saudi Crown Prince Mohammed bin Salman hosted Ukrainian President Volodymyr Zelenskyy in Riyadh on 10 March 2025, ahead of U.S.-Ukraine talks.",
    "published": "2 weeks ago"
  },
  {
    "title": "Crown Prince and Prime Minister of Saudi Arabia Mohammed bin Salman Meets with Wang Yi_Ministry of Foreign Affairs of the People's Republic of China",
    "url": "https://www.fmprc.gov.cn/mfa_eng/wjbzhd/202512/t20251216_11773559.html",
    "snippet": "On December 14, 2025 local time, Crown Prince and Prime Minister of Saudi Arabia Mohammed bin Salman <strong>met with Member of the Political Bureau of the CPC Central Committee and Foreign Minister Wang Yi in Riyadh</strong>.",
    "published": "1 day ago"
  },
  {
    "title": "How rich is Saudi Arabia’s King Salman bin Abdulaziz Al Saud? Net worth in 2025 | World News - The Times of India",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/how-rich-is-saudi-arabias-king-salman-bin-abdulaziz-al-saud-net-worth-in-2025/articleshow/125961000.cms",
    "snippet": "Fahda bint Falah Al Hithlain – ... arm, gallbladder surgery in 2020, and reported mild dementia, yet he <strong>continues to perform ceremonial duties as king</strong>.King Salman’s legacy is defined by modernizing Riyadh, steering the kingdom ...",
    "published": "7 hours ago"
  },
  {
    "title": "Jets, chips and a clean slate: Saudi Arabia’s crown prince got almost everything wanted from Trump | CNN",
    "url": "https://www.cnn.com/2025/11/20/middleeast/jets-chips-clean-slate-mbs-trump-saudi-intl",
    "snippet": "President Donald Trump, right, responding to a question during Tuesday’s Oval Office bilateral meeting, where Crown Prince Mohammed bin Salman, left, was asked about the slaying of Saudi journalist Jamal Khashoggi.",
    "published": "1 month ago"
  }
]