[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "This includes Disney&#x27;s handling of global theatrical distribution, home entertainment, and first pay rights for New Regency. New Regency&#x27;s sales team, led by <strong>Charlotte Thorp</strong> and primarily based out of London, United Kingdom will handle all other television and SVOD rights after the first pay ...",
    "published": "2 days ago"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "<strong>Yariv Milchan</strong> (PRODUCER) is the Chairman and CEO of the Academy Award®-winning New Regency Productions where he oversees the day-to-day management, creative direction, and overall growth strategy of the company.",
    "published": null
  },
  {
    "title": "Regency Enterprises Services - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/regency-enterprises-services",
    "snippet": "Regency&#x27;s five areas of service are <strong>project management, facilities management, event management, environmental consulting, and business consulting</strong>. ... St Louis, Missouri, United States.",
    "published": null
  },
  {
    "title": "Board of Directors | Regency Centers Corporation",
    "url": "https://investors.regencycenters.com/corporate-governance/board-of-directors",
    "snippet": "Blair currently serves as the Principal of Harborview Associates, LLC, a company which holds and manages investments in various real estate properties. He serves as a director of PulteGroup, Inc., one of the largest home builders in the U.S., in which he served as Chairman from 2017 until December 31, 2022.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between Arnon Milchan, Scriba &amp; Deyle and Canal+ to finance 20 films in five years, with New Regency Productions acting as its production and sales arm. The company was originally known as Embassy International Pictures from 1982 until 1991.",
    "published": "2 weeks ago"
  }
]