[
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "The president is elected by the Hellenic Parliament; the role has been mainly ceremonial since the 1986 constitutional reform. The office was formally established by the Constitution of Greece in 1975, but has antecedents in the Second Hellenic Republic of 1924–1935 and the Greek junta in 1973–1974 which predated the transition to the current Third Hellenic Republic.",
    "published": "2 weeks ago"
  },
  {
    "title": "Konstantinos Tasoulas - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Konstantinos_Tasoulas",
    "snippet": "He previously served as President of the Hellenic Parliament from 2019 to 2025. A member of the New Democracy party, he was previously an MP for Ioannina from 2000 to 2025. He also briefly served as the Minister of Culture and Sports from 2014 to 2015 during the Antonis Samaras government. Tasoulas was born in Ioannina, Greece on 17 July 1959.",
    "published": "1 month ago"
  },
  {
    "title": "Katerina Sakellaropoulou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Katerina_Sakellaropoulou",
    "snippet": "Katerina N. Sakellaropoulou (Greek: Κατερίνα Ν. Σακελλαροπούλου [kateˈrina sacelaroˈpulu]; born 30 May 1956) is a Greek retired judge who served as the president of Greece from 2020 to 2025. She was elected by the Hellenic Parliament to succeed <strong>Prokopis Pavlopoulos</strong> on 22 ...",
    "published": "October 2, 2025"
  },
  {
    "title": "Former Presidents - Aρχική",
    "url": "https://www.presidency.gr/en/president/former-presidents/",
    "snippet": "FORMER PRESIDENTS of the Hellenic Republic since 1974 FORMER PRESIDENTS <strong>Katerina Sakellaropoulou</strong> (2020-2025) Biography Katerina N. Sakellaropoulou was born in Thessaloniki in 1956.",
    "published": "March 24, 2025"
  },
  {
    "title": "2025 Greek presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Greek_presidential_election",
    "snippet": "The fourth round was held on 12 February 2025, where <strong>Konstantinos Tasoulas</strong> was elected as President of Greece. According to Article 32 of the Constitution of Greece, the president is elected for a five-year term by the Hellenic Parliament in ...",
    "published": "September 8, 2025"
  }
]