[
  {
    "title": "Mauricio Pochettino to become Chelsea head coach | News | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/news/article/mauricio-pochettino-to-become-chelsea-head-coach",
    "snippet": "Chelsea Football Club is pleased to confirm Mauricio Pochettino will become head coach of the men’s team from the beginning of the <strong>2023/24 season</strong>.",
    "published": null
  },
  {
    "title": "Chelsea FC can confirm that the Club and Mauricio Pochettino have mutually agreed to part ways.",
    "url": "https://www.chelseafc.com/en/news/article/club-statement-mauricio-pochettino",
    "snippet": "Sporting Directors Laurence Stewart and Paul Winstanley said: &#x27;On behalf of everyone at Chelsea, we would like to express our gratitude to Mauricio for his service this season. He will be welcome back to Stamford Bridge any time and we wish him all the very best in his future coaching career.&#x27; Mauricio Pochettino said: &#x27;Thank you to the Chelsea ownership group and Sporting Directors for the opportunity to be part of this football club&#x27;s history.",
    "published": null
  },
  {
    "title": "Why Pochettino left Chelsea, and what it reveals about the club - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/40193855/why-chelsea-mauricio-pochettino-split-reveals-club",
    "snippet": "Nothing sums up the frenzied thinking at Chelsea quite like a signing they didn&#x27;t initially want to make being named their Player of the Year. Cole Palmer&#x27;s remarkable rise at Stamford Bridge was one of the few highlights that Mauricio Pochettino can look back on with pride as the manager contemplates his next step in football following Tuesday&#x27;s departure from the Blues by mutual consent.",
    "published": "May 22, 2024"
  },
  {
    "title": "Pochettino leaves Chelsea by mutual consent",
    "url": "https://www.premierleague.com/en/news/4025501",
    "snippet": "The statement added: &quot;Chelsea will be making no further comment until such time as a new Head Coach is appointed.&quot; Pochettino had been appointed last summer, starting his role on <strong>1 July 2023</strong>.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino leaves Chelsea after one season - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/c1ww8xw8nywo",
    "snippet": "... Pochettino, whose tenure ended just short of <strong>12 months</strong>, is understood to have departed on very amicable terms; he felt leaving was the right decision following discussions with senior club officials.",
    "published": "May 21, 2024"
  }
]