[
  {
    "title": "Al Shabab Club - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al_Shabab_Club",
    "snippet": "In 1960 in the first official tournament called King Saud Cup for the Central Province, Al Shabab faced Al Hilal in their first official games between the two, and won 3–0 to win their first cup. In the 1960s, everyone wanted to play and be part of the club, and after the request of Al Najmah FC and Al Marekh in 1967, they were united as one club and changed their name from Shabab Riyadh, to simply Al Shabab.",
    "published": "2 days ago"
  },
  {
    "title": "Al Shabab FC football club - Soccer Wiki: for the fans, by the fans",
    "url": "https://en.soccerwiki.org/squad.php?clubid=626",
    "snippet": "Medium Name: Al Shabab · Short Name: SHA · Year Founded: 1947 · Stadium: King Fahd International (67,000) League: Saudi Pro League · Location: Riyadh · Country: Saudi Arabia · Manager · <strong>Imanol Alguacil</strong> · Age: 54 · None · Team Formation ...",
    "published": null
  },
  {
    "title": "Shabab Al Ahli Club - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Shabab_Al_Ahli_Club",
    "snippet": "Al Ahli Club was established in 1970 when two local football teams Al Wehdah and Al Shabab (est. 1958) joined for a training camp in Egypt but decided to merge as one single club under first club president H.E. <strong>Nasser Abdulla Hussain Lootah</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Al-Shabab FC - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/Al-Shabab_FC",
    "snippet": "Al-Shabab Football Club (Arabic: نادي الشباب) is a Saudi Arabian football club from Riyadh which plays in the Saudi Professional League.",
    "published": "February 28, 2025"
  },
  {
    "title": "Al-Shabab FC - Club profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/al-shabab-riad/startseite/verein/9840",
    "snippet": "Al-Shabab Saudi Sport Club, Cultural and Social Club or Al-Shabab Club “for short” is a Saudi club based in the city of Riyadh, and it is considered the oldest club in the capital, Riyadh.",
    "published": null
  }
]