[
  {
    "title": "Kevin Volland kehrt zum TSV 1860 München zurück | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/de/meldungen/wo-alles-begann-kevin-volland-kehrt-zum-tsv-1860-muenchen-zurueck--lPiUbM",
    "snippet": "Der 1. FC Union Berlin und Kevin Volland haben sich darauf verständigt, ihre gemeinsame Zeit im Sommer zu beenden. <strong>Der 32-jährige Offensivallrounder wird künftig wieder für seinen Jugendverein, den TSV 1860 München, auflaufen</strong>.",
    "published": null
  },
  {
    "title": "Union Berlin: Kevin Volland kehrt zu 1860 München zurück | Transfermarkt",
    "url": "https://www.transfermarkt.de/volland-wechselt-von-union-zu-1860-munchen-meinem-herzensverein-noch-einmal-alles-geben-quot-/view/news/452853",
    "snippet": "Christian Werner sagte: „<strong>Dass sich ein Stürmer wie Kevin Volland dazu entschlossen hat, noch einmal zu seiner ersten Profistation zurückzukehren, ist großartig für den TSV 1860 München</strong>.",
    "published": "April 21, 2025"
  },
  {
    "title": "Kevin Volland to Return to TSV 1860 München | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/kevin-volland-to-return-to-tsv-1860-muenchen--lPiUbM",
    "snippet": "This season – his second - however, has been marred by injuries for the striker. He has made only four appearances so far, and <strong>the former German international will return to Munich in the summer</strong> – to the club where it all began for him.",
    "published": null
  },
  {
    "title": "Official | Kevin Volland to return to 1860 Munich in the summer - Get German Football News",
    "url": "https://www.getfootballnewsgermany.com/2025/official-kevin-volland-to-return-to-1860-munich-in-the-summer/",
    "snippet": "1860 Munich have announced that former striker <strong>Kevin Volland will return to the club in the summer, leaving Union Berlin</strong>.",
    "published": "April 21, 2025"
  },
  {
    "title": "Kevin Volland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kevin_Volland",
    "snippet": "On 17 August 2023, Volland signed ... contract running until 2026, it was announced that <strong>Volland would leave Union Berlin in the summer to return to former club 1860 Munich</strong>....",
    "published": "2 weeks ago"
  }
]