[
  {
    "title": "[:ar]شركة الوحدة لكرة القدم[:en]Al Wahda Football Company[:] - AlWahda SC",
    "url": "https://alwahda-sc.com/en/fcc/",
    "snippet": "Al Wahda Football Company Under the directives of <strong>H.H. Sheikh Theyab bin Zayed Al Nahyan</strong>, Al Wahda Football Company was founded in 2013. The Football Company aims to improve the football sport and creating a team that competes on all levels ...",
    "published": "January 31, 2024"
  },
  {
    "title": "Al Wehda FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al_Wehda_FC",
    "snippet": "Al-Wehda FC (Arabic: نادي الوحدة لكرة القدم, romanized: Nādī al-Waḥdah li-kurat al-qadam, lit. &#x27;Unity Football Club&#x27;) is a multi-sports club based in Mecca, Saudi Arabia. Al-Wehda is the 5th oldest club in Saudi Arabia, founded in 1945, but if the club&#x27;s establishment ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Al Wahda FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al_Wahda_FC",
    "snippet": "In 1974, a decision was made by the Minister of youth and sport to create Abu Dhabi SC by merging Al-Ittihad and Al-Wahda on 13 March 1974, and to create Al-Emirates SC by merging Al-Ahli and Al-Falah on 3 June 1974. In 1984, Abu Dhabi SC and Al-Emirates SC merged to create Al-Wahda FC.",
    "published": "1 week ago"
  },
  {
    "title": "Al Wahda - Clubs - UAE Pro League Committee",
    "url": "http://live.proleague.ae/en/club/al-wahda.html",
    "snippet": "<strong>Ahmed Bo Hussein</strong>, the two clubs of Emirates and Abu Dhabi were merged under the name of Al Wahda Sports and Cultural Club, and its headquarter was based at the same previous headquarter of the Emirates Club, and it is the current headquarter of Al Wahda Club in the middle of the capital city ...",
    "published": null
  },
  {
    "title": "Al Wehda FC football club - Soccer Wiki: for the fans, by the fans",
    "url": "https://en.soccerwiki.org/squad.php?clubid=1472",
    "snippet": "Medium Name: Al Wehda · Short Name: WEH · Year Founded: 1945 · Stadium: King Abdul Aziz (38,000) League: Saudi First Division League · Location: Mecca · Country: Saudi Arabia · Manager · <strong>Daniel Carreño</strong> · Age: 62 · None · Team Formation ...",
    "published": null
  }
]