[
  {
    "title": "Real Madrid sack Julen Lopetegui as manager - BBC Sport",
    "url": "https://www.bbc.com/sport/football/45935137",
    "snippet": "Real, Champions League winners for the past three years, are ninth in La Liga after their worst start since 2001-02. The 52-year-old will be &quot;provisionally replaced&quot; by ex-player <strong>Santiago Solari</strong>, coach of B team Castilla.",
    "published": "October 29, 2018"
  },
  {
    "title": "Julen Lopetegui - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Julen_Lopetegui",
    "snippet": "On 12 June 2018, with the team already in Russia for the tournament, it was announced that Lopetegui would take over as the head coach of Real Madrid on a three-year contract after the conclusion of Spain&#x27;s involvement at the World Cup.",
    "published": "2 weeks ago"
  },
  {
    "title": "Real Madrid sack head coach Julen Lopetegui after Barcelona thrashing | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11835/11533481/real-madrid-sack-head-coach-julen-lopetegui-after-barcelona-thrashing",
    "snippet": "Image: <strong>Santiago Solari</strong> will step up from Real Madrid&#x27;s B-team &#x27;Castilla&#x27; to replace Lopetegui · Lopetegui, 52, has now lost two jobs in the space of less than five months. He was fired as coach of the Spain national team the day before the ...",
    "published": "October 30, 2018"
  },
  {
    "title": "Real Madrid, a luxury temporary worker to replace Ancelotti",
    "url": "https://frenchfootballweekly.com/2025/05/01/real-madrid-a-luxury-temporary-worker-to-replace-ancelotti/",
    "snippet": "According to the media, in recent days and weeks, <strong>Xabi Alonso</strong> will successfully succeeded Carlo Ancelotti as Real Madrid&#x27;s main coach, but only after the FIFA club World Cup, which will start in June and will be held in the United States this summer.",
    "published": "May 1, 2025"
  },
  {
    "title": "Who is new Real Madrid coach Julen Lopetegui? | UEFA Champions League 2018/19 | UEFA.com",
    "url": "https://www.uefa.com/uefachampionsleague/news/0246-0e9cd9e800c0-1df2bfca5453-1000--who-is-new-real-madrid-coach-julen-lopetegui/",
    "snippet": "On Tuesday, Real Madrid announced that Julen Lopetegui would replace <strong>Zinédine Zidane</strong> as their coach, having signed a three-year contract at the Bernabéu. On Wednesday morning, the 51-year-old was dismissed as Spain boss on the eve of their ...",
    "published": "June 14, 2018"
  }
]