[
  {
    "title": "USNC/IAU Committee | American Astronomical Society",
    "url": "https://aas.org/comms/usnc-iau-committee",
    "snippet": "Chair: <strong>Martha P. Haynes</strong> ... Secretary: Alice K. B. Monet · NASEM Staff Officer: Ana Ferreras, Category V (Ex officio, non-voting) Charge: Effects appropriate participation by the United States in International Astronomical Union through the National Academy of Sciences-National Research Council.",
    "published": null
  },
  {
    "title": "International Astronomical Union",
    "url": "https://www.iau.org/",
    "snippet": "Don&#x27;t miss the dedicated panel discussion &quot;Science in Action: Grassroots Pathways to Development&quot; on 10 November! Read more ... <strong>Anne Thieme</strong> joins the IAU Secretariat as Membership Coordinator in November 2025. Read more · Become a part of the largest international union of professional ...",
    "published": null
  },
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "It sponsors nine annual symposia and holds a triannual General Assembly that sets policy and includes various scientific meetings. The Union is best known for being the leading authority in assigning official names and designations to astronomical objects, and for setting uniform definitions for astronomical principles.",
    "published": "3 weeks ago"
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://www.iau.org/administration/executive_bodies/past_committees/executive_committee/",
    "snippet": "Debra Meloy Elmegreen · Piero Benvenuti (Interim General Secretary) <strong>José Miguel Rodriguez Espinosa</strong>",
    "published": null
  },
  {
    "title": "U.S. National Committee for the International Astronomical ...",
    "url": "https://www.nationalacademies.org/our-work/us-national-committee-for-the-international-astronomical-union-usnc-iau",
    "snippet": "This site requires JavaScript to be enabled",
    "published": null
  }
]