[
  {
    "title": "Enzo Maresca - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Enzo_Maresca",
    "snippet": "<strong>Enzo Maresca</strong> (born 10 February 1980) is an Italian professional football manager and former player. He is the head coach of Premier League club Chelsea. After starting out at West Bromwich Albion in 1998, he went on to play for several clubs in his country, including Juventus, who loaned him ...",
    "published": "3 days ago"
  },
  {
    "title": "List of Chelsea F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Chelsea_F.C._managers",
    "snippet": "The first manager of Chelsea Football Club was <strong>John Robertson</strong>, appointed player-manager in 1905. The current head coach is Enzo Maresca. Chelsea have had 32 permanent managers/head coaches (of whom four also served as player-manager), six interim ...",
    "published": "3 days ago"
  },
  {
    "title": "Cardiff v Chelsea: Pep proteges Barry-Murphy and Maresca reunite - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/ceq1178gzwlo",
    "snippet": "Few coaches have influenced football as significantly as <strong>Pep Guardiola</strong>. From Mikel Arteta leading Arsenal to the top of the Premier League, to Vincent Kompany&#x27;s Bayern Munich dominating the Bundesliga, the Catalan counts some of the game&#x27;s finest ...",
    "published": "19 hours ago"
  },
  {
    "title": "Chelsea Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=536&teamTabs=managers",
    "snippet": "Chelsea Football Club Managers, full history, past and present. Provided courtesy of Soccerbase.com, the Football Betting Site.",
    "published": null
  },
  {
    "title": "Rating Chelsea’s six Italian coaches before Maresca - Football Italia - May 28 latest",
    "url": "https://football-italia.net/assessing-chelsea-six-italian-coaches-maresca/",
    "snippet": "Fresh off the back of a two-year spell as CT of the Italy national team, and three consecutive Serie A titles with Juventus before then, Conte took his first job outside the Peninsula with Chelsea in 2016. By December of his first year, Conte had equalled Arsenal’s Premier League record of 13 consecutive victories. The following month, he picked up his third Manager of the Month award in a row, becoming the first Premier League coach ever to win three on the trot.",
    "published": "May 28, 2024"
  }
]