[
  {
    "title": "Revolution of Dignity - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Revolution_of_Dignity",
    "snippet": "Russian propaganda and government describe the removal of Yanukovych as a coup (echoing Putin calling it an &quot;illegal coup&quot; and a &quot;military seizure of power&quot;) to legitimize their coming actions. Researchers consider the subsequent actions of Russia in Crimea to be a true military coup, because the Russian military seized Crimea&#x27;s parliament and government buildings and instigated the replacement of its government with Russian proxies. On 1 March, Russia&#x27;s parliament approved a request from Putin to deploy Russian troops to Ukraine. On 24 March Putin stated, referring to the 2014 Ukrainian presidential election, &quot;We will respect the choice of the Ukrainian people and will be working with the authorities formed on the basis of this election.&quot;",
    "published": "3 weeks ago"
  },
  {
    "title": "r/chomsky on Reddit: The US backed coup in Ukraine in 2014.",
    "url": "https://www.reddit.com/r/chomsky/comments/10vnxtd/the_us_backed_coup_in_ukraine_in_2014/",
    "snippet": "What &quot;fruitful discussion&quot; do you expect to now take place, now that you have declared that 2014&#x27;s transition was a coup? What has this declaration changed? ... Legit elected, overthrown by pro west Ukrainians. East Ukraine felt different a about it. Pretty straightforward stuff ... It&#x27;s supposed to imply that the US had a role in the transition of power in the coup, given that she talks about who she wants in government 2 weeks before the coup happened, and that&#x27;s who ended up there.",
    "published": "February 7, 2023"
  },
  {
    "title": "The 2014 coup in Ukraine - World Socialist Web Site",
    "url": "https://www.wsws.org/en/topics/event/2014-coup-ukraine",
    "snippet": "The coup was the temporary culmination of long-standing efforts by US imperialism to install a puppet regime on the borders of Russia and brought the world a major step closer to a war between the largest nuclear powers, the US and Russia. The regime change prompted the outbreak of an ongoing civil war in the east of Ukraine, between Russian-backed separatists and the US-backed Ukrainian army, that has claimed the lives of tens of thousands and displaced millions.",
    "published": null
  },
  {
    "title": "The Stubborn Legend of a Western 'Coup' in Ukraine",
    "url": "https://foreignpolicy.com/2024/08/04/ukraine-maidan-revolution-russia-coup-myth-yanukovych/",
    "snippet": "Even Russia joined the rest of the world in recognizing the new Ukrainian government a few months later. But the truth underlying the events of February 2014 is far more interesting: The preponderance of evidence suggests that it was Moscow itself that triggered Yanukovych’s departure in order to launch a pre-arranged Plan B—the invasion of Crimea and an engineered “uprising” in eastern Ukraine—after Moscow’s Plan A—a new treaty with a pliant government in Kyiv that placed it under Russia’s de facto control—was about to fail.",
    "published": "August 12, 2024"
  },
  {
    "title": "Ukrainian constitutional process in 2014",
    "url": "https://khpg.org/en/1433405872",
    "snippet": "The juridical means of constitutional transformation include primarily such documents as the Law of Ukraine “On revalidation of certain provisions of the Constitution of Ukraine” of February 21, 2014; Resolution of the Verkhovna Rada of Ukraine “On the text of the Constitution of Ukraine in redaction of June 28, 1996 with amendments and supplements introduced by the laws of Ukraine of 8 December 2004 No. 2222-IV, February 1, 2011 No. 2952- VI, September 19, 2013 No. 586-VII”; Resolution of the Verkhovna Rada of Ukraine “On the dissociation of the President of Ukraine from fulfillment",
    "published": null
  }
]