[
  {
    "title": "History of ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_ESPN",
    "snippet": "ESPN was founded by <strong>Bill Rasmussen, his son Scott Rasmussen, and 43 year old eye doctor and Aetna insurance agent Ed Eagan</strong>. Bill, who had an affinity with sports for much of his life, was fired from his position as the communications manager for the New England Whalers in 1978.",
    "published": "November 11, 2025"
  },
  {
    "title": "ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ESPN",
    "snippet": "ESPN (an initialism of their original ... of the Walt Disney Company (80% and operational control) and Hearst Communications (20%). It was founded on <strong>September 7, 1979</strong> by Bill Rasmussen, Scott Rasmussen and Ed Eagan....",
    "published": "4 days ago"
  },
  {
    "title": "ESPN Founder",
    "url": "https://www.espnfounder.com/",
    "snippet": "A life-long entrepreneur and sports fan, <strong>Bill Rasmussen</strong>’s innovations in advertising, sports and broadcasting are numerous, including the creation of ESPN, the world’s first 24-hour, 7-days-a-week sports television network; the network’s signature program SportsCenter; wall-to-wall coverage ...",
    "published": null
  },
  {
    "title": "Dah Nuh Nuh: The founding of ESPN, and its rise | The Spokesman-Review",
    "url": "https://www.spokesman.com/further-review/founding-of-espn/",
    "snippet": "But at 7 p.m. Eastern on <strong>Sept. 7, 1979</strong>, ESPN went on the air with its first broadcast — the first edition of what would be its daily sports news show, “SportsCenter.” Anchor Lee Leonard, who Rasmussen had hired from a New York TV station, ...",
    "published": "September 3, 2024"
  },
  {
    "title": "ESPN, Inc. | Sports Broadcasting, Media Company & Multimedia | Britannica",
    "url": "https://www.britannica.com/topic/ESPN-Inc",
    "snippet": "Its success engendered additional ESPN networks, including an international sports network. New England sports announcer <strong>William Rasmussen</strong> founded ESPN to broadcast New England Whalers hockey games and University of Connecticut sports events.",
    "published": "July 20, 1998"
  }
]