[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises, Inc. is a multinational entertainment company formed by <strong>Arnon Milchan</strong>. It was founded on July 12, 1991 as the successor to Regency International Pictures (formerly known as Embassy International Pictures N.V.). It has offices in West Hollywood, California, London, and ...",
    "published": "4 days ago"
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between <strong>Arnon Milchan, Scriba &amp; Deyle and Canal+</strong> to finance 20 films in five years, with New Regency Productions acting as its production and sales arm.",
    "published": "3 weeks ago"
  },
  {
    "title": "Regency Enterprises (Creator) - TV Tropes",
    "url": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/RegencyEnterprises",
    "snippet": "Regency Enterprises (commonly referred to as Regency onscreen) is an American entertainment company formed by <strong>Arnon Milchan</strong>. It was founded in 1991 as the successor to Regency International Pictures formerly known as Embassy International …",
    "published": "October 2, 2025"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "After the incredible successes of his films “Pretty Woman” and “The War of the Roses,” Milchan founded New Regency Productions and went on to produce countless critical and box office successes including “J.F.K,” “A Time to Kill,” “Free Willy,” “The Client,” “Tin Cup,” “Under Siege,” “The Devil’s Advocate,” “The Negotiator,” “City of Angels,” “Entrapment,” “Fight Club,” “Big Momma’s House,” “Don’t Say a Word,” “Daredevil,” “Man on Fire,” “Mr.",
    "published": null
  },
  {
    "title": "Regency Enterprises | Golden",
    "url": "https://golden.com/wiki/Regency_Enterprises-PPNRR5",
    "snippet": "Regency Enterprises is a privately held company involved in the video production industry and founded on January 1, 1982 by <strong>Arnon Milchan and Joseph Patrick Grace</strong>.",
    "published": null
  }
]