[
  {
    "title": "Governance | Université Paris-Saclay",
    "url": "https://www.universite-paris-saclay.fr/en/about/governance",
    "snippet": "The President and Vice-Presidents ... <strong>defines the policy set forth by Paris-Saclay University, elects its President and approves the strategic plan, as well as the organization and operation of Paris-Saclay University</strong>...",
    "published": "July 8, 2025"
  },
  {
    "title": "Governance | ENS-PARIS-SACLAY",
    "url": "https://ens-paris-saclay.fr/en/governance",
    "snippet": "<strong>The Board of Governors is the School&#x27;s governing body</strong>. Under the authority of the School&#x27;s president, it sets the School&#x27;s strategic directions and approves and allocates the budget. It comprises 31 members, including suitably qualified lay members, representatives of partner institutions and ...",
    "published": null
  },
  {
    "title": "SATT Paris-Saclay governance",
    "url": "https://satt-paris-saclay.fr/en/governance/",
    "snippet": "It is structured around <strong>3 decision-making bodies with well-defined roles</strong>. The Investment Committee which includes 15 industry, startup and venture capital experts recognized for their strong expertise and knowledge of the markets informs, for ...",
    "published": "March 12, 2020"
  },
  {
    "title": "Paris-Saclay University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris-Saclay_University",
    "snippet": "Paris-Saclay University formally replaced several pre-existing Parisian universities, grande écoles and research institutes. These continue to exist as departments within the broader structure of Paris-Saclay.",
    "published": "3 weeks ago"
  },
  {
    "title": "Université Paris-Saclay | socialprotection.org",
    "url": "https://socialprotection.org/connect/stakeholders/universit%C3%A9-paris-saclay",
    "snippet": "As of 1st January 2020, Paris-Saclay University replaces Paris-XI-SUD University and the community of universities and institutions &quot;Université Paris-Saclay&quot;, and integrates, as component-institutions which retain their legal personality, under the conditions specified in its statutes, the Paris Institute of Technology for Life, Food and Environmental Sciences (AgroParisTech), “CentraleSupélec”, the “Ecole normale supérieure Paris-Saclay” and the “Institut d&#x27;Optique Graduate School”. It also integrates the Institut des hautes études scientifiques, a recognised non-profit research organisation. It includes the Universities of Versailles-Saint-Quentin-en-Yvelines and Evry-Val-d&#x27;Essonne as member-associated universities by convention. These participate in its governance within the perspective of a merger.",
    "published": null
  }
]