[
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "On 2 July 2019, Christine Lagarde was nominated by the European Council to succeed Mario Draghi as President of the European Central Bank (ECB) on <strong>1 November 2019.</strong>",
    "published": "6 days ago"
  },
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "The president of the European Central ... (EU). The current president of the European Central Bank is Christine Lagarde, <strong>previously the chair and managing director of the International Monetary Fund</strong>....",
    "published": "September 25, 2025"
  },
  {
    "title": "Christine Lagarde",
    "url": "https://www.ecb.europa.eu/ecb/decisions/html/cvlagarde.en.html",
    "snippet": "President of the European Central Bank <strong>Chair of the European Systemic Risk Board</strong> Member of the Board of Directors at the Bank for International Settlements Member of the G7 Member of the G20",
    "published": "November 22, 2023"
  },
  {
    "title": "Christine Lagarde - President of the European Central Bank | LinkedIn",
    "url": "https://de.linkedin.com/in/christinelagarde",
    "snippet": "She resigned from the IMF on 12 September 2019 following her nomination as President of the European Central Bank. Christine Lagarde took up her role as ECB President on <strong>1 November 2019.</strong>",
    "published": "October 1, 2025"
  },
  {
    "title": "Christine Lagarde appointed President of the European Central Bank - Consilium",
    "url": "https://www.consilium.europa.eu/en/press/press-releases/2019/10/18/christine-lagarde-appointed-president-of-the-european-central-bank/",
    "snippet": "<strong>The European Council appointed Christine Lagarde to be the President of the European Central Bank for a non-renewable term of 8 years</strong>.",
    "published": null
  }
]