[
  {
    "title": "Slovenia's Finance Minister Klemen Boštjančič Assumes Chairmanship of EBRD Board - The Region",
    "url": "https://connectingregion.com/news/slovenias-finance-minister-klemen-bostjancic-assumes-chairmanship-of-ebrd-board/",
    "snippet": "<strong>Slovenia&#x27;s Finance Minister Klemen Boštjančič assumes the chairmanship of the European Bank for Reconstruction and Development (EBRD) Board</strong>, marking a significant milestone for the country",
    "published": "May 20, 2024"
  },
  {
    "title": "STA: Boštjančič elected chair of EBRD Board of Governors",
    "url": "https://english.sta.si/3301029/bostjancic-elected-chair-of-ebrd-board-of-governors",
    "snippet": "Yerevan, 16 May - <strong>Finance Minister Klemen Boštjančič was elected chair of the Board of Governors of the European Bank for Reconstruction and Development (EBRD) at its annual meeting on Thursday</strong>.",
    "published": null
  },
  {
    "title": "EBRD holds its 2025 Annual Meeting and Business Forum in London",
    "url": "https://www.ebrd.com/home/news-and-events/news/2025/ebrd-holds-its-2025-annual-meeting-and-business-forum-in-london.html",
    "snippet": "The Board of Governors’ opening session for the event will take place at Westminster Central Hall on Wednesday 14 May. The Chair of the Board of Governors, Slovenia’s Klemen Boštjančič, and EBRD President Odile Renaud-Basso will deliver speeches at the session.",
    "published": null
  },
  {
    "title": "EBRD Board of Directors visits Slovenia",
    "url": "https://www.ebrd.com/home/news-and-events/news/2023/ebrd-board-of-directors-visits-slovenia.html",
    "snippet": "The EBRD Board Directors is meeting with government representatives, including <strong>Minister of Finance</strong> Klemen Boštjančič, private-sector companies and members of the diplomatic community.",
    "published": null
  },
  {
    "title": "Minister Boštjančič bo predsedoval Svetu guvernerjev ...",
    "url": "https://www.gov.si/en/",
    "snippet": "The central website for easy access to comprehensive information on the organisation and functioning of the state administration · Birth, parenthood, foster care, guardianship, adoption, family rights and benefits, prevention of domestic violence, marriage and partnership",
    "published": null
  }
]