[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "On 29 April 1918, the Rada elected <strong>Mykhailo Hrushevsky</strong> as the first president of the Central Rada of the Ukrainian People&#x27;s Republic, in effect making him the de facto leader of the republic. Although a rather widespread misconception, the state leadership position title varied and none of ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Ukraine’s Presidents, Power Elites, and the Country’s Evolution | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/ukraines-presidents-power-elites-and-countrys-evolution",
    "snippet": "After three rounds of elections and two months of protests in Kyiv’s Maidan Nezalezhnosti (Independence Square), <strong>Viktor Yushchenko became president</strong>. Under his leadership, Ukraine rose in the measurements of democracy, but the president’s ...",
    "published": null
  },
  {
    "title": "List of heads of state of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_leaders_of_Ukraine",
    "snippet": "The Ukrainian People&#x27;s Republic was formed after the Russian Revolution of 1917, and lasted until the Peace of Riga between Poland and Soviet Russia in March 1921. The state leadership position title varied and, despite a rather widespread misconception, <strong>none of them had an official Presidential</strong> ...",
    "published": "October 7, 2025"
  },
  {
    "title": "Politics of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Ukraine",
    "snippet": "As part of the Soviet Union as the Ukrainian Soviet Socialist Republic until 1991, the political system featured a single-party socialist-republic framework characterized by the superior role of the Communist Party of Ukraine (CPU), the sole-governing party then permitted by the Ukrainian SSR&#x27;s constitution.",
    "published": "3 days ago"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "<strong>The current office was formed when the Verkhovna Rada of the Ukrainian Soviet Socialist Republic passed a law on 5 July 1991 establishing the office of the &quot;President of the Ukrainian Soviet Socialist Republic.&quot;</strong>",
    "published": "October 25, 2025"
  }
]