[
  {
    "title": "Government of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_Canada",
    "snippet": "The prime minister (currently <strong>Mark Carney</strong>) is the head of government, who is invited by the Crown to form a government after securing the confidence of the House of Commons, which is typically determined through the election of enough members of a single political party in a federal election ...",
    "published": "October 28, 2025"
  },
  {
    "title": "Prime Minister of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Canada",
    "snippet": "The prime minister also selects individuals for appointment as governor general, provincial lieutenant governors, territorial commissioners, as well as to the Senate of Canada, Supreme Court of Canada, other federal courts, and senior members of the military and public service. <strong>Mark Carney</strong> is the ...",
    "published": "July 31, 2001"
  },
  {
    "title": "Canada’s Constitutional Monarchy",
    "url": "https://learn.parl.ca/understanding-comprendre/en/canada-system-of-government/canadas-constitutional-monarchy/",
    "snippet": "These responsibilities are carried out by the Governor General (the Monarch’s representative in Canada). The positions of Head of State and Head of Government are held by separate people. The Prime Minister is the Head of Government, and the Monarch – currently <strong>His Majesty King Charles III</strong> – ...",
    "published": null
  },
  {
    "title": "Cabinet | Prime Minister of Canada",
    "url": "https://www.pm.gc.ca/en/cabinet",
    "snippet": "The Canadian Ministry is commonly referred to as Cabinet. It is the body of ministerial advisors that sets the federal government’s policies and priorities for the country. ... President of the King’s Privy Council for Canada and Minister responsible for Canada-U.S.",
    "published": null
  },
  {
    "title": "Canada - Heads of Government Listing - HOG",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?OpenForm=&ExpandView=&RestrictToCategory=Canada",
    "snippet": "Head of State<strong>HM King Charles III</strong>Head of StateYour MajestyGovernor GeneralHer Excellency the Right Honourable Mary Simon, C.C., C.M.M., C.O.M., O.Q., C.DGovernor General and Commander-in-Chief of CanadaYour ExcellencyHead of GovernmentRt. Hon. Mark Carney, P.C., M.P.Prime Minister of CanadaDear ...",
    "published": null
  }
]