[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "During his political career, Mélenchon crossed various tendencies of the French left, from Trotskyism in his youth to more moderate socialism, as he was in the <strong>Socialist Party</strong> for almost thirty years, occupying a place on the left wing of the party, before he began a companionship with the ...",
    "published": "1 week ago"
  },
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "<strong>La France Insoumise</strong> (LFI or FI; [la fʁɑ̃s ɛ̃sumiz], lit. &#x27;France Unbowed&#x27; or &#x27;France in Revolt&#x27;) is a left-wing political party in France. It was launched in 2016 by Jean-Luc Mélenchon, then a Member of the European Parliament (MEP) and former co-president of the Left Party (PG).",
    "published": "5 days ago"
  },
  {
    "title": "Who Is Jean-Luc Melenchon? All About The New Popular Front Leader | Europe - Times Now",
    "url": "https://www.timesnownews.com/world/europe/who-is-jean-luc-melenchon-age-family-daughter-net-worth-controversies-new-popular-union-article-111560066",
    "snippet": "Jean-Luc Melenchon, born on August 19, 1951, in Tangier, Morocco, is the son of a postmaster and a primary school teacher.After working as a teacher for a while, Melenchon entered politics in September 1976 and joined the <strong>Socialist Party (PS).</strong>",
    "published": "July 7, 2024"
  },
  {
    "title": "French elections: Who is Mélenchon and what does his Nupes alliance want?",
    "url": "https://www.bbc.com/news/world-europe-61737537",
    "snippet": "Jean-Luc Mélenchon dropped a career in teaching and journalism for left-wing politics in the 1970s. He served briefly as junior education minister under Socialist Prime Minister Lionel Jospin, but by the early 2000s, he became disillusioned with the what he saw as the Socialists&#x27; drift to the right. He became a Euro MP as part of a new left-wing party in 2009.",
    "published": "June 15, 2022"
  },
  {
    "title": "Who’s who in France’s left-wing coalition? | Euronews",
    "url": "https://www.euronews.com/my-europe/2024/07/05/whos-who-in-frances-left-wing-coalition",
    "snippet": "Leftist firebrand Jean-Luc Mélenchon founded his current party <strong>France Unbowed (LFI)</strong> in 2016 before running for president for the second time in the 2017 elections. The 72-year-old politician has had a long career in politics: he became a senator ...",
    "published": "July 7, 2024"
  }
]