[
  {
    "title": "Chancellor Larive assumes position as new Board Chair for Monterey Bay Economic Partnership - News",
    "url": "https://news.ucsc.edu/2022/04/chancellor-larive-mbep/",
    "snippet": "“MBEP’s goals — equitable economic development, high-quality educational and health-care systems, and environmental preservation — align with what many of us in this region are working toward,” Chancellor Cynthia Larive said. “Convening local leaders and working together is how we can advance this vision and ensure our communities thrive.” · Campus News · Share on Facebook · Share on LinkedIn · Share on Reddit · Print this Page · Campus News · October 10, 2025 ·",
    "published": "March 18, 2025"
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "<strong>UC Santa Cruz Chancellor</strong> Cynthia Larive is set to undergo an overdue five-year performance review, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  },
  {
    "title": "Cynthia Larive - Chancellor - Univerisity of California Santa Cruz | LinkedIn",
    "url": "https://www.linkedin.com/in/cynthia-larive-83218a8",
    "snippet": "2 others named Cynthia Larive are on LinkedIn See others named Cynthia Larive · See all courses · Include this LinkedIn profile on other websites · <strong>Chancellor at Univerisity of California Santa Cruz</strong> · Chancellor at Univerisity of California ...",
    "published": null
  },
  {
    "title": "Campus Provost and Executive Vice Chancellor | The Journal of Blacks in Higher Education",
    "url": "https://jbhe.com/jbhejobs/ucsc-cpevc/",
    "snippet": "https://jobs.jbhe.com/25fd6jfv ... seeks a bold, strategic, and collaborative leader to serve as the <strong>Campus Provost and Executive Vice Chancellor (CPEVC).</strong>...",
    "published": "November 10, 2025"
  },
  {
    "title": "r/UCSC on Reddit: the chancellor is receiving a 28.5% pay increase.",
    "url": "https://www.reddit.com/r/UCSC/comments/1fw5ojy/the_chancellor_is_receiving_a_285_pay_increase/",
    "snippet": "Article states &quot;<strong>UC Santa Cruz Chancellor</strong> Cynthia Larive will voluntarily forgo her base salary increase for 2024-25.&quot; You should know that this is in reference to the 4% across-the-board increase that all staff got, not the upcoming 28.5% increase.",
    "published": "October 4, 2024"
  }
]