[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first <strong>Simonyi Professor for the Public Understanding of Science</strong>, a position he held until 2008, and ...",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "Dawkins was named the first Charles Simonyi Professor for the Public Understanding of Science at Oxford (1995–2008). In that capacity he continued to publish prolifically and produced an array of television programs. His 1996 documentary Break the Science Barrier featured Dawkins conversing with an array of prominent scientists about their discoveries.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/richarddawkins/",
    "snippet": "From 1995 to 2008 Richard Dawkins was the <strong>Charles Simonyi Professor of the Public Understanding of Science</strong> at Oxford University. He is an internationally best-selling author.",
    "published": "April 21, 2022"
  },
  {
    "title": "Richard Dawkins - Oxford Reference",
    "url": "https://www.oxfordreference.com/display/10.1093/oi/authority.20110803095703340",
    "snippet": "(1941– )British scientist whose ... University of California, Berkeley (1967–69), before returning to Oxford as a <strong>fellow of New College</strong>....",
    "published": null
  },
  {
    "title": "Richard Dawkins | The Progressive Forum",
    "url": "https://www.progressiveforumhouston.org/speaker/richard-dawkins",
    "snippet": "He is a Fellow of the Royal Society ... scientists. In 2008, Dawkins retired from his position as the <strong>Charles Simonyi Professor for Public Understanding of Science</strong> at Oxford University, a post created for Dawkins....",
    "published": null
  }
]