[
  {
    "title": "American Airlines Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/American_Airlines_Center",
    "snippet": "<strong>American Airlines Center (AAC)</strong> is a multi-purpose indoor arena located in the Victory Park neighborhood in downtown Dallas, Texas. The arena serves as the home of the Dallas Stars of the National Hockey League and Dallas Mavericks of the National Basketball Association.",
    "published": "1 week ago"
  },
  {
    "title": "Where Do The Dallas Mavericks Play?",
    "url": "https://www.elitesportstours.ca/where-do-the-dallas-mavericks-play-basketball",
    "snippet": "<strong>American Airlines Center (AAC)</strong> is a multi-purpose arena, located in the Victory Park neighborhood in downtown Dallas, Texas. The arena serves as the home to the Dallas Mavericks of the National Basketball Association, and the Dallas Stars of ...",
    "published": null
  },
  {
    "title": "American Airlines Center",
    "url": "https://www.americanairlinescenter.com/",
    "snippet": "The <strong>American Airlines Center</strong> is the Dallas area&#x27;s Premier Sports and Entertainment arena, and home to the NHL&#x27;s Dallas Stars and NBA&#x27;s Dallas Mavericks.",
    "published": null
  },
  {
    "title": "Dallas Mavericks - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Dallas_Mavericks",
    "snippet": "The Mavericks compete in the National Basketball Association (NBA) as a member of the Southwest Division of the Western Conference. The team plays its home games at <strong>American Airlines Center</strong>, which it shares with the National Hockey League&#x27;s ...",
    "published": "1 week ago"
  },
  {
    "title": "American Airlines Center",
    "url": "http://www.insidearenas.com/western/AmericanAirlinesCenter.htm",
    "snippet": "Home Court Advantage: The Mavericks play their home games at the <strong>American Airlines Center</strong>, which is located in the heart of downtown Dallas. The arena is known for its energetic crowds and distinctive Texas-style decor.",
    "published": "2 weeks ago"
  }
]