[
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "Mike Downey, an Irish-British film producer, was <strong>elected chairman in 2020.</strong>",
    "published": "September 3, 2025"
  },
  {
    "title": "Mike Downey elected new EFA chairman - Cineuropa",
    "url": "https://cineuropa.org/en/newsdetail/382667",
    "snippet": "The members of the European Film Academy (EFA) have elected Mike Downey, Irish producer and CEO of Film and Music Entertainment (F&amp;ME), as <strong>new chairman of the EFA board</strong>.",
    "published": "November 12, 2019"
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/mike-downey-downey-ink-berlin-slate-1236306279/",
    "snippet": "Producer Mike Downey, who is <strong>chair of the European Film Academy</strong> and whose co-production “Girls on Wire” is in Berlin competition, has unveiled a diverse slate of films from his production company Downey Ink at the European Film Market.",
    "published": "February 16, 2025"
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "Outgoing chair Downey added: “To quote Shakespeare, ‘Parting is such sweet sorrow.’ But <strong>I am happy to leave the Academy in good shape and fit for purpose for the future</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "The nominations will, as before be decided on by a panel of experts, <strong>new honorary president of the panel</strong> is EFA Chairman Mike Downey. These nominations, usually five (in its first edition, due to Covid-19, only three) will be announced as part ...",
    "published": null
  }
]