[
  {
    "title": "Princeton University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Princeton_University",
    "snippet": "At the same time, the college underwent large expansion and social life was changing in reflection of the rise in eating clubs and burgeoning interest in athletics. In 1893, the honor system was established, allowing for unproctored exams. <strong>In 1896</strong>, the college officially became a university, ...",
    "published": "September 10, 2001"
  },
  {
    "title": "Princeton University - New World Encyclopedia",
    "url": "https://www.newworldencyclopedia.org/entry/Princeton_University",
    "snippet": "Princeton University is a private coeducational research university located in Princeton, New Jersey. It is one of eight universities that belong to the Ivy League. <strong>Originally founded at Elizabeth, New Jersey, in 1746</strong> as the College of New Jersey, it relocated to Princeton in 1756 and was renamed ...",
    "published": null
  },
  {
    "title": "Princeton University | History, Location, & Notable Alumni | Britannica",
    "url": "https://www.britannica.com/topic/Princeton-University",
    "snippet": "Princeton University was <strong>originally founded as the College of New Jersey in Elizabeth, New Jersey, in 1746</strong> and moved to nearby Newark in 1747. Its inception was a direct outgrowth of the Great Awakening, a religious movement to revitalize ...",
    "published": "July 20, 1998"
  },
  {
    "title": "History of Princeton University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Princeton_University",
    "snippet": "New Light Presbyterians founded ... later Princeton University, in <strong>1746</strong> in order to train ministers dedicated to their views. The college was the educational and religious capital of Scottish-Irish America. By 1808, a loss of confidence in the college within the Presbyterian Church led to the ...",
    "published": "September 15, 2024"
  },
  {
    "title": "HISTORY OF PRINCETON FROM FOUNDING TO PRESENT TIME | News | The Harvard Crimson",
    "url": "https://www.thecrimson.com/article/1916/11/11/history-of-princeton-from-founding-to/",
    "snippet": "Two years later, on <strong>September 14, 1748</strong>, a second charter was granted by Governor Jonathan Belcher, Harvard 1699 and this is the charter of Princeton today. The university, then the College of New Jersey, opened in the fourth week of May, 1747, with the Reverend Jonathan Dickinson, Yale 1706, ...",
    "published": null
  }
]