[
  {
    "title": "Under Secretaries of State for Political Affairs - Principal Officers - People - Department History - Office of the Historian",
    "url": "https://history.state.gov/departmenthistory/people/principalofficers/under-secretary-for-political-affairs",
    "snippet": "<strong>Congress first authorized the position of Under Secretary of State for Political Affairs in the Department of State Organization Act of July 30, 1959</strong> (P.L. 86–117; 73 Stat. 265), which allowed the President to appoint either an Under Secretary for Political Affairs or an Under Secretary for ...",
    "published": null
  },
  {
    "title": "Under Secretary of State for Political Affairs - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Under_Secretary_of_State_for_Political_Affairs",
    "snippet": "The political bureaus were first overseen in 1949 by a deputy under secretary for political affairs. Prior to the creation of the position of under secretary of state for political affairs in <strong>August 1959</strong>, the deputy under secretary for political affairs assisted the secretary and under secretary ...",
    "published": "September 17, 2025"
  },
  {
    "title": "United States Under Secretary of State - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/United_States_Under_Secretary_of_State",
    "snippet": "Under Secretary of State (U/S) is a title used by senior officials of the United States Department of State who rank above the assistant secretaries and below the deputy secretary. <strong>From 1919 to 1972, the under secretary was the second-ranking official at the Department of State</strong> (immediately ...",
    "published": "1 month ago"
  },
  {
    "title": "R. Nicholas Burns - Former Under Secretary of State for Political Affairs",
    "url": "https://georgewbush-whitehouse.archives.gov/government/nburns-bio.html",
    "snippet": "Ambassador R. Nicholas Burns was the Under Secretary of State for Political Affairs, the Department of State’s third ranking official. <strong>Appointed by President Bush, he was confirmed by the U.S. Senate on March 17, 2005 and was sworn into office by Secretary of State Condoleezza Rice</strong>.",
    "published": null
  },
  {
    "title": "Deputy Under Secretaries of State for Political Affairs - Principal Officers - People - Department History - Office of the Historian",
    "url": "https://history.state.gov/departmenthistory/people/principalofficers/deputy-under-secretary-for-political-affairs",
    "snippet": "84-250; 69 Stat. 536). Prior to the creation of the position of Under Secretary of State for Political Affairs in <strong>Aug 1959</strong>, the Deputy Under Secretary for Political Affairs assisted the Secretary and Under Secretary in the formulation and conduct of U.S. foreign policy.",
    "published": null
  }
]