[
  {
    "title": "Kabel-TV – Wikipedia",
    "url": "https://sv.wikipedia.org/wiki/Kabel-TV",
    "snippet": "De första kabel-TV-sändningarna startades av <strong>Informations-TV AB i kvarteret Kronprinsen i Malmö 1961</strong>. De sände egenproducerade program och från 1981 vidaresändning av satellitsändningar, med början med den sovjetiska kanalen Horizont. Flera diskussion huruvida detta var lagligt eller ...",
    "published": "January 23, 2025"
  },
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "Com Hem was a Swedish brand owned by <strong>Tele2 AB</strong> which supplied Triple Play services that included cable television, broadband internet and fixed-line telephone. Founded in 1983 as Televerket Kabel-TV as part of the former state-owned Televerket, the company was successively named Svenska Kabel-TV ...",
    "published": "June 6, 2025"
  },
  {
    "title": "Canal Digital Kabel | Logopedia | Fandom",
    "url": "https://logos.fandom.com/wiki/Canal_Digital_Kabel",
    "snippet": "<strong>Canal Digital Kabel</strong> started as Televerkets Bedrifts Kunder Kabel TV A/S (TBK), a then cable television division of Norwegian state-owned telecommunications company Televerket in 1988 after merging with many cable companies in Norway.",
    "published": null
  },
  {
    "title": "Televerket – Artist & Author Joakim Lloyd Raboff",
    "url": "https://raboff.com/televerket/",
    "snippet": "There was no posting on it, and therefore only interesting as a relic of Televerket, the precursor of today’s Telia, Sweden’s partially state-owned telecom company. When I moved to Sweden in 1978, Televerket was a monopoly and omnipresent in society.",
    "published": null
  },
  {
    "title": "Televerket (Sweden) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Televerket_(Sweden)",
    "snippet": "Televerket was a Swedish State authority acting as a state-owned corporation (public enterprise), responsible for telecommunications in Sweden from 1853 until 1993. Originally it was named Kongl. Elektriska Telegraf-Werket (literally: Royal Electric Telegraph Agency), which was founded in 1853.",
    "published": "June 4, 2025"
  }
]