[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "The move was condemned by Germany as well as Amnesty International, which, in a statement, said: &quot;The objective is clear: to raze Alexei Navalny&#x27;s movement to the ground while he languishes in prison.&quot; On 29 April 2021, Navalny&#x27;s team announced that the political network would be dissolved, in advance of a court ruling in May expected to designate it as extremist.",
    "published": "2 days ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "Aleksey Navalny (1976–2024) was a <strong>Russian anti-corruption activist and politician</strong> who achieved international recognition as one of the most prominent domestic critics of Russian Pres. Vladimir Putin.",
    "published": "March 7, 2023"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "<strong>Russia of the Future</strong> (Russian: ... Прогресса, Partiya Progressa), is a banned opposition political party in Russia founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018 by Alexei Navalny, who was also the founder of the non-profit organisation ...",
    "published": "September 30, 2025"
  },
  {
    "title": "Alexei Navalny, Russia's most outspoken Putin critic - BBC News",
    "url": "https://www.bbc.com/news/world-europe-16057045",
    "snippet": "Anti-corruption campaigner Alexei Navalny was long the most prominent face of Russian opposition to President Vladimir Putin.",
    "published": "February 16, 2024"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "Alexei Navalny’s political history in Russia was quite prominent, as he led various parties and ran for various high-ranking positions within the government. Navalny’s presence made him a well known figure in Russian politics, making many allies and enemies along the way.",
    "published": null
  }
]