[
  {
    "title": "Thomas Tuchel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Thomas_Tuchel",
    "snippet": "<strong>On 24 March 2023, Tuchel was announced as head coach at Bayern Munich on a two-year deal, replacing his former player Julian Nagelsmann, who was dismissed</strong>. Tuchel was presented at a club press conference the following day, where he said &quot;the squad assembled [here] is one of the most talented ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Thomas Tuchel: News & profile - FC Bayern München",
    "url": "https://fcbayern.com/en/teams/first-team/former-players/thomas-tuchel",
    "snippet": "<strong>Thomas Tuchel (born 29 August 1973) has been the coach of FC Bayern since 24 March 2023</strong>. Info, titles &amp; news - you can find everything here!",
    "published": null
  },
  {
    "title": "Introducing new Bayern boss Thomas Tuchel",
    "url": "https://fcbayern.com/en/news/2023/03/profile-new-head-coach-thomas-tuchel",
    "snippet": "Thomas Tuchel has been appointed FC Bayern head coach. <strong>The 49-year-old has signed a contract with the German record champions until 30 June 2025</strong>. fcbayern.com profiles the new man in the Munich dugout.",
    "published": "March 25, 2023"
  },
  {
    "title": "Thomas Tuchel's fascinating coaching journey from Mainz to England manager | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/thomas-tuchel-england-manager-made-in-germany-chelsea-bayern-psg-dortmund-5732",
    "snippet": "Thomas Tuchel <strong>spent the best part of a decade honing his craft on Bundesliga touchlines with Mainz and Borussia Dortmund, before reaching consecutive UEFA Champions League finals with Paris Saint-Germain and Chelsea</strong>.",
    "published": "March 18, 2025"
  },
  {
    "title": "Niko Kovač, Thomas Tuchel and the men who've coached Bayern Munich and Borussia Dortmund | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/coaches-bayern-munich-borussia-dortmund-tuchel-kovac-30820",
    "snippet": "As arguably the two biggest clubs in the Bundesliga, Bayern Munich and Borussia Dortmund have attracted some of the best coaching talent Germany and the world have to offer. Some have even coached both, with Niko Kovač the latest to do so after joining the Black-Yellows. bundesliga.com takes ...",
    "published": "February 6, 2025"
  }
]