[
  {
    "title": "The Walt Disney Co Locations - Headquarters & Offices - GlobalData",
    "url": "https://www.globaldata.com/company-profile/the-walt-disney-company/locations/",
    "snippet": "View The Walt Disney Co&#x27;s company headquarters address along with its other key offices and locations.",
    "published": null
  },
  {
    "title": "The Walt Disney Company Corporate Headquarters, Office Locations and Addresses | Craft.co",
    "url": "https://craft.co/the-walt-disney/locations",
    "snippet": "The Walt Disney Company is headquartered in Burbank, <strong>500 S Buena Vista St, United States</strong>, and has 15 office locations.",
    "published": null
  },
  {
    "title": "Where is Disney's Headquarters? Main Office Location and Global Offices | Clay",
    "url": "https://www.clay.com/dossier/disney-headquarters-office-locations",
    "snippet": "This article will explore the real-world nerve centers of the company: its main headquarters and various office locations that support its worldwide operations. The Walt Disney Company&#x27;s main headquarters is located at <strong>500 South Buena Vista Street in Burbank, California</strong>. This facility serves ...",
    "published": null
  },
  {
    "title": "The Walt Disney Company Offices: Locations & Headquarters | Built In",
    "url": "https://builtin.com/company/walt-disney-company/offices",
    "snippet": "The Walt Disney Company is headquartered in <strong>Burbank, California, USA</strong> and has 15 office locations.",
    "published": null
  },
  {
    "title": "Contact Us - The Walt Disney Privacy Center",
    "url": "https://privacy.thewaltdisneycompany.com/en/support/",
    "snippet": "The Walt Disney Company For questions regarding The Walt Disney Company’s Privacy Policy or privacy practices, please contact: Email: privacycontact@TWDC.com Phone: (877) 466-6669 Address: The Walt Disney Company <strong>500 South Buena Vista Street</strong> Mail Code 7830 Burbank, CA 91521-7667",
    "published": "January 5, 2024"
  }
]