[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "They, in turn, stated they wanted to eventually see Navalny as a member of the party. On 15 December 2012 Navalny expressed his support of the party, saying, &quot;<strong>The People&#x27;s Alliance</strong> is my party&quot;, but again refused to join it, citing the criminal cases against him.",
    "published": "1 day ago"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "<strong>Russia of the Future</strong> (Russian: Россия Будущего, romanized: Rossiya Budushchego, IPA: [rɐˈsʲijə ˈbudʊɕːɪvə]), originally known as the People&#x27;s Alliance (Народный Альянс, Narodnyy Al&#x27;yans) and formerly called the Progress Party (Партия Прогресса, ...",
    "published": "September 30, 2025"
  },
  {
    "title": "Kremlin Foe Navalny Launches New Political Party",
    "url": "https://www.rferl.org/a/russia-navalny-new-political-party/29237240.html",
    "snippet": "Russian opposition leader Aleksei Navalny has launched a new political party, though he missed its founding due to a jail sentence over nationwide protests he organized against President Vladimir Putin.",
    "published": "May 19, 2018"
  },
  {
    "title": "The last party. The Kremlin is taking aim at Russia’s sole remaining legal opposition movement — Novaya Gazeta Europe",
    "url": "https://novayagazeta.eu/articles/2025/12/02/the-last-party-en",
    "snippet": "That prediction is borne out by recent moves against prominent party members — on 25 November, two Yabloko politicians accused of spreading “fake news about the army” both had their pre-trial detention extended, while party leader Nikolay Rybakov has been charged with “displaying extremist symbols” for sharing a photograph of Alexey Navalny online.",
    "published": "2 weeks ago"
  },
  {
    "title": "Alexei Navalny Speaks from Prison: An Exclusive Interview | TIME",
    "url": "https://time.com/6140102/alexei-navalny-russia-profile/",
    "snippet": "On balance, his agenda struck me as center-right: he supported gun rights, strong borders, less government spending—nothing more radical than a typical Republican in Texas, or a Christian Democrat in Bavaria. But Navalny’s politics were not driven by ideology.",
    "published": "January 19, 2022"
  }
]