[
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Jennifer Westacott AC is an Australian business executive. She served as the <strong>chief executive of the Business Council of Australia (BCA)</strong> from 2011 to 2023.",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "Jennifer is a National Fellow of the Institute of Public Administration Australia and a Fellow of the Australian Institute of Company Directors, and since 2013 has been a <strong>Non-Executive Director of Wesfarmers Limited and Chair of the Mental Health Council of Australia</strong>.",
    "published": null
  },
  {
    "title": "Jennifer Westacott: Positions, Relations and Network - MarketScreener",
    "url": "https://www.marketscreener.com/business-leaders/Jennifer-Westacott-0BQ309-E/biography/",
    "snippet": "Jennifer Anne Westacott currently works at Future Generation Global Ltd., as Chairman from 2023, Studio Schools of Australia Ltd., as Chairman from 2019, Western Parkland City Authority, as Chairman from 2019, Wesfarmers Ltd., as Independent Non-Executive Director from 2013, The Pinnacle Foundation, as Director, Cyber Security Research Centre Ltd., as Director from 2018, ATCO Gas Australia Pty Ltd., as Director from 2024, ATCO Australia Pty Ltd., as Director from 2024, Canadian Utilities Ltd., as Independent Director from 2025, The University of New South Wales, as Member from 2019, the University of Western Sydney, as Chancellor from 2023, and Reserve Bank of Australia, as Member-Governors Board.",
    "published": null
  },
  {
    "title": "Jennifer Westacott AO - Institute of Public Administration Australia (ACT) Limited | Institute of Public Administration Australia (ACT) Limited",
    "url": "https://act.ipaa.org.au/ipaa-people/jennifer-westacott-ao/",
    "snippet": "Professor Jennifer Westacott AO has returned to KPMG as a <strong>senior adviser</strong>. She is a prominent Australian business executive and public policy expert who has made significant contributions to various […]",
    "published": "March 26, 2025"
  },
  {
    "title": "Jennifer Westacott AC - KPMG Australia | LinkedIn",
    "url": "https://www.linkedin.com/in/jennifer-westacott-ac-9aa853146/",
    "snippet": "In 2018, Jennifer was made an <strong>Officer (AO) in the General Division of the Order of Australia</strong> for distinguished service to private and public-sector administration through executive roles, to policy development and reform, to cross sector ...",
    "published": "November 17, 2021"
  }
]