[
  {
    "title": "Luis Enrique named as Paris Saint-Germain's new manager | Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/first-team/content/luis-enrique-named-as-paris-saint-germain-new-manager",
    "snippet": "Paris Saint-Germain is delighted to announce that <strong>Luis Enrique has been named as its first team&#x27;s new head coach</strong>, with the Spanish manager signing a two-year contract.",
    "published": null
  },
  {
    "title": "Luis Enrique - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Luis_Enrique",
    "snippet": "Luis Enrique Martínez García (Spanish pronunciation: [lwis enˈrike maɾˈtineθ ɡaɾˈθia]; born 8 May 1970), known as Luis Enrique, is a Spanish football manager and former player. He is currently the <strong>head coach of Ligue 1 club Paris Saint-Germain</strong>. A versatile player with good technique, ...",
    "published": "3 days ago"
  },
  {
    "title": "Luis Enrique | Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/first-team/squad/staff/luis-enrique",
    "snippet": "Not long afterwards, Enrique was named as the new head coach of the Spanish men’s national team, with which he would eventually enjoy two stints – one between July 2018 and June 2019 and another between November 2019 and December 2022 – during which time he reached the UEFA EURO 2020 ...",
    "published": null
  },
  {
    "title": "List of Paris Saint-Germain FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Paris_Saint-Germain_FC_managers",
    "snippet": "Former Spanish player Luis Enrique is the <strong>current manager</strong>. He has been in charge since July 2023. Pierre Phelipon, appointed in August 1970, was PSG&#x27;s first manager. He was also one of two player-managers in the club&#x27;s history, the other being ...",
    "published": "4 days ago"
  },
  {
    "title": "Paris Saint-Germain Men's Team Coaching Staff",
    "url": "https://www.psg.fr/en/mens-football/staff",
    "snippet": "Luis Enrique is the <strong>Head coach</strong> of the Paris Saint-Germain Men’s football team.View profile · Technical staffTeam managersPerformance StaffMedical StaffVideo AnalystsEquipment staff · Assistant Coach · Assistant Coach · Psychologist · ...",
    "published": null
  }
]