[
  {
    "title": "Salman of Saudi Arabia | King, Father, Siblings, & Son | Britannica",
    "url": "https://www.britannica.com/biography/Salman-of-Saudi-Arabia",
    "snippet": "King Salman ibn Abdulaziz Salman ascended to the throne more than 60 years after the death of his father, Ibn Saud, who founded the country. He designated his son, <strong>Mohammed bin Salman</strong>, as his successor, making Salman the last of his generation ...",
    "published": "December 14, 2023"
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "His seventh son, Crown Prince <strong>Mohammed bin Salman</strong>, is considered the de facto ruler of Saudi Arabia due to the King&#x27;s poor health and Mohammed&#x27;s own political maneuvering. Mohammed replaced his father as prime minister in 2022, making Salman the first king since Saud in 1964 not to serve as ...",
    "published": "November 3, 2025"
  },
  {
    "title": "King of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/King_of_Saudi_Arabia",
    "snippet": "The first Saudi king to use the title was Faisal; however, <strong>King Khalid</strong> did not use the title after him. In 1986, King Fahd replaced &quot;His Majesty&quot; with the title of Custodian of the Two Holy Mosques, and it has been since used by both King Abdullah and King Salman.",
    "published": "2 weeks ago"
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "<strong>Crown Prince Mohammed bin Salman</strong> ... 1985), also known as MbS, is the de facto ruler of the Kingdom of Saudi Arabia, formally serving as Crown Prince and Prime Minister. He is the heir apparent to the Saudi throne, the seventh son of King Salman, ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Salman Bin Abdulaziz Al Saud - Saudipedia",
    "url": "https://saudipedia.com/en/article/235/royal-family/kings/salman-bin-abdulaziz-al-saud",
    "snippet": "He named it Diriyah after his tribe &#x27;al-Duru,&#x27; and the first Diriyah where he had lived in the east of the Arabian Peninsula. <strong>King Salman</strong> in his childhood next to his father King Abdulaziz.",
    "published": "September 18, 2025"
  }
]