[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "The site&#x27;s new owner, Disney, hired G. Elliott Morris to develop a new model. On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to <strong>ABC News</strong> pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight.",
    "published": "1 month ago"
  },
  {
    "title": "Nate Silver – FiveThirtyEight",
    "url": "https://fivethirtyeight.com/contributors/nate-silver/",
    "snippet": "<strong>Nate Silver</strong> founded and was the editor in chief of FiveThirtyEight.",
    "published": null
  },
  {
    "title": "FiveThirtyEight Founder Nate Silver Leaving ABC News as Disney Layoffs Continue",
    "url": "https://variety.com/2023/digital/news/fivethirtyeight-nate-silver-leaves-abc-news-disney-layoffs-1235594060/",
    "snippet": "ABC News plans to hold onto the FiveThirtyEight brand despite founder <strong>Nate Silver</strong>&#x27;s exit.",
    "published": "April 25, 2023"
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "On July 22, 2013, <strong>ESPN (a subsidiary of the Walt Disney Company)</strong> announced that it had acquired ownership of the FiveThirtyEight website and brand, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, ...",
    "published": "1 day ago"
  },
  {
    "title": "Nate Silver of FiveThirtyEight’s advice to founders | Fortune",
    "url": "https://fortune.com/2023/08/15/fivethirtyeight-nate-silver-advice-founders-disney-espn-abc-acquisition-departure/",
    "snippet": "Silver’s first commercial deal as a founder was to license FiveThirtyEight to the New York Times’ Upshot sectionfrom 2010 to 2013. When his three-year contract with the Times expired, Disney’s ESPN acquired the brand and website. In 2018, the site moved within the Disney portfolio to ABC News as ESPN revised its digital strategy.",
    "published": "August 15, 2023"
  }
]