[
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "Zaza Pachulia (Georgian: ზაზა ფაჩულია; Georgian pronunciation: [zaza patʃʰulia] born Zaur Pachulia; 10 February 1984) is a <strong>Georgian professional basketball executive and former player who is a basketball operations consultant for the Golden State Warriors of the National</strong> ...",
    "published": "November 6, 2025"
  },
  {
    "title": "Zaza Pachulia - Golden State Warriors | LinkedIn",
    "url": "https://www.linkedin.com/in/zazapachulia",
    "snippet": "Experience: Golden State Warriors · Education: Stanford University · Location: San Francisco · 500+ connections on LinkedIn. View Zaza Pachulia’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": "2 weeks ago"
  },
  {
    "title": "Warriors bring back Zaza Pachulia as consultant | NBA.com",
    "url": "https://www.nba.com/news/warriors-bring-back-zaza-pachulia-consultant",
    "snippet": "<strong>He will be used as a consultant on both the business and basketball side of team operations</strong>. Welcome back, @zaza27! Zaza Pachulia has rejoined the Warriors as a Consultant. pic.twitter.com/d9CqtmeBYN · — Golden State Warriors (@warriors) ...",
    "published": "October 10, 2020"
  },
  {
    "title": "Warriors bring back Pachulia as consultant, make promotions - NBA - ESPN",
    "url": "https://www.espn.com/espn/wire?section=nba&id=27495175",
    "snippet": "While Pachulia only appeared in ... mindset meant so much to Kerr and the Warriors. <strong>He will be used as a consultant on both the business and basketball side of team operations</strong>. Dunleavy came back to Golden State as a pro scout ...",
    "published": null
  },
  {
    "title": "Zaza Pachulia - Liaison For Business And Basketball At Golden State Warriors. at Golden State Warriors | The Org",
    "url": "https://theorg.com/org/golden-state-warriors/org-chart/zaza-pachulia",
    "snippet": "<strong>Currently serving as a liaison for business and basketball and consultant at the Golden State Warriors since September 2019,</strong> Pachulia is also a partner at the leading Georgian development company Archi and at CROSTY, a brand emphasizing values ...",
    "published": null
  }
]