[
  {
    "title": "Gabriel Boric - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gabriel_Boric",
    "snippet": "The bill faces strong opposition ... uncertain due to limited support in Congress and the approaching 2025 Chilean general election. <strong>Boric took office with a 50% approval rating</strong>....",
    "published": "2 days ago"
  },
  {
    "title": "Gabriel Boric, the Victory of the Pinochetist Far Right in Chile, and Donald Trump",
    "url": "https://colombiaone.com/2025/12/15/chile-gabriel-boric-victory-pinochetist-far-right-donald-trump/",
    "snippet": "But in all of this, there is a clear culprit: Chile’s current president, the leftist Gabriel Boric, incapable of delivering a single one of his major projects or transformation promises over four years.",
    "published": "1 day ago"
  },
  {
    "title": "​Gabriel Boric comienza a despedirse de La Moneda | EL PAÍS Chile",
    "url": "https://elpais.com/chile/2025-12-13/gabriel-boric-comienza-a-despedirse-de-la-moneda.html",
    "snippet": "Es una tradición en la política chilena y reafirma, una vez más, un camino institucional que ha tenido el país sudamericano desde el retorno a la democracia en 1990, independiente de la ferocidad de cada campaña. Será, de paso, el primer hito de la despedida de Boric de La Moneda, que dejará el Palacio presidencial el 11 de marzo de 2026 y, con 40 años recién cumplidos, se instalará en un curioso papel de expresidente siendo todavía tan joven.",
    "published": "3 days ago"
  },
  {
    "title": "Presidency: Gabriel Boric - Gob.cl",
    "url": "https://www.gob.cl/en/institutions/presidency/",
    "snippet": "With this, the citizens were mobilized, ... was greater than the presidential post. In this way, on December 19, <strong>he managed to win in the polls in the second round with a wide advantage over his opponent</strong>....",
    "published": null
  },
  {
    "title": "‘We were a flash in the pan’: The end of Gabriel Boric’s government in Chile | openDemocracy",
    "url": "https://www.opendemocracy.net/en/chile-gabriel-boric-left-jeannette-jara-neoliberalism-elections/",
    "snippet": "Chilean President Gabriel Boric carries his daughter while voting in Punta Arenas, southern Chile, in the elections on 16 November 2025 | ... Chile’s presidential run-off on 14 December will mark the end of the government led by Frente Amplio, a platform of young progressive parties that disrupted a political system that for 30 years had been dominated by two coalitions: the traditional right and the centre-left.",
    "published": "5 days ago"
  }
]