[
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "Albanese attended <strong>St Joseph&#x27;s Primary School in Camperdown and then St Mary&#x27;s Cathedral College</strong>. While at school, he worked part-time selling newspapers. He captained St Mary&#x27;s on several episodes of the children&#x27;s game show It&#x27;s Academic in 1978. Albanese joined the Australian Labor Party ...",
    "published": "20 hours ago"
  },
  {
    "title": "Anthony Albanese - Students | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/students/article/Anthony-Albanese/634506",
    "snippet": "Albanese attended <strong>local Roman Catholic schools</strong> and became the first person in his family to finish high school. He worked for a bank for a couple of years before continuing his studies at the University of Sydney.",
    "published": null
  },
  {
    "title": "Anthony Albanese | Australia, Biography, Age, & Wife | Britannica",
    "url": "https://www.britannica.com/biography/Anthony-Albanese",
    "snippet": "At age 12 he participated in his first political action, joining with fellow public housing residents to successfully block an attempt by the local government to sell their homes. In 1979, while still in his teens, Albanese joined the Labor Party. After attending St. Joseph’s Primary School in Camperdown and St.",
    "published": "June 1, 2022"
  },
  {
    "title": "Anthony Albanese receives rock star welcome at his Sydney high school | 7NEWS",
    "url": "https://7news.com.au/politics/federal-election/anthony-albanese-receives-rock-star-welcome-at-his-sydney-high-school-c-6727203",
    "snippet": "Anthony Albanese has received a rock star welcome at the <strong>Sydney high school</strong> he attended as a child.",
    "published": "May 9, 2022"
  },
  {
    "title": "The making of a prime minister • Frank Bongiorno",
    "url": "https://insidestory.org.au/the-making-of-a-prime-minister/",
    "snippet": "In the meantime, she had a short-lived and unhappy marriage to another man, whose surname Anthony briefly adopted before reverting to that of a father he had never met. Albanese attended <strong>Catholic schools</strong> and then the University of Sydney, where ...",
    "published": "May 4, 2025"
  }
]