[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "Richard Dawkins (born 26 March 1941) is a British evolutionary biologist, zoologist, science communicator and author. He is an emeritus fellow of New College, Oxford. In 1995 he was named the first Simonyi Professor for the Public Understanding of Science, a position he held until 2008, and is on the advisory board of the University of Austin.",
    "published": "3 days ago"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "Much of Dawkins’s work has generated debate for asserting the supremacy of science over religion in explaining the world. He also asserts that laws of probability preclude the existence of an omnipotent creator. After earning his master’s and doctorate degrees in zoology in 1966 at the University of Oxford under famed ethologist Nikolaas Tinbergen (who was best known for his work with both instinctive and learned behaviour), Richard Dawkins assisted Tinbergen before becoming an assistant professor of zoology (1967–69) at the University of California, Berkeley.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins | Edge.org",
    "url": "https://www.edge.org/memberbio/richard_dawkins",
    "snippet": "RICHARD DAWKINS, elected as a <strong>Fellow of the Royal Society</strong> in May, 2001, is a gifted writer, who is known for his popularization of Darwinian ideas as well as for original thinking on evolutionary theory.",
    "published": null
  },
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "There are too many places in the world where it‘s difficult to obtain books that explain and celebrate science written in the local language, particularly within more restrictive Islamic regimes. The Translations Project produces professionally translated versions of landmark books on science and nature for free, beginning with the works of Richard Dawkins himself.",
    "published": "July 17, 2025"
  },
  {
    "title": "Richard Dawkins Jr - Career Prep Fellow '26 - Management Leadership for Tomorrow | LinkedIn",
    "url": "https://www.linkedin.com/in/richard-dawkins-jr-962663250/",
    "snippet": "I am excited to share that I have accepted an offer with <strong>Nestlé USA</strong> as a Sales Intern for Summer 2025 in the Cincinnati, OH office!",
    "published": null
  }
]