[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: one to do business in the United States and legally named Regency Entertainment (USA), Inc., one to do business overseas and legally named Monarchy Enterprises S.á.r.l.",
    "published": "2 days ago"
  },
  {
    "title": "Regency Enterprises - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q466459",
    "snippet": "Monarchy Enterprises S.á.r.l.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between Arnon Milchan, Scriba &amp; Deyle and Canal+ to finance 20 films in five years, with New Regency Productions acting as its production and sales arm. The company was originally known as Embassy International Pictures from 1982 until 1991.",
    "published": "2 weeks ago"
  },
  {
    "title": "Regency Enterprises Inc - Company Profile and News - Bloomberg Markets",
    "url": "https://www.bloomberg.com/profile/company/4946240Z:US",
    "snippet": "Company profile page for Regency Enterprises Inc including stock price, company news, executives, board members, and contact information",
    "published": null
  },
  {
    "title": "Regency Enterprises (Creator) - TV Tropes",
    "url": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/RegencyEnterprises",
    "snippet": "In September 1997, Milchan signed ... Bros. (1991–1999) <strong>Fox&#x27;s parent company News Corporation (now 21st Century Fox) funneled $200 million in New Regency, in exchange for a 20 percent stake in the company</strong>....",
    "published": "October 2, 2025"
  }
]