[
  {
    "title": "Christine Lagarde - President of the European Central Bank | LinkedIn",
    "url": "https://de.linkedin.com/in/christinelagarde",
    "snippet": "President of the European Central Bank · Born in Paris in 1956, Christine Lagarde completed high school in Le Havre and attended <strong>Holton Arms School</strong> in Bethesda (Maryland, United States).",
    "published": "October 1, 2025"
  },
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "Lagarde had also served in the Government of France, most prominently as Minister of the Economy, Finance and Industry from 2007 until 2011. She is the first woman to hold each of those posts. Born and raised in Paris, Lagarde graduated from <strong>law school at Paris Nanterre University</strong> and obtained ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Christine Lagarde | Biography, IMF, ECB, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Christine-Lagarde",
    "snippet": "After graduating (1974) from the prestigious Holton-Arms girls’ college-preparatory school in Bethesda, Maryland, she studied at the <strong>Law School of the University of Paris X-Nanterre</strong>, where she lectured after graduation before going on to ...",
    "published": "January 30, 2009"
  },
  {
    "title": "Christine Lagarde - European Central Bank",
    "url": "https://www.ecb.europa.eu/ecb/decisions/html/cvlagarde.en.html",
    "snippet": "Number two on Forbes’ list of The World’s 100 Most Powerful Women Distinguished Alumna Award from the <strong>Holton-Arms School</strong> Distinguished International Leadership Award from the Atlantic Council 2019 CARE Humanitarian Award from CARE (Cooperative ...",
    "published": "November 22, 2023"
  },
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "The current president of the European Central Bank is Christine Lagarde, previously the chair and managing director of the International Monetary Fund.",
    "published": "September 25, 2025"
  }
]