[
  {
    "title": "History of modern Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_modern_Greece",
    "snippet": "Trikoupis and Deligiannis dominated Greek politics in the later 19th century, alternating in office. Trikoupis favoured co-operation with Great Britain in foreign affairs, the creation of infrastructure and an indigenous industry, raising protective tariffs and progressive social legislation, while the more populist Deligiannis depended on the promotion of Greek nationalism and the Megali Idea. Greece remained a very poor country throughout the 19th century.",
    "published": "2 weeks ago"
  },
  {
    "title": "Timeline of Modern Greek History",
    "url": "https://www.greekboston.com/culture/modern-history/timeline/",
    "snippet": "<strong>Shortly after the Greek War for Independence began, Greece set up a provisional government, which was in place from 1829 to 1832</strong>. In fact, the governments were actually set up during the War for Independence.",
    "published": "September 17, 2021"
  },
  {
    "title": "Modern Greek History | American School of Classical Studies at Athens",
    "url": "https://www.ascsa.edu.gr/research/gennadius-library/the-collections/modern-greek-history",
    "snippet": "The Library also contains many pamphlets addressing the critical period of the struggle for independence, from both Greece and other countries. In addition to the material that deals with the historical facts, this section also includes information about the Philhellenic movement, diplomatic transactions, biographies, cartography, pictorial representations and memorials, poetic, dramatic and romantic works on the War and manuscripts.",
    "published": null
  },
  {
    "title": "Greece - Unification, Modernization, Revolution | Britannica",
    "url": "https://www.britannica.com/place/Greece/Building-the-nation-1832-1913",
    "snippet": "Greece - Unification, Modernization, ... making of the treaty. <strong>Greece formally became a sovereign state, and the Greeks became the first of the subject peoples of the Ottoman Empire to gain full independence</strong>....",
    "published": "6 days ago"
  },
  {
    "title": "Ancient Greek Government - World History Encyclopedia",
    "url": "https://www.worldhistory.org/Greek_Government/",
    "snippet": "Ancient Greece witnessed a wide variety of government systems as people searched for the answers to such fundamental questions as who should rule and how? Should sovereignty lie in the rule of law, the constitution, officials, or the citizens? Not settling on a definitive answer, governments in the Greek world took extraordinarily diverse forms, from tyranny to democracy. Across different Greek city-states and over many centuries, political power expressed itself in different forms of government, often in the same city as it evolved.",
    "published": "March 20, 2018"
  }
]