[
  {
    "title": "Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Google",
    "snippet": "Google was founded on September 4, 1998, by American computer scientists <strong>Larry Page and Sergey Brin</strong>. Together, they own about 14% of its publicly listed shares and control 56% of its stockholder voting power through super-voting stock. The company went public via an initial public offering ...",
    "published": "3 days ago"
  },
  {
    "title": "History of Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Google",
    "snippet": "Google has its origins in &quot;BackRub&quot;, a research project started in 1996 by <strong>Larry Page and Sergey Brin</strong> when they were both PhD students at Stanford University in Stanford, California. The project initially involved an unofficial &quot;third founder&quot;, lead programmer Scott Hassan, who left before ...",
    "published": "14 hours ago"
  },
  {
    "title": "How we started and where we are today - Google - About Google",
    "url": "https://about.google/company-info/our-story/",
    "snippet": "Find out where it all began. Read the history of how Google has grown since <strong>Larry Page and Sergey Brin</strong> founded the company in 1998.",
    "published": null
  },
  {
    "title": "Google | History & Facts; Products & Services | Britannica Money",
    "url": "https://www.britannica.com/money/Google-Inc",
    "snippet": "Google is an American search engine company, founded in 1998 by <strong>Sergey Brin and Larry Page</strong>. Since 2015, Google has been a subsidiary of the holding company Alphabet, Inc. More than 70% of worldwide online search requests are handled by Google, ...",
    "published": null
  },
  {
    "title": "Google Is Founded | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/history/google-founded",
    "snippet": "&quot;Google Is Founded&quot; details the establishment of Google by Stanford University graduate students <strong>Sergey Brin and Larry Page</strong> in 1998. The narrative begins in the mid-1990s when the internet was becoming increasingly popular but lacked effective ...",
    "published": null
  }
]