[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "<strong>In 2009–10 Earps was promoted to Leicester City&#x27;s first team squad from the centre of excellence, to provide competition for regular goalkeeper Leanne Hall</strong>. The following season Earps signed for Nottingham Forest.",
    "published": "1 month ago"
  },
  {
    "title": "Mary Earps: PSG sign England goalkeeper on free transfer following Manchester United exit | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13161948/mary-earps-psg-sign-england-goalkeeper-on-free-transfer-following-manchester-united-exit",
    "snippet": "Mary Earps <strong>leaves Man Utd after five years at the club</strong>; England No 1 won the FA Cup in her final season; 31-year-old had been in talks with United over a new deal for two years but opts to join PSG on a three-year contract",
    "published": "July 11, 2024"
  },
  {
    "title": "Mary Earps stats and transfer history - AiScore",
    "url": "https://www.aiscore.com/player-mary-earps/ndkz6i9nzjgswq3",
    "snippet": "Mary Earps Transfer History and Transfer Fee <strong>2019/07/12 UTC, from VfL Wolfsburg (w) to Manchester United (w),</strong> - transfer fee. 2018/07/01 UTC, from Reading (w) to VfL Wolfsburg (w), - transfer fee. 2016/02/19 UTC, from Bristol City(w) to Reading (w), - transfer fee.",
    "published": null
  },
  {
    "title": "Mary Earps Transfers - Flashscore.com",
    "url": "https://www.flashscore.com/player/earps-mary/IsFSwJIa/transfers/",
    "snippet": "Help: You are on the player profile of Mary Earps, PSG. View Mary Earps transfers history including transfer fees, transfer value, contract length, career stats, news, injury updates or unique player ratings from previous matches. Follow player profiles (e.g.",
    "published": null
  },
  {
    "title": "Mary Earps transfer: Man Utd and England goalkeeper leaves club and set to join Paris Saint-Germain | Transfer Centre News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13160817/mary-earps-transfer-man-utd-and-england-goalkeeper-leaves-club-and-set-to-join-paris-saint-germain",
    "snippet": "<strong>Earps spent the last five years with United but her current deal had been winding down as the summer approached</strong>. United had been in talks with England&#x27;s No 1 for two years but were unable to reach an agreement with the goalkeeper.",
    "published": "June 29, 2024"
  }
]