[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: one to do business in the United States and legally named Regency Entertainment (USA), Inc., one to do business overseas and legally named Monarchy Enterprises S.á.r.l.",
    "published": "2 days ago"
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company <strong>formed in 1991 as a joint venture between Arnon Milchan, Scriba &amp; Deyle and Canal+</strong> to finance 20 films in five years, with New Regency Productions acting as its production and sales arm.",
    "published": "2 weeks ago"
  },
  {
    "title": "Regency Enterprises | Golden",
    "url": "https://golden.com/wiki/Regency_Enterprises-PPNRR5",
    "snippet": "Regency Enterprises is a privately held company involved in the video production industry and <strong>founded on January 1, 1982 by Arnon Milchan and Joseph Patrick Grace</strong>.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q466459",
    "snippet": "American entertainment company",
    "published": null
  },
  {
    "title": "Regency Enterprises | Corus Entertainment Fandom | Fandom",
    "url": "https://corusentertainment.fandom.com/wiki/Regency_Enterprises",
    "snippet": "<strong>Arnon Milchan rebranded Regency International Pictures and renamed it to Regency Enterprises</strong>. In addition to signing a distribution deal with Warner Bros., a subsidiary company New Regency Productions was also created.",
    "published": "October 29, 2024"
  }
]