[
  {
    "title": "List of Chelsea F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Chelsea_F.C._managers",
    "snippet": "Ron Suart has served as both caretaker and interim manager. <strong>José Mourinho</strong> has served two different periods as permanent manager, while Guus Hiddink has been interim manager twice.",
    "published": "3 days ago"
  },
  {
    "title": "Chelsea Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=536&teamTabs=managers",
    "snippet": "Our database is crammed with every football club you could possibly wish for ... A plethora of players ranging from Adebayor to Zamora. All you need to know to find out who is the best bet to score next ... From Allardyce to Zola, our massive manager database, with histories and win ratios, is sure to get your vote of confidence",
    "published": null
  },
  {
    "title": "Enzo Maresca - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Enzo_Maresca",
    "snippet": "In the end, Maresca led Chelsea to a fourth place finish, the first time that the club qualified for the UEFA Champions League since the 2021–22 season under <strong>Thomas Tuchel</strong>. On 28 May 2025, Maresca won his first trophy as the Chelsea manager by winning the UEFA Conference League after beating ...",
    "published": "3 days ago"
  },
  {
    "title": "Chelsea F.C. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chelsea_F.C.",
    "snippet": "After a poor start to the 2007–08 season, Mourinho was replaced by Avram Grant, who led the club to their first UEFA Champions League final, which they lost on penalties to Manchester United. The club did not turn a profit in the first nine years of Abramovich&#x27;s ownership, and made record losses of £140m in June 2005. In 2009, under caretaker manager Guus Hiddink, Chelsea won another FA Cup.",
    "published": "1 week ago"
  },
  {
    "title": "Chelsea Managers",
    "url": "https://www.bounder.friardale.co.uk/Managers.htm",
    "snippet": "Chelsea Managers · Comparison Of First 64 Matches Of Each Manager",
    "published": null
  }
]