[
  {
    "title": "List of chancellors of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_chancellors_of_Germany",
    "snippet": "This is a graphical lifespan timeline of the Chancellors of Germany since 1949.",
    "published": "1 week ago"
  },
  {
    "title": "List of chancellors of Germany by time in office - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_chancellors_of_Germany_by_time_in_office",
    "snippet": "This is a list of chancellors of Germany by time in office from <strong>1867 to 2025</strong>, including all the predecessor states of the current Federal Republic of Germany. This is based on the difference between dates; if counted by number of calendar days, ...",
    "published": "October 22, 2025"
  },
  {
    "title": "List of chancellors of Germany | Names & Years | Britannica",
    "url": "https://www.britannica.com/place/list-of-chancellors-of-Germany-2066807",
    "snippet": "This is a chronologically ordered list of chancellors of Germany.",
    "published": "May 31, 2016"
  },
  {
    "title": "List of Chancellors of Germany (1871-2025)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-chancellors-of-germany-1740401547-1",
    "snippet": "For these efforts, he was awarded the Nobel Peace Prize in 1971. <strong>Helmut Kohl, serving from 1982 to 1998</strong>, oversaw the reunification of East and West Germany in 1990 and was instrumental in establishing the European Union.",
    "published": "February 24, 2025"
  },
  {
    "title": "German Chancellors and Presidents - Behind the Name",
    "url": "https://www.behindthename.com/namesakes/list/german-chancellors/chrono",
    "snippet": "The office was <strong>established in 1919 during the Weimar Republic and re-established in 1949</strong> in West Germany. In German the Chancellor was originally called Reichskanzler meaning &quot;imperial chancellor&quot;. Since 1949 the title is Bundeskanzler meaning &quot;federal chancellor&quot; (the first female chancellor, ...",
    "published": null
  }
]