[
  {
    "title": "Italian Communist Party - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Italian_Communist_Party",
    "snippet": "It was established in Livorno as the Communist Party of Italy (Italian: Partito Comunista d&#x27;Italia, PCd&#x27;I) on 21 January 1921, when it seceded from the Italian Socialist Party (PSI), under the leadership of <strong>Amadeo Bordiga, Antonio Gramsci, and Nicola Bombacci</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Communist Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Communist_Party_(Italy)",
    "snippet": "Unlike other Italian communist organizations, the PC welcomes the historical figure of Joseph Stalin, though rejecting the definition of &quot;stalinism&quot;. It considers such a definition politically meaningless since during Stalin&#x27;s leadership there is no trace of elements of discontinuity or attempts of overcoming the Marxist–Leninist theory.",
    "published": "October 10, 2025"
  },
  {
    "title": "A Brief History of Italian Communism | Communist Crimes",
    "url": "https://communistcrimes.org/en/brief-history-italian-communism",
    "snippet": "However, despite the ideological vicinity to Soviet communism, the Italian Communist Party maintained the capacity to operate efficiently, even if on a municipal level. In fact, as of 1975, the PCI was the leading force in the majority of Italy’s biggest cities, most importantly Bologna, called “The Red One” because of its uninterrupted history of communist leadership.",
    "published": null
  },
  {
    "title": "The Rise and Fall of the Italian Communist Party | Stanford University Press",
    "url": "https://www.sup.org/books/history/rise-and-fall-italian-communist-party",
    "snippet": "Following three leaders of the Italian Communist Party (<strong>Antonio Gramsci, Palmiro Togliatti, and Enrico Berlinguer</strong>) from the First World War to the fall of the Soviet Union, Silvio Pons considers the broader relationship between communism and ...",
    "published": null
  },
  {
    "title": "The Rise and Fall of the Italian Communist Party: Introduction | Stanford University Press",
    "url": "https://www.sup.org/books/history/rise-and-fall-italian-communist-party/excerpt/introduction",
    "snippet": "To an empathetic and involved observer like Eric Hobsbawm, who assiduously frequented Italy and the milieu of the Italian left from the Fifties onward, communists and antifascists seemed the protagonists of a reaction to a sense of the country’s cultural and political marginality, which Fascism had aggravated.6 The socialist transformation of Italy was to remain a dream. Rightly or wrongly, however, the leading groups of Italian communism believed they had inherited a cosmopolitan tradition that was part of Italy’s long history and which they had to adapt to the ideological and global conditions of the twentieth century.",
    "published": null
  }
]