[
  {
    "title": "Anthony Albanese - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anthony_Albanese",
    "snippet": "Anthony Norman Albanese (/ˌælbəˈniːzi/ AL-bə-NEE-zee or /ˈælbəniːz/ AL-bə-neez; born 2 March 1963) is an Australian politician who has served since 2022 as the 31st prime minister of Australia. He has been the leader of the Labor Party since 2019 and the member of parliament (MP) for the New South Wales division of Grayndler since 1996. Albanese was born in Sydney, attended St Mary&#x27;s Cathedral College and studied economics at the University of Sydney. As a student, he joined the Labor Party and later worked as a party official and research officer before entering Parliament.",
    "published": "9 hours ago"
  },
  {
    "title": "Prime Minister of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Australia",
    "snippet": "Starting with the 1972 Australian federal election on 2 December 1972, <strong>Gough Whitlam</strong> and his deputy were sworn in on 5 December 1972 to form an interim government for two weeks, as the vote was being finalised and the full ministry makeup was being determined.",
    "published": "November 6, 2025"
  },
  {
    "title": "List of prime ministers of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Australia",
    "snippet": "The prime ministership of <strong>Frank Forde</strong>, who was prime minister for seven days in 1945, was the shortest in Australian history. Menzies served the longest, with eighteen years over two non-consecutive periods. The current prime minister is Anthony Albanese, who assumed office on 23 May 2022.",
    "published": "2 weeks ago"
  },
  {
    "title": "The Good, The Bad And The Unlikely: Australian's Prime Ministers: From Barton To Albanese | School of History",
    "url": "https://history.cass.anu.edu.au/research/publications/good-bad-and-unlikely-australians-prime-ministers-barton-albanese",
    "snippet": "<strong>Harold Holt</strong> spent three decades in parliament, only to disappear while swimming off the coast of Victoria just under two years into his first term. John Howard&#x27;s triple bypass is the stuff of legend. Julia Gillard overthrew Kevin Rudd and Kevin Rudd overthrew Julia Gillard, thus paving the ...",
    "published": null
  },
  {
    "title": "Prime Ministers | MOAD",
    "url": "https://apm-origin.moadoph.gov.au/prime-ministers",
    "snippet": "The Prime Minister is the head of the Australian Government. This position is achieved by being the leader of the party, or coalition, with a majority of seats in the House of Representatives. ... <strong>Anthony Albanese</strong> became Australia’s 31st Prime Minister when the Labor Party won office, replacing ...",
    "published": null
  }
]