[
  {
    "title": "Democratic Party (United States) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(United_States)",
    "snippet": "The Democratic Party is a liberal political party in the United States. Sitting on the center to center-left of the political spectrum, it is the world&#x27;s oldest active political party, having been founded in 1828.",
    "published": "9 hours ago"
  },
  {
    "title": "History of the Democratic Party (United States) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_the_Democratic_Party_(United_States)",
    "snippet": "The Democratic Party is one of the two major political parties of the United States political system and the oldest active political party in the country. Founded in 1828, the Democratic Party is the oldest active voter-based political party in the world. The party has changed significantly during its nearly two centuries of existence.",
    "published": "1 day ago"
  },
  {
    "title": "History of the Democratic Party (video)",
    "url": "https://www.khanacademy.org/humanities/us-government-and-civics/american-civics-parent/american-civics/v/history-of-the-democratic-party",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "Andrew Jackson: The American Franchise | Miller Center",
    "url": "https://millercenter.org/president/jackson/the-american-franchise",
    "snippet": "The Democratic party and its program emerged in stages out of the largely personal following that had elected <strong>Andrew Jackson</strong> President in 1828. As progressively defined by Jackson during his two terms, the party&#x27;s outlook was essentially ...",
    "published": "January 28, 2025"
  },
  {
    "title": "Who founded the Democratic Party and the Republican Party, and when were they founded? Why is there no American political party called 'the Liberal Party'? - Quora",
    "url": "https://www.quora.com/Who-founded-the-Democratic-Party-and-the-Republican-Party-and-when-were-they-founded-Why-is-there-no-American-political-party-called-the-Liberal-Party",
    "snippet": "Answer (1 of 4): The Democratic Party was founded by <strong>Thomas Jefferson</strong>… at first not an official “party” but as a group that opposed the policies of Alexander Hamilton, founder of the Federalist Party.",
    "published": null
  }
]