[
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "Sebastian Newbold Coe, Baron Coe, CH, KBE, Hon FRIBA (born 29 September 1956), often referred to as Seb Coe, is a <strong>British sports administrator, former politician and retired track and field athlete</strong>. As a middle-distance runner, Coe won four Olympic medals, including 1500 metres gold medals ...",
    "published": "November 18, 2025"
  },
  {
    "title": "Sebastian Coe | Biography, Runner, Olympics, Steve Ovett, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Sebastian-Coe",
    "snippet": "Sebastian Coe (born September 29, 1956, London, England) is a <strong>British athlete, who won four Olympic medals and set eight world records in middle-distance running</strong>.",
    "published": "5 days ago"
  },
  {
    "title": "Running My Life - The Autobiography: Winning On and Off the Track: Amazon.co.uk: Coe, Seb: 9781444732528: Books",
    "url": "https://www.amazon.co.uk/Running-My-Life-Autobiography-Winning/dp/1444732528",
    "snippet": "--Independent on Sunday It&#x27;s a proper autobiography in that it begins at the beginning...Coe&#x27;s direct prose drives this engrossing book. --Daily Telegraph · Sebastian Coe was <strong>born in London in 1956 and grew up in Sheffield</strong>.",
    "published": null
  },
  {
    "title": "Running My Life – The Autobiography by Seb Coe | Hachette UK",
    "url": "https://www.hachette.co.uk/titles/seb-coe/running-my-life-the-autobiography/9781444732535/",
    "snippet": "From sport Coe transferred his ideals to politics, serving in John Major’s Conservative government from 1992 to 1997 and developing ‘sharp elbows’ to become chief of staff to William Hague, leader of the Party from 1997 to 2001 and finally a member of the House of Lords. Running My Life is in turns exhilarating, inspiring, amusing, and extremely moving. Everyone knows where Sebastian Coe ended up.",
    "published": "June 29, 2024"
  },
  {
    "title": "Lord Sebastian Coe | Champions Speakers",
    "url": "https://champions-speakers.co.uk/speaker-agent/sebastian-coe",
    "snippet": "Lord Sebastian Coe is <strong>renowned for his former talent as a world record-breaking middle-distance runner who won four Olympic medals representing Great Britain</strong>. After his retirement, he led London&#x27;s successful Olympic bid and was chairman of the London Organising Committee for the Olympic Games.",
    "published": null
  }
]