[
  {
    "title": "Omar al-Bashir - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Omar_al-Bashir",
    "snippet": "From December 2018 onwards, al-Bashir faced large-scale protests which demanded his removal from power. On <strong>11 April 2019,</strong> Bashir was ousted in a military coup d&#x27;état.",
    "published": "3 days ago"
  },
  {
    "title": "2019 Sudanese coup d'état - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2019_Sudanese_coup_d'%C3%A9tat",
    "snippet": "A coup d&#x27;état took place in Sudan in the late afternoon on <strong>11 April 2019,</strong> when President Omar al-Bashir was overthrown by the Sudanese Armed Forces after popular protests demanded his departure.",
    "published": "2 weeks ago"
  },
  {
    "title": "Removal of President Omar al-Bashir and the Continued Pursuit of Justice - United States Holocaust Memorial Museum",
    "url": "https://www.ushmm.org/genocide-prevention/countries/sudan/removal-of-president-omar-al-bashir",
    "snippet": "In <strong>April 2019</strong> he was removed from office, and by August a civilian-military transitional government had formed. Since then, the difficult process of forming a new government has continued.",
    "published": null
  },
  {
    "title": "Omar al-Bashir | Alive, Now, Overthrown, Trial, Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Omar-Hassan-Ahmad-al-Bashir",
    "snippet": "He served as president from 1993 until he was <strong>overthrown in 2019.</strong> The International Criminal Court issued an arrest warrant for him, charging him with various crimes related to the crisis in Darfur.",
    "published": "December 9, 2008"
  },
  {
    "title": "Omar al-Bashir: Sudan's ousted president - BBC News",
    "url": "https://www.bbc.com/news/world-africa-16010445",
    "snippet": "Sudan&#x27;s ousted President Omar al-Bashir&#x27;s career has been defined by war. He came to power in a military coup in 1989 and ruled what was until 2011 Africa&#x27;s largest country with an iron fist.",
    "published": "August 14, 2019"
  }
]