[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The McClatchy Company bought Knight Ridder in June 2006 with intentions of selling 12 Knight Ridder newspapers. On August 2, 2006, McClatchy sold the Beacon Journal to Black Press. In 2018, <strong>GateHouse Media</strong> bought the newspaper. On November 11, 2013, the Akron Beacon Journal printed its last ...",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal Sold to GateHouse Media, Owner of Columbus Dispatch, Canton Repository",
    "url": "https://www.clevescene.com/news/akron-beacon-journal-sold-to-gatehouse-media-owner-of-columbus-dispatch-canton-repository-17221068/",
    "snippet": "The Akron Beacon Journal has been sold to <strong>Gatehouse Media</strong>, the largest publisher of daily newspapers in the United States and the owner of the Columbus Dispatch, the Canton Repository and a preponderance of smaller-town dailies.",
    "published": "June 2, 2025"
  },
  {
    "title": "Akron Beacon Journal 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/153167-50",
    "snippet": "Information on acquisition, funding, investors, and executives for Akron Beacon Journal. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Akron Beacon Journal from NewsBank | Shaker Heights Public Library",
    "url": "https://shakerlibrary.org/database_links/akron-beacon-journal-from-newsbank/",
    "snippet": "NewsBank gathers the major domestic and international news headlines and articles of the day. Founded in 1839, the Akron Beacon Journal is a four-time Pulitzer Prize-winning newspaper that serves readers in Summit, Medina, Portage, Stark, and Wayne counties. Read the Akron Beacon Journal from today or search past editions going back to 1984.",
    "published": null
  },
  {
    "title": "Akron Beacon Journal: Contact Information, Journalists, and Overview | Muck Rack",
    "url": "https://muckrack.com/media-outlet/akronbeacon",
    "snippet": "By Brad Bournival Verified | Akron Beacon Journal Verified Dec. 15, 2025, 3:18 p.m. ETMartin Poder has resigned as the football coach at Stow-Munroe Falls High School to take a job in the private sector. Poder is returning to the private sector as a regional sales manager, a role that requires extensive travel.",
    "published": null
  }
]