[
  {
    "title": "Sundar Pichai - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sundar_Pichai",
    "snippet": "Pichai was selected to become the next CEO of Google on <strong>August 10, 2015,</strong> after previously being appointed chief product officer by then CEO Larry Page. On October 24, 2015, he stepped into the new position at the completion of the formation of Alphabet Inc., the new holding company for the ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Sundar Pichai | Biography, Google, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Sundar-Pichai",
    "snippet": "Sundar Pichai <strong>became CEO of Google in 2015 and CEO of Alphabet in 2019.</strong> He has held roles such as vice president of product development, senior vice president, and product chief.",
    "published": null
  },
  {
    "title": "From PM to CEO: How Sundar Pichai’s Background in Product Paved the Way for Becoming CEO at Google",
    "url": "https://www.productplan.com/learn/sundar-pichai-product-manager-to-ceo/",
    "snippet": "Next up was a management consulting role with McKinsey &amp; Company. He then joined Google in 2004, and <strong>11 years later found himself named CEO as part of the Alphabet reorganization of the firm</strong>.",
    "published": "July 8, 2025"
  },
  {
    "title": "Sundar Pichai: The Journey to Becoming the CEO of Google",
    "url": "https://startuptalky.com/sundar-pichai-story/",
    "snippet": "<strong>In 2015, Pichai became the next CEO of Google and stepped into the new position after completing the formation of Alphabet Inc.</strong>, the latest holding for Google’s family. In 2017, he was appointed to the Board of Directors in Alphabet Inc.",
    "published": "April 3, 2025"
  },
  {
    "title": "Google CEO Sundar Pichai turns 52: A look at his journey over years - The Times of India",
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/google-ceo-sundar-pichai-turns-52-a-look-at-his-journey-over-years/articleshow/110864404.cms",
    "snippet": "He <strong>joined Google in 2004 and was named as its CEO in 2015.</strong> Here’s a look at Pichai’s journey from Madurai to leading Google over the years · Pichai was born to a Tamil Brahmin family.",
    "published": "June 10, 2024"
  }
]