[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Larive <strong>began her career as a professor in the chemistry department at the University of Kansas, and later joined the faculty of the University of California, Riverside, in 2005.</strong>",
    "published": "July 15, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Siendo la undécima rectora de la Universidad de California en Santa Cruz, <strong>Cynthia Larive</strong> encabeza una institución mundialmente reconocida por sus investigaciones de alto impacto, en pos de soluciones interdisciplinarias a los mayores retos mundiales, y por su compromiso con la justicia social ...",
    "published": null
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "Before taking the role, she <strong>served as provost and executive vice chancellor at UC Riverside, and served in various administrative roles after beginning her career as a chemistry professor at the University of Kansas in 1992</strong>.",
    "published": "August 22, 2025"
  },
  {
    "title": "Cynthia K. Larive - Chancellor at UC Santa Cruz | The Org",
    "url": "https://theorg.com/org/uc-santa-cruz/org-chart/cynthia-k-larive",
    "snippet": "Before arriving at UCR, Larive was a <strong>professor of chemistry at the University of Kansas</strong>, where she began what has become a productive and successful research career. She has over 155 publications, has mentored 30 Ph.D and M.S. students, and ...",
    "published": null
  },
  {
    "title": "Cynthia K. Larive - DART",
    "url": "https://mbdart.org/invited-speakers/cynthia-k-larive/",
    "snippet": "An accomplished bioanalytical chemist, Larive came to UC Santa Cruz from UC Riverside, where she was <strong>provost and executive vice chancellor</strong>. As provost, she was responsible for the academic enterprise, managing large-scale initiatives as well ...",
    "published": "August 25, 2023"
  }
]