[
  {
    "title": "2025 World Athletics Championships - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_World_Athletics_Championships",
    "snippet": "In October 2019, World Athletics president Sebastian Coe stated consideration of a direct choice for Kenya to host this championship. Kenya confirmed its bid for the championships in October 2021. In 2022, Japan and Singapore entered bids to host the championships. In July 2022, Tokyo was selected by World Athletics to host the 2025 event, after it scored the highest in the bid evaluation.",
    "published": "1 week ago"
  },
  {
    "title": "Nominees announced for 2025 Member Federations Award | World Athletics",
    "url": "https://worldathletics.org/awards/news/nominees-2025-member-federations-award",
    "snippet": "Spain delivered strong results in 2025, including a record medal haul at the European U20 Championships in Tampere and a competitive presence at the World Athletics Championships Tokyo 25. The country hosted the European Team Championships 1st Division in Madrid, while it expanded youth and community athletics initiatives across regions. Under new leadership, the federation enhanced governance and modernisation practices, ensuring transparency and efficiency.",
    "published": null
  },
  {
    "title": "‘Your column was very unfair’: what happened when I met World Athletics CEO | Athletics | The Guardian",
    "url": "https://www.theguardian.com/sport/2025/dec/02/athletics-joining-sports-goliaths-long-way-to-go",
    "snippet": "And the biggest sporting event in the world in 2025 was our event in Tokyo. I don’t say this complacently, but it says growth, right?” · He’s not finished. “And we’re not just sitting passively back going: ‘Gen Z is tough – let’s rely on our middle-aged audience!’” · But there is a glint in his eye when Ridgeon talks and explains that World Athletics had 700 million video views on its social media channels at the world championships in September – double that of Budapest two years ago.",
    "published": "3 weeks ago"
  },
  {
    "title": "Riden Named Head Women's Manager For World Athletics Championships Tokyo 2025 - University of North Carolina Athletics",
    "url": "https://goheels.com/news/2025/4/29/track-field-riden-named-head-womens-manager-for-world-athletics-championships-tokyo-2025",
    "snippet": "North Carolina Associate Director of Track and Field, Jessica Riden, has been named the Head Women&#x27;s Manager on World Athletics Championships Tokyo 2025 staf...",
    "published": null
  },
  {
    "title": "World Athletics aims to build on successful year and forge lasting geopolitical relationships during unprecedented 2026 | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/successful-year-lasting-geopolitical-relationships-unprecedented-2026",
    "snippet": "World Athletics President <strong>Sebastian Coe</strong> reflected on a successful year for the organisation at the 239th World Athletics Council Meeting in Monaco and reinforced how 2026 offers an unprecedented opportunity to build lasting geopolitical and ...",
    "published": null
  }
]