[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "<strong>Viktor Yushchenko, Petro Poroshenko, and Viktor Yanukovych served one term, with the latter being replaced by acting president Oleksandr Turchynov</strong>, who then also served as Chairman of the Ukrainian Parliament, on 21 February 2014. Oleksandr Turchynov was the only acting president in Ukraine&#x27;s ...",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "The current office was formed when the Verkhovna Rada of the Ukrainian Soviet Socialist Republic passed a law on 5 July 1991 establishing the office of the &quot;President of the Ukrainian Soviet Socialist Republic.&quot; Upon the declaration of Ukrainian independence from the Soviet Union on 24 August 1991, the title was changed to &quot;President of Ukraine&quot;.",
    "published": "October 25, 2025"
  },
  {
    "title": "Ukraine’s Presidents, Power Elites, and the Country’s Evolution | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/ukraines-presidents-power-elites-and-countrys-evolution",
    "snippet": "Kravchuk’s successor, Leonid Kuchma (1994–2005), was president for 10 years, during which time the contemporary Ukrainian political and economic systems—with their successes and failures—were constructed. Under his presidency, among other things, Ukraine established a market economy, and in 1996 adopted a new constitution and introduced a national currency. However, during his time in office, the oligarchy was formed and privatization reached its peak.",
    "published": null
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "<strong>Viktor Yanukovych was toppled after months of popular protests, and that May billionaire Petro Poroshenko was elected president of Ukraine</strong>. With a Russian-backed insurgency raging in eastern Ukraine and endemic corruption undermining public ...",
    "published": "September 27, 2019"
  },
  {
    "title": "Viktor Yanukovych | Facts, Biography, Maidan Protests, & Flight to Russia | Britannica",
    "url": "https://www.britannica.com/biography/Viktor-Yanukovych",
    "snippet": "<strong>Viktor Yanukovych</strong> (born July 9, 1950, Yenakiyeve, Ukraine, U.S.S.R. [now in Ukraine]) is a Ukrainian politician who served as prime minister (2002–05, 2006–07) and president (2010–14) of Ukraine.",
    "published": "February 9, 2010"
  }
]