[
  {
    "title": "Bombardier Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bombardier_Inc.",
    "snippet": "(French: [bɔ̃baʁdje]) is a Canadian aerospace manufacturer which produces business jets. Headquartered in Montreal, the company was <strong>founded in 1942 in Valcourt by Joseph-Armand Bombardier to market his snowmobiles</strong>; it later became one of the world&#x27;s biggest producers of aircraft and trains.",
    "published": "October 20, 2025"
  },
  {
    "title": "Bombardier Inc. | Aerospace, Rail & Transportation Solutions | Britannica Money",
    "url": "https://www.britannica.com/money/Bombardier-Inc",
    "snippet": "A second line of descent for the modern company dates to 1902 with the founding of the Locomotive and Machine Company of Montreal Ltd. After its purchase by the American Locomotive Company (Alco), the firm became known as Montreal Locomotive Works Limited (MLW) in 1908. In the late 1960s, with the acquisition of most of the assets of Alco by Worthington Corporation, MLW became MLW-Worthington. Bombardier Limited and MLW-Worthington merged in 1976 to form Bombardier-MLW Ltd., which assumed the name Bombardier Inc.",
    "published": null
  },
  {
    "title": "Bombardier Inc. - Company Profile, Information, Business Description, History, Background Information on Bombardier Inc.",
    "url": "https://www.referenceforbusiness.com/history2/56/Bombardier-Inc.html",
    "snippet": "Bombardier soon found himself besieged with 20 orders for the innovative vehicle, and he quickly assembled a work crew—comprised largely of relatives and friends—in order to begin manufacturing B7s for country doctors, veterinarians, telephone companies, foresters, and others who benefited from easy winter travel.",
    "published": null
  },
  {
    "title": "Bombardier | Company Overview & News",
    "url": "https://www.forbes.com/companies/bombardier/",
    "snippet": "The Transportation segment offers ... system integration, signaling, and e-mobility solutions. The company was founded on <strong>June 19, 1902</strong> and is headquartered in Montreal, Canada....",
    "published": null
  },
  {
    "title": "History Of Bombardier | CharterJets Inc.",
    "url": "https://charterjetsinc.com/history-of-bombardier/",
    "snippet": "1989 Bombardier Aviation is a ... jet manufacturer and service provider.Bombardier was <strong>founded on the innovative and entrepreneurial spirit of a teenage mechanic</strong>....",
    "published": "May 16, 2022"
  }
]