[
  {
    "title": "Nalini Anantharaman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nalini_Anantharaman",
    "snippet": "Anantharaman was included for her work in &quot;quantum chaos, dynamical systems and Schrödinger equation, including a remarkable advance in the problem of quantum unique ergodicity&quot;. In 2011 she won the Salem Prize which is awarded for work associated with the Fourier Series. She also took the Grand Prix Jacques Herbrand from the French Academy of Sciences in 2011. In 2015, Nalini Anantharaman was elected to be a member of the Academia Europaea.",
    "published": "August 7, 2025"
  },
  {
    "title": "Nalini Anantharaman | Académie des sciences",
    "url": "https://www.academie-sciences.fr/en/nalini-anantharaman",
    "snippet": "Nalini Anantharaman is a professor at the IRMA Institute for Advanced Mathematical Research (CNRS/Université de Strasbourg). <strong>After a thesis in mathematics defended in 2000, Nalini Anantharaman became a lecturer at ENS Lyon, then a research fellow at CNRS and a professor at Université Paris-Sud</strong>.",
    "published": null
  },
  {
    "title": "Nalini Anantharaman",
    "url": "https://grokipedia.com/page/Nalini_Anantharaman",
    "snippet": "Following her PhD in 2000 from ... in France, including <strong>maître de conférences at the École Normale Supérieure de Lyon (2001–2006) and CNRS researcher at the École Polytechnique (2006–2009).</strong>[13][3] These roles allowed ...",
    "published": null
  },
  {
    "title": "Nalini Anantharaman - USIAS - University of Strasbourg",
    "url": "https://www.usias.fr/en/chairs/nalini-anantharaman/",
    "snippet": "Nalini Anantharaman is a French mathematician who has won major prizes, including the Henri Poincaré Prize in 2012. She <strong>attended the Ecole normale supérieure (ENS) and stayed in Paris to go on to complete her PhD at the Pierre and Marie Curie University in 2000</strong>, under the supervision of François ...",
    "published": null
  },
  {
    "title": "Nalini Anantharaman | Collège de France",
    "url": "https://www.college-de-france.fr/en/person/nalini-anantharaman",
    "snippet": "Nalini Anantharaman&#x27;s research focuses on the geometric description of wave propagation. It combines dynamical systems theory, partial differential equations, symplectic and Riemannian geometry, and probability theory.",
    "published": "February 19, 2025"
  }
]