[
  {
    "title": "Achille Occhetto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Achille_Occhetto",
    "snippet": "Achille Leone Occhetto (Italian pronunciation: [aˈkille okˈketto] ⓘ; born 3 March 1936) is an Italian politician. He served as the last secretary-general of the Italian Communist Party (PCI) between <strong>1988 and 1991</strong>, and was the first leader of the Democratic Party of the Left (PDS), the ...",
    "published": "July 26, 2025"
  },
  {
    "title": "Achille Occhetto",
    "url": "https://grokipedia.com/page/Achille_Occhetto",
    "snippet": "By the mid-1980s, Occhetto&#x27;s regional work in Sicily had built his reputation for pragmatic leadership, bridging ideological commitments with empirical adaptations to southern realities, though party results plateaued amid declining national communist support—evident in the PCI&#x27;s 18.5% share in the 1983 general elections, with Sicily mirroring weaker turnout due to abstention rates exceeding 25% in urban areas.[16] This period laid groundwork for his national roles without resolving core electoral barriers tied to the party&#x27;s Soviet alignment. Achille Occhetto was elected secretary-general o",
    "published": null
  },
  {
    "title": "Achille Occhetto | Italian politician | Britannica",
    "url": "https://www.britannica.com/biography/Achille-Occhetto",
    "snippet": "Other articles where Achille Occhetto is discussed: Italy: Emergence of the second republic: Under its new leader, Achille Occhetto, the Communist Party adopted a more moderate program and, in 1991, even took a new name: the Democratic Party of the Left (Partito Democratico della Sinistra; PDS).",
    "published": null
  },
  {
    "title": "Achille Occhetto (born March 3, 1936), Italian Italian government official | World Biographical Encyclopedia",
    "url": "https://prabook.com/web/achille.occhetto/271299",
    "snippet": "Member Leadership Italian Communist Party. Head of Section for Schools. Reelected Deputy, 1983. Member Committee on Constitutional Affairs. Member Parliamentary Committee of Inquiry on the P2 Masonic Lodge. Re-elected Deputy, 1987. Member Committee on Constitutional Affairs, Presidency of the Council and Internal Affairs. Vice-Sec., Italian Communist Party. Member of the European Parliament. since 1989. Journalist. ... Achille OCCHETTO, Italian General Secretary, Partito Democrático della Sinistra (PDS, Democratic Party of the Left).",
    "published": null
  },
  {
    "title": "The ‘new beginning’: The Italian communist party under the leadership of Achille Occhetto: Journal of Communist Studies: Vol 6, No 3",
    "url": "https://www.tandfonline.com/doi/abs/10.1080/13523279008415035",
    "snippet": "When Achille Occhetto became general secretary of the PCI in the summer of 1988 he inherited a party that was politically isolated at the national level and declining both electorally and organizat...",
    "published": null
  }
]