[
  {
    "title": "Politics of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Kyrgyzstan",
    "snippet": "<strong>Political insurgency in Kyrgyzstan amplified following controversy about the conduct of October 2020 Kyrgyz parliamentary election</strong>, where only four parties met the 7% threshold to achieve parliamentary representation, three of whom were closely aligned with the government.",
    "published": "3 weeks ago"
  },
  {
    "title": "BTI 2024 Kyrgyzstan Country Report: BTI 2024",
    "url": "https://bti-project.org/en/reports/country-report/KGZ",
    "snippet": "While a constitutional law governing the institution is still being drafted, the first congressional meeting was convened in November 2022 by presidential decree. However, the meeting resulted in no notable political outcome. ... Kyrgyzstan’s key democratic institutions have seen their legitimacy eroded since late 2020.",
    "published": null
  },
  {
    "title": "Understanding the Political Crisis in Kyrgyzstan | Lawfare",
    "url": "https://www.lawfaremedia.org/article/understanding-political-crisis-kyrgyzstan",
    "snippet": "Kyrgyzstan has had only five presidents since its independence: Among them, <strong>Akayev and Bakiev are currently living in self-imposed exile abroad and Atambayev was imprisoned until he was freed by protestors during the current unrest</strong>. Babanov likewise left for Russia immediately after his defeat ...",
    "published": "January 18, 2023"
  },
  {
    "title": "Kyrgyzstan is losing its status as Central Asia’s only democracy",
    "url": "https://www.economist.com/asia/2025/12/04/kyrgyzstan-is-losing-its-status-as-central-asias-only-democracy",
    "snippet": "KYRGYZSTAN USED to be an exception in Central Asia: the sole democracy in a region run by strongmen, albeit a flawed one. That is rapidly ceasing to be the case. It regressed a bit closer to the mean on November 30th, when a parliamentary election produced victory for candidates loyal to Sadyr Japarov, the increasingly authoritarian president.",
    "published": "2 weeks ago"
  },
  {
    "title": "Kyrgyzstan: Country Profile | Freedom House",
    "url": "https://freedomhouse.org/country/kyrgyzstan",
    "snippet": "<strong>Governing coalitions proved unstable, however, and corruption remains pervasive. Unrest surrounding the annulled 2020 parliamentary elections led to significant political upheaval and the violent repression of opponents of nationalist politician Sadyr Japarov</strong>...",
    "published": null
  }
]