[
  {
    "title": "Presidential Election 2025 Greece",
    "url": "https://www.robert-schuman.eu/en/monitor/6474-konstantinos-tasoulas-is-elected-president-of-greece",
    "snippet": "<strong>Konstantinos Tasoulas</strong> is elected President of Greece",
    "published": null
  },
  {
    "title": "A veteran conservative lawmaker is sworn in as Greece’s new president | AP News",
    "url": "https://apnews.com/article/greece-president-politics-tassoulas-db1f4771e16254a234a713908c01f5b7",
    "snippet": "Greece’s new President <strong>Constantine Tassoulas</strong>, right, takes an oath next to Archbishop of Athens and All Greece Ieronimos during the swearing in ceremony at the Parliament, in Athens, Greece, Thursday, March 13, 2025.",
    "published": "March 13, 2025"
  },
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "The president of Greece, officially the president of the Hellenic Republic (Greek: Πρόεδρος της Ελληνικής Δημοκρατίας, romanized: Próedros tis Ellinikís Dimokratías), commonly referred to in Greek as the president of the Republic (Πρόεδρος της Δημοκρατίας, Próedros tis Dimokratías, ΠτΔ), is the head of state of Greece. The president is elected by the Hellenic Parliament; the role has been mainly ceremonial since the 1986 constitutional reform. The office was formally established by the Constitution of Greece in 1975, but has antecedents in the Second Hellenic Republic of 1924–1935 and the Greek junta in 1973–1974 which predated the transition to the current Third Hellenic Republic.",
    "published": "2 weeks ago"
  },
  {
    "title": "Greece elects former parliament speaker as new president | Reuters",
    "url": "https://www.reuters.com/world/europe/greece-elects-former-parliament-speaker-new-president-2025-02-12/",
    "snippet": "[1/4]Greek prime minister <strong>Kyriakos Mitsotakis</strong> and his party&#x27;s lawmakers applaud after the conclusive vote for the Greek president, at the Greek parliament in Athens, Greece, February 12, 2025.",
    "published": "February 12, 2025"
  },
  {
    "title": "Greece Government 2024, CIA World Factbook",
    "url": "https://theodora.com/wfbcurrent/greece/greece_government.html",
    "snippet": "chief of state: President <strong>Ekaterini SAKELLAROPOULOU</strong> (since 13 March 2020) head of government: Prime Minister Kyriakos MITSOTAKIS (since 26 June 2023) cabinet: Cabinet appointed by the president on the recommendation of the prime minister elections/appointments: president elected by Hellenic ...",
    "published": null
  }
]