[
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: ... Прогресса, Partiya Progressa), is a banned opposition political party in Russia <strong>founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018</strong> by Alexei Navalny, who was also the founder of the non-profit organisation ...",
    "published": "1 month ago"
  },
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "In a 2011 interview, he described ... <strong>a &quot;party of crooks and thieves&quot;, which became a popular byname</strong>. Navalny and the FBK have published investigations detailing alleged corruption by high-ranking Russian officials and their associates. Navalny twice received a suspended sentence for embezzlement, ...",
    "published": "1 week ago"
  },
  {
    "title": "Kremlin Foe Navalny Launches New Political Party",
    "url": "https://www.rferl.org/a/russia-navalny-new-political-party/29237240.html",
    "snippet": "Russian opposition leader Aleksei ... Vladimir Putin. The new party, called Russia Of The Future, was <strong>created at a May 19 founding convention in Moscow</strong>, Lybov Sobol, a senior associate of the Kremlin critic, said on ...",
    "published": "May 19, 2018"
  },
  {
    "title": "Alexei Navalny, Russia",
    "url": "https://www.europarl.europa.eu/cmsdata/240201/Profile of the 2021 Sakharov Prize nominee, Alexei Navalny.pdf",
    "snippet": "<strong>strongest opposition candidate to the ruling party in Russia</strong>. Navalny was a member of the · Russian Opposition Coordination Council and is the leader of the Russia of the Future party as · well as the founder of the Anti-Corruption Foundation (FBK). The FBK has published ·",
    "published": null
  },
  {
    "title": "Russian Supreme Court liquidates ‘Russia of the Future’ — the party that kept Navalny from registering his political party back in 2019 — Meduza",
    "url": "https://meduza.io/en/news/2020/09/21/russian-supreme-court-liquidates-russia-of-the-future-the-party-that-kept-navalny-from-registering-his-political-party-back-in-2019",
    "snippet": "The “Russia of the Future” party that was dismantled on Monday, September 21, first appeared on the Justice Ministry’s list of registered political parties at the end of May 2019. Navalny had submitted the documents to register his party earlier that same month.",
    "published": null
  }
]