[
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "Greta Conway Van Susteren (born June 11, 1954) is an American journalist, lawyer, and television news anchor for Newsmax TV. She was previously on CNN, Fox News, and MSNBC. She hosted Fox News&#x27;s On the Record w/ Greta Van Susteren for 14 years (2002–2016) before departing for MSNBC, where she hosted For the Record with Greta for roughly six months in 2017.",
    "published": "August 20, 2025"
  },
  {
    "title": "Newsmax Inks Greta Van Susteren to Multi-Year Contract Extension - Barrett Media",
    "url": "https://barrettmedia.com/2025/04/11/newsmax-inks-greta-van-susteren-to-multi-year-contract-extension/",
    "snippet": "<strong>Newsmax has announced it has signed anchor Greta Van Susteren to a new, multi-year contract extension to remain with the cable network</strong>.",
    "published": "April 11, 2025"
  },
  {
    "title": "Greta Van Susteren Signs New Deal With Newsmax",
    "url": "https://deadline.com/2025/04/greta-van-susteren-signs-new-deal-with-newsmax-1236366410/",
    "snippet": "Ashleigh Banfield To Lead True Crime Vertical For NewsNation, Will Depart Primetime Show · Donald Trump Signs Executive Order To Sideline State AI Laws ... Greta Van Susteren has signed a multi-year deal to continue hosting Newsmax‘s The Record with Greta Van Susteren.",
    "published": "April 11, 2025"
  },
  {
    "title": "Greta Van Susteren Signs Multi-Year Renewal with Newsmax | Nasdaq",
    "url": "https://www.nasdaq.com/press-release/greta-van-susteren-signs-multi-year-renewal-newsmax-2025-04-11",
    "snippet": "BOCA RATON, FL/ ACCESS Newswire/ April 11, 2025/ Newsmax Inc. today announced that veteran news anchor and broadcaster Greta Van Susteren has signed a multi-year extension to host &quot;<strong>The Record with Greta Van Susteren.&quot;.</strong> Based in Washington, D.C., ...",
    "published": null
  },
  {
    "title": "Newsmax to Make Lineup Changes Including Greta Van Susteren and Carl Higbie - Barrett Media",
    "url": "https://barrettmedia.com/2025/09/03/newsmax-to-make-lineup-changes-including-greta-van-susteren-and-carl-higbie/",
    "snippet": "September 3, 2025 · - Advertisement ... and Carl Higbie changing timeslots. <strong>Beginning on Monday, September 8th, the network will move The Record with Greta Van Susteren to the 4 PM ET timeslot</strong>....",
    "published": "September 3, 2025"
  }
]