[
  {
    "title": "Josep Borrell - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Josep_Borrell",
    "snippet": "On 15 May 2024, Borrell called on Israel to immediately halt its assault on Rafah, stating it was disrupting humanitarian aid and causing a humanitarian crisis, while also calling on Hamas to release all Israeli hostages. Borrell condemned the Tel al-Sultan attack, saying that Israel&#x27;s military actions needed to stop. In May 2025, after his retirement as an EU diplomat, Borrell spoke out against Israel&#x27;s actions, accusing Israel of committing genocide in Gaza.",
    "published": "3 weeks ago"
  },
  {
    "title": "Josep Borrell begins his term as President of CIDOB | CIDOB",
    "url": "https://www.cidob.org/en/news/josep-borrell-begins-his-term-president-cidob",
    "snippet": "CIDOB Apr 02 2025 · Following his appointment by the institution’s Board on 13 December, the former head of European diplomacy has begun his agenda as <strong>President of CIDOB</strong>, a leading think tank in international relations based in Barcelona. In his first hours as President of the institution, ...",
    "published": null
  },
  {
    "title": "EEAS: High Representative Josep Borrell announces senior nominations | EEAS",
    "url": "https://www.eeas.europa.eu/eeas/eeas-high-representative-josep-borrell-announces-senior-nominations-5_en",
    "snippet": "Josep Borrell, <strong>High Representative of the Union for Foreign Affairs and Security Policy/Vice-President of the European Commission</strong> also announces the nomination of two Heads of Delegation of the European Union.",
    "published": null
  },
  {
    "title": "Josep Borrell",
    "url": "https://www.realinstitutoelcano.org/en/biographies/josep-borrell/",
    "snippet": "Josep Borrell is <strong>Senior Distinguished Fellow at the Elcano Royal Institute, and president of CIDOB (Barcelona Centre for International Affairs).</strong>",
    "published": "April 10, 2025"
  },
  {
    "title": "Borrell’s U.S. Broadside Reveals the EU Elite’s Post-National Turn",
    "url": "https://europeanconservative.com/articles/news/borrells-u-s-broadside-reveals-the-eu-elites-post-national-turn/",
    "snippet": "— December 12, 2025 · Josep Borrell’s latest outburst as <strong>former High Representative</strong>—accusing the United States of wanting “a white Europe divided into nations”—has triggered a political shockwave that reveals far more than he intended.",
    "published": "4 days ago"
  }
]