[
  {
    "title": "Hemedti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hemedti",
    "snippet": "<strong>Muhammad Hamdan Dagalo Musa</strong> (born c. 1973-1975), commonly known by the mononym Hemedti, is a Sudanese military officer and politician who is serving as the chairman of the presidential council of the Government of Peace and Unity since 2025.",
    "published": "4 days ago"
  },
  {
    "title": "Sudan conflict: Who is RSF leader Mohamed Hamdan 'Hemedti' Dagalo?",
    "url": "https://www.bbc.com/news/articles/c3vn17r29v9o",
    "snippet": "4 November 2025 · ShareSave · Alex de WaalAfrica analyst · ShareSave · Anadolu via Getty Images · <strong>Mohamed Hamdan Dagalo</strong>, known as &quot;Hemedti&quot;, has emerged as a dominant figure on Sudan&#x27;s political stage, with his paramilitary Rapid Support ...",
    "published": "November 4, 2025"
  },
  {
    "title": "Speak Out On Sudan",
    "url": "https://www.speakoutonsudan.org/",
    "snippet": "Date: December 16, 2025 Time: 3pm start of demonstration (game begins at 5:30pm) Location: Meet at Toshiba Plaza (3780 Las Vegas Blvd. S) across from the main entrance of T-Mobile Arena · Millions of people in Sudan today are facing famine, mass atrocities, and the largest forced displacement and humanitarian crisis in the world.",
    "published": null
  },
  {
    "title": "RSF's Hemedti sworn in as head of parallel Sudanese government | Reuters",
    "url": "https://www.reuters.com/world/africa/rsfs-hemedti-sworn-head-parallel-sudanese-government-2025-08-30/",
    "snippet": "CAIRO, Aug 30 (Reuters) - <strong>Mohamed Hamdan Dagalo</strong>, head of the paramilitary Rapid Support Forces, was sworn in as the head of a parallel Sudanese government, the government said in a statement, pushing the country a step closer towards de facto ...",
    "published": "August 30, 2025"
  },
  {
    "title": "Treasury Sanctions Sudanese Paramilitary Leader, Weapons Supplier, and Related Companies | U.S. Department of the Treasury",
    "url": "https://home.treasury.gov/news/press-releases/jy2772",
    "snippet": "WASHINGTON — Today, the Department of the Treasury’s Office of Foreign Assets Control (OFAC) is sanctioning <strong>Mohammad Hamdan Daglo Mousa</strong> (Hemedti), the leader of Sudan’s Rapid Support Forces (RSF), under Executive Order (E.O.) 14098, ...",
    "published": "January 7, 2025"
  }
]