[
  {
    "title": "President of Chile - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Chile",
    "snippet": "The shorter term (previously it was six years) allows for synchronized parliamentary and presidential elections. The president&#x27;s official seat is the La Moneda Palace in the capital Santiago. <strong>Michelle Bachelet</strong> was the first female president of Chile and served twice, from 2006 to 2010 and again ...",
    "published": "10 hours ago"
  },
  {
    "title": "Chile elects most right-wing leader since Pinochet – in line with regional drift, domestic tendency to punish incumbents",
    "url": "https://theconversation.com/chile-elects-most-right-wing-leader-since-pinochet-in-line-with-regional-drift-domestic-tendency-to-punish-incumbents-272042",
    "snippet": "Despite the momentous shift heralded by Kast’s election, though, it is unlikely to change one of the principal challenges of Chile’s democracy in the 21st century: voter discontent and disenchantment. There has been a consistent trend for the government in power to lose popular support and face strong headwinds in Congress from the opposition. For all the celebration happening right now for Kast and his supporters, it is hard to see that changing once the new government takes office in March 2026.",
    "published": "17 hours ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "The ultra-conservative former congressman <strong>José Antonio Kast</strong> has been elected as Chile’s next president. With more than 99% of polling stations counted, Kast took 58.16% of the vote, against 41.84% for the leftist Jeannette Jara, a former ...",
    "published": "11 hours ago"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "In his first speech to supporters as president-elect, Kast said: &quot;Chile will once again be free from crime, free from anguish, free from fear.&quot; &quot;Criminals, delinquents - their lives are going to change. We&#x27;re going to look for them, find them, judge them and then we&#x27;re going to lock them up,&quot; he added. At a gathering of his backers in the capital Santiago, many draped in Chilean flags, chanting and taking selfies, there was jubilation as the results came through.",
    "published": "2 days ago"
  },
  {
    "title": "Gabriel Boric - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gabriel_Boric",
    "snippet": "<strong>Gabriel Borić Font</strong> (Spanish: [ɡaˈβɾjel ˈβoɾitʃ ˈfont]; born 11 February 1986) is a Chilean politician who has served as the 37th president of Chile since 2022. A socialist, he was previously a member of the Chamber of Deputies for ...",
    "published": "2 days ago"
  }
]