[
  {
    "title": "Downey Family Continues to Impact NECC | The New England Center for Children",
    "url": "https://www.necc.org/downey-family-continues-to-impact-necc/",
    "snippet": "Through the years, the younger Mike, <strong>his wife Kelley and their four daughters</strong> have participated in many of NECC’s fundraising events. From fielding a 5K team to hosting a lemonade stand on the Cape, the Downey family is a model of compassion, ...",
    "published": "October 29, 2020"
  },
  {
    "title": "Mike Downey (producer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mike_Downey_(producer)",
    "snippet": "Michael Downey OBE is an Irish-British film producer. He is the co-founder and CEO of Film and Music Entertainment and as of 2020 the Chairman of the European Film Academy. Downey was born in Devon, England, the son of <strong>Brigid Downey (née Flood) and Thomas Downey</strong>, who were economic migrants ...",
    "published": "July 19, 2025"
  },
  {
    "title": "Michael Joseph Downey - Pizzi Funeral Home",
    "url": "https://pizzifuneralhome.com/?p=7837",
    "snippet": "Michael Joseph Downey, 57, a devoted husband and father and producer of award winning TV commercials, died suddenly, Monday, March 18 at home in Norwood, New Jersey. In 2004, <strong>Mike and his wife Christen Downey</strong>, founded Hero Content, a production ...",
    "published": "March 20, 2024"
  },
  {
    "title": "Michael \"Mike\" Downey | The Gazette",
    "url": "https://www.thegazette.com/obituaries/michael-mike-downey/",
    "snippet": "Mike is survived by <strong>his partner in life, ministry, and wife of 46 years, Colleen, their 5 children, 3 children-in-law, and 3 grandsons</strong>. Justus (Amy), Simon and Calvin of Greenville, SC, Austin of Columbia, SC, Luke of Chesapeake, VA, Chloe (Ethan), ...",
    "published": "April 4, 2025"
  },
  {
    "title": "Search Michael Downey Obituaries and Funeral Services",
    "url": "https://www.legacy.com/obituaries/name/downey/michael",
    "snippet": "Search all Michael Downey Obituaries and Death Notices to find upcoming funeral home services, leave condolences for the family, and research genealogy.",
    "published": "October 1, 2025"
  }
]