[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Kaptur took office on January 3, 1983. At the time, she became the first woman to represent Ohio&#x27;s 9th congressional district and was one of 24 women serving in Congress. In her first term, she was appointed to the Banking, Finance, and Urban Affairs Committee as well as the Veterans’ Affairs Committee.",
    "published": "1 week ago"
  },
  {
    "title": "Marcy C Kaptur | Archives of Women's Political Communication",
    "url": "https://awpc.cattcenter.iastate.edu/directory/marcy-c-kaptur/",
    "snippet": "Prior to serving in Congress, Kaptur <strong>served on the Toledo-Luca County Plan Commission from 1969 to 1975</strong>, as director of planning for the National Center for Urban Ethnic Affairs from 1975 to 1977 and as a domestic policy advisor during President ...",
    "published": null
  },
  {
    "title": "KAPTUR, Marcia Carolyn (Marcy) | US House of Representatives: History, Art & Archives",
    "url": "https://history.house.gov/People/Detail/16086",
    "snippet": "KAPTUR, Marcia Carolyn (Marcy), A Representative from Ohio; born in Toledo, Lucas County, Ohio, June 17, 1946; graduated from St. Ursula Academy, Toledo, Ohio, 1964; B.A., University of Wisconsin, Madison, Wis., 1968; M.A., University of Michigan, Ann Arbor, Mich., 1974; attended the University of Manchester, Manchester, England, 1974; post-graduate studies, Massachusetts Institute of Technology, Cambridge, Mass., 1981; urban planner, Toledo-Lucas County, Ohio, Plan Commissions, 1969-1975; director of planning, National Center for Urban Ethnic Affairs, 1975-1977; assistant director for urban affairs, domestic policy staff, Executive Office of the President, 1977-1979; elected as a Democrat to the Ninety-eighth and to the twenty-one succeeding Congresses (January 3, 1983-present).",
    "published": null
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "In 1981, while pursuing a doctorate in urban planning and development finance at MIT, she was recruited by the Lucas County Democratic Party to run for Congress against a first-term Republican. Although she was outspent by a 3-to-1 margin, Kaptur parlayed a strong economic message during the 1982 recession to stage a nationally-recognized upset.",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "Marcy Kaptur, the Representative from Ohio - in Congress from 1983 through Present",
    "published": null
  }
]