[
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Peter Norvig (born 14 December 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google. Norvig is the co-author with Stuart J. Russell of the most ...",
    "published": "1 month ago"
  },
  {
    "title": "Peter Norvig is stepping back from Google after 20 years",
    "url": "https://searchengineland.com/peter-norvig-is-stepping-back-from-google-after-20-years-375108",
    "snippet": "<strong>Peter Norvig is the latest big name at Google to step back from his day-to-day role at Google</strong>. He has set a lot of the groundwork for the mega search company and it looks like he is ready for his next thing now.",
    "published": "October 17, 2022"
  },
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "🎉 What I mean is that it is time for Advent of Code 2025! ❄️ It&#x27;s a challenge that starts every December where Eric Wastl… · Excited to share that Accenture Federal Services is sponsoring Advent of Code (https://adventofcode.com/) again this year! 🎄 For those unfamiliar… · Working with our Google #Accelerator Alumni is an honour and privilege.",
    "published": "2 weeks ago"
  },
  {
    "title": "Peter Norvig",
    "url": "https://norvig.com/",
    "snippet": "Distinguished Education Fellow at Stanford HAI, <strong>Research Director at Google</strong>. Co-author of Artificial Intelligence: A Modern Approach, the leading AI textbook used in 1,500+ universities worldwide. peter@norvig.com / resume / github / medium / photo gallery / legacy homepage",
    "published": null
  },
  {
    "title": "Peter Norvig",
    "url": "https://research.google/people/author205/",
    "snippet": "Peter Norvig is a <strong>Director of Research</strong> at Google Inc; previously he directed Google&#x27;s core search algorithms group.",
    "published": null
  }
]