[
  {
    "title": "Progressive Party (United States, 1948–1955) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Progressive_Party_(United_States,_1948–1955)",
    "snippet": "Most agree that Wallace paid very little attention to internal party affairs. Historians Schapsmeier and Schapsmeier argue (1970 p 181): [The Progressive Party] stood for one thing and Wallace another. Actually the party organization was controlled from the outset by those representing the radical left and not liberalism per se.",
    "published": "3 weeks ago"
  },
  {
    "title": "Progressive Party Platform of 1912 | The American Presidency Project",
    "url": "https://www.presidency.ucsb.edu/documents/progressive-party-platform-1912",
    "snippet": "The extreme insistence on States&#x27; rights by the Democratic party in the Baltimore platform demonstrates anew its inability to understand the world into which it has survived or to administer the affairs of a union of States which have in all essential respects become one people. The Progressive party, believing that no people can justly claim to be a true democracy which denies political rights on account of sex, pledges itself to the task of securing equal suffrage to men and women alike.",
    "published": null
  },
  {
    "title": "Party of Progress (Germany) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Party_of_Progress_(Germany)",
    "snippet": "The Party of Progress (German: Partei des Fortschritts, PdF), also known as Party of Progress – Free Parliamentary Alliance (PdF–FPA) is a political party in Germany <strong>founded in Cologne in 2020.</strong> While the party sees itself as being beyond the left–right political spectrum, it is classified ...",
    "published": "October 1, 2025"
  },
  {
    "title": "Progress Party (United States) | Second Renaissance Wikia | Fandom",
    "url": "https://second-renaissance.fandom.com/wiki/Progress_Party_(United_States)",
    "snippet": "The Progress Party, commonly called ... back to the Democratic Party, the Progress Party was <strong>founded in 2060 after the Democratic party had split over Augment Rights</strong>....",
    "published": "October 29, 2024"
  },
  {
    "title": "Progressive Party Platform of 1948 | The American Presidency Project",
    "url": "https://www.presidency.ucsb.edu/documents/progressive-party-platform-1948",
    "snippet": "As Jefferson headed a new party to defeat the reactionaries of his day, and as Lincoln led a new party to victory over the slave owners, so today the people, inspired and led by Henry Wallace, have created a new party to secure peace, freedom, and abundance. With the firm conviction that the principles of the Declaration of Independence and of the Constitution of the United States set forth, all fundamental freedoms for all people and secure the safety and well being of our country, the Progressive Party pledges itself to safeguard these principles to the American people.",
    "published": null
  }
]