[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "To complement this, his government ... emphasising better tax-to-GDP ratio rather than raw debt expansion. Prabowo Subianto’s decision to appoint <strong>Purbaya Yudhi Sadewa</strong> as Minister of Finance on 8 September 2025 signaled a change in economic policymaking, a departure from the ...",
    "published": "1 day ago"
  },
  {
    "title": "Indonesia's first ladies have always been influential, but soon the country won't have one - ABC News",
    "url": "https://www.abc.net.au/news/2024-05-05/role-first-lady-indonesia-election-prabowo-subianto/103787902",
    "snippet": "In a country that in many ways strongly holds onto its traditional values, Mr Subianto&#x27;s lack of a partner was considered an issue ahead of the February election. Prabowo Subianto was married to <strong>Siti Hediati Hariyadi</strong>, daughter of then-president ...",
    "published": "May 4, 2024"
  },
  {
    "title": "Prabowo Subianto - The Muslim 500",
    "url": "https://themuslim500.com/profiles/prabowo-subianto/",
    "snippet": "He rose through the ranks of the Indonesian Army, becoming a lieutenant general and commander of the Army’s Strategic Reserve Command. Prabowo was also married to Suharto’s daughter, <strong>Siti Hediati Hariyadi</strong>, from 1983 to 1998, further cementing ...",
    "published": "May 29, 2018"
  },
  {
    "title": "Titiek Suharto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Titiek_Suharto",
    "snippet": "In 2021, during the COVID-19 pandemic, <strong>Titiek</strong> donated a sample of her blood for the development of the Nusantara vaccine. In May 1983, <strong>Titiek</strong> married Prabowo Subianto, who was then a senior officer in the Indonesian Army&#x27;s ...",
    "published": "3 days ago"
  },
  {
    "title": "Didit Hediprasetyo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Didit_Hediprasetyo",
    "snippet": "Ragowo Hediprasetyo Djojohadikusumo (born 22 March 1984), or more commonly known as Didit Prabowo, is an Indonesian fashion designer and socialite. He is the only child of current Indonesian president Prabowo Subianto and his former wife, Titiek Suharto, as well as the maternal grandson of former Indonesian president Suharto.",
    "published": "June 24, 2025"
  }
]