[
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "Carney <strong>graduated in the class of 1983 from St.</strong> Francis Xavier High School, Edmonton, Alberta. From there, he went on to study at Harvard University with a partial scholarship and financial aid. During his Harvard years, he was backup goalie for the varsity ice hockey team and was a roommate ...",
    "published": "7 hours ago"
  },
  {
    "title": "Mark Carney | Liberal Party, Prime Minister, Biography, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Mark-Carney",
    "snippet": "Prior to and following his <strong>studies at Oxford</strong>, Carney worked for Goldman Sachs, rising to become managing director of investment banking. While at Goldman Sachs he helped postapartheid South Africa gain access to international bond markets and ...",
    "published": "4 days ago"
  },
  {
    "title": "Mark Carney - Prime Minister of Canada and Leader of the Liberal Party | Premier ministre du Canada et chef du Parti libéral | LinkedIn",
    "url": "https://ca.linkedin.com/in/mark-carney-5b9744205",
    "snippet": "· Experience: Office of the Prime Minister of Canada | Cabinet du premier ministre du Canada · Education: <strong>University of Oxford</strong> · Location: Ottawa · 500+ connections on LinkedIn.",
    "published": "3 days ago"
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "Prime Minister Carney started his career in finance before joining Canada’s public service to help ensure our economy supports the things that Canadians value – like health care, security, and a life you can afford.",
    "published": null
  },
  {
    "title": "Mark Carney - Nuffield College Oxford University",
    "url": "https://www.nuffield.ox.ac.uk/people/profiles/mark-carney/",
    "snippet": "Mark began his career at Goldman Sachs, working across several international offices before joining the Bank of Canada in 2003 as Deputy Governor, then becoming Governor in 2008.",
    "published": null
  }
]