[
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "<strong>The President of the Republic declares the state of siege and emergency</strong>, after hearing the Government and under authorization from the Assembly of the Republic.",
    "published": "3 days ago"
  },
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "<strong>Marcelo Rebelo de Sousa</strong> was born in Lisbon, on 12 December 1948. He is a Catholic and has 2 children and 5 grandchildren. A Law Graduate, he received a Doctorate in Legal and Political Science in 1984.",
    "published": null
  },
  {
    "title": "Portugal's president invites caretaker PM to lead new government | Reuters",
    "url": "https://www.reuters.com/world/europe/portugals-president-invites-caretaker-pm-lead-new-government-2025-05-29/",
    "snippet": "<strong>Luis Montenegro</strong>, Social Democratic Party (PSD) and Democratic Alliance (AD) leader, meets with Portugal President Marcelo Rebelo de Sousa at Belem Palace, following the final results of the general elections in Lisbon, Portugal, May 29, 2025.",
    "published": "May 29, 2025"
  },
  {
    "title": "Portugal hit by severe disruption in first general strike for 12 years",
    "url": "https://www.bbc.com/news/articles/cdxwrvl1734o",
    "snippet": "Under Portugal&#x27;s &quot;semi-presidential&quot; system, the head of state can decline to sign bills approved by parliament.",
    "published": "5 days ago"
  },
  {
    "title": "The Portuguese Government in 2025: What Expats Should Know",
    "url": "https://www.portugalresidencyadvisors.com/the-political-system-in-portugal-an-expat-guide/",
    "snippet": "As head of state, <strong>President Marcelo</strong> holds a mostly symbolic role but plays an important part in safeguarding democratic institutions. He can appoint the prime minister, dissolve parliament, and veto laws, though typically acts with restraint ...",
    "published": "September 29, 2025"
  }
]