[
  {
    "title": "President of Georgia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Georgia",
    "snippet": "Protests against the ruling party ... 2025, the European Parliament passed a resolution stating that the European Union does not recognize <strong>Mikheil Kavelashvili</strong> as the legitimate president of Georgia....",
    "published": "4 weeks ago"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "In his speech Sunday, Kavelashvili promised to be “everyone’s president, regardless of whether they like me or not.” He called for the nation to unite behind him around “shared values, the principles of mutual respect, and the future we should build together.” · Georgian Dream retained control of Parliament in the South Caucasus nation in an Oct.",
    "published": "December 29, 2024"
  },
  {
    "title": "The Bitter Standoff Over Georgia's Next President",
    "url": "https://www.rferl.org/a/georgia-president-election-mikheil-kavelashvili-salome-zurabishvili-protests/33237724.html",
    "snippet": "An electoral college is expected to choose <strong>Mikheil Kavelashvili</strong>, a 53-year-old former footballer and right-wing populist, as Georgia&#x27;s next president. But with the country rocked by anti-government protests, the incumbent Salome Zurabishvili ...",
    "published": "December 13, 2024"
  },
  {
    "title": "DOJ sues Georgia county as Trump pushes debunked 2020 election fraud claims - The Washington Post",
    "url": "https://www.washingtonpost.com/politics/2025/12/12/justice-department-lawsuit-fulton-county-2020-election/",
    "snippet": "President <strong>Donald Trump</strong> has increasingly pressured his administration to find widespread voter fraud in the 2020 election, despite those claims having been debunked and dismissed in dozens of cases by the courts.",
    "published": "4 days ago"
  },
  {
    "title": "Salomé Zourabichvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salome_Zourabichvili",
    "snippet": "She was quoted saying &quot;This building ... the President, who was legitimate, sat here. I&#x27;m taking away the legitimacy, I&#x27;m taking away the flag, I&#x27;m taking away what is your trust&quot;. On 9 January 2025, Zourabichvili held a press briefing at her new office on Chovelidze street, stating that she would continue to work to solve the crisis, meeting people around Georgia and ...",
    "published": "November 13, 2025"
  }
]