[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The Akron Beacon Journal is a morning newspaper in Akron, Ohio, United States. <strong>Owned by Gannett</strong>, it is the sole daily newspaper in Akron and is distributed throughout Northeast Ohio. The paper&#x27;s coverage focuses on local news. The Beacon Journal has won four Pulitzer Prizes: in 1968, 1971, ...",
    "published": "1 week ago"
  },
  {
    "title": "Beacon Journal owner GateHouse Media acquires Gannett",
    "url": "https://www.beaconjournal.com/story/news/local/2019/08/05/beacon-journal-owner-gatehouse-media/4534606007/",
    "snippet": "<strong>GateHouse Media</strong>, the company that owns the Akron Beacon Journal and nine other Ohio newspapers, on Monday announced its long-planned acquisition of Gannett, creating the nation’s largest newspaper ch…",
    "published": "August 5, 2019"
  },
  {
    "title": "Akron Beacon Journal newspaper in Akron Ohio - MondoTimes.com",
    "url": "https://www.mondotimes.com/1/world/us/35/1910/4784",
    "snippet": "The Akron Beacon Journal is a daily newspaper in Akron, Ohio USA owned by <strong>Gannett Company, Inc.</strong>",
    "published": null
  },
  {
    "title": "Akron Beacon Journal and other NEO Gannett papers pare back to printing six days a week | Ideastream Public Media",
    "url": "https://www.ideastream.org/news/arts-culture/2022-01-17/akron-beacon-journal-and-other-papers-pare-back-to-printing-six-days-a-week",
    "snippet": "<strong>All of the papers are owned by Gannett</strong>. ... Arts &amp; Culture newspaperAkron Beacon JournalRecord-CourierCity of WoosterCantonMansfieldDoverGannettFrom WKSU ... Kabir Bhatia is a senior reporter for Ideastream Public Media&#x27;s arts &amp; culture team.",
    "published": "January 17, 2022"
  },
  {
    "title": "Akron Beacon Journal 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/153167-50",
    "snippet": "Akron Beacon Journal was acquired by <strong>Gannett Company</strong>.",
    "published": null
  }
]