[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the secretary of the Democratic Party (PD) since <strong>12 March 2023</strong>. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Biography - Elly Schlein",
    "url": "https://www.ellyschlein.it/en/biography",
    "snippet": "On <strong>6 May 2015,</strong> after the approval of the “Italicum”, education and school reforms, the Jobs Act, and due to irremediable fractures between Elly’s political views and the policies taken by Renzi’s government, she decides to leave the Democratic Party together with Pippo Civati and many ...",
    "published": "February 16, 2022"
  },
  {
    "title": "Italy's left picks 'anti-Meloni' politician Elly Schlein to lead the party | Euronews",
    "url": "https://www.euronews.com/my-europe/2023/02/27/the-anti-meloni-meet-elly-schlein-italys-breakout-left-wing-star",
    "snippet": "Come the following year, and increasingly opposed to the labour reforms of the then-PM and party leader, Renzi, <strong>she ultimately parted ways with the PD and joined a splinter party, Possible (Possibile).</strong>",
    "published": "March 1, 2023"
  },
  {
    "title": "Why Elly Schlein is freaking out Italy’s ‘soft’ socialists",
    "url": "https://www.politico.eu/article/elly-schlein-italy-soft-socialist-democratic-party-leader/",
    "snippet": "“My PD is no longer there, this is another party — it no longer belongs to the center left, but to the hard left,” he said. As a youth leader in 2013, Schlein became the figurehead of Occupy PD, a protest movement set up by disaffected progressives angered over 101 center-left parliamentarians who voted against their own social democrat grandee Romano Prodi’s bid to become the president of Italy. “With Elly Schlein, the PD has occupied itself,” quipped Allegranti.",
    "published": "March 2, 2023"
  },
  {
    "title": "Elly Schlein Will Tilt Italy’s Democrats to the Left, but Don’t Expect Revolutionary Change",
    "url": "https://jacobin.com/2023/03/elly-schlein-italy-democratic-party-left-primary-election/",
    "snippet": "This is, however, a meager consolation, given its evident inability to create a credible alternative, both to Schlein herself (who after seven years has precisely returned to the PD, having found little outside) and especially vis-à-vis the people who decided to support her in the primaries and who now, perhaps, might decide to join the Democratic Party permanently. Just as they might abandon all collective participation if Schlein’s leadership proves to be an only brief interlude, as in the case of some of her predecessors. There would, in all likelihood, have been no Elly Schlein to lead the PD if there had been no Prime Minister Giorgia Meloni.",
    "published": null
  }
]