[
  {
    "title": "Stade Saint-Symphorien - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stade_Saint-Symphorien",
    "snippet": "Stade Municipal Saint-Symphorien is a multi-purpose stadium located <strong>on the &quot;island Saint-Symphorien&quot; in Longeville-lès-Metz, near Metz, France</strong>. It is currently used mostly for football matches, by Ligue 1 club FC Metz.",
    "published": "June 15, 2025"
  },
  {
    "title": "Stade Saint-Symphorien - Stadion | RouteYou",
    "url": "https://www.routeyou.com/de-fr/location/view/47858355/stade-saint-symphorien",
    "snippet": "Das Stade Saint-Symphorien ist ein Fußballstadion <strong>im französischen Longeville-lès-Metz, an der südwestlichen Stadtgrenze zu Metz</strong> gelegen. In der Anlage trägt der Fußballverein FC Metz seine Heimspiele aus.",
    "published": null
  },
  {
    "title": "Santos Football Planet | Stade Saint-Symphorien",
    "url": "https://www.santosfootballplanet.com/europe/france/metz/stade-saint-symphorien/",
    "snippet": "The illustrious Stade Saint-Symphorien is <strong>wedged between the Motorway A31 and the Moselle River</strong>. Given its open corners, you can still take a look inside when driving by, but not for long.",
    "published": "May 17, 2023"
  },
  {
    "title": "Stade Saint-Symphorien - FC Metz - Metz - The Stadium Guide",
    "url": "https://www.stadiumguide.com/stade-saint-symphorien/",
    "snippet": "Stade Saint-Symphorien is located just south east of Metz’ city centre on the west bank of the river Moselle.",
    "published": "April 29, 2020"
  },
  {
    "title": "Stade Saint-Symphorien, entrust us with the organization of your events and live a unique experience.",
    "url": "https://www.seminar-france.com/seminar-room/10902-stage-saint-symphorien.html",
    "snippet": "With a view of the FC Metz pitch and direct access to the stands, give your guests an atypical experience during your corporate or private events (work meetings, conferences, exhibitions, large-scale private events). <strong>in the heart of Metz</strong>, the Stade ...",
    "published": null
  }
]