[
  {
    "title": "FCA board | Farm Credit Administration",
    "url": "https://www.fca.gov/about/fca-board",
    "snippet": "<strong>Glen R. Smith was designated FCA board chairman and CEO of the Farm Credit Administration by President Donald Trump on July 17, 2019.</strong> He served in this position until October 21, 2022. Mr. Smith has been a member of the FCA board since December 2017. You can read more about Mr.",
    "published": null
  },
  {
    "title": "Executive Team",
    "url": "https://www.fca.org/aboutus/who-we-are/executive-team",
    "snippet": "The executive team of FCA is led by our President and other executives who carry the vision of the FCA sports ministry.",
    "published": null
  },
  {
    "title": "History of FCA governance | Farm Credit Administration",
    "url": "https://www.fca.gov/about/history-of-fca-governance",
    "snippet": "Mr. Reyna instituted numerous programs to increase workplace diversity at FCA. Under his leadership, FCA instituted an Affirmative Employment Program Action Plan to increase the number of minorities, women, and people with disabilities in the FCA workforce. During his tenure, a Blacks in Government chapter was created at FCA, as well as a Female Examiners Work Group.",
    "published": null
  },
  {
    "title": "Fellowship of Christian Athletes - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fellowship_of_Christian_Athletes",
    "snippet": "The Fellowship of Christian Athletes (FCA) is an international nonprofit Christian sports ministry based in Kansas City. FCA was founded in 1954 by Eastern Oklahoma A&amp;M basketball coach <strong>Don McClanen</strong>, who later resigned to become its full-time ...",
    "published": "June 16, 2025"
  },
  {
    "title": "Fellowship of Christian Athletes | FCA TimelineFellowship of Christian Athletes | FCA Timeline",
    "url": "https://timeline.fca.org/",
    "snippet": "Greater Dallas FCA’s Carey Casey is named National Director of Urban Ministry. He later serves as Senior VP and National Director of OW2P Programs and VP… ... Under Dick Abel’s leadership, FCA develops the CHAD (camps, huddles, adult chapters, development) program.",
    "published": null
  }
]