[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to ABC News pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight. <strong>On March 5, 2025, 538 was shut down by ABC News and its staff were laid off</strong>.",
    "published": "1 month ago"
  },
  {
    "title": "FiveThirtyEight is shutting down as part of broader cuts at ABC and Disney | Nieman Journalism Lab",
    "url": "https://www.niemanlab.org/2025/03/fivethirtyeight-is-shutting-down-as-part-of-broader-cuts-at-abc-and-disney/",
    "snippet": "Our daily email, with all the freshest future-of-journalism news. ... Owen, Laura Hazard. &quot;<strong>FiveThirtyEight is shutting down as part of broader cuts at ABC and Disney</strong>.&quot; Nieman Journalism Lab. Nieman Foundation for Journalism at Harvard, 5 Mar.",
    "published": null
  },
  {
    "title": "r/OutOfTheLoop on Reddit: What is up with Project Fivethirtyeight disappearing?",
    "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1jc57fo/what_is_up_with_project_fivethirtyeight/",
    "snippet": "On September 18, 2023, the original website domain at fivethirtyeight.com was closed, and web traffic became redirected to ABC News pages. <strong>The logo was replaced, with the name 538 used instead of FiveThirtyEight</strong>. On March 5, 2025, the website ...",
    "published": "March 15, 2025"
  },
  {
    "title": "Politics News | Breaking Political News, Video & Analysis-ABC News ...",
    "url": "http://fivethirtyeight.com/",
    "snippet": "This is a listing for &#x27;This Week&#x27; airing Sunday, December 14, 2025.",
    "published": null
  },
  {
    "title": "The Rise (and Fall) of FiveThirtyEight",
    "url": "https://news.marketecture.tv/p/the-rise-and-fall-of-fivethirtyeight",
    "snippet": "Without them, the newsroom’s sharp edge dulled. The business gap. FiveThirtyEight never built beyond ad-driven pageviews. No licensing products, no analytics services, and no paid memberships. For all its intellectual capital, its business capital was thin. By 2023, Disney began swinging the axe. Nate Silver left amid layoffs that gutted two-thirds of the staff. The sports and science desks faltered. By March 2025, the lights went out for good.",
    "published": "September 15, 2025"
  }
]