[
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "<strong>Christopher Ruddy</strong> (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and majority owner of Newsmax Media.",
    "published": "5 days ago"
  },
  {
    "title": "Newsmax stock surges after its IPO | CNN Business",
    "url": "https://www.cnn.com/2025/04/01/media/newsmax-stock-surges-after-ipo",
    "snippet": "Newsmax CEO <strong>Chris Ruddy</strong>, who is now a billionaire on paper thanks to the stock’s explosive performance, told CNN, “Last election Americans voted against the media establishment and similarly investors voted by enormously buying Newsmax stock ...",
    "published": "April 1, 2025"
  },
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "Newsmax Media divisions include its cable and broadcast channel Newsmax TV; its website Newsmax.com, which includes Newsmax Health and Newsmax Finance; and Newsmax magazine, its monthly print publication. The company went public in March 2025. Newsmax launched Newsmax TV in June 2014 to 35 million satellite subscribers through DirecTV and Dish Network. As of 2019, the network claimed to reach about 70 million households via cable television.",
    "published": "1 week ago"
  },
  {
    "title": "newsmax inc.",
    "url": "https://www.sec.gov/Archives/edgar/data/2026478/000121390025021989/ea0233655-253g1_newsmax.htm",
    "snippet": "Subsequently, Newsmax Media changed its state of domicile from Delaware to Florida. As a result of this reorganization, <strong>Newsmax Inc.</strong> became the direct holding company and the sole shareholder of Newsmax Media. Newsmax Media’s ownership of its subsidiaries was not affected or changed as a ...",
    "published": null
  },
  {
    "title": "Christopher Ruddy | Long Island University",
    "url": "https://liu.edu/roosevelt/~/link.aspx?_id=CBEEEDD71542408AA2E0F8E91B527511&_z=z",
    "snippet": "<strong>Christopher Ruddy</strong> is CEO and President of Newsmax Media Inc., a leading digital and television news media company. Ruddy, who grew up near Sagamore Hill, has been a long-time member of the Theodore Roosevelt Association and often reference Theodore Roosevelt in his commentaries on current U.S.",
    "published": null
  }
]