[
  {
    "title": "Alphabet Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
    "snippet": "Alphabet is mainly owned by <strong>institutional investors</strong>, who own over 60% of shares. The founders Larry Page and Sergey Brin each control around 3% of all shares, but control with other insiders the majority of voting shares. The largest shareholders in December 2023 were:",
    "published": "1 week ago"
  },
  {
    "title": "Alphabet Inc. (GOOG) Stock Major Holders - Yahoo Finance",
    "url": "https://finance.yahoo.com/quote/GOOG/holders/",
    "snippet": "Find out the direct holders, institutional holders and mutual fund holders for Alphabet Inc. (GOOG).",
    "published": null
  },
  {
    "title": "Alphabet Inc.: Shareholders Board Members Managers and Company Profile | US02079K3059 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/ALPHABET-INC-24203373/company/",
    "snippet": "Alphabet Inc.: Company profile, business summary, shareholders, managers, financial ratings, industry, sector and market information | Nasdaq: GOOGL | Nasdaq",
    "published": null
  },
  {
    "title": "Who owns Alphabet in 2025? GOOGL shareholders explained | Capital.com",
    "url": "https://capital.com/en-int/analysis/alphabet-shareholder-who-owns-most-googl",
    "snippet": "As of June 2025, the largest institutional holders include The <strong>Vanguard Group (7.73%), BlackRock (6.55%) and State Street Global Advisors (3.47%), followed by FMR LLC, Capital Research and Management Company, and T.</strong>",
    "published": null
  },
  {
    "title": "Who Owns Alphabet? Biggest Shareholders and Recent Insider Trades | TIKR.com",
    "url": "https://www.tikr.com/blog/who-owns-alphabet-biggest-shareholders-and-recent-insider-trades",
    "snippet": "Alphabet’s shareholder base is anchored by massive index funds like <strong>Vanguard, BlackRock, and State Street</strong>, which helps keep the stock stable as a core part of global portfolios.",
    "published": "August 26, 2025"
  }
]