[
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "Askar Akayev was forced from office by the Tulip Revolution of 2005 and Kurmanbek Bakiyev was forced from office by the Kyrgyz Revolution of 2010. <strong>Almazbek Atambayev was peacefully succeeded by Sooronbay Jeenbekov in 2017.</strong> However, Jeenbekov resigned from office due to the 2020 Kyrgyzstani ...",
    "published": "November 11, 2025"
  },
  {
    "title": "List of leaders of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_leaders_of_Kyrgyzstan",
    "snippet": "The president, according to the constitution, &quot;is the symbol of the unity of people and state power, and is the guarantor of the Constitution of the Kyrgyz Republic, and of an individual and citizen.&quot; <strong>The office of president was established in 1990</strong> ...",
    "published": "October 3, 2025"
  },
  {
    "title": "BTI 2024 Kyrgyzstan Country Report: BTI 2024",
    "url": "https://bti-project.org/en/reports/country-report/KGZ",
    "snippet": "Kyrgyzstan became known as “the island of democracy” in the 1990s when <strong>Askar Akayev</strong>, a young and unconventional politician during the late-Soviet era, unexpectedly rose to the presidency under unique political circumstances.",
    "published": null
  },
  {
    "title": "Kyrgyzstan (10/08)",
    "url": "https://2001-2009.state.gov/r/pa/ei/bgn/5755.htm",
    "snippet": "Facts about the land, people, history, government, political conditions, economy, foreign relations of Kyrgyzstan.",
    "published": null
  },
  {
    "title": "Kyrgyzstan profile - Timeline - BBC News",
    "url": "https://www.bbc.com/news/world-asia-16185772",
    "snippet": "1990 - State of emergency imposed after several hundred people are killed in interethnic clashes between Uzbeks and Kyrgyz around the southern town of Osh; Askar Akayev, a liberal academic on the reform wing of the Kyrgyz Communist Party, elected by the legislature to the newly created post of president. 1991 - Kyrgyzstan acquires its present name, dropping Kirgizia, and declares independence; Mr Akayev joins Russian leader Boris Yeltsin in openly resisting the anti-Gorbachev coup by conservative Communists in Moscow; Mr Akayev wins another term in direct elections in which he stands unopposed; Kyrgyzstan joins Commonwealth of Independent States (CIS).",
    "published": "January 11, 2021"
  }
]