[
  {
    "title": "Dr. Manmohan Singh: India’s son, the Pride of the World",
    "url": "https://inc.in/congress-sandesh/tribute/dr-manmohan-singh-india-s-son-the-pride-of-the-world",
    "snippet": "Dr. Manmohan Singh was born on September 26, 1932, in a Sikh family to <strong>Gurumukh Singh and Amrit Kaur</strong> at a place called Gah in the Punjab state of undivided India. His mother’s name was Amrit Kaur and father’s name was Gurumukh Singh.",
    "published": null
  },
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "In 2022, Union Transport Minister of Modi Government, Nitin Gadkari said the &quot;country is indebted to Manmohan Singh for the liberalisation that gave a new direction&quot;. In 2013, BJP leader Narendra Modi had termed Singh as &quot;night watchman&quot; and a &quot;puppet of the Gandhi family&quot;.",
    "published": "2 days ago"
  },
  {
    "title": "RIP Manmohan Singh | A look at former PM's family: All you need to know",
    "url": "https://www.deccanherald.com/india/rip-manmohan-singh-a-look-at-former-pms-family-all-you-need-to-know-3333468",
    "snippet": "He is survived by <strong>his wife Gursharan Kaur and three daughters - Upinder Singh, Amrit Singh and Daman Singh</strong>. His daughters have made remarkable strides in their respective fields.",
    "published": "December 27, 2024"
  },
  {
    "title": "Former PM Manmohan Singh's love for Amritsar & Chandigarh or a family tale",
    "url": "https://www.newindianexpress.com/nation/2024/Dec/27/former-pm-manmohan-singhs-love-for-amritsar-chandigarh-or-a-family-tale",
    "snippet": "The couple has three daughters Upinder Singh, Daman Singh and Amrit Singh. The former PM’s extended family included <strong>six sisters and three half-brothers Surinder Singh Kohli, Surjit Singh Kohli and Daljit Singh Kohli</strong>.",
    "published": "December 27, 2024"
  },
  {
    "title": "Manmohan Singh’s Three Daughters: Achievers In History, Law, And Literature - No Politician | News | Zee News",
    "url": "https://zeenews.india.com/photos/india/manmohan-singh-s-daughters-who-are-former-pm-s-three-daughters-check-thier-age-professions-and-lifestyle-noone-s-interested-in-politics-2837016",
    "snippet": "Manmohan Singh, India’s former Prime Minister, is survived by <strong>his wife Gursharan Kaur and three accomplished daughters—Upinder Singh, Daman Singh, and Amrit Singh</strong>. Upinder Singh, a renowned historian, has authored several notable books, ...",
    "published": "December 29, 2024"
  }
]