[
  {
    "title": "Googleplex - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Googleplex",
    "snippet": "The Googleplex is the corporate headquarters complex of Google and its parent company, Alphabet Inc. It is located at <strong>1600 Amphitheatre Parkway in Mountain View, California</strong>. The original complex, with 2 million square feet (190,000 square meters) of office space, is the company&#x27;s second-largest ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Browse a list of Google’s office locations - About Google",
    "url": "https://about.google/company-info/locations/",
    "snippet": "<strong>Neue Mainzer Str.</strong>",
    "published": null
  },
  {
    "title": "Where is Google's Headquarters? Main Office Location and Global Offices | Clay",
    "url": "https://www.clay.com/dossier/google-headquarters-office-locations",
    "snippet": "This article will delve into the company&#x27;s main headquarters and explore its most significant office locations that support its worldwide operations. Google&#x27;s main headquarters is located at <strong>1600 Amphitheatre Parkway in Mountain View, California, 94043</strong>. This address places the company&#x27;s primary ...",
    "published": null
  },
  {
    "title": "Google LLC Locations - Headquarters & Offices - GlobalData",
    "url": "https://www.globaldata.com/company-profile/google-llc/locations/",
    "snippet": "View Google LLC&#x27;s company headquarters address along with its other key offices and locations.",
    "published": null
  },
  {
    "title": "Google Mountain View - Headquarters in Mountain View, CA United States - Apple Maps",
    "url": "https://maps.apple.com/place?auid=13012628869081955587",
    "snippet": "The Googleplex is the corporate headquarters complex of Google, Inc. and its parent company Alphabet Inc., located at <strong>1600 Amphitheatre Parkway in Mountain View, Santa Clara County, California, United States</strong>, near San Jose.",
    "published": null
  }
]