[
  {
    "title": "Aníbal Fernández - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.m.wikipedia.org/wiki/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "Aníbal Domingo Fernández (born January 9, 1957) is an Argentine politician, public accountant and lawyer affiliated and militant of the Justicialist Party, Since 2021 to 2023, he has served as Argentina&#x27;s Minister of Security, in the cabinet of Alberto Fernández.",
    "published": "August 13, 2025"
  },
  {
    "title": "Presidency of Alberto Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Presidency_of_Alberto_Fern%C3%A1ndez",
    "snippet": "Ahead of the 2021 legislative elections, the ministers of defense (Agustín Rossi) and social development (Daniel Arroyo) announced their candidacies for legislative positions; they were replaced by <strong>Jorge Taiana</strong> and Juan Zabaleta, respectively, in August 2021.",
    "published": "November 7, 2025"
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "Aníbal Domingo Fernández, born on January 9, 1957, is an Argentine politician. He is a Justicialist Party member, a lawyer, and a certified public accountant. He has been a close supporter of former Presidents Néstor Kirchner and Cristina Fernández de Kirchner. From 2021 to 2023, he served as Argentina&#x27;s Minister of Security under President Alberto Fernández.",
    "published": null
  },
  {
    "title": "Milei puts military back in charge of defence after 42 years of civilian rule | Buenos Aires Times",
    "url": "https://www.batimes.com.ar/news/argentina/milei-puts-military-back-in-charge-of-defence-after-42-years-of-civilian-rule.phtml",
    "snippet": "President Javier Milei names <strong>Lieutenant General Carlos Presti</strong>, current head of the Army, as Argentina’s new defence minister; Opposition criticises move as &quot;step backwards&quot;; Since December 1983, when Raúl Alfonsín began his Presidency following ...",
    "published": "1 month ago"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "During Kirchner’s government he was named minister of interior in 2003 and in 2007, and during Cristina Fernandez’s government, he was assigned as minister of justice, security and human rights. Fernández received a degree in public accounting from Universidad Nacional de Lomas and later graduated as a lawyer from the same institution. Aníbal Fernández es candidato a gobernador de la Provincia de Buenos Aires y actualmente jefe de Gabinete de Ministros de la presidencia de la República Argentina.",
    "published": null
  }
]