[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "The prime minister of France (French: Premier ministre français), officially the prime minister of the French Republic (Premier ministre de la République française), is <strong>the nominal head of government of the French Republic and leader of its Council of Ministers</strong>, although the officeholder ...",
    "published": "1 day ago"
  },
  {
    "title": "The institutions | Élysée",
    "url": "https://www.elysee.fr/en/french-presidency/the-institutions",
    "snippet": "Since Article 61-1, created by ... constitutionality of legislative provisions already enacted. ... The Prime Minister is <strong>accountable to the Parliament</strong> (Article 20 of the Constitution)....",
    "published": null
  },
  {
    "title": "What is a French prime minister’s job anyway?",
    "url": "https://www.politico.eu/article/michel-barnier-french-prime-minister-cohabitation-french-politics/",
    "snippet": "... The French president usually ... attended some meetings. But the prime minister is in charge of <strong>directing the government action also when it comes to EU files</strong>....",
    "published": "September 5, 2024"
  },
  {
    "title": "Laws, national defence: what is the role of the French prime minister?",
    "url": "https://www.connexionfrance.com/article/French-news/Laws-national-defence-what-is-the-role-of-the-French-prime-minister",
    "snippet": "Once Ms Borne has put forward candidates for the various positions, Mr Macron will sign off on them (or not). Aside from naming cabinet members, the role of the prime minister is to <strong>manage the cohesion and coordination of the government</strong>.",
    "published": "May 17, 2022"
  },
  {
    "title": "France Prime Minister – News, Role, and Recent Actions",
    "url": "https://staffinfo.in/tag/france-prime-minister/",
    "snippet": "The Prime Minister <strong>heads the government, turns policy ideas into reality, and works side‑by‑side with President Emmanuel Macron to steer the country</strong>. While the President handles foreign affairs and national vision, the Prime Minister keeps ...",
    "published": "September 11, 2025"
  }
]