[
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Council has the powers and responsibilities to develop the World Plan for athletics and approve and review the World Athletics Strategic Plan; adopt, amend and repeal rules and regulations; decide all matters relating to the competition calendar and World Athletics competitions, world records, bidding procedures and selection of host cities; develop policies for training and appointing technical officials; review and monitor the global athletics development programme; appoint Commissions and Working Groups and make recommendations to Congress on membership of various independent panels and bodies of World Athletics.",
    "published": null
  },
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "The World Athletics Council appoints a <strong>chief executive officer (CEO),</strong> who is focused on improving the coverage of the sport and the organisation&#x27;s commercial interests. This role was created and merged with the General Secretary role that had existed previously.",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The role of <strong>the Executive Board</strong> is to govern World Athletics’ business · The Executive Board has responsibility for all decisions related to the business of World Athletics including developing and reviewing the World Athletics Strategic ...",
    "published": null
  },
  {
    "title": "Track and Field: World Athletics (formerly the IAAF)",
    "url": "https://www.ducksters.com/sports/track_and_field/iaaf.php",
    "snippet": "As of 2021, the organization is governed under the leadership of <strong>President Sebastian Coe</strong>. He is a member of the World Athletics council which also consists of four vice presidents, the treasurer, a representative from each area association, and fifteen other members.",
    "published": null
  },
  {
    "title": "New Athletes' Commission members announced | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/athletes-commission-members-2025-2029",
    "snippet": "The six seats that were available for election in 2025 include the Deputy Chair position, which will be voted on by the Athletes’ Commission now the elections have been held. The importance of athletes to decision-making within World Athletics was recognised and embedded into the World Athletics structures with the governance and integrity reforms approved in December 2016.",
    "published": null
  }
]