[
  {
    "title": "Alex Padilla - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alex_Padilla",
    "snippet": "<strong>Governor Gavin Newsom appointed Padilla to the United States Senate after then-Senator Kamala Harris was elected vice president of the United States</strong>; Harris, as the newly elected vice president and president of the Senate, swore Padilla in on January 20, 2021.",
    "published": "November 6, 2025"
  },
  {
    "title": "SEN. ALEX PADILLA | CHCI",
    "url": "https://chci.org/staff-and-leadership/sen-alex-padilla/",
    "snippet": "He <strong>began serving in January of 2021 after being appointed to fill the vacancy created by the election of Vice President Kamala Harris</strong>. He is the first Latino to represent California in the U.S. Senate.",
    "published": "January 3, 2025"
  },
  {
    "title": "U.S. Senate: U.S. Senator Alex Padilla",
    "url": "https://www.senate.gov/senators/117thCongress/padilla-alex.htm",
    "snippet": "As Secretary of State, Alex worked to make our elections more accessible and inclusive, while fighting to protect the integrity of our voting systems. <strong>In December 2020 Alex was appointed by Governor Gavin Newsom to finish the term of Vice President-elect Kamala Harris</strong>.",
    "published": null
  },
  {
    "title": "Timeline of Alex Padilla: Key Milestones and Achievements | Timepath Wiki",
    "url": "https://timepath.org/alex-padilla",
    "snippet": "Alex Padilla was <strong>appointed to the United States Senate on January 20, 2021</strong>, by California Governor Gavin Newsom. He filled the vacancy left by Kamala Harris when she became Vice President of the United States. Padilla became the first Latino to represent California in the U.S. Senate.",
    "published": null
  },
  {
    "title": "Governor Newsom Formally Appoints Alex Padilla to the U.S. Senate and Nominates Dr. Shirley Weber as Secretary of State | Governor of California",
    "url": "https://www.gov.ca.gov/2021/01/18/governor-newsom-formally-appoints-alex-padilla-to-the-u-s-senate-and-nominates-dr-shirley-weber-as-secretary-of-state/",
    "snippet": "Martin Luther King, Jr. and his work to expand voting rights and representation, Governor Gavin Newsom today formally submitted the appointment of Alex Padilla to become California’s first Latino U.S. Senator and the nomination of Assemblymember Dr. Shirley Weber to become the state’s first African American Secretary of State. The announcement comes as Kamala Harris formally resigned her position as U.S. Senator this morning as she prepares to make history by becoming the first African American and woman to become Vice President of the United States when she is inaugurated alongside President-elect Joe Biden Wednesday.",
    "published": "August 7, 2024"
  }
]