[
  {
    "title": "Business Council of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Business_Council_of_Australia",
    "snippet": "In June 1951, the AIPL was renamed as the Australian Industries Development Association (AIDA). Hosiery manufacturer <strong>George Foletta served as the organisation&#x27;s president from 1951 to 1956</strong>. The Business Council of Australia was formed in 1983 from a merger of AIDA and the Business Roundtable.",
    "published": "April 1, 2025"
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "<strong>Jennifer Westacott has been Chief Executive of the Business Council of Australia since 2011</strong>, bringing extensive policy experience in both the public and private sectors. For over 20 years Jennifer occupied critical leadership positions in the New South Wales and Victorian governments.",
    "published": null
  },
  {
    "title": "Board - Business Council of Australia - V1",
    "url": "https://www.bca.com.au/board",
    "snippet": "President, Business Council of Australia · Chief Executive Officer, Commonwealth Bank of Australia (CBA)",
    "published": null
  },
  {
    "title": "Business Council of Australia proposes five critical questions for the next Australian government - AICD",
    "url": "https://www.aicd.com.au/leadership/types/management/business-council-of-australia-proposes-five-critical-questions-for-the-next-australian-government.html",
    "snippet": "Former Sydney Airport CEO <strong>Geoff Culbert became president of the Business Council of Australia (BCA) in February 2024</strong>, when CEO Bran Black, a lawyer and former government adviser, was just six months into his new role at the powerful advocacy group.",
    "published": null
  },
  {
    "title": "Australian business leaders | Australia in the USA",
    "url": "https://usa.embassy.gov.au/aus-biz-leaders",
    "snippet": "AMP Capital Holdings Limited: Ms Vanessa Wallace, Chairman Business Council of Australia: <strong>Mr Grant King, President Business Council of Australia: Ms Jennifer Westacott, CEO</strong> Commonwealth Bank of Australia: Mr Ian Narev, Managing Director and Chief Executive Officer Corrs Chambers Westgarth: ...",
    "published": null
  }
]