[
  {
    "title": "The New York Times Mailing Address - The New York Times Help Center",
    "url": "https://help.nytimes.com/115003860627-Contact-The-New-York-Times/24650675546004-The-New-York-Times-Mailing-Address",
    "snippet": "The New York Times Company <strong>620 Eighth Avenue New York, NY 10018</strong> Please note, we are unable to respond to account and subscription questions via mail. The b",
    "published": null
  },
  {
    "title": "The New York Times Building - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_New_York_Times_Building",
    "snippet": "The New York Times Building is a 52-story skyscraper at <strong>620 Eighth Avenue</strong>, between 40th and 41st Streets near Times Square, on the west side of Midtown Manhattan in New York City, New York, U.S. Its chief tenant is the New York Times Company, publisher of The New York Times.",
    "published": "October 27, 2025"
  },
  {
    "title": "The New York Times, 620 8th Ave, New York, NY 10018, US - MapQuest",
    "url": "https://www.mapquest.com/us/new-york/the-new-york-times-371791259",
    "snippet": "Get more information for The New York Times in New York, NY. See reviews, map, get the address, and find directions.",
    "published": null
  },
  {
    "title": "Driving directions to New York Times, 242 W 41st St, New York - Waze",
    "url": "https://www.waze.com/live-map/directions/us/ny/new-york/new-york-times?to=place.ChIJY8f_S1NYwokRtjCHSQph_1w",
    "snippet": "Realtime driving directions to New York Times, <strong>242 W 41st St, New York</strong>, based on live traffic updates and road conditions – from Waze fellow drivers",
    "published": null
  },
  {
    "title": "The New York Times - Breaking News, US News, World News and Videos",
    "url": "https://www.nytimes.com/",
    "snippet": "Live news, investigations, opinion, photos and video by the journalists of The New York Times from more than 150 countries around the world. Subscribe for coverage of U.S. and international news, politics, business, technology, science, health, arts, sports and more.",
    "published": "3 hours ago"
  }
]