[
  {
    "title": "Olena Zelenska - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olena_Zelenska",
    "snippet": "Olena Volodymyrivna Zelenska (née Kyiashko; born 6 February 1978) is a Ukrainian screenwriter who has served as First Lady of Ukraine since 2019, as the wife of President <strong>Volodymyr Zelenskyy</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "President's wife news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/wife",
    "snippet": "News about President&#x27;s wife Olena Zelenska on Official web site of the President of Ukraine",
    "published": "1 day ago"
  },
  {
    "title": "Meet Olena Zelenska, Ukrainian President Volodymyr Zelenskyy's wife: Their high-school love story - The Times of India",
    "url": "https://timesofindia.indiatimes.com/life-style/relationships/love-sex/meet-olena-zelenska-ukrainian-president-volodymyr-zelenskyys-wife-their-high-school-love-story/articleshow/118662272.cms",
    "snippet": "In 2023, Olena Zelenska was named in the 100 Most Influential People of 2023 by TIME. After dating for a few years, President Volodymyr Zelenskyy and Olena Zelenska <strong>married on September 6, 2003.</strong>",
    "published": "March 2, 2025"
  },
  {
    "title": "Who Is Olena Zelenska? Meet President, Volodymyr Zelenskyy's Wife Who Is The First Lady Of Ukraine",
    "url": "https://www.bollywoodshaadis.com/articles/volodymyr-zelenskyy-wife-olena-zelenska-love-story-high-school-best-friends-husband-wife-61299",
    "snippet": "The Ukrainian President, <strong>Volodymyr Zelenskyy, is married to Olena Zelenska, who is the First Lady of Ukraine</strong>. The couple got married on September 6, 2003, and are currently parents of two children, a son named Kyrylo and a daughter named Oleksandra.",
    "published": "March 1, 2025"
  },
  {
    "title": "Olena Zelenska thanks other first ladies for supporting Ukraine | Ukraine | The Guardian",
    "url": "https://www.theguardian.com/world/2022/mar/22/olena-zelenska-thanks-first-ladies-supporting-ukraine",
    "snippet": "The wife of the Ukrainian president, <strong>Vlodymyr Zelenskiy</strong>, has thanked France’s first lady, Brigitte Macron, and other leaders’ wives for helping to ensure sick children reached safety.",
    "published": "March 29, 2022"
  }
]