[
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "Every president of Ukraine except for Volodymyr Zelenskyy has been a People&#x27;s Deputy of the Verkhovna Rada prior to their election, with Kuchma, Yushchenko, and Yanukovych all previously serving as Prime Minister and Kravchuk as well as acting president Turchynov previously serving as Chairman of the Verkhovna Rada.",
    "published": "October 25, 2025"
  },
  {
    "title": "Speeches — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/speeches",
    "snippet": "Speeches of <strong>Volodymyr Zelenskyy</strong> on Official web site of the President of Ukraine",
    "published": "2 days ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "Since the office&#x27;s establishment on 5 December 1991, there have been six presidents of Ukraine. <strong>Leonid Kravchuk</strong> was the inaugural president, serving three years from 1991 until his resignation in 1994. Leonid Kuchma was the only president to have served two consecutive terms in office.",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine facts for kids",
    "url": "https://kids.kiddle.co/List_of_presidents_of_Ukraine",
    "snippet": "Leonid Kravchuk was the first president to leave office early. Later, in 2014, after some big changes in Ukraine, Viktor Yanukovych left his position. The head of the parliament, Oleksandr Turchynov, became the acting president for a short time. New elections were held on May 25, 2014, and Petro Poroshenko became the fifth president.",
    "published": "October 17, 2025"
  },
  {
    "title": "Presidents of Ukraine | World Presidents Database",
    "url": "https://www.worldpresidentsdb.com/list/countries/Ukraine/",
    "snippet": "List of Ukrainian presidents, leaders and heads of state. Both current and historical presidents of Ukraine are listed with biographies.",
    "published": null
  }
]