[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the <strong>chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "Holbrook told Lookout that Larive doesn’t have a contract with the university, and he didn’t respond to questions clarifying if an employment agreement exists for chancellors.",
    "published": "August 22, 2025"
  },
  {
    "title": "r/UCSC on Reddit: the chancellor is receiving a 28.5% pay increase.",
    "url": "https://www.reddit.com/r/UCSC/comments/1fw5ojy/the_chancellor_is_receiving_a_285_pay_increase/",
    "snippet": "Article states &quot;<strong>UC Santa Cruz Chancellor Cynthia Larive will voluntarily forgo her base salary increase for 2024-25</strong>.&quot; You should know that this is in reference to the 4% across-the-board increase that all staff got, not the upcoming 28.5% increase.",
    "published": "October 4, 2024"
  },
  {
    "title": "Contact Administrators and Public Officials – pay us more ucsc",
    "url": "https://payusmoreucsc.com/contact-admins-and-public-officials/",
    "snippet": "Cynthia Larive <strong>UCSC Chancellor</strong> Contact: 831-459-4291 | clarive@ucsc.edu | Contact Form • Total pay and benefits (2021): $473,082 • Has said she is fine with receiving nearly half a million dollars a year in salary while graduate students and workers at the university lack food and housing ...",
    "published": null
  },
  {
    "title": "Cynthia Larive | Transparent California",
    "url": "https://transparentcalifornia.com/salaries/2018/university-of-california/cynthia-larive/",
    "snippet": "Search California public, government employee, workers salaries, pensions and compensation",
    "published": null
  }
]