[
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "At the G7 summit in June 2021, the G7 agreed on a global minimum corporate tax rate of at least 15%, which had been proposed by Scholz. Scholz is credited as having convinced President of the US Joe Biden to agree to the proposal, which his predecessor <strong>Donald Trump</strong> had been opposed to.",
    "published": "2 weeks ago"
  },
  {
    "title": "Can a New Chancellor Fix Germany? | Carnegie Endowment for International Peace",
    "url": "https://carnegieendowment.org/europe/strategic-europe/2025/01/can-a-new-chancellor-fix-germany?lang=en",
    "snippet": "Faced with a recession and rising unemployment, Scholz’s Social Democrat predecessor <strong>Gerhard Schröder</strong> implemented a shake-up of the social welfare system so as to encourage people to enter the work force.",
    "published": null
  },
  {
    "title": "Scholz's team: Key players in Germany's new government | AP News",
    "url": "https://archive.ph/Tp1QU",
    "snippet": "Trump&#x27;s return brought stiff headwinds for clean energy. So why are advocates optimistic in 2026 · FILE - Designated German Chancellor Olaf Scholz smiles during a news conference after the signing of the coalition agreement with two other parties for new German government in Berlin, Germany, ...",
    "published": "41 minutes ago"
  },
  {
    "title": "Olaf Scholz becomes Germany's new chancellor as Merkel bows out | Euronews",
    "url": "https://www.euronews.com/2021/12/08/olaf-scholz-to-become-germany-s-new-chancellor-as-merkel-bows-out",
    "snippet": "Olaf Scholz, right, and his predecessor, <strong>Angela Merkel</strong>, right - Credit: AP · By&amp;nbspOrlando Crowcroft&amp;nbsp&amp;amp;&amp;nbspAleksandar Brezar&amp;nbspwith&amp;nbspAP · Published on 08/12/2021 - 9:51 GMT+1 •Updated 21:58 · Share this article Comments · ...",
    "published": "December 8, 2021"
  },
  {
    "title": "Olaf Scholz: Latest News and Updates | South China Morning Post",
    "url": "https://www.scmp.com/topics/olaf-scholz",
    "snippet": "Olaf Scholz began his tenure as the chancellor of Germany on 8 December 2021; a member of the Social Democratic Party, he previously served as vice-chancellor under his immediate predecessor, <strong>Angela Merkel</strong>, and as federal minister of finance ...",
    "published": null
  }
]