[
  {
    "title": "Samy Bengio",
    "url": "https://bengio.abracadoudou.com/",
    "snippet": "More recently I have been <strong>sponsoring our new MLX library, for machine learning on Apple silicon</strong>.",
    "published": null
  },
  {
    "title": "Samy Bengio",
    "url": "https://scholar.google.com/citations?user=Vs-MdPcAAAAJ&hl=en",
    "snippet": "Samy Bengio · Senior Director, AI and ML Research, Apple · Verified email at apple.com - Homepage · Machine LearningDeep LearningRepresentation LearningReasoningProf EPFL · ArticlesCited byPublic accessCo-authors · PrivacyTermsHelp ·",
    "published": null
  },
  {
    "title": "The AI revolution is here - UdeMNouvelles",
    "url": "https://nouvelles.umontreal.ca/en/article/2023/11/10/the-ai-revolution-is-here",
    "snippet": "Yoshua Bengio: No, not at all! Looking back at AI’s trajectory over the past 20 years, we’re amazed at how rapidly it has reached the levels of performance we see today. The systems were so rudimentary back then. Even the developers are astonished. What we are witnessing is a revolution comparable to the advent of electricity. What are some of the advances you never thought possible? Samy Bengio: In the past year, two technologies that have been around for a while started to perform spectacularly.",
    "published": null
  },
  {
    "title": "Google's Samy Bengio is leaving amid fallout from AI researcher firing",
    "url": "https://www.cnbc.com/2021/04/06/googles-samy-bengio-is-leaving-amid-fallout-from-ai-researcher-firing.html",
    "snippet": "Samy Bengio, a well-known researcher at Google&#x27;s research group Brain, announced on Tuesday he&#x27;s <strong>resigning from Google</strong>.",
    "published": "April 6, 2021"
  },
  {
    "title": "Samy Bengio - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Samy_Bengio",
    "snippet": "Bengio is <strong>senior director of Artificial Intelligence and Machine Learning Research at Apple and an adjunct professor at École Polytechnique Fédérale de Lausanne</strong>. He was a longtime scientist at Google, where he led a large group of researchers ...",
    "published": "November 14, 2025"
  }
]