[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "<strong>It was subsequently acquired by TF1 Group, and later merged with Screensport</strong>. For a period, it was a joint venture between TF1, Canal+ Group, and Havas Images. TF1 Group later bought out the other owners&#x27; shares. In 2012, Discovery Communications began to take an ownership in Eurosport, eventually ...",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/eurosport",
    "snippet": "Eurosport was <strong>founded in February 1989</strong>.",
    "published": null
  },
  {
    "title": "Eurosport | LinkedIn",
    "url": "https://www.linkedin.com/company/eurosport",
    "snippet": "External link for Eurosport · Industry · Broadcast Media Production and Distribution · Company size · 501-1,000 employees · Headquarters · London, England · Type · Privately Held · <strong>Founded · 1989</strong> · Specialties · Broadcast, Multimedia, ...",
    "published": null
  },
  {
    "title": "Eurosport | Warner Bros. Entertainment Wiki | Fandom",
    "url": "https://warnerbros.fandom.com/wiki/Eurosport",
    "snippet": "Discovery through its TNT Sports ... <strong>Originally a joint venture between the European Broadcasting Union and Sky established in 1989, it was briefly shut down in 1991 following complaints by competitor Screensport</strong>...",
    "published": null
  },
  {
    "title": "The History of Warner Bros. Discovery Sports",
    "url": "https://wbdsports.com/page/our-history",
    "snippet": "Today, Eurosport is proud to call itself the number one sport destination in Europe, with its two channels now reaching 246 million cumulative subscribers across 75 countries in Europe, Asia Pacific, Africa and the Middle East and Eurosport.com positioned as Europe’s No 1 online sports news website with an average of 30 million unique users per month. *TV Audience aged +3 or +4 depending on official data in each market. The International Olympic Committee (IOC) announced that all TV and multi-platform broadcast rights in Europe for the four Olympic Games in the 2018–2024 period have been awarded to Discovery Communications, the parent company of Eurosport.",
    "published": null
  }
]