[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Ideological differences are short lived, but the way Manmohan Singh has guided this House and the country for such a long period, he will be remembered for his contributions during every discussion on our democracy. Modi also recalled when Singh arrived at the Parliament in a wheelchair to cast his vote over a key legislation. Following his death, Prime Minister Narendra Modi called Singh one of &quot;India&#x27;s most distinguished leaders&quot; and declared national mourning.",
    "published": "2 weeks ago"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "This was soon followed by his appointment as Chief Economic Advisor in the Ministry of Finance in 1972. Over his career, Dr. Singh held several significant positions, including Secretary in the Ministry of Finance, Deputy Chairman of the Planning Commission, Governor of the Reserve Bank of India, Advisor to the Prime Minister, and Chairman of the University Grants Commission.",
    "published": null
  },
  {
    "title": "Manmohan Singh | Biography, Reforms, Political Career, & Death | Britannica",
    "url": "https://www.britannica.com/biography/Manmohan-Singh",
    "snippet": "He was also the first prime minister after Jawaharlal Nehru to return to office after completing a full five-year term (2004–09). As finance minister in P.V. Narasimha Rao’s government (1991–96), Singh introduced economic reforms focused on liberalization, privatization, and globalization to pull India out of a severe financial crisis.",
    "published": "February 24, 2005"
  },
  {
    "title": "Manmohan Singh's decisions that shaped a billion lives",
    "url": "https://www.bbc.com/news/articles/cg4zg690py9o",
    "snippet": "Despite stiff opposition from members of his government and party, Singh prevailed. He took bold measures that included <strong>devaluing the currency, reducing import tariffs and privatising state-owned companies</strong>.",
    "published": "December 27, 2024"
  },
  {
    "title": "DR. MANMOHAN SINGH",
    "url": "https://inc.in/our-inspiration/dr-manmohan-singh",
    "snippet": "This story of unprecedented growth and prosperity is the story of Dr Singh’s premiership from 2004-2014. But it began during his tenure as Finance Minister from 1991-1996 when the script first began to take shape. In July 1991, Dr Manmohan Singh ended his budget speech with the words “No power on earth can stop an idea whose time has come.",
    "published": null
  }
]