[
  {
    "title": "DFG - German Research Foundation",
    "url": "https://www.dfg.de/en",
    "snippet": "<strong>DFG Welcomes EU Agreement on New Breeding Techniques</strong> · Call for swift implementation of the new legal framework",
    "published": null
  },
  {
    "title": "Germany news roundup: 3-9 December - Research Professional News",
    "url": "https://www.researchprofessionalnews.com/rr-news-europe-germany-2025-12-germany-news-roundup-3-9-december/",
    "snippet": "Germany 09 Dec 2025 · By Hristio ... · In depth: <strong>The German Research Foundation (DFG) and German ministers have argued against a petition calling on the country to ban the use of monkeys for research</strong>....",
    "published": "1 week ago"
  },
  {
    "title": "DFG, German Research Foundation - Information for Researchers | 2025",
    "url": "https://www.dfg.de/en/news/news-topics/announcements-proposals/2025",
    "snippet": "Information for Researchers, No. 81 | 6 October 2025 · New Edition of the French-German Call for Proposals in the Natural, Life and Engineering Sciences (ANR-DFG 2026 NLE)",
    "published": null
  },
  {
    "title": "University of Münster to receive renewed funding to support physicians engaged in research",
    "url": "https://www.uni-muenster.de/news/view.php?cmdid=15175",
    "snippet": "December 2025 | Münster (upm/dn) Delighted by the success of the Clinician Scientist programme in Münster: <strong>Spokesperson Professor Michael Schäfers and Coordinator Dr Silke Jamitzky (centre), Dean Professor Frank Ulrich Müller (left) and Medical Director Professor Alex W. Friedrich (right).</strong>",
    "published": "4 days ago"
  },
  {
    "title": "German Research Foundation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/German_Research_Foundation",
    "snippet": "The German Research Foundation is a member of Science Europe. The Heisenberg Programme of the DFG is aimed at young outstanding scientists who meet all the requirements for appointment to a permanent professorship. The programme was named after the German physicist Werner Heisenberg, who received the Nobel Prize in Physics at the age of 31. The funding programme aims to enable scientists to prepare for a scientific leadership position and to work on further research topics during this time.",
    "published": "October 2, 2025"
  }
]