[
  {
    "title": "World Report 2025: Ethiopia | Human Rights Watch",
    "url": "https://www.hrw.org/world-report/2025/country-chapters/ethiopia",
    "snippet": "In mid-November, the Ethiopian ... Rights (LHR), forcing the organizations to cease their work. <strong>Ethiopian authorities lifted the suspension on December 11.</strong>...",
    "published": "January 16, 2025"
  },
  {
    "title": "Ethiopia situation update (5 February 2025) | ACLED",
    "url": "https://acleddata.com/update/ethiopia-situation-update-5-february-2025",
    "snippet": "For the first time since September ... From 15 December 2024 to 31 January 2025, <strong>ACLED records 97 battles between these actors, a 44% decrease compared to the previous seven weeks</strong>....",
    "published": null
  },
  {
    "title": "Ethiopia | International Crisis Group",
    "url": "https://www.crisisgroup.org/africa/horn-africa/ethiopia",
    "snippet": "Electoral authorities 17 Nov invited candidates to register for general elections – tentatively set for 1 June 2026 – despite concerns that security conditions in Oromia and Amhara regions, alongside political dispute with Tigray, could prevent voting in large parts of country, undermining poll’s credibility. Continue reading · 10 Dec 2025 There’s a possibility of mistakes or miscalculation [between Ethiopia and Eritrea], and the situation could deteriorate further in the coming months.",
    "published": null
  },
  {
    "title": "Ethiopia situation update (5 March 2025) | ACLED",
    "url": "https://acleddata.com/update/ethiopia-situation-update-5-march-2025",
    "snippet": "In January, numerous Tigray security force senior leaders openly sided with Debretsion (for more on the internal dispute, see EPO Monthly Update: October 2024 and Ethiopia Situation Update (5 February 2025)). Since the signing of a peace agreement between the Oromia regional government and a faction of Oromo Liberation Army (OLA) — referred to by the government as the Oromo Liberation Front (OLF)-Shane — on 1 December 2024, political violence has been decreasing in the region (for more, see Ethiopia Weekly Update (10 December 2024), Ethiopia Weekly Update (17 December 2024); Ethiopia Situation Update (5 February 2025), and Ethiopia Situation Update (19 February 2025)).",
    "published": null
  },
  {
    "title": "The Habesha: Trusted Ethiopian News & In-Depth Analysis",
    "url": "https://zehabesha.com/",
    "snippet": "By Zehabesha News DeskDecember 5, 2025 <strong>The Federal High Court has sentenced Taye Dendea, former State Minister at the Ministry of Peace and member of the Oromia Regional Council, to seven years</strong>",
    "published": "April 17, 2025"
  }
]