[
  {
    "title": "European Bank for Reconstruction and Development - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Bank_for_Reconstruction_and_Development",
    "snippet": "Representatives from each member state compose this board, they have authority power. Currently (2024-2025) <strong>Slovenia is the Chair of Board of Governors</strong>, while Iceland and Turkey are the Vice Chairs.",
    "published": "1 week ago"
  },
  {
    "title": "Odile Renaud-Basso | World Bank Live",
    "url": "https://live.worldbank.org/en/experts/o/odile-renaud-basso",
    "snippet": "The EBRD’s Board of Governors elected Ms Renaud-Basso as the Bank’s seventh President in October 2020 during its 29th Annual Meeting. She took up the role in November 2020, replacing <strong>Sir Suma Chakrabarti</strong>, who had stepped down in July 2020 ...",
    "published": null
  },
  {
    "title": "Odile Renaud-Basso - European Commission",
    "url": "https://commission.europa.eu/persons/odile-renaud-basso_en",
    "snippet": "The EBRD’s Board of Governors re-elected <strong>Ms Renaud-Basso for a second term as President at its 33rd Annual Meeting held in Yerevan, Armenia. The Board first elected her as the Bank’s seventh President in October 2020 during its 29th Annual Meeting. She took up her role in November 2020, replacing Sir Suma Chakrabarti</strong>...",
    "published": null
  },
  {
    "title": "La Moncloa. 08/05/2019. Nadia Calviño to become chair of European Bank of Reconstruction and Development's board of governors [Government/News]",
    "url": "https://www.lamoncloa.gob.es/lang/en/gobierno/news/Paginas/2019/20190508chair-ebrd.aspx",
    "snippet": "08 May 2019. The board of governors of the European Bank for Reconstruction and Development (EBRD) has officially appointed the Acting Minister for Economy and Business of Spain, <strong>Nadia Calviño</strong>, as its new chair.",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development Shareholders and Board of Governors",
    "url": "https://web.archive.org/web/20170228141219/http:/www.ebrd.com/shareholders-and-board-of-governors.html",
    "snippet": "Full list of the shareholders and board of governors of the European Bank for Reconstruction and Development (EBRD) which is owned by 65 countries and two European insitutions.",
    "published": null
  }
]