[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "The ownership of the certificates gave Viking the exclusive right to manufacture new aircraft; previously, Viking had purchased in <strong>May 2005</strong> the right to manufacture spares and distribute the de Havilland heritage aircraft product line. In addition to the de Havilland type certificates, Viking ...",
    "published": "3 hours ago"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "Commuter airlines did not create the high demand that the company had expected for its 50-passenger DHC-7 Dash 7. In <strong>1974</strong>, the year before the Dash 7 first flew, the Canadian government purchased de Havilland Canada from its British owners, ...",
    "published": null
  },
  {
    "title": "De Havilland Canada Amalgamation - De Havilland Canada",
    "url": "https://dehavilland.com/amalgamation/",
    "snippet": "On <strong>August 1, 2024</strong>, our group of Canadian aviation corporations, including De Havilland Aircraft of Canada Limited, De Havilland Flight Operations Limited, Viking Air Limited, Longview Aviation Services Inc. and Longview Distribution Services ...",
    "published": "August 1, 2024"
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "At this point, Longview would re-establish a link between the &quot;De Havilland Canada&quot; name and the Dash 8-400. ... Years later, Longview Aviation Capital announced that De Havilland Aircraft of Canada Limited would &quot;become the operating brand&quot; for companies currently operating as Longview Aviation, Viking Air, Pacific Sky Training, and De Havilland Canada.",
    "published": "February 21, 2024"
  },
  {
    "title": "de Havilland Canada (1928–1986) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada_(1928–1986)",
    "snippet": "The Downsview plant still turns out civil propeller aircraft, and the facility maintains thousands of employees. In <strong>November 2018,</strong> Viking Air&#x27;s parent Longview Aviation Capital Corporation acquired the Dash 8 program and the de Havilland brand from Bombardier, in a deal which closed on 3 June ...",
    "published": "November 1, 2025"
  }
]