[
  {
    "title": "Removal of President Omar al-Bashir and the Continued Pursuit of Justice - United States Holocaust Memorial Museum",
    "url": "https://www.ushmm.org/genocide-prevention/countries/sudan/removal-of-president-omar-al-bashir",
    "snippet": "In <strong>April 2019</strong> he was removed from office, and by August a civilian-military transitional government had formed. Since then, the difficult process of forming a new government has continued.",
    "published": null
  },
  {
    "title": "Omar al-Bashir - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Omar_al-Bashir",
    "snippet": "Omar Hassan Ahmad al-Bashir (born 1 January 1944) is a Sudanese former military officer and politician who served as Sudan&#x27;s head of state under various titles from 1989 until 2019, when he was <strong>deposed in a coup d&#x27;état</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "2019 Sudanese coup d'état - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2019_Sudanese_coup_d'%C3%A9tat",
    "snippet": "By February 2019, Bashir had declared the first state of national emergency in twenty years amidst increasing unrest. <strong>On 11 April, the Sudanese military removed Omar al-Bashir from his position as President of Sudan</strong>, dissolved the cabinet and the National Legislature, and announced a three-month ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Abandoned by the UAE, Sudan’s Bashir was destined to fall",
    "url": "https://www.reuters.com/investigates/special-report/sudan-bashir-fall/",
    "snippet": "Sudan&#x27;s President Omar Hassan al-Bashir was among the Arab world&#x27;s longest serving rulers. He was toppled in April, after four months of street protests. Here he is pictured in Khartoum in June 2015 after being sworn in for a new presidential term.",
    "published": "July 3, 2019"
  },
  {
    "title": "Sudan coup: Why Omar al-Bashir was overthrown",
    "url": "https://www.bbc.com/news/world-africa-47852496",
    "snippet": "Sudan&#x27;s deposed President Omar al-Bashir is <strong>under arrest after being overthrown by the military following months of protests</strong> - and the coup leader himself announced his resignation just 24 hours after taking charge.",
    "published": "April 15, 2019"
  }
]