[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "On 31 July, they filed a document to register an organising committee of a future party named &quot;<strong>The People&#x27;s Alliance</strong>&quot;. The party identified itself as centrist; one of the then-current leaders of the party, and Navalny&#x27;s ally Vladimir Ashurkov, explained this was intended to help the party get ...",
    "published": "2 days ago"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "On 22 February 2018, the former deputy coordinator of the Moscow headquarters of the presidential campaign of Alexei Navalny, Vitaly Serukanov, stated on his Facebook page that documents had been submitted to the Ministry of Justice to rename the party Civic Position to <strong>Party of Progress</strong>.",
    "published": "September 30, 2025"
  },
  {
    "title": "Europe: Alexei Navalny - A Fearless Democrat",
    "url": "https://www.freiheit.org/andean-states/alexei-navalny-fearless-democrat",
    "snippet": "This set him apart from many opponents who were primarily involved in parties and NGOs. Alexei Navalny always aimed to reach a broader segment of the population than other opposition forces. Additionally, he had the confidence and courage to aspire to the highest offices and to organize structures to support him. He was able to lead campaigns along with his circle of followers, a significant achievement in a repressive environment that increasingly limited political criticism and opposition.",
    "published": null
  },
  {
    "title": "Kremlin Foe Navalny Launches New Political Party",
    "url": "https://www.rferl.org/a/russia-navalny-new-political-party/29237240.html",
    "snippet": "Russian opposition leader Aleksei Navalny has launched a new political party, though he missed its founding due to a jail sentence over nationwide protests he organized against President Vladimir Putin.",
    "published": "May 19, 2018"
  },
  {
    "title": "Alexei Navalny - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.m.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "In 2000, Navalny joined the <strong>Russian United Democratic Party</strong>, &quot;Yabloko&quot;. He became known through his LiveJournal blog. In 2012, The Wall Street Journal described him as &quot;the man Vladimir Putin fears most.&quot;",
    "published": "August 30, 2025"
  }
]