[
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "Greta Conway Van Susteren (born June 11, 1954) is an American journalist, lawyer, and television news anchor for Newsmax TV. She was previously on <strong>CNN, Fox News, and MSNBC</strong>. She hosted Fox News&#x27;s On the Record w/ Greta Van Susteren for 14 years (2002–2016) before departing for MSNBC, where ...",
    "published": "August 20, 2025"
  },
  {
    "title": "Greta Van Susteren Will Join Newsmax Early-Evening Lineup in June",
    "url": "https://variety.com/2022/tv/news/greta-van-susteren-newsmax-1235275722/",
    "snippet": "Greta Van Susteren says she just couldn’t stay away from the immediacy of cable news. For the past few years, Van Susteren, one of the few anchors who can say they have been employed by CNN, MSNBC and Fox News Channel, has been working as a political analyst for Gray Television and doing a show for Voice of America.",
    "published": "May 24, 2022"
  },
  {
    "title": "Greta Van Susteren",
    "url": "https://www.forbes.com/profile/greta-van-susteren/",
    "snippet": "A former criminal defense and civil trial lawyer, the Georgetown law grad got her start on TV as a legal commentator at CNN, contributing to coverage of the O.J. Simpson murder trial and the Elian Gonzalez custody battle. At CNN she co-hosted a daily legal analysis show, &quot;Burden of Proof&quot;, and hosted the station&#x27;s prime-time news and analysis show, &quot;The Point with Greta Van Susteren,&quot; before joining Fox in 2002.",
    "published": null
  },
  {
    "title": "Greta Van Susteren (@greta) / X",
    "url": "https://x.com/greta?lang=en",
    "snippet": "Greta Van Susteren · @greta · · · Apr 26, 2022 · Some twitter employees say they will quit over · @elonmusk buying twitter..I have never met Musk but for some reason I don’t think he cares if they quit..your thoughts? 6.9K · 3.6K · 50K · Sign up now to get your own personalized timeline!",
    "published": "August 28, 2008"
  },
  {
    "title": "Greta Van Susteren – USC Center on Communication Leadership and Policy",
    "url": "https://communicationleadership.usc.edu/greta-van-susteren-3/",
    "snippet": "Prior to Fox, Greta <strong>worked at CNN for 7 years</strong> where she started out as a legal analyst then became co-host of CNN’s daily legal program Burden of Proof. She went on to host the channel’s prime time news and analysis show The Point with Greta Van Susteren.",
    "published": null
  }
]