[
  {
    "title": "Italian Communist Party - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Italian_Communist_Party",
    "snippet": "At the time, it was the largest ... the vote (12.6 million votes) in the 1976 Italian general election. <strong>The PCI was part of the Constituent Assembly of Italy and the Italian government from 1944 to 1947</strong>, when the United States ordered a removal from government of the PCI ...",
    "published": "1 week ago"
  },
  {
    "title": "Communist Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Communist_Party_(Italy)",
    "snippet": "With regards to the history of the communist movement in Italy, <strong>the PC recognizes as leading figures Antonio Gramsci and Pietro Secchia while it takes a highly critical stand on Palmiro Togliatti and Enrico Berlinguer</strong>. Unlike other Italian communist organizations, the PC welcomes the historical ...",
    "published": "October 10, 2025"
  },
  {
    "title": "The Rise and Fall of the Italian Communist Party: Introduction | Stanford University Press",
    "url": "https://www.sup.org/books/history/rise-and-fall-italian-communist-party/excerpt/introduction",
    "snippet": "In actual fact, this history was part of a global project that gave rise to a source of identity, a connective tissue, and the guiding star of a vision of the world centered on the idea of politics as a demiurgic force.4 · Unlike the French communists, with whom they were in close contact during the years of exile, the Italians did not participate in this project through the means of a European great power and an imperial metropolis.5 They had experienced semilegality, clandestinity, emigration, and imprisonment in a country that had fallen to a Fascist dictatorship during the tumultuous years of the century’s first postwar period.",
    "published": null
  },
  {
    "title": "A Brief History of Italian Communism | Communist Crimes",
    "url": "https://communistcrimes.org/en/brief-history-italian-communism",
    "snippet": "The Italian Communist Party, widely known as PCI, was <strong>founded in 1921 in the Tuscanian town of Livorno following the secession from the Italian Socialist Party</strong>, and it eventually became the stronghold of Western communism.",
    "published": null
  },
  {
    "title": "The Rise and Fall of the Italian Communist Party | Stanford University Press",
    "url": "https://www.sup.org/books/history/rise-and-fall-italian-communist-party",
    "snippet": "Following three leaders of the Italian Communist Party (Antonio Gramsci, Palmiro Togliatti, and Enrico Berlinguer) from the First World War to the fall of the Soviet Union, Silvio Pons considers the broader relationship between communism and Cold War history, the history of decolonization, and the rise of &quot;Europe&quot; as a political category.",
    "published": null
  }
]