[
  {
    "title": "Sundar Pichai - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sundar_Pichai",
    "snippet": "Pichai Sundararajan (born June 10, 1972), better known as Sundar Pichai (pronounced: /ˈsʊndɜːr pɪˈtʃeɪ/), is an Indian-American business executive. He is the chief executive officer (CEO) of Alphabet Inc. and its subsidiary Google. Pichai <strong>began his career as a materials engineer</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Sundar Pichai - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm6640826/bio/",
    "snippet": "Sundar is the <strong>CEO of Google and Alphabet and serves on Alphabet&#x27;s Board of Directors</strong>. He joined Google in 2004 and helped lead the development of Google Toolbar and then Google Chrome, which grew to become the world&#x27;s most popular internet browser.",
    "published": null
  },
  {
    "title": "Who is the CEO of Google? Sundar Pichai’s Bio | Clay",
    "url": "https://www.clay.com/dossier/google-ceo",
    "snippet": "<strong>Born in Madurai, Tamil Nadu, India, Sundar Pichai is an accomplished business executive who currently serves as the CEO of both Google and its parent company, Alphabet Inc</strong>. Pichai&#x27;s educational background includes a degree in metallurgical engineering from IIT Kharagpur, an M.S.",
    "published": null
  },
  {
    "title": "Sundar Pichai | Biography, Google, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Sundar-Pichai",
    "snippet": "Sundar Pichai <strong>became CEO of Google in 2015 and CEO of Alphabet in 2019.</strong> He has held roles such as vice president of product development, senior vice president, and product chief.",
    "published": "2 weeks ago"
  },
  {
    "title": "Sundar Pichai Biography: Leadership and Life Wisdom from Goggle's CEO: Stallworth, George: 9798866220694: Amazon.com: Books",
    "url": "https://www.amazon.com/Sundar-Pichai-Biography-Leadership-Goggles/dp/B0CMDKD9S8",
    "snippet": "<strong>From his modest beginnings in India to his groundbreaking contributions to products like Chrome, Android, and Google Cloud, this biography uncovers the secrets behind Pichai&#x27;s remarkable success</strong>.",
    "published": null
  }
]