[
  {
    "title": "Prime Minister of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Saudi_Arabia",
    "snippet": "Due to unrest within the royal family over his rule, Saud was forced to appoint his half-brother, <strong>Crown Prince Faisal</strong>, as prime minister. An ongoing power struggle between the two led to Faisal&#x27;s resignation in 1960, allowing Saud to reclaim the reins of government, but continued discontent ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing - HOG",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?OpenForm=&ExpandView=&RestrictToCategory=Saudi+Arabia",
    "snippet": "The Heads of Government listing is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers and in some cases, ministers responsible for development assistance.",
    "published": null
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?RestrictToCategory=Saudi+Arabia",
    "snippet": "The heads of government list is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers, trade ministers and in some cases, ministers responsible for development assistance.&amp;nbsp It has been prepared using information provided by ...",
    "published": null
  },
  {
    "title": "Politics of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Saudi_Arabia",
    "snippet": "Saudi government is authoritarian, although some analysts have characterized the government of <strong>Mohammed bin Salman</strong> as totalitarian. The Crown Prince and Prime Minister of Saudi Arabia, <strong>Mohammed bin Salman</strong>, is the de facto ruler of Saudi Arabia.",
    "published": "November 2, 2025"
  },
  {
    "title": "Saudi Arabia (10/06)",
    "url": "https://2009-2017.state.gov/outofdate/bgn/saudiarabia/74242.htm",
    "snippet": "The border with Oman also is not demarcated. <strong>King Abdul Aziz</strong> died in 1953 and was succeeded by his eldest son, Saud, who reigned for 11 years. In 1964, Saud abdicated in favor of his half-brother, Faisal, who had served as Foreign Minister.",
    "published": null
  }
]