[
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "Carney graduated in the class of 1983 from <strong>St. Francis Xavier High School</strong>, Edmonton, Alberta. From there, he went on to study at Harvard University with a partial scholarship and financial aid. During his Harvard years, he was backup goalie for the varsity ice hockey team and was a roommate ...",
    "published": "7 hours ago"
  },
  {
    "title": "Mark Carney's dad was the principal of an N.W.T. day school",
    "url": "https://www.aptnnews.ca/national-news/mark-carney-father-was-the-principal-of-a-n-w-t-day-school-survivors/",
    "snippet": "“He was my principal, he was great,” said Frieda Martselos, who attended <strong>Joseph Burr Tyrell (JBT) school in Fort Smith</strong>, a town in the southeastern part of the northern territory near the Alberta border.",
    "published": "April 16, 2025"
  },
  {
    "title": "Untangling Mark Carney's father's ties to Fort Smith, N.W.T., Indian day school | CBC News",
    "url": "https://www.cbc.ca/news/indigenous/robert-carney-jbt-day-school-1.7501066",
    "snippet": "And it&#x27;s also true Indigenous children from <strong>Fort Smith&#x27;s Grandin College and Breynat Hall residential schools</strong> attended the day school during Carney&#x27;s principalship, which",
    "published": "April 3, 2025"
  },
  {
    "title": "r/Edmonton on Reddit: Mark Carney, Canada's 24th prime minister, grew up in Edmonton and supports the Edmonton Oilers and Edmonton Elks",
    "url": "https://www.reddit.com/r/Edmonton/comments/1j7s7in/mark_carney_canadas_24th_prime_minister_grew_up/",
    "snippet": "According to Wikipedia, Mark Carney grew up in Edmonton and attended <strong>St. Francis Xavier High School</strong> before studying at Harvard University.",
    "published": "March 10, 2025"
  },
  {
    "title": "Mark Carney, from Edmonton Journal paperboy to Bank of England | Edmonton Journal",
    "url": "https://edmontonjournal.com/news/national/mark-carney-edmonton-journal-bank-of-england",
    "snippet": "... He attended <strong>St. Rose Catholic junior high school and St. Francis Xavier high school</strong>, where he had a general sense of where his career would take him. ... “My dad was an academic so I had an interest in academia …",
    "published": "January 16, 2025"
  }
]