[
  {
    "title": "Arteta's update on Rice, Timber, Trossard & Saliba | Press conference | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/artetas-update-rice-timber-trossard-saliba",
    "snippet": "Share Connor Booth 12 Dec 2025 · <strong>Mikel Arteta</strong> has delivered the latest news on the fitness of several first team players as we prepare to host Wolves in the Premier League on Saturday, December 13.",
    "published": null
  },
  {
    "title": "2025–26 Arsenal F.C. season - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025–26_Arsenal_F.C._season",
    "snippet": "Erling Haaland gave City an early lead from a counter-attack, but Arsenal equalised late on when substitute Martinelli lobbed Gianluigi Donnarumma after a pass from Eze. The match ended 1–1, with <strong>Mikel Arteta</strong> becoming the first manager to avoid defeat in five consecutive league games against ...",
    "published": "2 days ago"
  },
  {
    "title": "Arsenal FC - Transfer news, results, fixtures, video & audio",
    "url": "https://www.bbc.com/sport/football/teams/arsenal",
    "snippet": "<strong>Mikel Arteta has made eight changes to the side that beat Everton at the weekend</strong>. Riccardo Calafiori is at centre-back with William Saliba and Gabriel Jesus makes his first start for 345 days.",
    "published": null
  },
  {
    "title": "Six years of Mikel Arteta at Arsenal: What next for club and manager? - The Athletic",
    "url": "https://www.nytimes.com/athletic/6899315/2025/12/19/mikel-arteta-arsenal-six-years/",
    "snippet": "Talks with Arteta over his future are on the horizon. What will Arsenal and the Spaniard need to consider?",
    "published": "5 days ago"
  },
  {
    "title": "Arteta's update on White, Gabriel and Zubimendi | Press conference | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/artetas-update-white-gabriel-and-zubimendi",
    "snippet": "Mikel Arteta issued updates on the fitness of Ben White, Gabriel, Kai Havertz and Martin Zubimendi",
    "published": null
  }
]