[
  {
    "title": "Martin 'absolutely' confident he will remain FF leader",
    "url": "https://www.rte.ie/news/politics/2025/1216/1549211-fianna-fail-review/",
    "snippet": "<strong>Taoiseach Micheál Martin has said he has absolute confidence in remaining as Fianna Fáil leader</strong> after receiving the review of his party&#x27;s presidential election campaign.",
    "published": "2 hours ago"
  },
  {
    "title": "Michéal Martin warned FF won’t tolerate bid to scapegoat Chambers",
    "url": "https://extra.ie/2025/12/15/news/micheal-martin-ff-warning",
    "snippet": "News · John Drennan · 15/12/2025 · Fianna Fáil veteran John McGuinness has warned leader Micheál Martin the party ‘won’t tolerate any attempt to scapegoat individuals like Jack Chambers in order to save the leader’. Speaking about the review into Fianna Fáil’s Presidential campaign – due to be discussed in a five-hour special meeting of the party this week – Mr McGuinness TD said: ‘The report will be unacceptable if it tries the old trick of just finding someone other than the leader to blame.’ ·",
    "published": "1 day ago"
  },
  {
    "title": "Statement by Taoiseach Micheál Martin on Sydney attack",
    "url": "https://www.gov.ie/en/department-of-the-taoiseach/press-releases/statement-by-taoiseach-miche%C3%A1l-martin-on-sydney-attack/",
    "snippet": "News · Departments · Services · Press release · From: Department of the Taoiseach · Published on: 14 December 2025 · Last updated on: 14 December 2025 · I am shocked and appalled by the gun attack targeting Sydney’s Jewish community that has left at least twelve dead and dozens more injured.",
    "published": "2 days ago"
  },
  {
    "title": "'Micheál knew about the Jim Gavin rumours': Fianna Fáil row over presidential election review deepens",
    "url": "https://www.irishexaminer.com/news/politics/arid-41760545.html",
    "snippet": "news · Politics · In a scathing statement, <strong>Micheál Martin disputed “commentary of the past week”, which he described as “extremely disappointing, selective and inaccurate”.</strong> Mr Gavin withrew from the election in October after failing ...",
    "published": "2 hours ago"
  },
  {
    "title": "Micheál Martin confident he will remain as Fianna Fáil leader as he receives presidential report - Irish Mirror",
    "url": "https://www.irishmirror.ie/news/irish-news/politics/micheal-martin-confident-remain-fianna-36408836",
    "snippet": "News · Ciara O&#x27;Loughlin · 11:17, 16 Dec 2025 · View Image · <strong>Taoiseach Micheal Martin speaking to reporters before a Cabinet meeting at Government Buildings, Dublin</strong>.",
    "published": "26 minutes ago"
  }
]