[
  {
    "title": "Portugal - Parliamentary Democracy, Autonomous Regions, EU Member | Britannica",
    "url": "https://www.britannica.com/place/Portugal/Government-and-society",
    "snippet": "Portugal’s chief of state is the president, who is directly elected by universal suffrage for a five-year term and may be elected to only two consecutive terms. The president is responsible for guaranteeing Portugal’s independence and national unity.",
    "published": "3 weeks ago"
  },
  {
    "title": "List of presidents of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Portugal",
    "snippet": "Not shown are Manuel de Arriaga (born in Horta, Azores, Portugal), Teófilo Braga (born in Ponta Delgada, Azores, Portugal), and Bernardino Machado (born in Rio de Janeiro, Brazil). ... ^ Teófilo Braga served as President of the Provisional Government, the de facto head of government and head of state, from the republican revolution of 1910 to the election of Manuel de Arriaga, the 1st President of Portugal.",
    "published": "2 weeks ago"
  },
  {
    "title": "List of heads of state of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Portugal",
    "snippet": "^ Teófilo Braga served as President of the Provisional Government, the de facto head of government and head of state, from the republican revolution of 1910 to the election of Manuel de Arriaga, the 1st President of Portugal.",
    "published": "2 weeks ago"
  },
  {
    "title": "Portugal's president invites caretaker PM to lead new government | Reuters",
    "url": "https://www.reuters.com/world/europe/portugals-president-invites-caretaker-pm-lead-new-government-2025-05-29/",
    "snippet": "Portugal&#x27;s president named Luis Montenegro, head of the centre-right Democratic Alliance (AD) that won a snap national election on May 18, as the prime minister on Thursday and invited him to form his second minority government, the presidency said.",
    "published": "May 29, 2025"
  },
  {
    "title": "Presidents and Matrons of the Lisbon Portugal Temple | ChurchofJesusChristTemples.org",
    "url": "https://churchofjesuschristtemples.org/lisbon-portugal-temple/presidents/",
    "snippet": "Temple presidents and matrons are called to oversee all activities performed at the temple. They serve voluntarily, usually for a period of several years. Following is a list of the current and former presidents and matrons of the Lisbon Portugal Temple.",
    "published": null
  }
]