[
  {
    "title": "President of Georgia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Georgia",
    "snippet": "<strong>Salome Zourabichvili</strong> stated on 29 December and during the following weeks that she remained the president of Georgia. Protests against the ruling party have continued since the election, with hundreds of protesters arrested, beaten or tortured by the police and the ruling-party affiliated violent ...",
    "published": "4 weeks ago"
  },
  {
    "title": "Salomé Zourabichvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salom%C3%A9_Zourabichvili",
    "snippet": "On 9 January 2025, <strong>Zourabichvili</strong> held a press briefing at her new office on Chovelidze street, stating that she would continue to work to solve the crisis, meeting people around Georgia and internationally. She stated that she would attend the inauguration of Donald Trump and hold high-level ...",
    "published": "5 days ago"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "Kavelashvili, 53, who was the only candidate on the ballot, easily won the vote earlier in December given the Georgian Dream party’s control of a 300-seat electoral college that replaced direct presidential elections in 2017.",
    "published": "December 29, 2024"
  },
  {
    "title": "New Georgian President Sworn In Amid Political Standoff",
    "url": "https://www.rferl.org/a/georgia-tbilisi-kavelashvili-zourabichvili/33256787.html",
    "snippet": "TBILISI -- <strong>Mikheil Kavelashvili</strong>, a former soccer player and right-wing populist, has been sworn in as Georgia&#x27;s new president amid a monthslong political crisis, likely further complicating the country&#x27;s prospects for European Union membership.",
    "published": "December 29, 2024"
  },
  {
    "title": "Who is Georgia's president, Salome Zourabichvili?",
    "url": "https://www.dw.com/en/who-is-georgias-president-salome-zourabichvili/a-71169081",
    "snippet": "A showdown is expected on December 29 when Zourabichvili is supposed to cede the office to her successor. She has not made it clear whether she will physically leave the presidential palace or not, but she has promised to claim the presidency and stay in the country. In one of her almost daily addresses to the public on Tuesday, she once again stressed her commitment. &quot;This constitution has been trampled upon but has endured, just as Georgia endures.",
    "published": "December 28, 2024"
  }
]