[
  {
    "title": "Kyrgyzstan Under Japarov: The Country’s Decline Into Dictatorship - Human Rights Foundation",
    "url": "https://hrf.org/latest/kyrgyzstan-under-japarov-the-countrys-decline-into-dictatorship/",
    "snippet": "<strong>The peaceful transition of power was practiced</strong>. The country continued to show signs of a competitive authoritarian regime with manipulation of elections, restrictions on media freedom, and political pressure on the opposition.",
    "published": "February 26, 2025"
  },
  {
    "title": "After third revolution, Kyrgyzstan drifts further away from democracy",
    "url": "https://emerging-europe.com/news/after-third-revolution-kyrgyzstan-drifts-further-away-from-democracy/",
    "snippet": "Following a day and night of violent ... caretaker prime minister. A week later, following Jeenbekov’s resignation, <strong>Japarov assumed the presidency too</strong>....",
    "published": "October 14, 2021"
  },
  {
    "title": "From Prison to Presidency: Sadyr Japarov’s Victory",
    "url": "https://thediplomat.com/2021/01/from-prison-to-presidency-sadyr-japarovs-victory/",
    "snippet": "In Kyrgyzstan, where the cold winter has ushered in a thick blanket of smog, people voted to cement Sadyr Japarov’s meteoric victory. On January 10, Japarov rocketed past 16 other candidates with 79 percent of the vote. The nationalist politician also helped push through a shift in the country’s political landscape from a parliamentary system to a presidential one. Following the resignation of Sooronbay Jeenbekov three months ago, Japarov’s unusual rise from prison to the presidency is something unseen in the history of modern Central Asia.",
    "published": "January 11, 2021"
  },
  {
    "title": "Kyrgyzstan in the aftermath of revolution | OSW Centre for Eastern Studies",
    "url": "https://www.osw.waw.pl/en/publikacje/osw-commentary/2020-10-29/kyrgyzstan-aftermath-revolution",
    "snippet": "On 15 October Kyrgyzstan’s president, Sooronobay Jeenbekov, <strong>resigned from his position and his duties were taken over by the opposition leader, Sadyr Japarov</strong>. The change in power was brought about by large-scale protests which broke out on ...",
    "published": "November 12, 2020"
  },
  {
    "title": "Kyrgyzstan and Russia: Political, Economic and Security Ties Since 1991 – Armenian Council",
    "url": "https://council.am/en/entry/8498/kyrgyzstan-and-russia-political-economic-and-security-ties-since-1991/",
    "snippet": "2020 – Power shift: <strong>Mass protests over a disputed election force President Jeenbekov to resign</strong>. New leader Sadyr Japarov assumes office and reiterates Kyrgyzstan’s alliance with Russia amid internal power consolidation.",
    "published": "September 24, 2025"
  }
]