[
  {
    "title": "Juventus sack head coach Thiago Motta, replaced by Igor Tudor - The Athletic",
    "url": "https://www.nytimes.com/athletic/6189017/2025/03/23/thiago-motta-sacked-juventus/",
    "snippet": "Igor Tudor is the new Head Coach of the Men’s First Team. Welcome, Igor! Juventus thanks <strong>Thiago Motta</strong> for his work, passion and dedication during his time with the club. — JuventusFC 🇬🇧🇺🇸 (@juventusfcen) March 23, 2025 · Motta ...",
    "published": "March 23, 2025"
  },
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "Juventus Football Club announces that it has today relieved Igor Tudor of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of <strong>Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci</strong>.",
    "published": null
  },
  {
    "title": "Igor Tudor - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Igor_Tudor",
    "snippet": "On 23 March 2025, Tudor replaced <strong>Thiago Motta</strong> as head coach of Serie A club Juventus. This appointment marked the first time Juventus had appointed a foreign manager since Didier Deschamps in the 2006–07 season. He eventually guided the club to the fourth place of league table and Champions ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus sack manager Thiago Motta and bring in Igor Tudor as replacement | Juventus | The Guardian",
    "url": "https://www.theguardian.com/football/2025/mar/23/juventus-sack-thiago-motta-bring-in-igor-tudor",
    "snippet": "Tudor, 46, is a former Juve player and Croatia international who most recently was in charge of Lazio. In 2020, Tudor was <strong>Andrea Pirlos</strong> assistant at Juventus for one season.",
    "published": "March 23, 2025"
  },
  {
    "title": "Breaking: Juventus Announce New Manager Until 2026 After Sacking Igor Tudor",
    "url": "https://www.si.com/soccer/juventus/onsi/breaking-juventus-announce-new-manager-2026-sacking-igor-tudor",
    "snippet": "After sacking Igor Tudor last Monday, Juventus had <strong>Massimo Brambilla</strong> serving as interim coach during today&#x27;s match against Udinese, where they won 3-1.",
    "published": "October 29, 2025"
  }
]