[
  {
    "title": "Hawker Siddeley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Siddeley",
    "snippet": "Hawker Siddeley combined the legacies of several British aircraft manufacturers, emerging through a series of mergers and acquisitions as one of only two such major British companies in the 1960s. In 1977, Hawker Siddeley became a founding component of the nationalised British Aerospace (BAe).",
    "published": "August 29, 2025"
  },
  {
    "title": "Hawker Aircraft - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hawker_Aircraft",
    "snippet": "In 1933, the company was renamed Hawker Aircraft Limited, and it took advantage of the Great Depression and a strong financial position to purchase the Gloster Aircraft Company in 1934. The next year, it merged with the engine and automotive company <strong>Armstrong Siddeley</strong> and its subsidiary, Armstrong ...",
    "published": "2 weeks ago"
  },
  {
    "title": "History of HAWKER SIDDELEY GROUP PUBLIC LIMITED COMPANY – FundingUniverse",
    "url": "https://www.fundinguniverse.com/company-histories/hawker-siddeley-group-public-limited-company-history/",
    "snippet": "Its founder, <strong>Tommy Sopwith</strong>, produced the famous Sopwith Camel that shot down Germany&#x27;s World War I flying ace, the Red Baron. In World War II the company produced the Hawker Hurricane, which played a crucial role in the Battle of Britain in 1940.",
    "published": null
  },
  {
    "title": "Hawker Siddeley",
    "url": "https://heritage.baesystems.com/page/hawker-siddeley",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "The General History Of Hawker Siddeley",
    "url": "https://simpleflying.com/hawker-siddeley-history-guide/",
    "snippet": "Hawker Siddeley Aircraft was formed in 1935 when Hawker Aircraft purchased the companies of <strong>J.D. Siddeley</strong> which included Armstrong Siddeley which produced automobiles and engines, and aircraft manufacturer Armstrong Whitworth Aircraft.",
    "published": "September 26, 2024"
  }
]