[
  {
    "title": "European Bank for Reconstruction and Development - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Bank_for_Reconstruction_and_Development",
    "snippet": "Divided between its headquarters located in London, and field offices located elsewhere, the European Bank for reconstruction and development is made of a three-tier structure composed of firstly, <strong>the president and the staff, secondly the Board of Governors and finally the Board of Directors</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "European Bank for Reconstruction and Development (EBRD)",
    "url": "https://www.ebrd.com/",
    "snippet": "Join us on Tuesday 25 November 2025 at 16.00 (London time) for the launch of the Transition Report 2025-26 in the Auditorium at Five Bank Street, London E14 4BG. ... How we operate, and the services we offer to clients. ... A wide range of business sectors and industries. Information on the full range of what we offer. ... Environmentally sound and sustainable development is central to the EBRD’s mandate.",
    "published": null
  },
  {
    "title": "Who we are",
    "url": "https://www.ebrd.com/home/who-we-are.html",
    "snippet": "Each shareholder is represented on the Board of Governors, which has overall authority over the Bank. Our President is <strong>Odile Renaud-Basso</strong> (left). The President manages our work under the guidance of the Board of Directors.",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development (EBRD) | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/crs-product/IF11419",
    "snippet": "At the EBRD&#x27;s May 2022 annual meeting, ... now and for reconstruction.&quot; In August 2022, the Biden Administration nominated <strong>Richard L. A. Weiner</strong>, a lawyer at Sidley Austin, to be the U.S executive director at the Bank....",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development - EBRD | Ministry of Finance of the Slovak Republic",
    "url": "https://www.mfsr.sk/en/european-international-affairs/international-financial-institutions/european-bank-reconstruction-development-ebrd/",
    "snippet": "Under the guidance of the Board of Directors, <strong>the President</strong> manages the EBRD&#x27;s work. The Executive Committee and senior leadership group advise <strong>the President</strong> and oversee EBRD activities.",
    "published": null
  }
]