[
  {
    "title": "Igor Tudor - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Igor_Tudor",
    "snippet": "On 23 March 2025, Tudor replaced <strong>Thiago Motta</strong> as head coach of Serie A club Juventus. This appointment marked the first time Juventus had appointed a foreign manager since Didier Deschamps in the 2006–07 season. He eventually guided the club to the fourth place of league table and Champions ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "Juventus Football Club announces that it has today relieved Igor Tudor of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": null
  },
  {
    "title": "r/soccer on Reddit: Igor Tudor is no longer Juventus' head coach",
    "url": "https://www.reddit.com/r/soccer/comments/1ohc7qk/igor_tudor_is_no_longer_juventus_head_coach/",
    "snippet": "&quot;Juventus FC announces that it has today relieved Igor Tudor of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": "October 27, 2025"
  },
  {
    "title": "Juventus sack coach Igor Tudor after seven months in charge - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/46743501/juventus-sack-head-coach-igor-tudor-seven-months-charge",
    "snippet": "Tudor played for Juventus for nearly a decade from 1998-2007 and he previously coached <strong>Udinese, Hellas Verona and Lazio</strong> in Italy.",
    "published": "October 27, 2025"
  },
  {
    "title": "Juventus sack manager Thiago Motta and announce Igor Tudor as new coach until the end of the season - CBS Sports",
    "url": "https://www.cbssports.com/soccer/news/juventus-sack-manager-thiago-motta-and-announce-igor-tudor-as-new-coach-until-the-end-of-the-season/",
    "snippet": "After the sacking of Motta, Juventus ... season. On Sunday, Juventus issued the following statement: &quot;Juventus FC announce that <strong>Thiago Motta</strong> has been relieved of his duties as Men&#x27;s First Team coach....",
    "published": "March 23, 2025"
  }
]