[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "Afterwards, she joined the Carter administration as a <strong>domestic policy advisor on urban affairs and helped advance several housing and neighborhood revitalization bills through Congress</strong>. Following her time in Washington D.C., Kaptur went to Massachusetts to do graduate work.",
    "published": "1 week ago"
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "After working for 15 years as a city and regional planner, primarily in Toledo and Chicago, she accepted an appointment as a domestic policy advisor to President Jimmy Carter. During his Administration, she <strong>helped maneuver 17 housing and neighborhood revitalization bills through Congress</strong>.",
    "published": "May 27, 2025"
  },
  {
    "title": "Congresswoman Marcy Kaptur reflects on time with Jimmy Carter's administration",
    "url": "https://spectrumnews1.com/oh/columbus/news/2024/12/30/marcy-kaptur-jimmy-carter-",
    "snippet": "WASHINGTON, D.C. – Before she was elected to Congress more than four decades ago, Ohio’s Marcy Kaptur worked in President Jimmy Carter’s administration as a <strong>domestic policy advisor</strong>.",
    "published": "December 30, 2024"
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Kaptur served as an <strong>urban policy advisor</strong> in the Jimmy Carter (D) administration from 1977 to 1979 and was pursuing a doctorate in urban affairs at the Massachusetts Institute of Technology when she first ran for election in 1982.[5][2] Kaptur was assigned to the following committees:[Source] ...",
    "published": null
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "BILL 1. H.R.6198 — 119th Congress (2025-2026) Rear Admiral Alene Duerk Ship Renaming Act of 2025 Sponsor: Kaptur, Marcy [Rep.-D-OH-9] (Introduced 11/20/2025) Cosponsors: (3) Committees: House - Armed Services Latest Action: House - 11/20/2025 Referred to the House Committee on Armed Services.",
    "published": null
  }
]