[
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "Almazbek Atambayev was peacefully succeeded by Sooronbay Jeenbekov in 2017. However, Jeenbekov resigned from office due to the 2020 Kyrgyzstani protests and was succeeded by <strong>Sadyr Japarov</strong>. indicates an individual serving as an acting or provisional president of Kyrgyzstan",
    "published": "November 11, 2025"
  },
  {
    "title": "Sadyr Japarov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sadyr_Japarov",
    "snippet": "Since the start of Japarov&#x27;s presidency, Kyrgyzstan has dropped 70 positions in Reporters Without Borders&#x27; freedom of speech rating - from 72nd in 2022 to 144 in 2025. Another case is the closure of the Kyrgyz Next TV channel, sanctioned by the authorities of Kyrgyzstan.",
    "published": "2 weeks ago"
  },
  {
    "title": "Allies of Kyrgyzstan's strongman president sweep snap parliamentary election | Reuters",
    "url": "https://www.reuters.com/world/asia-pacific/allies-kyrgyzstans-president-win-majority-parliamentary-election-preliminary-2025-11-30/",
    "snippet": "Kyrgyz President <strong>Sadyr Japarov</strong> casts his ballot as his wife Aigul Japarova stands nearby at a polling station during the snap parliamentary election in Bishkek, Kyrgyzstan November 30, 2025.",
    "published": "2 weeks ago"
  },
  {
    "title": "President of the Kyrgyz Republic Sadyr Japarov received the Ministers of Foreign Affairs of the CSTO member states",
    "url": "https://en.odkb-csto.org/news/news_odkb/prezident-kyrgyzskoy-respubliki-sadyr-zhaparov-prinyal-ministrov-inostrannykh-del-gosudarstv-chlenov/",
    "snippet": "30.06.2025 · The Kyrgyz President <strong>Sadyr Japarov</strong> received the Ministers of Foreign Affairs of the CSTO member states and the Secretary General of the Organization in Cholpon-Ata on June 30. The meeting was attended by the Foreign Ministers of Kyrgyzstan, Belarus, Kazakhstan, Russia and Tajikistan.",
    "published": null
  },
  {
    "title": "2025 Kyrgyz parliamentary election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Kyrgyz_parliamentary_election",
    "snippet": "On 30 September 2025, after the decree of President <strong>Sadyr Japarov</strong> setting the date for early elections, the Central Election Commission approved the Calendar Plan for the organization and conduct of the early elections of deputies of the Jogorku ...",
    "published": "2 days ago"
  }
]