[
  {
    "title": "Mark A. Aguiar | NBER",
    "url": "https://www.nber.org/people/mark_aguiar",
    "snippet": "Contact Us 1050 Massachusetts Avenue Cambridge, MA 02138 617-868-3900 info@nber.org webaccessibility@nber.org",
    "published": null
  },
  {
    "title": "Mark Aguiar | IDEAS/RePEc",
    "url": "https://ideas.repec.org/e/pag57.html",
    "snippet": "<strong>Mark Aguiar &amp; Manuel Amador &amp; Hugo Hopenhayn &amp; Iván Werning</strong>, 2016. &quot;Take the Short Route: Equilibrium Default and Debt Maturity,&quot; NBER Working Papers 22847, National Bureau of Economic Research, Inc. <strong>Mark Aguiar &amp; Manuel Amador &amp; Hugo Hopenhayn &amp; Iván Werning</strong>, 2019.",
    "published": null
  },
  {
    "title": "NBER WORKING PAPER SERIES SOVEREIGN DEBT: A REVIEW Mark Aguiar Manuel Amador",
    "url": "https://www.nber.org/system/files/working_papers/w19388/w19388.pdf",
    "snippet": "undistorted discount factor β. Aguiar and Amador (2011) show how to generalize this to per- sistent political processes. Political economy distortions are captured by θ, with θ = 1 reﬂecting · a benevolent government and θ &gt; 1 reﬂecting an incumbent who strictly favors front-loading ... the multiplier on the resource constraint. This condition is similar to (3), the ﬁrst order condition",
    "published": null
  },
  {
    "title": "Mark Aguiar - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Aguiar",
    "snippet": "He was elected a Fellow of the Econometric Society in 2018, and was a co-editor of the American Economic Review from 2014 to 2017, where he previously served on the board of editors and reviewed submissions relating to macroeconomics. Aguiar has been a member of the advisory board of the Carnegie-NYU-Rochester Conference on Public Policy since 2010. In 2017, The Economist commented on research he conducted (alongside Mark Bils, Kerwin Charles, and Erik Hurst) on the link between unemployment and ownership of video game consoles.",
    "published": "October 23, 2025"
  },
  {
    "title": "Mark Aguiar - Stats, Contract, Salary & More",
    "url": "https://www.eliteprospects.com/player/215721/mark-aguiar",
    "snippet": "Eliteprospects.com hockey player profile of Mark Aguiar. Most recently in the NCAA III with UMass-Dartmouth. Complete player biography and stats.",
    "published": null
  }
]