[
  {
    "title": "Sun Microsystems - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/Sun_Microsystems",
    "snippet": "Sun created the Java programming language, the Solaris operating system, the Network File System (NFS), and the SPARC instruction set. Sun was founded on February 24, 1982. Sun&#x27;s headquarters were in <strong>Santa Clara, California</strong>.",
    "published": "April 28, 2023"
  },
  {
    "title": "Sun Microsystems Information",
    "url": "https://rocketreach.co/sun-microsystems-profile_b5c61df4f42e0c4b",
    "snippet": "Sun Microsystems is an IT Services and IT Consulting, Custom Software &amp; Technical Consulting, and Business/Productivity Software company located in <strong>Palo Alto, California</strong> with $55.8 billion in revenue and 5,073 employees.",
    "published": null
  },
  {
    "title": "Sun Microsystems 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10596-52",
    "snippet": "Sun Microsystems is headquartered in <strong>Santa Clara, CA</strong>.",
    "published": null
  },
  {
    "title": "Sun Microsystems Inc, 2550 Garcia Ave, Mountain View, CA 94043, US - MapQuest",
    "url": "https://www.mapquest.com/us/california/sun-microsystems-inc-431565487",
    "snippet": "Sun Microsystems Inc, headquartered in <strong>Mountain View, California</strong>, was a prominent technology company known for its development of computer hardware and software, particularly in the UNIX operating system space.",
    "published": null
  },
  {
    "title": "Sun Microsystems Santa Clara Campus",
    "url": "https://www.w3.org/QA/2004/06/SantaClara.html",
    "snippet": "The June Face to Face meeting of the QA Working Group will take place on Tuesday through Thursday, June 15, 16, and 17 on the Sun Microsystems campus in <strong>Santa Clara, California</strong>. The campus is bounded by Lafayette St, Agnew Rd, and Montague Expressway. The main entrance to the campus is Palm ...",
    "published": null
  }
]