[
  {
    "title": "Sooronbay Jeenbekov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sooronbay_Jeenbekov",
    "snippet": "Jeenbekov&#x27;s son-in-law became the head of the foreign policy department of the president&#x27;s office, his nephew Nooruz headed the &quot;Gazprom Kyrgyzstan&quot; branches, another brother, Jusup Jeenbekov, headed the embassy in Ukraine, and another nephew Teniz became the head of the &quot;Ayyl Bank&quot; branches. Many saw this as a departure from the democratic ideals and principles that Kyrgyzstan tried to uphold since its inception. Such a strengthening of the family-clan regime undermined the trust of the people in the government and became the main reason for its overthrow. As it turned out later, cases with a politically motivated bias were personally handled by the president&#x27;s nephew Rustambek Borombaev in Attorney general&#x27;s office, and his relatives also entered the leadership circles of the corrupt South-West customs of Kyrgyzstan.",
    "published": "October 3, 2025"
  },
  {
    "title": "Who's Who in Kyrgyz Politics",
    "url": "https://geohistory.today/kyrgyz-politics-whos-who/",
    "snippet": "That oblast experienced violent unrest soon after Jeenbekov entered office as the effects of the revolution helped further divide society along ethnic lines. Tensions between the Kyrgyz majority and Uzbek minority exploded and around 400,000 Kyrgyzstani citizens became internally displaced and around 2,000 died. In 2016 the SDPK, which President Almazbek helped found and is currently Kyrgyzstan’s most powerful political party, nominated Jeenbekov as prime minister.",
    "published": "November 30, 2024"
  },
  {
    "title": "Sooronbay Jeenbekov, President of Kyrgyzstan | Current Leader",
    "url": "https://planetrulers.com/kyrgyzstan-president/",
    "snippet": "In November 1988, he managed to obtain a job as an instructor in the district committee of the Communist Party of Kyrgyzstan in the Soviet district of the Osh region. After a few years, he became the director of the party committee. After entering politics, in 1993, Jeenbekov was elected chairman of the Kashka-Zhol collective farm in Kara-Kulja District.",
    "published": "April 11, 2022"
  },
  {
    "title": "Sooronbay Jeenbekov facts for kids",
    "url": "https://kids.kiddle.co/Sooronbay_Jeenbekov",
    "snippet": "<strong>Before becoming president, he served as the Prime Minister of Kyrgyzstan from April 2016 to August 2017.</strong> As president, Jeenbekov worked on foreign policy and tried to improve public trust in the government.",
    "published": null
  },
  {
    "title": "Kyrgyzstan’s Media Crackdown Sign of Deepening Authoritarianism - Jamestown",
    "url": "https://jamestown.org/kyrgyzstans-media-crackdown-sign-of-deepening-authoritarianism/",
    "snippet": "In Kyrgyzstan, overt nepotism and corruption, elite fissures, economic stagnation, and electoral falsifications contributed to the ousters of past leaders (DW, October 7, 2020; Mediazona.ca, April 10, 2024; 24.kg, April 7). Each previous Kyrgyz president—Askar Akayev (1991–2005), Kurmanbek Bakiyev (2005–2010), Almazbek Atambayev (2011–2017), and Sooronbay Jeenbekov (2017–2020)—unsuccessfully attempted to establish the type of consolidated authoritarian regime common in the post-Soviet space (Radio Svoboda, April 5, 2006; Carnegie Berlin, March 31, 2012; 24.kg, December 7, 2018; Meduza, August 9, 2019).",
    "published": "1 month ago"
  }
]