[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "In September 2024, he became the Union&#x27;s candidate for Chancellor of Germany ahead of the following year&#x27;s federal election. The CDU/CSU won a plurality of the seats and subsequently reached an agreement to form a coalition with the SPD. Merz was elected chancellor on 6 May 2025, taking two rounds to clear, which was a first in German history.",
    "published": "2 days ago"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "Ten people (nine men and one woman) have served as chancellor of the Federal Republic of Germany, the first being Konrad Adenauer from 1949 to 1963. (Another 26 men had served as &quot;Reich chancellors&quot; of the previous German Empire from 1871 to 1945.) The current officeholder is <strong>Friedrich Merz</strong> of the ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Germany's new chancellor: Who is Friedrich Merz? – DW – 05/06/2025",
    "url": "https://www.dw.com/en/germanys-new-chancellor-who-is-friedrich-merz/a-72314352",
    "snippet": "Now Merz&#x27;s center-right Christian Democratic Union (CDU) the regional Bavarian Christian Social Union (CSU) and the center-left Social Democrats (SPD) will be working together as Germany&#x27;s new government. For Merz, it is a big step in an unusual career. Merz, who is 69 years old, has never held a top governmental office with significant leadership responsibilities. He has never been a federal minister, or a state premier, or even mayor of a small town. He is the oldest chancellor to take office since Konrad Adenauer, the first post-war German head of government (1949–1963).",
    "published": "May 6, 2025"
  },
  {
    "title": "Friedrich Merz is the next federal chancellor",
    "url": "https://www.deutschland.de/en/topic/politics/friedrich-merz-next-federal-chancellor",
    "snippet": "On 6 May 2025, <strong>Friedrich Merz</strong> was elected chancellor by the German parliament, the Bundestag.",
    "published": "May 6, 2025"
  },
  {
    "title": "Biography Federal Chancellor Merz",
    "url": "https://www.bundesregierung.de/breg-en/news/friedrich-merz-2341938",
    "snippet": "Since 2022 Chair of the CDU in Germany · Since 6 May 2025 Federal Chancellor of the Federal Republic of Germany · Share the article · E-mail, <strong>Friedrich Merz</strong> · Facebook, <strong>Friedrich Merz</strong> · X, <strong>Friedrich Merz</strong> · E-Mail E-mail, <strong>Friedrich Merz</strong> ...",
    "published": null
  }
]