[
  {
    "title": "Bank of America Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Bank_of_America_Stadium",
    "snippet": "<strong>Bank of America Stadium</strong> is a multi-purpose stadium located in the Uptown section of Charlotte, North Carolina, United States. It has a capacity of 75,037 and is the home facility and headquarters of the Carolina Panthers of the National Football League (NFL) and Charlotte FC of Major League ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Carolina Panthers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Carolina_Panthers",
    "snippet": "The Carolina Panthers are a ... a member of the National Football Conference (NFC) South division. The team is headquartered in <strong>Bank of America Stadium in Uptown Charlotte</strong>, which also serves as the team&#x27;s home field....",
    "published": "2 weeks ago"
  },
  {
    "title": "Carolina Panthers 2025-2026 Home Game Schedule & Tickets | Ticketmaster",
    "url": "https://www.ticketmaster.com/carolina-panthers-tickets/artist/805909?home_away=home",
    "snippet": "The Carolina Panthers play their home games at <strong>Bank of America Stadium</strong>, located in Charlotte, North Carolina.",
    "published": "3 weeks ago"
  },
  {
    "title": "Stadium Facts | Carolina Panthers - Panthers.com",
    "url": "https://www.panthers.com/stadium/facts",
    "snippet": "Opened in the summer of 1996, <strong>Bank of America Stadium</strong> is located in uptown Charlotte and was specifically designed for football. The 75,037-seat, privately-financed, open-air stadium is designed as a self-contained headquarters for the Carolina ...",
    "published": null
  },
  {
    "title": "Step Inside: Bank of America Stadium - Home of the Carolina Panthers",
    "url": "https://blog.ticketmaster.com/step-inside-bank-of-america-stadium-charlotte-nc/",
    "snippet": "<strong>Bank of America Stadium</strong> is located in uptown Charlotte, North Carolina in the heart of the city center. The 75,525-seat, open-air stadium was designed specifically for football and is home to the NFL’s Carolina Panthers.",
    "published": "November 20, 2025"
  }
]