[
  {
    "title": "European Central Bank",
    "url": "https://www.ecb.europa.eu/",
    "snippet": "Interview with Frank Elderson, Member of the Executive Board of the ECB and Vice-Chair of the Supervisory Board of the ECB, conducted by <strong>Andrés Stumpf</strong> on 4 November 2025 ... The ECB plans to prepare for the potential issuance of the digital ...",
    "published": null
  },
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "The president of the European Central Bank is the head of the European Central Bank (ECB), the main institution responsible for the management of the euro and monetary policy in the eurozone of the European Union (EU). The current president of the European Central Bank is <strong>Christine Lagarde</strong>, ...",
    "published": "September 25, 2025"
  },
  {
    "title": "'Europe's existential crisis': ECB's Lagarde calls for urgent reforms | Euronews",
    "url": "https://www.euronews.com/business/2025/12/10/europes-existential-crisis-ecbs-lagarde-calls-for-urgent-reforms",
    "snippet": "FILE. European Central Bank President <strong>Christine Lagarde</strong> speaks during the press conference following the Governing Council meeting in Florence, Italy. 30 Oct. 2025.",
    "published": "1 week ago"
  },
  {
    "title": "Spain seen gunning for top job at European Central Bank – POLITICO",
    "url": "https://www.politico.eu/article/spain-silence-central-bank-presidency/",
    "snippet": "<strong>Pablo Hernández de Cos moving to the ECB could cost Europe the BIS leadership. | Jalal Morchidi/EPA · This article is also available in: French · November 18, 2025 4:14 am CET · By Johanna Treeck · The starter’s gun is about to fire on the race to succeed Christine Lagarde</strong> ...",
    "published": "1 month ago"
  },
  {
    "title": "European Central Bank Org Chart + Executive Team",
    "url": "https://www.theofficialboard.com/org-chart/european-central-bank",
    "snippet": "See the executive team of European Central Bank and its org chart, featuring 63 leaders like <strong>Christine Lagarde</strong>, Claudia Mann and Doris Schneeberger",
    "published": null
  }
]