[
  {
    "title": "Italian Communist Party - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Italian_Communist_Party",
    "snippet": "At a 1989 conference in a working-class section of Bologna, Occhetto stunned the party faithful with a speech heralding the Revolutions of 1989, a move now referred to in Italian politics as the svolta della Bolognina (Bolognina turning point). The collapse of the Communist governments in the Eastern Europe led Occhetto to conclude that the era of Eurocommunism was over. Under his leadership, the PCI dissolved and refounded itself as the Democratic Party of the Left, which branded itself as a progressive left-wing and democratic socialist party.",
    "published": "1 week ago"
  },
  {
    "title": "Full article: The Italian Communist Party in the 1980s and the denouement of the Italian party system",
    "url": "https://www.tandfonline.com/doi/full/10.1080/1354571X.2022.2097690",
    "snippet": "The long ‘constituent phase’ which followed the Central Committee’s approval of Occhetto’s proposal saw the party arrive at its 19th Congress (in March 1989) with two other motions opposing that presented by Occhetto (Bassolino’s ‘modern reforming and antagonistic party’ and Tortorella’s ‘communist refoundation’) alongside one proposed alternative name (‘Italian Communist Party’) to Occhetto’s ‘Democratic Party of the Left.’",
    "published": null
  },
  {
    "title": "Democrats of the Left | Political Party, Italy, Ideology, History | Britannica",
    "url": "https://www.britannica.com/topic/Democrats-of-the-Left",
    "snippet": "In 1956, when the revelation of Joseph Stalin’s crimes was followed by the Soviet Union’s suppression of the Hungarian revolt, communist leader <strong>Palmiro Togliatti</strong> helped dissociate the party from the Soviet Union by proposing the concept ...",
    "published": "July 20, 1998"
  },
  {
    "title": "Palmiro Togliatti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Palmiro_Togliatti",
    "snippet": "Considered one of the founding fathers of the Italian Republic, he led Italy&#x27;s Communist party from a few thousand members in 1943 to two million members in 1946. Born in Genoa but culturally formed in Turin during the first decades of the 1900s, when the first Fiat workshops were built and the Italian labour movement began its battles, Togliatti&#x27;s history is linked to that of Lingotto. He helped launch the left-wing weekly L&#x27;Ordine Nuovo in 1919, and he was the editor of Il Comunista starting in 1922.",
    "published": "September 8, 2025"
  },
  {
    "title": "Giorgio Napolitano Was an Ex-Communist Who Became a Staunch Defender of the Establishment",
    "url": "https://jacobin.com/2023/09/giorgio-napolitano-communist-party-italy-president-center-left-democrats",
    "snippet": "There are many watersheds that ... Democratic Party (PD) in 2007, but also, perhaps most importantly, before and after <strong>Giorgio Napolitano</strong>....",
    "published": null
  }
]