[
  {
    "title": "Next Portuguese legislative election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Portuguese_legislative_election",
    "snippet": "Party leader Inês Sousa Real will ... former party district leader and 2024 candidate for Viseu district. <strong>The President of Portugal has the power to dissolve the Assembly of the Republic by his/her own will</strong>....",
    "published": "4 days ago"
  },
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "The powers, functions and duties of prior presidential offices, and their relation with the prime minister and cabinets have over time differed with the various Portuguese constitutions. Currently, in the Third Republic, a semi-presidential system, the president holds no direct executive power, unlike his counterparts in the United States and France.",
    "published": "3 days ago"
  },
  {
    "title": "Luís Montenegro - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lu%C3%ADs_Montenegro",
    "snippet": "<strong>Luís Filipe Montenegro Cardoso de Morais Esteves</strong> (European Portuguese: [luˈiʒ mõtɨˈneɣɾu]; born 16 February 1973) is a Portuguese politician and lawyer serving as the prime minister of Portugal since April 2024. He is the president of the Social Democratic Party (PSD) and he leads the ...",
    "published": "2 days ago"
  },
  {
    "title": "Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en",
    "snippet": "Versão Portuguesa · Presidente da República promulgou três diplomas do Governo · 04 of December of 2025 · Presidente da República lembra <strong>Francisco Sá Carneiro e Adelino Amaro da Costa</strong> · 04 of December of 2025 · Presidente da República promulgou diploma do Governo ·",
    "published": null
  },
  {
    "title": "2026 Portuguese presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2026_Portuguese_presidential_election",
    "snippet": "Candidates who formalized their candidacy and claim to have already submitted enough signatures to the Constitutional Court. <strong>The deadline to submit candidacies to the Court is 18 December 2025</strong>...",
    "published": "12 hours ago"
  }
]