[
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "In July 2024 Jennifer was appointed as a <strong>Special Advisor to KPMG</strong>.",
    "published": null
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "Jennifer is a National Fellow of the Institute of Public Administration Australia and a Fellow of the Australian Institute of Company Directors, and since 2013 has been a <strong>Non-Executive Director of Wesfarmers Limited and Chair of the Mental Health Council of Australia</strong>.",
    "published": null
  },
  {
    "title": "Chancellor | Western Sydney University",
    "url": "https://www.westernsydney.edu.au/about_uws/leadership/chancellor",
    "snippet": "Jennifer is a long-standing <strong>Non-Executive Director of Wesfarmers</strong>, one of the nation’s largest and most community-engaged employers. She also sits on the board of ATCO, which provides integrated energy, housing, transportation and infrastructure solutions. As Australia’s Business Champion ...",
    "published": null
  },
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Jennifer Westacott AC is an Australian business executive. She served as the chief executive of the Business Council of Australia (BCA) from 2011 to 2023. She is the <strong>current chancellor of Western Sydney University</strong>. She grew up in Springfield in New South Wales, Australia and completed her secondary ...",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott: Positions, Relations and Network - MarketScreener",
    "url": "https://www.marketscreener.com/insider/JENNIFER-WESTACOTT-A18HDI/",
    "snippet": "Jennifer Anne Westacott currently ... 2024, ATCO Australia Pty Ltd., as Director from 2024, Canadian Utilities Ltd., as <strong>Independent Director</strong> from 2025, The University of New South Wales, as Member from 2019, the Univ...",
    "published": null
  }
]