[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "He held office as the leader of the Liberal Party and was the member of parliament (MP) for the New South Wales division of Cook from 2007 until his resignation in 2024. Morrison was born in Sydney and studied <strong>economic geography</strong> at the University of New South Wales.",
    "published": "6 days ago"
  },
  {
    "title": "Scott Morrison | CNAS",
    "url": "https://www.cnas.org/people/scott-morrison",
    "snippet": "Mr. Morrison holds a <strong>Bachelor of Applied Science with Honours in Applied Economic Geography</strong> from the University of New South Wales. Mr. Morrison was born in 1968, is married to Jenny and they have two teenage daughters.",
    "published": "May 4, 2023"
  },
  {
    "title": "Scott Morrison: before office | naa.gov.au",
    "url": "https://www.naa.gov.au/explore-collection/australias-prime-ministers/scott-morrison/before-office",
    "snippet": "Scott John Morrison was born on 13 May 1968 in Sydney, New South Wales, to John Morrison, a policeman, and his wife Marion. He was educated at Sydney Boys High School, then <strong>attended the University of New South Wales, where he received an honours degree in applied economic geography</strong>.",
    "published": null
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "During his childhood Morrison also acted in television commercials. He attended the prestigious Sydney Boys High before matriculating at the University of New South Wales, where he <strong>studied economics and geography</strong>.",
    "published": "August 30, 2018"
  },
  {
    "title": "Scott J. Morrison - American Global Strategies",
    "url": "https://americanglobalstrategies.com/team_member/scott-p-morrison/",
    "snippet": "Morrison worked in the tourism, hospitality, major events and commercial property sector as a senior executive. Mr. Morrison holds a <strong>Bachelor of Applied Science with Honours in Economic Geography</strong> from the University of New South Wales, where ...",
    "published": "April 11, 2025"
  }
]