[
  {
    "title": "Meet the new Board - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/european-film-academy-new-board/",
    "snippet": "Three incumbent Board members who put themselves forward for a new mandate, have been re-elected. <strong>Mike Downey (Ireland/UK) will continue as Chair of the Board</strong>, with Joanna Szymańska (Poland) now joining Ada Solomon (Romania) as Deputy Chair.",
    "published": "May 13, 2024"
  },
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "In 1996, Wim Wenders succeeded Bergman as president, and Nik Powell, a British producer, was elected chairman. Mike Downey, an Irish-British film producer, was <strong>elected chairman in 2020.</strong>",
    "published": "September 3, 2025"
  },
  {
    "title": "Mike Downey • Producer and chairman of the European Film Academy - Cineuropa",
    "url": "https://cineuropa.org/en/interview/440528/",
    "snippet": "<strong>Mike Downey OBE is a producer and the chairman of the European Film Academy</strong>, as well as being one of the founding board members of the International Coalition for Filmmakers at Risk (ICFR).",
    "published": null
  },
  {
    "title": "European Film Academy to Restructure Board Membership to Ensure Fairer Geographic Representation",
    "url": "https://variety.com/2023/film/global/european-film-academy-board-membership-1235656918/",
    "snippet": "Austria, Germany, Switzerland, Liechtenstein (as of 2025, after current mandates end) ... Ireland, U.K. ... “These changes will make for a more diverse and more democratically representative board to serve the European Film Academy,” said EFA’s chair, Mike Downey.",
    "published": "June 29, 2023"
  },
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "The nominations will, as before be decided on by a panel of experts, <strong>new honorary president of the panel</strong> is EFA Chairman Mike Downey. These nominations, usually five (in its first edition, due to Covid-19, only three) will be announced as part ...",
    "published": null
  }
]