[
  {
    "title": "Infantino’s lickspittle World Cup draw promises a tournament autocrats will love | World Cup 2026 | The Guardian",
    "url": "https://www.theguardian.com/football/2025/dec/08/gianni-infantino-world-cup-draw-2026-trump",
    "snippet": "Friday’s ceremony in Washington ... the reign of Sepp Blatter ... Well, that was awful, wasn’t it? Donald Trump’s heroic victory over a field of one to claim the inaugural Fifa peace prize, on-stage banter so dead it was already fossilized, Gianni Infantino doing crowd work, ...",
    "published": "1 week ago"
  },
  {
    "title": "FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FIFA",
    "snippet": "The President and the Secretary General are the main office holders of FIFA and are in charge of its daily administration, carried in by the general secretariat, with its staff of approximately 280 members. Gianni Infantino is the current president, <strong>elected on 26 February 2016</strong> at an extraordinary ...",
    "published": "1 day ago"
  },
  {
    "title": "Gianni Infantino",
    "url": "https://www.forbes.com/profile/gianni-infantino/",
    "snippet": "A big proponent of Video Assistant Referee (VAR), Infantino successfully push for the feature to be present for the first time at the 2018 World Cup. <strong>Infantino took the helm at FIFA in February 2016</strong>, a few months after his predecessor, Sepp ...",
    "published": null
  },
  {
    "title": "Gianni Infantino’s Trump problem - POLITICO",
    "url": "https://www.politico.com/news/2025/12/05/the-world-games-washington-problem-00677204",
    "snippet": "Infantino launched his first campaign for FIFA’s presidency as an underdog. A corruption scandal had toppled much of FIFA’s leadership in 2015, forcing a so-called “extraordinary congress” the next year in which members would vote to decide who would complete the unfinished term vacated by the newly suspended president Sepp Blatter...",
    "published": "5 days ago"
  },
  {
    "title": "Sepp Blatter eviscerates Gianni Infantino over Trump, Ronaldo and Saudi Arabia",
    "url": "https://www.telegraph.co.uk/football/2025/12/05/sepp-blatter-interview-gianni-infantino-trump-ronaldo-fifa/",
    "snippet": "In response, a Fifa spokesperson said: “<strong>Gianni Infantino was re-elected Fifa President unopposed for a second term in March 2023</strong> in Kigali in front of 208 gathered member associations.",
    "published": null
  }
]