[
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "Com Hem was a Swedish brand owned by <strong>Tele2 AB</strong> which supplied Triple Play services that included cable television, broadband internet and fixed-line telephone. Founded in 1983 as Televerket Kabel-TV as part of the former state-owned Televerket, the company was successively named Svenska Kabel-TV ...",
    "published": "June 6, 2025"
  },
  {
    "title": "Com Hem - Products, Competitors, Financials, Employees, Headquarters Locations",
    "url": "https://www.cbinsights.com/company/com-hem",
    "snippet": "In the fixed-line broadband segment, the number of DSL subscribers is falling steadily as customers continue to migrate to fibre networks. There is also competition from HFC infrastructure, with the main cableco Com Hem, now owned by <strong>Tele2</strong>, offering fibre-based broadband and investing in services ...",
    "published": null
  },
  {
    "title": "BC Partners to acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/bc-partners-acquire-com-hem",
    "snippet": "London – <strong>BC Partners</strong>, a leading international private equity firm, today announces that it has signed an agreement to acquire Com Hem, Sweden’s leading TV, broadband and telephony company, from The Carlyle Group (“Carlyle”) and Providence Equity Partners (“Providence”). Financial ...",
    "published": null
  },
  {
    "title": "Com Hem",
    "url": "https://eqtgroup.com/about/current-portfolio/com-hem",
    "snippet": "<strong>EQT III</strong> acquired Com Hem AB, a Swedish cable TV operator, in 2003.",
    "published": null
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - <strong>The Carlyle Group and Providence Equity Partners</strong> today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT. Financial details were not disclosed. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  }
]