[
  {
    "title": "Luxembourg national football team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Luxembourg_national_football_team",
    "snippet": "On 22 March 2025, Luxembourg showed improvement with a convincing victory against Sweden in a friendly match. As of 1 September 2021, the Luxembourg national team adopted Luxembourg City&#x27;s <strong>Stade de Luxembourg</strong>, the country&#x27;s national stadium, as its home venue.",
    "published": "1 month ago"
  },
  {
    "title": "Luxembourg U21 live scores, results, fixtures | Football, Europe",
    "url": "https://www.flashscore.com/team/luxembourg/fsjoGwpC/",
    "snippet": "HELP: You are on Luxembourg U21 live scores page in Football/Europe section. Flashscore.com offers Luxembourg U21 livescore, final and partial results, standings, home stadium with official capacity, squad updates (signed and sold players, transfer fees, loan deals, free agents and complete squad list), team ...",
    "published": null
  },
  {
    "title": "Luxembourg U21 vs Switzerland U21 live score, H2H and lineups | Sofascore",
    "url": "https://www.sofascore.com/football/match/luxembourg-u21-switzerland-u21/BXbsOvc",
    "snippet": "Luxembourg U21 Switzerland U21 live score (and video online live stream) starts on 18 Nov 2025 at 18:30 UTC time at <strong>Stade de la Frontière stadium, Esch-sur-Alzette city, Luxembourg</strong> in U21 EURO, Qualification, Group C, Europe.",
    "published": null
  },
  {
    "title": "France U21 vs Luxembourg U21 live score, H2H and lineups | Sofascore",
    "url": "https://www.sofascore.com/football/match/luxembourg-u21-france-u21/LtcsOvc",
    "snippet": "France U21 Luxembourg U21 live score (and video online live stream) starts on 5 Sept 2025 at 16:30 UTC time at <strong>Stade Yves Allainmat-Le Moustoir stadium, Lorient city, France</strong> in U21 EURO, Qualification, Group 3, Europe.",
    "published": null
  },
  {
    "title": "Football in Luxembourg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Football_in_Luxembourg",
    "snippet": "Until 2017, Luxembourg were consistently ranked outside the top 100 teams by FIFA, but after some good results, namely in the UEFA Nations League, they are now ranked 84th. The national stadium, the <strong>Stade de Luxembourg</strong> was opened in September 2021, replacing the outdated Stade Josy Barthel, ...",
    "published": "September 1, 2025"
  }
]