[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "De Havilland Aircraft of Canada Limited (DHC) is a Canadian aircraft manufacturer founded in 2018 that purchased the aircraft programs of the original the de Havilland Canada, which was founded in 1928. The aircraft types currently in production or planned for production include the DHC-6 Twin Otter, DHC-8 Dash 8, and DHC-515 Firefighter turboprop aircraft.",
    "published": "1 month ago"
  },
  {
    "title": "De Havilland Canada Amalgamation - De Havilland Canada",
    "url": "https://dehavilland.com/amalgamation/",
    "snippet": "On August 1, 2024, our group of Canadian aviation corporations, including <strong>De Havilland Aircraft of Canada Limited, De Havilland Flight Operations Limited, Viking Air Limited, Longview Aviation Services Inc. and Longview Distribution Services Limited</strong>...",
    "published": "August 1, 2024"
  },
  {
    "title": "Viking Air - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Viking_Air",
    "snippet": "He retired as president of Viking Air in 1987. The company is a subsidiary of Longview Aviation Capital, which is owned by <strong>Sherry Brydson</strong>, granddaughter of deceased newspaper magnate Roy Thomson and cousin of David Thomson, parties of the largest family fortune in Canada.",
    "published": "October 25, 2025"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "Commuter airlines did not create ... the Canadian government purchased de Havilland Canada from its British owners, <strong>Hawker Siddeley Aviation</strong>....",
    "published": null
  },
  {
    "title": "Longview Aviation Capital Announces Consolidation of Companies under De Havilland Aircraft of Canada Limited and Appoints Brian Chafe Chief Executive Officer - De Havilland Canada",
    "url": "https://dehavilland.com/our-team/longview-aviation-capital-announces-consolidation-of-companies-under-de-havilland-aircraft-of-canada-limited-and-appoints-brian-chafe-chief-executive-officer/",
    "snippet": "Victoria, BC, February 2, 2022 – Longview Aviation Capital has announced that <strong>De Havilland Aircraft of Canada Limited</strong> will become the operating brand for the companies currently operating as Longview Aviation, Viking Air, Pacific Sky Training ...",
    "published": "March 18, 2024"
  }
]