[
  {
    "title": "Unai Emery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Unai_Emery",
    "snippet": "There, he won a Ligue 1 title, two Coupe de France titles, two Coupe de la Ligues, and two Trophée des Champions, including a domestic quadruple in his second season. After the expiry of his contract, <strong>Emery was appointed as head coach of English club Arsenal in 2018,</strong> succeeding Arsène Wenger.",
    "published": "2 days ago"
  },
  {
    "title": "Welcome Unai | News | Arsenal.com",
    "url": "https://www.arsenal.com/news/welcome-unai",
    "snippet": "I’m excited about what we can do together and I look forward to giving everyone who loves Arsenal some special moments and memories.” Unai <strong>started his coaching career at Lorca Deportiva in 2005 after playing mostly in the Spanish second division</strong>.",
    "published": null
  },
  {
    "title": "Unai Emery - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/unaiemery/profil/trainer/5075",
    "snippet": "Avg. term as coach : 2.24 Years ... This is an overview of the career of a manager. ... Unai Emery is the grandson of Antonio Emery (---). Unai Emery is the nephew of Román Emery (---). Unai Emery is the son of Juan Emery (---). Unai Emery is the brother of Igor Emery (Chairman Real Unión Club). Unai Emery is the father of Lander Emery (Real Unión Club).",
    "published": null
  },
  {
    "title": "Unai Emery at Arsenal: a failure or a victim of circumstance? - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/39048034/unai-emery-arsenal-failure-victim-circumstance",
    "snippet": "Unai Emery is enjoying so much ... Wenger. <strong>In the summer of 2018, the Spanish coach was hired to replace the departing Wenger, who had fallen from legend to lamented in a tenure spanning almost 22 years</strong>....",
    "published": "December 8, 2023"
  },
  {
    "title": "Arsenal: The rise and fall of Unai Emery",
    "url": "https://paininthearsenal.com/2020/05/30/arsenal-rise-fall-unai-emery/",
    "snippet": "Unai Emery spent <strong>18 months as Arsenal&#x27;s head coach</strong>. Here, we chart his rise and fall as he attempted to lead the club out of Arsene Wenger&#x27;s shadow.",
    "published": "May 30, 2020"
  }
]