[
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "The Sovereignty Council, an 11-member civilian-military collective head of state, is designed to lead the country for 39 months in the transition to democracy, which is supposed to end with the next general election. The Transitional Sovereignty Council was dissolved by al-Burhan on 25 October 2021, following a coup d&#x27;état. Al-Burhan reinstated it on 11 November 2021, with some members replaced. As of 2021, there is a two-term limit for the president in the Constitution of Sudan.",
    "published": "November 14, 2025"
  },
  {
    "title": "List of heads of government of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_government_of_Sudan",
    "snippet": "The current prime minister is <strong>Kamil Idris</strong>. He was appointed by the Transitional Sovereignty Council on 31 May 2025. ... ^ Briefly interrupted following the 2021 coup d&#x27;état, when Abdel Fattah al-Burhan served as head of state and there was ...",
    "published": "October 23, 2025"
  },
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "It was reported that Sudan wanted Israeli support following the capture of Khartoum by the SAF in exchange for Sudan&#x27;s recognition. On 6 March 2024, al-Burhan&#x27;s son, Mohammed Fattah Burhan Rahman, was severely injured after his motorcycle collided with another vehicle in Ankara, Turkey. He died of his injuries on 3 May after spending nearly two months in intensive care. ... ^ While al-Burhan heads the Transitional Sovereignty Council, his role in the council is weak and thus, al-Burhan and the council both served as collective head of state until a coup led by al-Burhan in October 2021 where the council was dissolved and al-Burhan became the sole head of state.",
    "published": "3 weeks ago"
  },
  {
    "title": "Heads of State of Sudan (1956–Present)",
    "url": "https://www.sudanembassy.de/index.php/ct-menu-item-14/ct-menu-item-15",
    "snippet": "Most important achievements of ... that stated granting autonomy to Sudan . Afterward a parliament was formed of the Senate and the Parliament of 50 members he aded by Ahmed Mohamed Yasin then by Mohamed Al - Hassan Dyab. The Parliament was formed of 97 members headed by Babikir ...",
    "published": null
  },
  {
    "title": "New York 23/09/2022 - H.E. Lt. Gen. Abdel Fattah Al-Burhan President of the Transitional Sovereign Council, Sudan | African Union",
    "url": "https://au.int/en/images/20220923/he-lt-gen-abdel-fattah-al-burhan-president-transitional-sudan",
    "snippet": "H.E. Lt. Gen. <strong>Abdel Fattah Al-Burhan</strong> President of the Transitional Sudan",
    "published": null
  }
]