[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The Akron Beacon Journal is a morning newspaper in Akron, Ohio, United States. <strong>Owned by Gannett</strong>, it is the sole daily newspaper in Akron and is distributed throughout Northeast Ohio. The paper&#x27;s coverage focuses on local news.",
    "published": "September 20, 2025"
  },
  {
    "title": "Beacon Journal owner GateHouse Media acquires Gannett",
    "url": "https://www.beaconjournal.com/story/news/local/2019/08/05/beacon-journal-owner-gatehouse-media/4534606007/",
    "snippet": "<strong>GateHouse Media</strong>, the company that owns the Akron Beacon Journal and nine other Ohio newspapers, on Monday announced its long-planned acquisition of Gannett, creating the nation’s largest newspaper chain.",
    "published": "August 5, 2019"
  },
  {
    "title": "Akron Beacon Journal newspaper in Akron Ohio - MondoTimes.com",
    "url": "https://www.mondotimes.com/1/world/us/35/1910/4784",
    "snippet": "The Akron Beacon Journal is one of the highest circulation newspapers in the USA. This newspaper is owned by <strong>Gannett Company, Inc.</strong>",
    "published": null
  },
  {
    "title": "Akron Beacon Journal 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/153167-50",
    "snippet": "<strong>Akron Beacon Journal was acquired by Gannett Company</strong>.",
    "published": null
  },
  {
    "title": "Can it be saved? Frustrated owner doesn’t want to raze old Beacon Journal building",
    "url": "https://www.usatoday.com/story/news/2022/11/23/businessman-hopes-someone-can-save-former-beacon-journal-building/69661849007/",
    "snippet": "The Beacon Journal won four Pulitzers from its base at 44 E. Exchange St. <strong>GateHouse Media, now known as Gannett, purchased the Beacon Journal from Canadian company Black Press Ltd</strong>.",
    "published": "November 23, 2022"
  }
]