[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "The new facility is intended to merge its two manufacturing facilities and produce the Twin Otter and Dash 8 planes, as well as the new DHC-515 firefighting aircraft. <strong>First production at the new site is planned to begin in 2025</strong>. The company also owns the type certificates for aircraft produced ...",
    "published": "1 month ago"
  },
  {
    "title": "De Havilland Aircraft of Canada 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/292700-62",
    "snippet": "De Havilland Aircraft of Canada is a <strong>Private company</strong>. The current valuation of De Havilland Aircraft of Canada is .",
    "published": null
  },
  {
    "title": "De Havilland Canada Amalgamation - De Havilland Canada",
    "url": "https://dehavilland.com/amalgamation/",
    "snippet": "On <strong>August 1, 2024</strong>, our group of Canadian aviation corporations, including De Havilland Aircraft of Canada Limited, De Havilland Flight Operations Limited, Viking Air Limited, Longview Aviation Services Inc. and Longview Distribution Services ...",
    "published": "August 1, 2024"
  },
  {
    "title": "De Havilland Aircraft of Canada Acquires Fleet Canada Inc.",
    "url": "https://www.globenewswire.com/news-release/2025/04/01/3053557/0/en/De-Havilland-Aircraft-of-Canada-Acquires-Fleet-Canada-Inc.html",
    "snippet": "CALGARY, Alberta, April 01, 2025 (GLOBE NEWSWIRE) -- Today, De Havilland Aircraft of Canada (DHC) announced that it has acquired all of the shares of <strong>Fleet Canada Inc.</strong>",
    "published": null
  },
  {
    "title": "De Havilland Canada acquires Fleet Canada to expand manufacturing capabilities",
    "url": "https://avitrader.com/2025/04/02/de-havilland-canada-acquires-fleet-canada-to-expand-manufacturing-capabilities/",
    "snippet": "April 2, 2025 · 9:28 am · Financial · De Havilland Canada, Fleet Canada · © Fleet Canada · <strong>De Havilland Aircraft of Canada (DHC) has acquired all shares of Fleet Canada Inc.</strong>",
    "published": "April 3, 2025"
  }
]