[
  {
    "title": "David Hurley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley",
    "snippet": "General David John Hurley (born 26 August 1953) is an Australian former politician and military officer. <strong>A senior officer in the Australian Army, he served as the 27th governor-general of Australia from 2019 to 2024</strong>. He was previously the 38th governor of New South Wales from 2014 to 2019.",
    "published": "October 31, 2025"
  },
  {
    "title": "Biography - The Honourable David Hurley AC CVO DSC | Governor-General of the Commonwealth of Australia",
    "url": "https://www.gg.gov.au/biography-honourable-david-hurley-ac-cvo-dsc",
    "snippet": "David Hurley <strong>joined the Australian Army in January 1972, graduating from the Royal Military College, Duntroon into the Royal Australian Infantry Corps</strong>. In a long and distinguished 42-year military career, his service culminated with his appointment as Chief of the Defence Force.",
    "published": null
  },
  {
    "title": "DAVID HURLEY – Living Legends of Aviation",
    "url": "https://living-legends-of-aviation.myshopify.com/pages/david-hurley",
    "snippet": "David C. Hurley has <strong>over sixty years of aviation experience starting with his first flight in a Stinson Voyager at the age of 14.</strong> In 1970, Hurley joined Cessna Aircraft Company to help launch a new business jet, the Cessna Fanjet 500, later known as the “Cessna Citation.” It was during ...",
    "published": null
  },
  {
    "title": "David Hurley Stats | Soccerway",
    "url": "https://us.soccerway.com/player/hurley-david/vJU2fdN6/",
    "snippet": "View the player profile of David Hurley (Galway) on Soccerway. Career stats, injuries and transfer history.",
    "published": null
  },
  {
    "title": "David Hurley | Stats | History | Career Details | Images | extratime.com - The Home of Irish Football - Extratime.com",
    "url": "https://www.extratime.com/player/11122667/david_hurley/",
    "snippet": "Having <strong>made over 80 appearances for Cobh</strong>, David signed for Galway in November 2020.",
    "published": null
  }
]