[
  {
    "title": "Odion Ighalo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Odion_Ighalo",
    "snippet": "Odion Jude Ighalo (born 16 June 1989) is a Nigerian professional footballer who plays as a forward. After starting his career at Nigerian clubs Prime and Julius Berger, Ighalo moved to Norwegian club Lyn in 2007. A year later, he was signed by <strong>Italian club Udinese</strong>, spending most of his tenure ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Odion Ighalo | EPL Contracts & Salaries | Spotrac.com",
    "url": "https://www.spotrac.com/epl/player/_/id/47315/odion-ighalo",
    "snippet": "Odion Ighalo signed a 1 year contract with the <strong>Manchester United F.C.</strong>.",
    "published": null
  },
  {
    "title": "Odion Ighalo - Nigeria | Player Profile | Sky Sports Football",
    "url": "https://www.skysports.com/odion-ighalo",
    "snippet": "Odion Ighalo, who was on loan at Manchester United for a year, has completed a permanent transfer to Saudi Arabian club <strong>Al-Shabab</strong>.",
    "published": null
  },
  {
    "title": "r/ManchesterUnited on Reddit: Odion Ighalo on his loan at Manchester United : “I give God the glory for helping me fulfill this lifelong dream of putting on a Manchester United shirt as a player and represent this great club, it was indeed an honour I will forever cherish and be grateful for.”",
    "url": "https://www.reddit.com/r/ManchesterUnited/comments/1gr0vpw/odion_ighalo_on_his_loan_at_manchester_united_i/",
    "snippet": "Odion Ighalo: &quot;It&#x27;s always special to hear the Watford fans sing your name because they know what I&#x27;ve done for them in the past when I was there. They are always in my heart and I love them for that.&quot; ... The football subreddit. News, results, and discussion about the beautiful game. ... Back when we brought in Ighalo from Sanghai China on a Loan.....",
    "published": "November 14, 2024"
  },
  {
    "title": "Odion Ighalo (Ighalo O.) Stats - Flashscore.com",
    "url": "https://www.flashscore.com/player/ighalo-odion/ITCY8iWq/",
    "snippet": "Help: You are on the player profile of Odion Ighalo, Ighalo O.. View Odion Ighalo stats in detail (appearances, goals, cards / leagues, cups, national team), transfer value, contract length, transfer history including transfer fees, injury updates or unique player ratings from previous matches.",
    "published": null
  }
]