[
  {
    "title": "Union Berlin’s Stadium Holding Company Expands with 10,000 Shareholders and €30 Million Capital.",
    "url": "https://www.footballbusinessjournal.com/post/union-berlin-s-stadium-holding-company-expands-with-10-000-shareholders-and-30-million-capital",
    "snippet": "During this process, approximately 49,000 new shares were applied for. The club itself subscribed to <strong>40,000 shares</strong>, reinforcing its majority ownership stake, which had already included 6,847 shares.",
    "published": "February 17, 2025"
  },
  {
    "title": "1. FC Union Berlin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/1._FC_Union_Berlin",
    "snippet": "The club&#x27;s origins can be traced to 1906, when its predecessor FC Olympia Oberschöneweide was founded. During the Cold War, Union was based in East Berlin, joining the German league structure upon the reunification of the city and country in 1990. From 2009 until 2019, they competed in the 2.",
    "published": "3 weeks ago"
  },
  {
    "title": "Union Berlin: Inside the Rise of a Truly Unique Bundesliga Club | Jobs In Football",
    "url": "https://jobsinfootball.com/blog/union-berlin-inside-the-rise-of-a-truly-unique-bundesliga-club/",
    "snippet": "In a footballing world that&#x27;s been ... state ownership, this is a tale of community togetherness and triumph that encapsulates what the sport is all about. Situated in Köpenick, a leafy suburb in East Berlin that was part of communist East Germany until the Berlin wall came crashing down in 1989, Union Berlin is ...",
    "published": null
  },
  {
    "title": "Newly promoted Union Berlin is a model club in Germany",
    "url": "https://worldsoccertalk.com/news/newly-promoted-union-berlin-is-a-model-club-in-germany-20230207-WST-418976.html",
    "snippet": "While fans have seen clubs like Paris Saint-German, Chelsea, and Manchester City get to their positions by spending incredible amounts of money, this club hasn’t done that. Union Berlin is <strong>100% fan member owned</strong>.",
    "published": "February 7, 2023"
  },
  {
    "title": "The story of FC Union Berlin, the cult club you all wish you supported - Planet Football",
    "url": "https://www.planetfootball.com/in-depth/story-fc-union-berlin-cult-club-wish-supported",
    "snippet": "For a club that has been shooed away from the top table so many times, this sort of stability is savoured. There’s no ‘us and them’ tension between Union fans and Zingler either. German football has traditionally adhered to a ‘50+1’ ownership rule ‒ aimed to preserve fans as majority shareholders, but there are exceptions for company-owned clubs like Wolfsburg (Volkswagen) and Bayer Leverkusen, and there’s a risk that the rule will disappear altogether as more clubs start to ignore it.",
    "published": "April 18, 2018"
  }
]