[
  {
    "title": "Issa Hayatou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Issa_Hayatou",
    "snippet": "Issa Hayatou (9 August 1946 – 8 August 2024) was a Cameroonian sports executive, athlete, and football administrator best known for serving as the president of the Confederation of African Football (CAF) between 1988 and 2017. He <strong>served as the acting FIFA president until 26 February 2016</strong> ...",
    "published": "October 20, 2025"
  },
  {
    "title": "Who We Are - News - Information regarding Acting FIFA President Issa Hayatou - FIFA.com",
    "url": "https://www.fifa.com/about-fifa/who-we-are/news/information-regarding-acting-fifa-president-issa-hayatou-2732634",
    "snippet": "Issa Hayatou has never hidden the fact that, for several years now, he has been suffering from a renal insufficiency, a situation that has not, however, prevented him from fully performing his duties at the heart of world and African football’s governing bodies, without interruption. He will continue to fulfil his role as Acting FIFA President as intended.",
    "published": null
  },
  {
    "title": "Former FIFA interim president and long-time leader of African soccer Issa Hayatou dies at 77 | AP News",
    "url": "https://apnews.com/article/issa-hayatou-fifa-ioc-olympic-ab10305e84624493a8e612602a868541",
    "snippet": "PARIS (AP) — Issa Hayatou, the long-time leader of African soccer who was made interim president of FIFA during its corruption crisis in 2015, <strong>died on Thursday</strong>.",
    "published": "August 9, 2024"
  },
  {
    "title": "FIFA President pays tribute to Issa Hayatou: “An ambassador for football in the world”",
    "url": "https://inside.fifa.com/about-fifa/president/news/issa-hayatou-funeral-fifa-president-gianni-infantino-tribute",
    "snippet": "FIFA President Gianni Infantino ... funeral in Garoua, Cameroon. Mr Hayatou was acting FIFA President for <strong>just over four months between October 2015</strong> and Mr Infantino’s election in February 2016....",
    "published": null
  },
  {
    "title": "About FIFA: Organisation - FIFA.com",
    "url": "https://web.archive.org/web/20151010023004/http:/www.fifa.com/about-fifa/acting-president/index.html",
    "snippet": "<strong>The Cameroonian has also been a member of the IOC (International Olympic Committee) since 2001 and has been serving as a FIFA vice-president since 1992</strong>. On 8 October 2015, given the decision of the Adjudicatory Chamber of the Independent Ethics ...",
    "published": null
  }
]