[
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The 2019 election took place on 31 March, with a run-off on 21 April. As a result of this election, <strong>Volodymyr Zelenskyy</strong>, a former actor and comedian with no prior political experience, became the sixth President of Ukraine, scoring a record 73.22% of the popular vote in the run-off against ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Shakeup in Wartime Ukraine Consolidates Power in the President’s Office | German Marshall Fund of the United States",
    "url": "https://www.gmfus.org/news/shakeup-wartime-ukraine-consolidates-power-presidents-office",
    "snippet": "The decision was accompanied by ... actions of the current authorities speak of the systematic centralization of power by <strong>the president</strong> and his office....",
    "published": null
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "President of Ukraine <strong>Volodymyr Zelenskyy</strong> has signed a Decree establishing the honorary distinction “Rescue Community” to recognize the courage, compassion, and solidarity shown by residents of territorial communities in the fight against ...",
    "published": "1 week ago"
  },
  {
    "title": "Ukraine’s Presidents, Power Elites, and the Country’s Evolution | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/ukraines-presidents-power-elites-and-countrys-evolution",
    "snippet": "After three rounds of elections and two months of protests in Kyiv’s Maidan Nezalezhnosti (Independence Square), <strong>Viktor Yushchenko</strong> became president. Under his leadership, Ukraine rose in the measurements of democracy, but the president’s ...",
    "published": null
  },
  {
    "title": "Politics of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Ukraine",
    "snippet": "The politics of Ukraine take place in a framework of a semi-presidential republic and a multi-party system. A Cabinet of Ministers exercises executive power (jointly with the president until 1996). Legislative power is vested in Ukraine&#x27;s parliament, the Verkhovna Rada (Ukrainian: Верховна Рада, lit.",
    "published": "3 days ago"
  }
]