[
  {
    "title": "List of prime ministers of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Canada",
    "snippet": "Two prime ministers have died in office: John A. Macdonald (1867–1873, 1878–1891) and John Thompson (1892–1894), both of natural causes. All others have resigned, either after losing an election or upon retirement. Canadian custom is to count by the individuals who were prime minister, not by terms.",
    "published": "2 weeks ago"
  },
  {
    "title": "Prime Ministers of Canada",
    "url": "https://lop.parl.ca/sites/ParlInfo/default/en_CA/People/primeMinisters",
    "snippet": "This page provides general details on Canada&#x27;s prime ministers since 1867.",
    "published": null
  },
  {
    "title": "List of prime ministers of Canada | Britannica",
    "url": "https://www.britannica.com/place/list-of-prime-ministers-of-Canada-1800352",
    "snippet": "After a general election, the governor-general calls on the leader of the political party winning the most seats in the House of Commons to become prime minister and to form a government. This is a chronologically ordered list of the prime ministers, from the earliest to the most recent.",
    "published": "November 4, 2011"
  },
  {
    "title": "Mark Carney - Prime Minister of Canada | Prime Minister of Canada",
    "url": "https://www.pm.gc.ca/en",
    "snippet": "Home Page of the Right Honourable <strong>Mark Carney</strong>",
    "published": "1 day ago"
  },
  {
    "title": "Government Ministries and Prime Ministers of Canada Since 1867 - House of Commons Procedure and Practice, Third edition, 2017 - ProceduralInfo - House of Commons of Canada",
    "url": "https://www.ourcommons.ca/procedure/procedure-and-practice-3/App06-e.html",
    "snippet": "Sir Charles Tupper served as Prime Minister during the dissolution period following the end of the Sixth Session of the Seventh Parliament and before the beginning of the First Session of the Eighth Parliament. ... The Tenth Ministry was a reorganization of the Ninth Ministry, with the addition of certain Liberal Ministers.",
    "published": null
  }
]