[
  {
    "title": "Mikheil Kavelashvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikheil_Kavelashvili",
    "snippet": "Zourabichvili, along with opposition ... February 2025, the European Parliament passed a resolution stating that <strong>the European Union does not recognize Kavelashvili as the legitimate president of Georgia</strong>....",
    "published": "5 days ago"
  },
  {
    "title": "Georgia’s Kavelashvili defends 2024 vote amid EU strains | Muscat Daily| Oman News |Business | Sports |Lifestyle",
    "url": "https://www.muscatdaily.com/2025/12/01/georgias-kavelashvili-defends-2024-vote-amid-eu-strains/",
    "snippet": "Tuesday, December 09 · 11:47 AM · Subscribe · E-paper · 1 Dec 2025 · Tbilisi, Georgia – Georgia has grappled with political tension and months of street protests, but President Mikheil Kavelashvili defended the legitimacy of the country’s 2024 parliamentary elections and its path to become an European Union (EU) member.",
    "published": "3 weeks ago"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "Former soccer player Mikheil Kavelashvili was <strong>formally inaugurated as president of Georgia</strong> on Sunday, cementing the ruling party&#x27;s grip in what the opposition calls a blow to the country’s EU aspirations and a victory for former imperial ruler ...",
    "published": "December 29, 2024"
  },
  {
    "title": "Anti-Western Kavelashvili sworn in as Georgia's president, pro-EU Zourabichvili disputes legitimacy",
    "url": "https://kyivindependent.com/anti-western-kavelashvili-inaugurated-as-georgias-president/",
    "snippet": "Georgian anti-Western politician Mikheil Kavelashvili, an ally of the ruling Georgian Dream party, was inaugurated as the country&#x27;s sixth president on Dec. 29 in a move seen as <strong>illegitimate by the opposition</strong>.",
    "published": "December 29, 2024"
  },
  {
    "title": "Mikheil Kavelashvili sworn in as Georgia's president amid political tensions",
    "url": "https://www.aa.com.tr/en/europe/mikheil-kavelashvili-sworn-in-as-georgias-president-amid-political-tensions/3437181",
    "snippet": "As she departed, <strong>she declared she was taking with her “legitimacy, the flag, and your trust”</strong> and vowed to continue her struggle. Last Sunday, Georgian Prime Minister Irakli Kobakhidze stated that Zourabichvili must vacate her post on the ...",
    "published": null
  }
]