[
  {
    "title": "President of Georgia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Georgia",
    "snippet": "Protests against the ruling party ... 2025, the European Parliament passed a resolution stating that the European Union does not recognize <strong>Mikheil Kavelashvili</strong> as the legitimate president of Georgia....",
    "published": "4 weeks ago"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "READ MORE: Georgian ruling party candidate Kavelashvili becomes president with country’s EU bid in limbo",
    "published": "December 29, 2024"
  },
  {
    "title": "Salomé Zourabichvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salom%C3%A9_Zourabichvili",
    "snippet": "She was quoted saying &quot;This building ... the President, who was legitimate, sat here. I&#x27;m taking away the legitimacy, I&#x27;m taking away the flag, I&#x27;m taking away what is your trust&quot;. On 9 January 2025, Zourabichvili held a press briefing at her new office on Chovelidze street, stating that she would continue to work to solve the crisis, meeting people around Georgia and ...",
    "published": "5 days ago"
  },
  {
    "title": "2024 Georgian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024_Georgian_presidential_election",
    "snippet": "Kazakhstan: President Kassym-Jomart Tokayev sent a letter to Kavelashvili, extending New Year greetings and expressing his &quot;best wishes for a joyous and prosperous 2025&quot;. Hungary: President Tamás Sulyok congratulated Kavelashvili on his election as president. Sulyok emphasized that &quot;Hungary firmly supports the territorial integrity and sovereignty of Georgia and the country&#x27;s European integration efforts&quot;.",
    "published": "November 14, 2025"
  },
  {
    "title": "Georgia Election 2024: Key Races and Historical Presidential Election Results",
    "url": "https://www.nbcnews.com/politics/2024-elections/georgia-results",
    "snippet": "Get an overview of the 2024 Georgia election, highlighting key races. Discover how the state has voted in past presidential elections.",
    "published": "August 22, 2025"
  }
]