[
  {
    "title": "r/fivethirtyeight on Reddit: Future of the subreddit after 538’s disbandment",
    "url": "https://www.reddit.com/r/fivethirtyeight/comments/1j3v5li/future_of_the_subreddit_after_538s_disbandment/",
    "snippet": "434 votes, 129 comments. Howdy kits, In case you have not heard, <strong>Disney is officially shuttering 538</strong>, which is the namesake of this subreddit. Its…",
    "published": "March 5, 2025"
  },
  {
    "title": "FiveThirtyEight is shutting down as part of broader cuts at ABC and Disney | Nieman Journalism Lab",
    "url": "https://www.niemanlab.org/2025/03/fivethirtyeight-is-shutting-down-as-part-of-broader-cuts-at-abc-and-disney/",
    "snippet": "<strong>Disney is cutting 200 positions across ABC News and Disney Entertainment, including shutting down FiveThirtyEight</strong>, The Wall Street Journal reported Tuesday night.",
    "published": null
  },
  {
    "title": "FiveThirtyEight is shutting down completely – FlowingData",
    "url": "https://flowingdata.com/2025/03/05/fivethirtyeight-is-shutting-down-completely",
    "snippet": "Disney is cutting news jobs, and FiveThirtyEight, which was absorbed by ABC News and owned by Disney, is going with them. <strong>FiveThirtyEight employees were laid off this morning</strong>. It&#x27;s unclear what will happen to past projects and the brand itself, ...",
    "published": "March 5, 2025"
  },
  {
    "title": "Daring Fireball: ABC Shuts Down FiveThirtyEight, and Pulls the Plug on Its Website",
    "url": "https://daringfireball.net/2025/03/abc_shuts_down_fivethirtyeight",
    "snippet": "On Wednesday morning, shortly after sending an all-staff memo announcing layoffs at ABC News, network president Almin Karamehmedovic joined a virtual meeting with the FiveThirtyEight team. The 15 staffers at the political analysis site owned by ABC News had learned the previous evening — via a Wall Street Journal report — that they were being let go.",
    "published": null
  },
  {
    "title": "Disney and ABC News cuts include the shutdown of FiveThirtyEight - Poynter",
    "url": "https://www.poynter.org/commentary/2025/538-disney-abc-layoffs-shut-down-nate-silver/",
    "snippet": "The Wall Street Journal’s Joe Flint reported that Disney was cutting about 6% — or 200 people — from ABC News and Disney Entertainment Networks. But here’s where the political drama played out: The cuts include shutting down FiveThirtyEight, the political and data-driven news site known for its focus on election polling and predictions.",
    "published": "March 6, 2025"
  }
]