[
  {
    "title": "Mary Earps’ Manchester United return: Jeers, cheers, selfies and a painful defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6802703/2025/11/13/mary-earps-manchester-united-psg/",
    "snippet": "It ensured that Earps was the headline act at Old Trafford last night. Some spectators held placards in support of her, one reading ‘Mary Queen of Stops’. Elloise Walker, wearing a PSG top with Earps’ name on the back, had come 50 miles from Leeds, just to support the player and not United.",
    "published": "November 13, 2025"
  },
  {
    "title": "Pantomime villain Mary Earps booed on miserable return to Manchester United",
    "url": "https://www.telegraph.co.uk/football/2025/11/12/man-utd-vs-psg-live-score-womens-champions-league-earps/",
    "snippet": "Earps may have thought leaving United would give her a better chance of silverware but, on this evidence, she is further away than before. Manchester United Women Middleton-Patel, Riviere, Le Tissier, George, Sandberg, Miyazawa, Awujo (Toone, 69), Zigiotti Olme, Park (Williams 90), Malard (Terland 76), Rolfo (Galton 75). Substitutes not used Rendell, Blundell, Naalsund, Griffiths. Booked Le Tissier, Malard. PSG Women Earps, Chagas (Morissaint 84), De Almeida, Mbock, Carmona, Ebayilin, Groenen (Elimbi 74), Karchaoui, Ajibade (Diakite 73), Leuchter, Echegini (Kanjinga 64).",
    "published": "November 12, 2025"
  },
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She and Paris Saint-Germain lost 5–2 on aggregate to Juventus in the 2024–25 UEFA Women&#x27;s Champions League qualifying rounds. On 12 November 2025, <strong>Earps returned to Manchester United in the Champions League for the first time since her move, where they lost 2-1</strong>.",
    "published": "4 days ago"
  },
  {
    "title": "Man Utd vs Paris St-Germain: Mary Earps says return to old club was 'written in stars' - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cy7e214vx6yo",
    "snippet": "When Hampton was handed the starting spot ahead of Euro 2025, Earps described the decision as &quot;unjust&quot; and subsequently announced her <strong>retirement from international football</strong> just before the tournament started.",
    "published": "November 11, 2025"
  },
  {
    "title": "Mary Earps left Manchester United to become a better player at PSG, England goalkeeper tells Pitch to Pod | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13340388/mary-earps-left-manchester-united-to-become-a-better-player-at-psg-england-goalkeeper-tells-pitch-to-pod",
    "snippet": "Earps joined Paris Saint-Germain on a free transfer last summer following a period of lengthy talks over a contract extension with United. PSG were knocked out in the Women&#x27;s Champions League second round by Juventus and they are second in their domestic league behind Lyon, but they do have a derby game to look forward to against Paris FC in the French Cup final at the beginning of next month.",
    "published": "April 4, 2025"
  }
]