[
  {
    "title": "Prime Minister of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Saudi_Arabia",
    "snippet": "After the deposition of Saud in 1964, Faisal succeeded him as king, while remaining prime minister. From that point until the appointment of <strong>Mohammed bin Salman</strong> as prime minister by King Salman, the two offices were merged.",
    "published": "November 10, 2025"
  },
  {
    "title": "Prime ministers of Saudi Arabia | Amwaj.media",
    "url": "https://amwaj.media/en/data/country/saudi-arabia/politics/individuals/prime-ministers-of-saudi-arabia",
    "snippet": "The office was created by royal decree in 1953.",
    "published": null
  },
  {
    "title": "Saudi Royal Family Tree: Tracing Saudi Arabia's Royal Lineage | History Cooperative",
    "url": "https://historycooperative.org/saudi-royal-family-tree/",
    "snippet": "Prince Alwaleed bin Talal is one of Saudi Arabia’s most well-known and influential figures. Born in 1955, he is the grandson of King Abdulaziz Al Saud, the founder of Saudi Arabia, and Riad Al Solh, Lebanon’s first prime minister.",
    "published": "January 13, 2025"
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing - HOG",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?OpenForm=&ExpandView=&RestrictToCategory=Saudi+Arabia",
    "snippet": "The Heads of Government listing is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers and in some cases, ministers responsible for development assistance.",
    "published": null
  },
  {
    "title": "Who Was the First Prime Minister in Saudi Arabia? - Saudipedia",
    "url": "https://saudipedia.com/en/article/3256/figures/officials/who-was-the-first-prime-minister-in-saudi-arabia",
    "snippet": "During the reign of King Saud, his then Crown Prince, <strong>Prince Faisal Bin Abdulaziz</strong>, was appointed the Prime Minister. After King Faisal assumed power, he chaired the council himself.",
    "published": "December 6, 2024"
  }
]