[
  {
    "title": "PM Modi embarks on three-nation visit beginning with Jordan - The Hindu",
    "url": "https://www.thehindu.com/news/national/pm-modi-embarks-on-three-nation-visit-beginning-with-jordan/article70397710.ece",
    "snippet": "Prime Minister Narendra Modi on Monday (December 15, 2025) <strong>embarked on a visit to Jordan, Ethiopia and Oman</strong> — countries which enjoy civilizational ties and exceptional bilateral relations with India.",
    "published": "1 day ago"
  },
  {
    "title": "Prime Minister Narendra Modi departed for Ethiopia from Jordan - The Hindu",
    "url": "https://www.thehindu.com/news/national/pm-narendra-modi-ethiopia-visit-updates-december-16-2025/article70402401.ece",
    "snippet": "In a gesture reflecting the warm Indian-Jordan bilateral ties, HRH Crown Prince Al-Hussein bin Abdullah II drove PM @narendramodi to the airport and saw him off. PM emplanes for the second leg of his tour — Ethiopia,&quot; Ministry of External Affairs Official Spokesperson Randhir Jaiswal posted on social media. In his first visit to Ethiopia, the Prime Minister will address the Joint Session of Parliament and share his thoughts on India&#x27;s journey as the &quot;Mother of Democracy&quot; and the value that the India-Ethiopia partnership can bring to the Global South. Mr. Modi will also hold discussions with Ethiopia&#x27;s Prime Minister Abiy Ahmed Ali and meet the Indian diaspora.",
    "published": "1 hour ago"
  },
  {
    "title": "Putin, Modi agree to expand and widen India-Russia trade, strengthen friendship | Reuters",
    "url": "https://www.reuters.com/business/aerospace-defense/russias-putin-hold-summit-talks-with-indias-modi-delhi-2025-12-05/",
    "snippet": "<strong>Russia&#x27;s President Vladimir Putin and India&#x27;s Prime Minister Narendra Modi walk ahead of their talks in New Delhi, India, December 5, 2025</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "‘Age-old civilizational ties’: PM Modi begins three-nation tour to Jordan, Ethiopia and Oman; what's on agenda | India News - The Times of India",
    "url": "https://timesofindia.indiatimes.com/india/age-old-civilizational-ties-pm-modi-begins-three-nation-tour-to-jordan-ethiopia-and-oman-whats-on-agenda/articleshow/125971993.cms",
    "snippet": "TOI News Desk / TIMESOFINDIA.COM / Updated: Dec 15, 2025, 11:54 IST · Share · AA · +Text Size · Small · Medium · Large · Prime Minister Narendra Modi <strong>commenced a significant three-nation tour to Jordan, Ethiopia, and Oman</strong>, countries with ...",
    "published": "1 day ago"
  },
  {
    "title": "News Updates | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/news-updates/",
    "snippet": "Prime Minister Shri Narendra Modi today <strong>paid solemn tribute to the brave security personnel who sacrificed their lives while defending the Parliament of India during the heinous terrorist attack on 13 December 2001.</strong> ... The Governor of Himachal Pradesh, Shri Shiv Prathap Shukla, met Prime Minister ...",
    "published": null
  }
]