[
  {
    "title": "Sooronbay Jeenbekov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sooronbay_Jeenbekov",
    "snippet": "Atambayev strongly backed Jeenbekov during the 2017 election against his opponent Ömürbek Babanov, even referring to himself as an &quot;older brother&quot; to Jeenbekov. Since Atambayev left office on 24 November 2017 and handed the presidency to his successor Sooronbay Jeenbekov, he has served as head of the SDPK.",
    "published": "October 3, 2025"
  },
  {
    "title": "Sooronbay Jeenbekov - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q23810819",
    "snippet": "Sooronbay Jeenbekov · series ordinal · 18 · member of cabinet · First Jeenbekov Cabinet · 0 references · President of Kyrgyzstan · start time · 24 November 2017 · replaces · <strong>Almazbek Atambaev</strong> · elected in · 2017 Kyrgyz presidential ...",
    "published": null
  },
  {
    "title": "President of Kyrgyzstan Sooronbay Jeenbekov received participants of the meeting of the Council of Ministers of Defense of the CSTO member states",
    "url": "https://en.odkb-csto.org/news/news_odkb/prezident-kyrgyzstana-sooronbay-zheenbekov-prinyal-uchastnikov-zasedaniya-soveta-ministrov-oborony-g/",
    "snippet": "The stated priorities of our chairmanship are focused on maintaining continuity, ”S. Jeenbekov stressed. Speaking on behalf of the participants of the meeting of the CSTO defense ministers, Belarusian Minister of Defence Andrei Ravkov wished success to the President of the Kyrgyz Republic.",
    "published": null
  },
  {
    "title": "Kyrgyzstan's President Resigns Amid Turmoil Following Disputed Election | NCPR News",
    "url": "https://www.northcountrypublicradio.org/news/npr/924008910/kyrgyzstan-s-president-resigns-amid-turmoil-following-disputed-election",
    "snippet": "&quot;I&#x27;m not clinging to power,&quot; Sooronbay Jeenbekov said. The new prime minister, sprung from jail, says he&#x27;ll become president. Russia, Kyrgyzstan&#x27;s main ally, is freezing aid until the situation calms.",
    "published": null
  },
  {
    "title": "Sooronbai Jeenbekov | prime minister of Kyrgyzstan | Britannica",
    "url": "https://www.britannica.com/biography/Sooronbai-Jeenbekov",
    "snippet": "…for a second term, and Sooronbai Jeenbekov, an ally and onetime prime minister of Atambayev, was elected president in October 2017. After a midwinter power plant outage in Bishkek caused public outrage, Jeenbekov fell out with Atambayev and his associates.",
    "published": null
  }
]