[
  {
    "title": "Politics of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Greece",
    "snippet": "The Greek governmental structure ... French and German models. <strong>The prime minister and cabinet play the central role in the political process, while the president performs some executive and legislative functions in addition to ceremonial duties</strong>....",
    "published": "October 14, 2025"
  },
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "The president is elected by the ... 1986 constitutional reform. <strong>The office was formally established by the Constitution of Greece in 1975, but has antecedents in the Second Hellenic Republic of 1924–1935 and the Greek junta in 1973–1974</strong> which predated the transition to ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Greece profile - Leaders - BBC News",
    "url": "https://www.bbc.com/news/world-europe-17372887",
    "snippet": "Born in 1974 - the year Greece returned to democracy after a brutal seven-year military dictatorship - Mr Tsipras joined the youth organisation of the Greek Communist Party while at university. He went on carve out a political career in the broader radical left Synaspismos movement, and was elected its leader in 2006.",
    "published": "December 15, 2016"
  },
  {
    "title": "Prime Minister of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Greece",
    "snippet": "To end the political deadlock, Georgios Papandreou attempted a more moderate approach with the king, but Andreas Papandreou publicly rejected his father&#x27;s effort and attacked the whole establishment, attracting the support of 41 members of the Center Union in an effort designed to gain the party&#x27;s leadership and preventing any compromise. The prolonged political instability between the politicians and the king in finding a solution led a group of Colonels to intervene and rule Greece for seven years.",
    "published": "2 weeks ago"
  },
  {
    "title": "Katerina Sakellaropoulou | president of Greece | Britannica",
    "url": "https://www.britannica.com/biography/Katerina-Sakellaropoulou",
    "snippet": "Ask the Chatbot Games &amp; Quizzes History &amp; Society Science &amp; Tech Biographies Animals &amp; Nature Geography &amp; Travel Arts &amp; Culture ProCon Money Videos ... In mid-January 2020 Mitsotakis nominated Katerina Sakellaropoulou, a high court judge, to become the country’s president. The appointment of Sakellaropoulou, a committed environmentalist and expert on environmental and constitutional law, won support from across the political spectrum, and 261 out of 300 members of parliament voted in her favour on…Read More",
    "published": null
  }
]