[
  {
    "title": "VfL Wolfsburg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/VfL_Wolfsburg",
    "snippet": "Within a year, VfL Wolfsburg secured the local Gifhorn championship. In late November 1946, the club played a friendly match against the prominent Gelsenkirchen team Schalke 04 at the Volkswagen-owned stadium, marking its emergence as the company&#x27;s officially supported team.",
    "published": "1 day ago"
  },
  {
    "title": "Workers, Their Clubs, and 50+1 Exception: VfL Wolfsburg and Bayer Leverkusen – Pace Intellectual Property, Sports & Entertainment Law Forum",
    "url": "https://pipself.blogs.pace.edu/2017/02/16/workers-their-clubs-and-501-exception-vfl-wolfsburg-and-bayer-leverkusen/",
    "snippet": "Now, VfL Wolfsburg (“Wolfsburg”) is owned by <strong>VfL Wolfsburg-Fußball GmbH</strong>, a wholly owned subsidiary of Volkswagen Group. Bayer Leverkusen—In 1903, 170 workers of Friedrich Bayer and Co. signed a letter asking their employer to support a sports club. On July 1, 1904, the company supported ...",
    "published": null
  },
  {
    "title": "VfL Wolfsburg facts for kids",
    "url": "https://kids.kiddle.co/VfL_Wolfsburg",
    "snippet": "Within a year, VfL Wolfsburg won the local Gifhorn championship. In November 1946, the club played a friendly match against Schalke 04. This showed that Wolfsburg was becoming the official team supported by Volkswagen.",
    "published": null
  },
  {
    "title": "Management board | VfL Wolfsburg | VfL Wolfsburg",
    "url": "https://www.vfl-wolfsburg.de/en/vfl/club/management-board",
    "snippet": "2013 - present:Head of Law and Compliance and Legal Advisor and Attorney at VfL Wolfsburg-Fußball GmbH",
    "published": null
  },
  {
    "title": "VfL Wolfsburg | Dxs Wiki | Fandom",
    "url": "https://dxs.fandom.com/wiki/VfL_Wolfsburg",
    "snippet": "Professional football is run by the spin-off organization <strong>VfL Wolfsburg-Fußball GmbH, a wholly owned subsidiary of the Volkswagen Group</strong>.[2][3] Since 2002, Wolfsburg&#x27;s stadium is the Volkswagen Arena.",
    "published": null
  }
]