[
  {
    "title": "Tim Cook - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tim_Cook",
    "snippet": "As CEO of Apple, <strong>Cook</strong> met U.S. House members on 10 December 2025 to push back against a federal legislation that could require Apple to authenticate users&#x27; ages and possibly collect sensitive data on children.",
    "published": "2 days ago"
  },
  {
    "title": "Apple Leadership - Tim Cook - Apple",
    "url": "https://www.apple.com/leadership/tim-cook/",
    "snippet": "<strong>Tim Cook</strong> is the CEO of Apple and serves on its board of directors.",
    "published": null
  },
  {
    "title": "Apple Leadership - Apple",
    "url": "https://www.apple.com/leadership/",
    "snippet": "Apple leadership biographies include Apple’s executive team responsibilities and experience. Learn more about Apple’s leadership team.",
    "published": null
  },
  {
    "title": "Apple CEO Tim Cook out-earns the average American’s salary in just 7 hours—to put that into context, he could buy a new $439,000 home in just 2 days",
    "url": "https://fortune.com/2025/12/12/apple-ceo-tim-cook-out-earns-average-american-salary-7-hours-can-buy-new-home-in-2-days-wealth-billionaire-luxury-high-net-worth/",
    "snippet": "But pay dropped the next year after the CEO recommended an adjustment “in light of the feedback received,” which followed pushback from Apple staffers and some shareholders. And when compared to the paycheck of everyday Americans, the difference is severe. With his $74.6 million package, it only takes around seven hours for Cook to outearn the typical U.S. worker—who takes home just $62,088 a year, according to 2025 ...",
    "published": "1 week ago"
  },
  {
    "title": "Pressure builds on Apple and CEO Tim Cook with holiday executive shake-up",
    "url": "https://www.cnbc.com/2025/12/08/apple-tim-cook-pressure-2026.html",
    "snippet": "In the last seven days, there has been extraordinary turnover among Apple&#x27;s top ranks, from its head of artificial intelligence to its top lawyer. CEO <strong>Tim Cook</strong> now has two fewer direct reports than he did before Thanksgiving.",
    "published": "2 weeks ago"
  }
]