[
  {
    "title": "2025 World Athletics Championships - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_World_Athletics_Championships",
    "snippet": "In August 2024, World Athletics released the timetable for the championships. ... On 5 September 2025, World Athletics officially published the final entry lists to the championships.",
    "published": "10 hours ago"
  },
  {
    "title": "World Athletics sets ambitious targets with three-year gender leadership strategy | World Athletics",
    "url": "https://worldathletics.org/women-in-athletics/news/world-athletics-targets-gender-leadership-strategy",
    "snippet": "The World Athletics Gender Leadership ... on <strong>promoting awareness, initiating policy change, and implementing education to support progression and growth of the pool and pipeline of female leaders aligned to defined targets</strong>...",
    "published": null
  },
  {
    "title": "‘Your column was very unfair’: what happened when I met World Athletics CEO | Athletics | The Guardian",
    "url": "https://www.theguardian.com/sport/2025/dec/02/athletics-joining-sports-goliaths-long-way-to-go",
    "snippet": "And the biggest sporting event in the world in 2025 was our event in Tokyo. I don’t say this complacently, but it says growth, right?” · He’s not finished. “And we’re not just sitting passively back going: ‘Gen Z is tough – let’s rely on our middle-aged audience!’” · But there is a glint in his eye when Ridgeon talks and explains that World Athletics had 700 million video views on its social media channels at the world championships in September – double that of Budapest two years ago.",
    "published": "2 weeks ago"
  },
  {
    "title": "World Athletics aims to build on successful year and forge lasting geopolitical relationships during unprecedented 2026 | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/successful-year-lasting-geopolitical-relationships-unprecedented-2026",
    "snippet": "World Athletics President <strong>Sebastian Coe</strong> reflected on a successful year for the organisation at the 239th World Athletics Council Meeting in Monaco and reinforced how 2026 offers an unprecedented opportunity to build lasting geopolitical and ...",
    "published": null
  },
  {
    "title": "HOME - World Masters Athletics",
    "url": "https://world-masters-athletics.org",
    "snippet": "Obituary for Guido Müller Guido passed away on Tuesday December 9, after a long illness Guido Müller (1938–2025): From Württemberg ... Read More ... AFMA Elects a New President Rose Tata Muya and Leonie Paulette Etong – Photo AFMA Passing of the baton for ... Read More ... 🌍 Help Us Grow the Global Voice of Masters Athletics! We Need YOU! World Masters Athletics (WMA) is calling on ... Read More ... Well Deserved Recognition for Siva! 2025 ANUGERAH TOKOH SUKAN (NATIONAL SPORTS LEADERSHIP ...",
    "published": "July 21, 2025"
  }
]