[
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Appointed in December 2017 after a year with Bordeaux Begles, <strong>Jacques Brunel</strong>’s first game as France rugby coach saw his side lose 15-13 to Ireland following a last-minute Johnny Sexton drop goal.",
    "published": "May 30, 2025"
  },
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Galthié won 64 caps for France, including playing in four Rugby World Cups, as well as captaining the side at the 2003 World Cup. Former France national coach <strong>Bernard Laporte</strong> has described him as the greatest scrum-half in French history. He was the IRB International Player of the Year in 2002.",
    "published": "3 weeks ago"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "<strong>Thibault Giroud</strong>, former Toulon head of physical training where he worked with Galthié, was also appointed as head of high performance. Video analyst Nicolas Buffa retained his positions and became the analysis unit director. After the 2023 Rugby World Cup, Ghezal, Labit and Giroud left the ...",
    "published": "1 week ago"
  },
  {
    "title": "France rugby captain - who has led the men's team over the years?",
    "url": "https://www.rugbyworld.com/countries/france-countries/who-has-captained-the-france-rugby-team-172065",
    "snippet": "France rugby captain: From <strong>Antoine Dupont</strong> to Serge Blanco, here are the players to have captained the France&#x27;s men&#x27;s rugby team in the modern era.",
    "published": "May 30, 2025"
  },
  {
    "title": "Fabien Galthie’s right-hand man exits after France’s World Cup failure : Planet Rugby",
    "url": "https://www.planetrugby.com/news/fabien-galthies-right-hand-man-departs-after-frances-rugby-world-cup-failure-report",
    "snippet": "France head coach Fabien Galthie with <strong>Raphael Ibanez</strong> behind him. France are in search for a new team manager after reports stated <strong>Raphael Ibanez</strong> had left his position in the set-up.",
    "published": "November 20, 2023"
  }
]