[
  {
    "title": "Saudi Arabia - Heads of Government Listing",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?RestrictToCategory=Saudi+Arabia",
    "snippet": "The heads of government list is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers, trade ministers and in some cases, ministers responsible for development assistance.&amp;nbsp It has been prepared using information provided by ...",
    "published": null
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing - HOG",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?OpenForm=&ExpandView=&RestrictToCategory=Saudi+Arabia",
    "snippet": "The Heads of Government listing is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers and in some cases, ministers responsible for development assistance.",
    "published": null
  },
  {
    "title": "Saudi Arabia - Heads of Government | Australian Government Department of Foreign Affairs and Trade",
    "url": "https://www.dfat.gov.au/geo/heads-of-government/saudi-arabia",
    "snippet": "View current heads of government and senior officials for The Kingdom of Saudi Arabia. Capital: Riyadh. Not a Commonwealth member. Australian mission: Riyadh. Updated government positions including ministers and key officials.",
    "published": null
  },
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "Salman is the third oldest living head of state, the oldest living monarch, and Saudi Arabia&#x27;s first head of state born after the unification of Saudi Arabia. He has a reported personal wealth of at least US$18 billion, which makes him the third wealthiest royal in the world. Salman is a son of King Abdulaziz and Hassa bint Ahmed Al Sudairi, making him one of the Sudairi Seven. He was the deputy governor of Riyadh and later the governor of Riyadh for 48 years from 1963 to 2011.",
    "published": "November 3, 2025"
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "In February 2017, Saudi Arabia appointed its first woman to head the Saudi Stock Exchange. Muhammad bin Nayef was arrested on 6 March 2020, along with his half-brother Nawwaf bin Nayef and King Salman&#x27;s brother Ahmed bin Abdulaziz. The three princes were charged with treason. The Saudi government claimed the princes were trying to overthrow Mohammed bin Salman.",
    "published": "11 hours ago"
  }
]