[
  {
    "title": "Where Real Madrid And A New Coach Go From Here | Managing Madrid",
    "url": "https://www.managingmadrid.com/2025/4/29/24420159/where-real-madrid-and-a-new-coach-go-from-here",
    "snippet": "The rest of the squad can be guided by a manager with fresh ideas. Carlo Ancelotti was exactly what Real Madrid needed when he came in, and remained the perfect coach for the job for three years — which is typically around the time where managers lose their influence.",
    "published": "April 29, 2025"
  },
  {
    "title": "OFFICIAL: Real Madrid announce Xabi Alonso as new head coach | beIN SPORTS",
    "url": "https://www.beinsports.com/en-us/soccer/la-liga/articles-video/official-real-madrid-announce-xabi-alonso-as-new-head-coach-2025-05-25",
    "snippet": "Real Madrid confirmed this Sunday that <strong>Xabi Alonso will take over as the new head coach of the first team, replacing Italian manager Carlo Ancelotti</strong>. The coach from Tolosa will sign a three-year deal running from June 1, 2025, through June 30, ...",
    "published": null
  },
  {
    "title": "Official Announcement: Xabi Alonso - Real Madrid",
    "url": "https://www.realmadrid.com/en-US/news/club/announcements/comunicado-oficial-xabi-alonso-25-05-2025",
    "snippet": "Real Madrid C. F. confirms that <strong>Xabi Alonso</strong> will be the Real Madrid coach for the next three seasons, from 1 June 2025, until 30 June 2028. <strong>Xabi Alonso</strong> is a Real Madrid legend and one of the greatest players in world football history.",
    "published": "May 25, 2025"
  },
  {
    "title": "8 Potential Replacements for Xabi Alonso as Real Madrid Head Coach",
    "url": "https://bleacherreport.com/articles/25323948-8-potential-replacements-xabi-alonso-real-madrid-head-coach",
    "snippet": "That will no doubt be appealing for Real Madrid. A manager known for building a team based on defensive strength might not be ideal for a squad that boasts serious attacking riches, but that solid base could be exactly what is needed to let the forward players shine. ... Xabi Alonso might have been considered the hottest young Spanish coach on the planet before his Real Madrid appointment, but Cesc Fabregas is not far behind.",
    "published": null
  },
  {
    "title": "List of Real Madrid CF managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Real_Madrid_CF_managers",
    "snippet": "The most successful coach with Real Madrid is Carlo Ancelotti, as won 15 titles with the team. Ancelotti, in two spells, won La Liga twice, Copa del Rey twice, UEFA Champions League three times, Spanish Super Cup twice, UEFA Super Cup three times, FIFA Club World Cup twice, and one FIFA Intercontinental Cup. The complete list of Real Madrid managers is shown in the following table: Information correct as of the match played 27 September 2025...",
    "published": "September 27, 2025"
  }
]