[
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "Al-Burhan held several positions throughout his career as he began as a soldier with the Border Guard Forces and later became commander of this force before becoming Deputy Chief of Staff of the Ground Forces Operations and then Chief of Staff of the Sudanese Army in <strong>February 2018</strong> before he ...",
    "published": "3 days ago"
  },
  {
    "title": "List of heads of government of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_government_of_Sudan",
    "snippet": "He was appointed by the Transitional Sovereignty Council on 31 May 2025. ... ^ <strong>Briefly interrupted following the 2021 coup d&#x27;état, when Abdel Fattah al-Burhan served as head of state and there was no prime minister</strong>.",
    "published": "October 23, 2025"
  },
  {
    "title": "Civil War in Sudan | Global Conflict Tracker",
    "url": "https://www.cfr.org/global-conflict-tracker/conflict/power-struggle-sudan",
    "snippet": "Hamdok was briefly reinstated as prime minister in November 2021 after agreeing to concede certain governing powers to Burhan and Hemedti. However, he ultimately resigned in January 2022, as Sudanese protestors were dissatisfied with the terms of his reinstatement and the violent actions of security forces, who had repeatedly beaten and killed protestors. Since Hamdok’s resignation, Sudan has had no effective civilian leadership, with Burhan operating as de facto head of state.",
    "published": null
  },
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Abboud was succeeded by a senior civil servant, Sirr Al-Khatim Al-Khalifa, who served as acting president for 18 days before transferring executive authority to a Committee of Sovereignty. Ismail al-Azhari, the leader of the National Unionist Party, was made president in July 1965; he ruled with limited power until he was deposed in a 1969 military coup. The military officers responsible for the coup established the National Revolutionary Command Council, chaired by Jaafar Nimeiry. Nimeiry, the leader of the newly formed Sudanese Socialist Union, assumed the position of president in 1971, and subsequently established a one-party state, which existed until 1985, when a group of military officers overthrew his government and established the 1985 Transitional Military Council, led by Field Marshal Abdel Rahman Swar al-Dahab.",
    "published": "1 week ago"
  },
  {
    "title": "Sudan timeline: Developments since October military takeover - Region - World - Ahram Online",
    "url": "https://english.ahram.org.eg/NewsContent/2/8/442021/World/Region/Sudan-timeline-Developments-since-October-military.aspx",
    "snippet": "On November 1, the UN envoy to Sudan speaks of &quot;mediation&quot; efforts. International pressure builds, and four civilian ministers are released on November 4. Civil society groups mobilise a nationwide protest campaign on November 7. They are met with tear gas, and there are more arrests of activists. On November 9, Burhan -- the de facto ruler since Bashir was ousted in 2019, heading a Sovereign Council of military and civilian figures -- forms a new ruling council.",
    "published": null
  }
]