[
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "In January 2020, Zelenskyy took a trip to Oman that was not published on his official schedule, appearing to combine a personal holiday with government business. His office said Zelenskyy paid for the entire trip himself. Nevertheless, he was criticized for a lack of transparency and critics pointed out he had once criticized his predecessor Poroshenko for taking an undisclosed vacation in the Maldives.",
    "published": "4 days ago"
  },
  {
    "title": "Volodymyr Zelensky’s biography — Official web site of the ...",
    "url": "https://www.president.gov.ua/en/president",
    "snippet": "Volodymyr Zelensky’s biography on Official web site of the President of Ukraine",
    "published": "1 day ago"
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "<strong>Donald Trump</strong> · The COVID-19 pandemic and the Russian invasion of Ukraine References &amp; Edit History Quick Facts &amp; Related Topics ... Volodymyr Zelensky Ukrainian president Volodymyr Zelensky speaking during a press conference, March 15, 2025.",
    "published": "September 27, 2019"
  },
  {
    "title": "Oleksandr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Oleksandr_Zelenskyy",
    "snippet": "<strong>Oleksandr Semenovych Zelenskyy</strong> was born in Kryvyi Rih, Soviet Ukraine, on 23 December 1947. He is of Jewish origin. He is married to Rymma Zelenska (born 16 September 1950). He is the father of Ukrainian President Volodymyr Zelenskyy (born 1978).",
    "published": "October 29, 2025"
  },
  {
    "title": "Who is Volodymyr Zelensky - News, Facts, Life, Education, Family, Political Career",
    "url": "https://www.business-standard.com/about/who-is-volodymyr-zelensky",
    "snippet": "Expressing cautious optimism, Zelenskyy acknowledged New Delhi&#x27;s position on energy-related complexities, an issue which has been consistently raised by the US President Donald Trump ... Trump said the war in Ukraine was making Russia look bad because it was supposed to be a quick little skirmish ... Trump&#x27;s remark comes a day after he pledged security guarantees to Ukraine at the White House during a meeting with Ukrainian counterpart Volodymyr Zelenskyy and seven European leaders",
    "published": "1 week ago"
  }
]