[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Two subsidiaries of the IAU were also created at this assembly: the International Time Commission seated at the International Time Bureau in Paris, France, and the International Central Bureau of Astronomical Telegrams initially seated in Copenhagen, Denmark. The seven initial member states were Belgium, Canada, France, Great Britain, Greece, Japan, and the United States, soon to be followed by Italy and Mexico. The first executive committee consisted of Benjamin Baillaud (President, France), Alfred Fowler (General Secretary, UK), and four vice presidents: William Campbell (US), Frank Dyson (UK), Georges Lecointe (Belgium), and Annibale Riccò (Italy).",
    "published": "5 days ago"
  },
  {
    "title": "Category:Presidents of the International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Category:Presidents_of_the_International_Astronomical_Union",
    "snippet": "Category:Presidents of the International Astronomical Union ·",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://www.iau.org/administration/executive_bodies/past_committees/executive_committee/",
    "snippet": "Debra Meloy Elmegreen · Piero Benvenuti (Interim General Secretary) <strong>José Miguel Rodriguez Espinosa</strong>",
    "published": null
  },
  {
    "title": "International Astronomical Union – GKToday",
    "url": "https://www.gktoday.in/international-astronomical-union/",
    "snippet": "Later Presidents have included <strong>Jan Oort, Victor Ambartsumian, Otto Heckmann, Adriaan Blaauw, Vainu Bappu, Robert Hanbury Brown, Catherine Cesarsky, Norio Kaifu, and Silvia Torres</strong>, reflecting the Union’s global and disciplinary diversity. The International Astronomical Union remains central ...",
    "published": null
  },
  {
    "title": "Executive Committee",
    "url": "https://www.iau.org/Iau/Iau/About/Governance-Overview/Executive-Committee.aspx",
    "snippet": "The Executive Committee consists of the President of the Union, the President-Elect, six Vice-Presidents , the General Secretary, and the Assistant General Secretary elected by the General Assembly on the proposal of the Special Nominating Committee (SNC) . The Executive Committee is seconded by two Advisors, namely the past ...",
    "published": null
  }
]