[
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "On Meet the Press, Zelenskyy confirmed that he was interested in joining the summit meeting, emphasizing the importance of Ukraine as being part the dialogue in order &quot;to have just and lasting peace.&quot; Trump later cancelled the summit. In October 2025, Zelenskyy welcomed US sanctions against Russia&#x27;s largest oil companies Rosneft and Lukoil. In a mid-June interview with BIHUS info, a representative of the president of Ukraine at the Cabinet of Ministers, Andriy Herus stated that Zelenskyy had never promised to lower communal tariffs, but that a campaign video in which Zelenskyy stated that the price of natural gas in Ukraine could fall by 20–30 percent or maybe more was not a direct promise but actually &quot;half-hinting&quot; and &quot;joking&quot;.",
    "published": "1 day ago"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "In his address marking Ukrainian Armed Forces Day, President of Ukraine <strong>Volodymyr Zelenskyy</strong> spoke about Ukrainian warriors honored through murals in Ukraine and around the world. ... The parties covered multiple aspects and went through key ...",
    "published": "1 week ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... nation&#x27;s head of government. The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "Volodymyr Zelensky’s biography — Official web site of the ...",
    "url": "https://www.president.gov.ua/en/president",
    "snippet": "15 December 2025 - 21:08 Go to all news · pgPhoto gallery · Working Visit of the President of Ukraine to Germany · 14 December 2025 - 17:45 Go to all galleries · Home · President · <strong>Volodymyr Zelenskyy</strong> was elected President of Ukraine on ...",
    "published": "13 hours ago"
  },
  {
    "title": "Next Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Ukrainian_presidential_election",
    "snippet": "On 6 March 2025 opposition politicians Petro Poroshenko and Yulia Tymoshenko, after having confirmed that they had held discussions with United States representatives, confirmed that they still opposed elections held during wartime. The president of Ukraine is elected for a five-year term using the two-round system; if no candidate receives an absolute majority in the first round, a second round is expected to take place three weeks after the first.",
    "published": "6 days ago"
  }
]