[
  {
    "title": "European Bank for Reconstruction and Development - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Bank_for_Reconstruction_and_Development",
    "snippet": "More generally, <strong>Suma Chakrabarti</strong>, the EBRD president from 2012 to 2020, has pushed in the beginning of the 2010s for modernizing the bank. Reforms encompassed the bank&#x27;s structure in itself, for instance by changing the management team, and its processes (for instance about policy dialogue ...",
    "published": "1 week ago"
  },
  {
    "title": "Who we are",
    "url": "https://www.ebrd.com/home/who-we-are.html",
    "snippet": "Each shareholder is represented on the Board of Governors, which has overall authority over the Bank. Our President is <strong>Odile Renaud-Basso</strong> (left). The President manages our work under the guidance of the Board of Directors.",
    "published": null
  },
  {
    "title": "EBRD governance and leadership",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership.html",
    "snippet": "... <strong>The Board of Directors is responsible for our country, sector and thematic strategies, policies and operations. The Executive Committee oversees all key aspects of the strategy, performance and financial soundness of the Bank. Our senior leadership group covers every aspect of the EBRD&#x27;s business and advises the Executive Committee and President</strong>...",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development - EBRD | Ministry of Finance of the Slovak Republic",
    "url": "https://www.mfsr.sk/en/european-international-affairs/international-financial-institutions/european-bank-reconstruction-development-ebrd/",
    "snippet": "<strong>Each shareholder is represented on the Board of Governors</strong>, which has overall authority over the EBRD. Under the guidance of the Board of Directors, the President manages the EBRD&#x27;s work.",
    "published": null
  },
  {
    "title": "European Bank for Reconstruction and Development (EBRD)",
    "url": "https://www.ebrd.com/",
    "snippet": "Join us on Tuesday 25 November 2025 at 16.00 (London time) for the launch of the Transition Report 2025-26 in the Auditorium at Five Bank Street, London E14 4BG. ... How we operate, and the services we offer to clients. ... A wide range of business sectors and industries. Information on the full range of what we offer. ... Environmentally sound and sustainable development is central to the EBRD’s mandate.",
    "published": null
  }
]