[
  {
    "title": "Chelsea FC can confirm that the Club and Mauricio Pochettino have mutually agreed to part ways.",
    "url": "https://www.chelseafc.com/en/news/article/club-statement-mauricio-pochettino",
    "snippet": "<strong>Chelsea FC can confirm that the Club and Mauricio Pochettino have mutually agreed to part ways</strong>.",
    "published": null
  },
  {
    "title": "Why Pochettino left Chelsea, and what it reveals about the club - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/40193855/why-chelsea-mauricio-pochettino-split-reveals-club",
    "snippet": "But the fact they are now looking ... environment they have created. Mauricio Pochettino leaves Chelsea <strong>after just one season in charge at Stamford Bridge</strong>....",
    "published": "May 22, 2024"
  },
  {
    "title": "Mauricio Pochettino leaves Chelsea by mutual consent after just one season in charge | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11668/13064363/mauricio-pochettino-leaves-chelsea-by-mutual-consent-after-just-one-season-in-charge",
    "snippet": "<strong>Mauricio Pochettino has left Chelsea by mutual consent after just one season in charge</strong>. Pochettino led a youthful Blues side to the Carabao Cup final and FA Cup semi-finals, and despite a season largely of struggles, ended the Premier League ...",
    "published": "May 22, 2024"
  },
  {
    "title": "Pochettino leaves Chelsea by mutual consent",
    "url": "https://www.premierleague.com/en/news/4025501",
    "snippet": "<strong>Chelsea have announced that head coach Mauricio Pochettino has left by mutual consent</strong>. In a statement the club said: &quot;Chelsea FC can confirm that the Club and Mauricio Pochettino have mutually agreed to part ways.&quot;",
    "published": null
  },
  {
    "title": "Mauricio Pochettino leaves Chelsea by mutual consent - The Athletic",
    "url": "https://www.nytimes.com/athletic/5495869/2024/05/21/mauricio-pochettino-leaves-chelsea/",
    "snippet": "<strong>Mauricio Pochettino has left his position as Chelsea head coach by mutual consent after less than 11 months in charge</strong>. Chelsea’s decision to part ways with the 52-year-old Argentine comes following the conclusion of an internal review into ...",
    "published": "May 22, 2024"
  }
]