[
  {
    "title": "Chrysler World Headquarters and Technology Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chrysler_World_Headquarters_and_Technology_Center",
    "snippet": "Completed between 1993 and 1996 ... Fiat Chrysler Automobiles (FCA) and now Stellantis North America. Before moving to the <strong>Auburn Hills</strong> headquarters, Chrysler was based at the Highland Park Chrysler Plant campus, which predated the formation of the company itself. It was located along I-75, ...",
    "published": "1 week ago"
  },
  {
    "title": "Where is Fiat Chrysler Automobiles Located? HQ, Global Offices & Company Insights",
    "url": "https://www.highperformr.ai/company/fca-group",
    "snippet": "Fiat Chrysler Automobiles established in 2014 and headquartered in <strong>Auburn Hills</strong>., Learn more about Fiat Chrysler Automobiles offices, leadership team, mission, and growth journey.",
    "published": null
  },
  {
    "title": "Chrysler Headquarters and Technology Center | The Center for Land Use Interpretation",
    "url": "https://clui.org/ludb/site/chrysler-headquarters-and-technology-center",
    "snippet": "The Chrysler Headquarters and Technology Center, in <strong>Auburn Hills, Michigan, north of Detroit</strong>, has 5,300,000 square feet, and a contiguous office complex with a central building that is half a mile long. Chrysler, (now Fiat Chrysler), sells around 2.2 million cars per year and has five assembly ...",
    "published": null
  },
  {
    "title": "Contact",
    "url": "https://fcabrandprotection.com/contacts.htm",
    "snippet": "Fiat Chrysler Automobiles · 1000 Chrysler Drive · <strong>Auburn Hills, MI 48326-2766</strong> · brand_protect@fcagroup.com · (800) 543-1391 ·",
    "published": null
  },
  {
    "title": "Fiat Chrysler Automobiles - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_Chrysler_Automobiles",
    "snippet": "Fiat Chrysler Automobiles N.V., commonly known by the acronym FCA, was an Italian-American multinational corporation primarily known as a manufacturer of automobiles, commercial vehicles, auto parts and production systems. The corporation was established by January 2012, when Fiat Group acquired a 58.5% stake of the Chrysler Group (which from 1998 to 2007 was part of DaimlerChrysler) and thus became, at that time, the 7th largest automaker (behind Toyota, General Motors, Volkswagen, Hyundai, Ford and Nissan). Its corporate headquarters were domiciled in Amsterdam and its financial headquarters were in London.",
    "published": "2 weeks ago"
  }
]