[
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "<strong>Mike Downey</strong>, an Irish-British film producer, was elected chairman in 2020. In 2021, Polish filmmaker Agnieszka Holland became the first woman to serve as president of the Academy. That same year, the Academy discontinued use of the abbreviation &quot;EFA&quot; and began referring to itself either by ...",
    "published": "September 3, 2025"
  },
  {
    "title": "Story - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/story/",
    "snippet": "<strong>Wim Wenders (1996-2020) Agnieszka Holland (2020-2024) and Juliette Binoche (2024- ) followed in Bergman’s footsteps as Presidents of the Academy. The current chair of the Board is Mike Downey</strong>.",
    "published": "June 13, 2025"
  },
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Its leadership has included <strong>Wim Wenders, Agnieszka Holland, and, since 2024, Juliette Binoche</strong>. ... Producer Ada Solomon has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian ...",
    "published": "2 weeks ago"
  },
  {
    "title": "The new Academy Board members - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/new-academy-board-members/",
    "snippet": "The President of the European Film ... members. <strong>Ingmar Bergman was the first President since the founding years of the European Film Academy (1989-1996), followed by Wim Wenders (2006-2020) and Agnieszka Holland (2021-2024).</strong>...",
    "published": "January 30, 2025"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "Includes new chair <strong>Ada Solomon</strong> and deputy chairs to be Leontine Petit and Matthieu Darras · The European Film Academy membership has concluded its voting procedures for the 2026 intake, and as well as re-electing 10 members the election results ...",
    "published": "2 weeks ago"
  }
]