[
  {
    "title": "2025 German federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_German_federal_election",
    "snippet": "Following a government crisis, <strong>Olaf Scholz</strong> dismissed FDP leader Christian Lindner from the incumbent government on 6 November 2024, triggering the collapse of the traffic light coalition and leaving the government without a majority. On the same day, Chancellor Scholz announced he would submit ...",
    "published": "4 days ago"
  },
  {
    "title": "German election 2025 – DW",
    "url": "https://www.dw.com/en/german-election-2025/t-70794502",
    "snippet": "<strong>Friedrich Merz</strong>&#x27;s center-right CDU, together with its CSU sister party, won Germany&#x27;s 2025 parliamentary election. The far-right populist Alternative for Germany saw massive support across the east, coming in second. ... Young Russians who found refuge in Germany have become engaged in local ...",
    "published": null
  },
  {
    "title": "No honeymoon for Merz as the new German government already faces domestic constraints | Chatham House – International Affairs Think Tank",
    "url": "https://www.chathamhouse.org/2025/05/no-honeymoon-merz-new-german-government-already-faces-domestic-constraints",
    "snippet": "Although <strong>Friedrich Merz</strong> has big ambitions for Germany’s international role, significant domestic pressures remain and will constrain his government’s room for manoeuvre. ... Image — New Chancellor <strong>Friedrich Merz</strong> of the German Christian ...",
    "published": "June 6, 2025"
  },
  {
    "title": "Website of the Federal Government | Bundesregierung",
    "url": "https://www.bundesregierung.de/breg-en",
    "snippet": "<strong>Bundeskanzler Friedrich Merz</strong>/Federal Chancellor of Germany @Bundeskanzler ... Federal Chancellor Friedrich Merz met with the heads of the Federal State governments to discuss current topics of significance.",
    "published": null
  },
  {
    "title": "PM meeting with President Steinmeier of Germany: 3 December 2025 - GOV.UK",
    "url": "https://www.gov.uk/government/news/pm-meeting-with-president-steinmeier-of-germany-3-december-2025",
    "snippet": "The Prime Minister hosted President Steinmeier of Germany for a bilateral in Downing Street this afternoon.",
    "published": "2 weeks ago"
  }
]