[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Alfa Romeo Automobiles S.p.A. (Italian: [ˈalfa roˈmɛːo]) is an Italian car manufacturer known for its sports-oriented vehicles, strong auto racing heritage, and iconic design. Headquartered in <strong>Turin, Italy</strong>, it is a subsidiary of Stellantis Europe and one of 14 brands of multinational automotive ...",
    "published": "5 days ago"
  },
  {
    "title": "Alfa Romeo opens its new headquarters | Alfa Romeo | Stellantis Media",
    "url": "https://www.media.stellantis.com/em-en/alfa-romeo/press/alfa-romeo-opens-its-new-headquarters",
    "snippet": "Such an environment was identified as the <strong>Centro Stile on Via Plava</strong>, a redeveloped part of the Mirafiori plant on the premises of the historic Officine 83 workshops. An iconic location, it is strongly bound to tradition: after all, over 110 ...",
    "published": "April 21, 2021"
  },
  {
    "title": "Alfa Romeo Opens New Headquarters At Historic Design Center | Southern Alfa Romeo of Norfolk Alfa Romeo Opens New Headquarters At Historic Design Center",
    "url": "https://www.alfaromeousaofnorfolk.com/alfa-romeo-opens-new-headquarters-at-historic-design-center/",
    "snippet": "Alfa Romeo is opening a brand-new headquarters that will be located at the historic and iconic design center <strong>Centro Stile, in Turin, Italy</strong>. The new headquarters will welcome employees to a new shared workspace to better facilitate teamwork, ...",
    "published": "July 20, 2021"
  },
  {
    "title": "Alfa Romeo: Headquarters, Global Offices & ...",
    "url": "https://www.highperformr.ai/company/alfa-romeo",
    "snippet": "Alfa Romeo established in 2005 and headquartered in Turin., Learn more about Alfa Romeo offices, leadership team, mission, and growth journey.",
    "published": null
  },
  {
    "title": "Alfa Romeo SpA | luxury cars, performance vehicles, Italian design | Britannica Money",
    "url": "https://www.britannica.com/money/Alfa-Romeo-SpA",
    "snippet": "The company was operated by the Italian government through its state holding company, IRI (Istituto per la Ricostruzione Industriale), until 1986, when it was sold to Fiat SpA. <strong>Headquarters are in Milan</strong>.",
    "published": null
  }
]