[
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "Zaza Pachulia (Georgian: ზაზა ფაჩულია; Georgian pronunciation: [zaza patʃʰulia] born Zaur Pachulia; 10 February 1984) is a Georgian professional basketball executive and former player who is a <strong>basketball operations consultant</strong> for the Golden State Warriors of the National ...",
    "published": "November 6, 2025"
  },
  {
    "title": "Zaza Pachulia - Golden State Warriors | LinkedIn",
    "url": "https://www.linkedin.com/in/zazapachulia/",
    "snippet": "“Zaza is a <strong>smart and strategically focused in every thing he does</strong>. He has an understanding that one must look beyond the obvious and see how decisions are going to effect not only short term but in the long term.",
    "published": "1 week ago"
  },
  {
    "title": "Zaza Pachulia on what lured him to join Golden State Warriors - Basketball Network",
    "url": "https://www.basketballnetwork.net/latest-news/zaza-pachulia-on-what-lured-him-to-join-the-golden-state-warriors",
    "snippet": "So, my message changed after that. Actually, it’s fair. We have a good team…There’s only one spot in the whole world for the <strong>starting center</strong>, and I was considered as that player,” Pachulia added.",
    "published": "April 17, 2025"
  },
  {
    "title": "Zaza Pachulia — Bay Area Host Committee",
    "url": "https://bayareahostcommittee.com/advisory-board1/zaza-pachulia",
    "snippet": "One of the highlights of Pachulia&#x27;s career came during his tenure with the Golden State Warriors, where he <strong>played a crucial role in the team&#x27;s success during their championship runs in 2017 and 2018</strong>.",
    "published": null
  },
  {
    "title": "Zaza Pachulia facts for kids",
    "url": "https://kids.kiddle.co/Zaza_Pachulia",
    "snippet": "Zaza Pachulia (born Zaur Pachulia on February 10, 1984) is a famous Georgian basketball player. He is now a <strong>consultant</strong> for the Golden State Warriors in the National Basketball Association (NBA).",
    "published": null
  }
]