[
  {
    "title": "President of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_France",
    "snippet": "The president of France, officially ... or president of the Republic (Président de la République), is <strong>the executive head of state of France, and the commander-in-chief of the French Armed Forces</strong>....",
    "published": "2 weeks ago"
  },
  {
    "title": "The Role of the President | Élysée",
    "url": "https://www.elysee.fr/en/french-presidency/the-role-of-the-president",
    "snippet": "The President of the Republic has presidential powers and shared powers. The latter require a ministerial countersignature. ... Holding of a referendum (&gt;&gt;Art.11) at the proposal of the Government, or on a joint motion of the two houses. The right to dissolve the National Assembly (&gt;&gt;Art.12) The emergency powers described in Article 16 (&gt;&gt;Art.16)",
    "published": null
  },
  {
    "title": "Explainer: what is the role of a French president?",
    "url": "https://www.connexionfrance.com/news/explainer-what-is-the-role-of-a-french-president/228491",
    "snippet": "In theory, they share power with their prime minister, who is head of the government, but in practice a president with a parliamentary majority carries greater executive control. The president also presides over Conseil des ministres cabinet meetings, which take place each week in order to discuss parliamentary bills and decrees. ... France’s president is charged with guaranteeing the nation’s independence, territorial integrity and the observance of treaties, and is therefore responsible for the direction of the Armed Forces.",
    "published": "October 23, 2023"
  },
  {
    "title": "Explainer: What does a French president do?",
    "url": "https://www.france24.com/en/europe/20220211-explainer-what-does-a-french-president-do",
    "snippet": "Although the French Constitution, the founding text of the Fifth Republic adopted in 1958, assigns defence and diplomacy to the prime minister and the president as shared responsibilities, both areas have in practice become the preserve of France&#x27;s head of state.",
    "published": "February 11, 2022"
  },
  {
    "title": "Emmanuel Macron - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emmanuel_Macron",
    "snippet": "<strong>Emmanuel Jean-Michel Frédéric Macron</strong> (born 21 December 1977) is a French politician who has served as President of France and Co-Prince of Andorra since 2017. He served as Minister of Economics and Finance under President François Hollande ...",
    "published": "2 weeks ago"
  }
]