[
  {
    "title": "Share capital and shareholder structure - BVB Dortmund Annual Report 2022/2023",
    "url": "https://report.bvb.de/annual-report/2022-2023/shareholders/the-shares/share-capital-and-shareholder-structure.html",
    "snippet": "Borussia Dortmund GmbH &amp; Co. KGaA’s share capital amounts to EUR 110,396,220 divided into the same number of no-par value shares. The shareholder structure of Borussia Dortmund GmbH &amp; Co.",
    "published": null
  },
  {
    "title": "Borussia Dortmund - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Borussia_Dortmund",
    "snippet": "The organisation Borussia Dortmund GmbH is the partner with unlimited liability and is responsible for the management and representation of Borussia Dortmund GmbH &amp; Co. KGaA. Borussia Dortmund GmbH is <strong>fully owned by the sports club, Borussia Dortmund e.V.</strong> This organizational structure was designed ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Ownership of Borussia Dortmund | Download Scientific Diagram",
    "url": "https://www.researchgate.net/figure/Ownership-of-Borussia-Dortmund_fig5_344375289",
    "snippet": "Ownership Landscape: an RBV perspective of football leagues’ configurations diversity ... ... Members&#x27; associations, also known as supporter-owned or community-owned clubs, are primarily found in Germany (e.g., FC Bayern Munich and BV Borussia Dortmund) and, to some extent, in Spain (e.g., Real Madrid CF and FC Barcelona)",
    "published": null
  },
  {
    "title": "Should Borussia Dortmund take on an equity partner?",
    "url": "https://www.aabri.com/manuscripts/162401.pdf",
    "snippet": "give up some of their ownership shares to the corporate partner, as well as, allow the firm to sit · on the club’s advisory board. With this in mind it was very important to have the right partner. Evonik had been a corporate sponsor of Borussia Dortmund since the 2007/2008 season and",
    "published": null
  },
  {
    "title": "Borussia Dortmund GmbH : Shareholders Board Members Managers and Company Profile | DE0005493092 | MarketScreener",
    "url": "https://www.marketscreener.com/quote/stock/BORUSSIA-DORTMUND-GMBH-435951/company/",
    "snippet": "Borussia Dortmund GmbH &amp; Co KGaA is a Germany-based company engaged in the operation of Ballspielverein Borussia (BVB), a professional football club based in Dortmund, Germany. The Company has around 8 functional areas such as sports, communications, human resources, organization, finance, legal and IR, marketing and digitalization, commercial partnerships.",
    "published": null
  }
]