[
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "He was subsequently impeached and ... office is vacant. <strong>Early presidential elections were held on 25 May 2014 and won by Petro Poroshenko; Poroshenko was inaugurated as the fifth president on 7 June 2014.</strong>...",
    "published": "6 days ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "<strong>Viktor Yushchenko, Petro Poroshenko, and Viktor Yanukovych served one term, with the latter being replaced by acting president Oleksandr Turchynov</strong>, who then also served as Chairman of the Ukrainian Parliament, on 21 February 2014. Oleksandr Turchynov was the only acting president in Ukraine&#x27;s ...",
    "published": "November 10, 2025"
  },
  {
    "title": "Volodymyr Zelensky | Biography, Facts, Presidency, & Russian Invasion of Ukraine | Britannica",
    "url": "https://www.britannica.com/biography/Volodymyr-Zelensky",
    "snippet": "<strong>Volodymyr Zelensky (born January 25, 1978, Kryvyy Rih, Ukraine, U.S.S.R. [now in Ukraine]) is a Ukrainian actor and comedian who was elected president of Ukraine in 2019. Although he was a political novice, Zelensky’s anti-corruption platform won him widespread support, and his significant online following translated into a solid electoral base. He won a landslide victory over incumbent Petro Poroshenko in the second round of the 2019 presidential election</strong>...",
    "published": "September 27, 2019"
  },
  {
    "title": "List of Presidents of Ukraine (1991 - 2022)",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-presidents-of-ukraine-1646021751-1",
    "snippet": "- Ukrainian actor and comedian <strong>Volodymyr Zelensky</strong> was born on 25 January 1978 in Kryvyy Rih, Ukraine, U.S.S.R. (now in Ukraine). - He was elected as the President of Ukraine in 2019.",
    "published": "February 28, 2022"
  },
  {
    "title": "Elections, Succession, and Legitimacy in Ukraine: Lessons from ...",
    "url": "https://online.ucpress.edu/cpcs/article/57/4/6/197501/Elections-Succession-and-Legitimacy-in",
    "snippet": "Of Ukraine’s <strong>six presidential transitions, only those in 2010 and 2019 proceeded entirely as envisioned in the constitution</strong>. In several cases, elections and transitions resulted from ad hoc arrangements made to address political crises.",
    "published": "December 1, 2024"
  }
]