[
  {
    "title": "\"Money-wise, that was the worst offer I had\" - Zaza Pachulia on what lured him to join the Warriors",
    "url": "https://www.basketballnetwork.net/latest-news/zaza-pachulia-on-what-lured-him-to-join-the-golden-state-warriors",
    "snippet": "Apr 17, 2025 10:23 AM EDT · Add us on Google Start the Conversation · The Golden State Warriors of 2010 are set in stone due to the greatness and assembly of incredible stars like Kevin Durant, Stephen Curry, Klay Thompson, and Draymond Green. However, the Dubs’ mantra was always “Strength in Numbers,” referring to the small but important roles of the rest of the guys. Sure, Andre Iguodala is the first name that pops up, but center Zaza Pachulia actually played a great role in the 2017 and 2018 back-to-back championships.",
    "published": "April 17, 2025"
  },
  {
    "title": "Georgian basketball legend Zaza Pachulia appointed as UN Tourism Special Ambassador | AGENDA.GE",
    "url": "http://agenda.ge/en/news/2025/42737",
    "snippet": "The United Nations World Tourism Organisation appointed the Georgian basketball player Zaza Pachulia as a <strong>Special Ambassador for Sports Tourism</strong>, along with American basketball legend Stephen Curry, the organisation said on Wednesday.",
    "published": null
  },
  {
    "title": "Zaza Pachulia NBA Stats & News",
    "url": "https://www.rotowire.com/basketball/player/zaza-pachulia-2391",
    "snippet": "After Pachulia’s decision to sacrifice personal production for the team&#x27;s greater good netted him his first championship ring, he elected to re-sign with Golden State in the offseason while receiving only a slight raise, locking him back into a starting role for 2017-18.",
    "published": null
  },
  {
    "title": "Zaza Pachulia reveals how losing over $100K on restaurant business made him a better investor - Basketball Network",
    "url": "https://www.basketballnetwork.net/off-the-court/zaza-pachulia-reveals-how-losing-over-100k-on-restaurant-business-made-him-a-better-investor",
    "snippet": "Pachulia reflects on the lessons learned from his failed restaurant ventures during his playing career.Nov 14, 2025 9:25 AM EST · By Peter SunjicEditor and Writer at Basketball Network ... Jan 19, 2019; Detroit, MI, USA; Detroit Pistons center Zaza Pachulia (27) reacts to a call during the ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "Zaza Pachulia (Georgian: ზაზა ფაჩულია; Georgian pronunciation: [zaza patʃʰulia] born Zaur Pachulia; 10 February 1984) is a Georgian professional basketball executive and former player who is a basketball operations consultant for the Golden State Warriors of the National Basketball Association (NBA).",
    "published": "November 6, 2025"
  }
]