[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the <strong>chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Larive serves as <strong>chair of the Alliance of Hispanic Serving Research Universities (HSRU),</strong> which is dedicated to increasing the number of doctoral degree holders, contributing to the higher education professoriate, and enhancing the nation’s research, scientific, and technical workforce.",
    "published": null
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "UC Santa Cruz Chancellor Cynthia Larive is set to undergo an overdue five-year performance review, part of a standard UC systemwide process led by President James Milliken and faculty leaders. The review comes amid mounting faculty concerns over budget cuts, low morale and leadership communication, following a tumultuous tenure marked by the pandemic, political challenges and campus unrest.",
    "published": "August 22, 2025"
  },
  {
    "title": "r/UCSC on Reddit: the chancellor is receiving a 28.5% pay increase.",
    "url": "https://www.reddit.com/r/UCSC/comments/1fw5ojy/the_chancellor_is_receiving_a_285_pay_increase/",
    "snippet": "Article states &quot;<strong>UC Santa Cruz Chancellor Cynthia Larive will voluntarily forgo her base salary increase for 2024-25</strong>.&quot; You should know that this is in reference to the 4% across-the-board increase that all staff got, not the upcoming 28.5% increase.",
    "published": "October 4, 2024"
  },
  {
    "title": "Provost Cynthia K. Larive | Inside UCR",
    "url": "https://insideucr.ucr.edu/tag/provost-cynthia-k-larive",
    "snippet": "Larive has been <strong>appointed as UC Santa Cruz chancellor effective July 1.</strong> At the reception, Larive was honored for her history with UC Riverside that began as a... ... UC Riverside Provost and Executive Vice Chancellor Cynthia K.",
    "published": null
  }
]