[
  {
    "title": "Barry Andrews (politician) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Barry_Andrews_(politician)",
    "snippet": "<strong>Barry Andrews</strong> (born 16 May 1967) is an Irish politician who serves as a Member of the European Parliament (MEP) for the Dublin constituency. He is a member of Fianna Fáil, part of Renew Europe. He previously served as Minister of State for Children from 2008 to 2011.",
    "published": "September 29, 2025"
  },
  {
    "title": "Minister: Barry Andrews",
    "url": "https://isad.ie/item.php?t=m&id=16",
    "snippet": "He was a <strong>Teachta Dála (TD) for the Dún Laoghaire constituency from 2002 to 2011.The Andrews family have a long connection with Fianna Fáil. Before entering political life, Andrews was a secondary school teacher</strong>.",
    "published": null
  },
  {
    "title": "Birth of Barry Andrews, Fianna Fáil Politician | seamus dubhghaill",
    "url": "https://seamusdubhghaill.com/2024/05/16/birth-of-barry-andrews-fianna-fail-politician/",
    "snippet": "Barry Andrews, Fianna Fáil politician who serves as a Member of the European Parliament (MEP) for the Dublin constituency, is born in Dublin on May 16, 1967. He previously serves as Minister of State for Children from 2008 to 2011. He is a Teachta Dála (TD) for the Dún Laoghaire constituency from 2002 to 2011.…",
    "published": "September 3, 2025"
  },
  {
    "title": "Barry Andrews - Age, Family, Bio | Famous Birthdays",
    "url": "https://www.famousbirthdays.com/people/barry-andrews.html",
    "snippet": "Between 2008 and 2011, he served as the Minister of State for Children for the Irish government. He was born in Dublin, Ireland. His grandfather, <strong>Todd Andrews</strong>, was a founding member of the Fianna Fáil political party.",
    "published": null
  },
  {
    "title": "Barry Andrews (politician)",
    "url": "https://grokipedia.com/page/Barry_Andrews_(politician)",
    "snippet": "Barry Andrews (born 16 May 1967) ... previously held the position of Minister of State for Children and Youth Affairs from <strong>2008 to 2011</strong> and was a Teachta Dála (TD) for Dún Laoghaire in Dáil Éireann from 2002 to 2011.[1][3] ...",
    "published": null
  }
]