[
  {
    "title": "EQT AB - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_AB",
    "snippet": "EQT AB is a Swedish global investment organization <strong>founded in 1994</strong>. Its funds invest in private equity (EQT Private Capital Europe &amp; North America), infrastructure (EQT Infrastructure), real estate (EQT Real Estate), growth equity, and venture capital in Europe, North America, and Asia Pacific.",
    "published": "3 weeks ago"
  },
  {
    "title": "Eqtgroup",
    "url": "https://eqtgroup.com/about/history",
    "snippet": "Over the course of Sweden’s modern ... family’s philosophy of responsible ownership, <strong>Conni Jonsson received a mandate from the board of Investor AB to establish EQT in 1994 with the backing from Investor AB, AEA Investors and SEB</strong>....",
    "published": null
  },
  {
    "title": "EQT - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT",
    "snippet": "EQT AB, a Swedish global private equity group, including infrastructure and real estate · EQT Ventures, the venture capital arm of EQT · EQT Corporation, an American petroleum and natural gas company · EQT Plaza, a skyscraper in Pittsburgh · Mercedes-Benz EQT, an electric van ·",
    "published": "March 25, 2025"
  },
  {
    "title": "EQT Corporation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_Corporation",
    "snippet": "<strong>In February 2009, the company changed its name to EQT Corporation</strong>. EQT opened one of the first compressed natural gas (CNG) fueling stations in the Strip District of Pittsburgh in 2011. That same year, David L.",
    "published": "July 14, 2025"
  },
  {
    "title": "EQT Corporation (EQT) Stock Price, News, Quote & History - Yahoo Finance",
    "url": "https://finance.yahoo.com/quote/EQT/",
    "snippet": "The company was formerly known as Equitable Resources Inc. and changed its name to EQT Corporation in February 2009. EQT Corporation was <strong>founded in 1888</strong> and is headquartered in Pittsburgh, Pennsylvania.",
    "published": null
  }
]