[
  {
    "title": "New Regency Forms Partnership With Shamrock Capital | Media | Shamrock Capital",
    "url": "https://shamrockcap.com/media/new-regency-forms-partnership-with-shamrock-capital/",
    "snippet": "As part of this partnership, Shamrock’s Content Strategy acquired a participation in the New Regency film and television library cash flows. This industry groundbreaking transaction establishes a dedicated and forward-looking capital structure around the company’s celebrated film and television library, carefully curated over 35 years.",
    "published": null
  },
  {
    "title": "New Regency Partners With Shamrock Capital, Investment Firm Acquires Participation In Studio’s Film & TV Library",
    "url": "https://deadline.com/2025/06/new-regency-shamrock-capital-1236436582/",
    "snippet": "<strong>Multi Oscar winning producer New Regency has entered into a partnership with Los Angeles investment firm Shamrock Capital</strong>, whose Shamrock Content Strategy is taking a participation in the studio’s 35-year-old plus film and television library.",
    "published": "June 18, 2025"
  },
  {
    "title": "Sidley Represents Shamrock Capital Investment Firm in Acquiring Participation in New Regency’s Content Library | News | Sidley Austin LLP",
    "url": "https://www.sidley.com/en/newslanding/newsannouncements/2025/06/sidley-represents-shamrock-capital-investment-firm",
    "snippet": "<strong>Sidley represented Shamrock Capital</strong>, a Los Angeles-based investment firm specializing in media, entertainment, communications, and related sectors, in connection with its strategic investment in acquiring a participation in New Regency, a leading ...",
    "published": "June 20, 2025"
  },
  {
    "title": "New Regency Partners With Shamrock Capital for Film and TV Library",
    "url": "https://ca.news.yahoo.com/regency-partners-shamrock-capital-film-195005200.html",
    "snippet": "Shamrock Capital has entered into a long-term partnership with New Regency that will see the Los Angeles-based investment firm’s content strategy division acquire participation in the cash flows of the production company’s film and television library.",
    "published": "June 18, 2025"
  },
  {
    "title": "New Regency Partners With Shamrock Capital for Film and TV Library",
    "url": "https://www.thewrap.com/shamrock-capital-new-regency-film-tv-library/",
    "snippet": "Shamrock Capital has entered into a long-term partnership with New Regency that will see the Los Angeles-based investment firm’s content strategy division acquire participation in the cash flows of the production company’s film and television library.",
    "published": "June 18, 2025"
  }
]