[
  {
    "title": "List of heads of state of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Greece",
    "snippet": "This is a list of the heads of state of the modern Greek state, from its establishment during the Greek War of Independence to the present day. First Hellenic Republic is a historiographical term used by academics to label the earliest iteration of an independent Greek state. Its formal name in English was the Provisional Administration of Greece; it was established at the beginning of the Greek revolution and ...",
    "published": "October 11, 2025"
  },
  {
    "title": "President of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Greece",
    "snippet": "The president of Greece, officially the president of the Hellenic Republic (Greek: Πρόεδρος της Ελληνικής Δημοκρατίας, romanized: Próedros tis Ellinikís Dimokratías), commonly referred to in Greek as the president of the Republic (Πρόεδρος της Δημοκρατίας, Próedros tis Dimokratías, ΠτΔ), is the head of state of Greece. The president is elected by the Hellenic Parliament; the role has been mainly ceremonial since the 1986 constitutional reform. The office was formally established by the Constitution of Greece in 1975, but has antecedents in the Second Hellenic Republic of 1924–1935 and the Greek junta in 1973–1974 which predated the transition to the current Third Hellenic Republic.",
    "published": "2 weeks ago"
  },
  {
    "title": "List of Presidents of Greece - Phantis",
    "url": "https://wiki.phantis.com/index.php/List_of_Presidents_of_Greece",
    "snippet": "List of Presidents of Greece · From Phantis · Jump to navigation Jump to search · This is a list of presidents of Greece · Contents · 1 First Hellenic Republic, 1828-1833 · 2 Kingdom of Greece, 1833-1924 · 3 Second Hellenic Republic, 1924-1935 · 4 Kingdom of Greece, 1935-1973 · 5 ...",
    "published": null
  },
  {
    "title": "List of prime ministers of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Greece",
    "snippet": "This is a list of the heads of government of the modern Greek state, from its establishment during the Greek War of Independence to the present day. Although various official and semi-official appellations were used during the early decades of independent statehood, the title of prime minister has been the formal designation of the office at least since 1843. On dates, Greece ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Presidents of Greece | World Presidents Database",
    "url": "https://www.worldpresidentsdb.com/list/countries/Greece/",
    "snippet": "List of Greek presidents, leaders and heads of state. Both current and historical presidents of Greece are listed with biographies.",
    "published": null
  }
]