[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Trudeau remained Liberal leader ... as his successor on March 9. He resigned as prime minister five days later and stood down as an MP at the 2025 federal election. On June 23, 1971, the Prime Minister&#x27;s Office (PMO) announced that Prime Minister Pierre Trudeau&#x27;s wife of four months, Margaret Trudeau (née Sinclair), was pregnant and due in December. Justin Trudeau was born on December 25, 1971, at 9:27 pm EST at the Ottawa Civic Hospital. He is the second child in Canadian history to be born ...",
    "published": "4 days ago"
  },
  {
    "title": "Justin Trudeau | Biography, Facts, Resignation, & Father | Britannica",
    "url": "https://www.britannica.com/biography/Justin-Trudeau",
    "snippet": "Justin Trudeau (b. 1971) is a Canadian politician who was <strong>prime minister of Canada (2015–25) and leader of the Liberal Party (2013–25)</strong>. He is the son of four-term prime minister Pierre Trudeau.",
    "published": "June 7, 2013"
  },
  {
    "title": "Canadian Prime Minister Justin Trudeau and his wife announce their separation : NPR",
    "url": "https://www.npr.org/2023/08/03/1191789443/canadian-prime-minister-justin-trudeau-and-his-wife-announce-their-separation",
    "snippet": "Justin Trudeau is the 51-year-old scion of one of Canada&#x27;s most famous politicians. <strong>Sophie Trudeau</strong> is a former model and TV host. Together, they brought star power to the prime minister&#x27;s office.",
    "published": "August 3, 2023"
  },
  {
    "title": "Justin Trudeau Was Spotted Kissing Katy Perry. Here’s What We Know About Their Romance.",
    "url": "https://www.biography.com/political-figures/justin-trudeau",
    "snippet": "Trudeau led his allies to a remarkable ... history. <strong>He unseated Conservative Party leader Stephen Harper</strong>, who had served as prime minister since 2006. In his victory speech, Trudeau said, according to the National Post: “Canadians have spoken.",
    "published": "October 13, 2025"
  },
  {
    "title": "Electoral history of Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Electoral_history_of_Justin_Trudeau",
    "snippet": "Although Trudeau was successful in leading the party in three general elections, a political crisis led to Trudeau&#x27;s retirement early in 2025. He was succeeded by <strong>Mark Carney</strong> as prime minister and Liberal leader.",
    "published": "3 days ago"
  }
]