[
  {
    "title": "Abdullah II of Jordan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdullah_II_of_Jordan",
    "snippet": "Abdullah II (Abdullah bin Hussein; born 30 January 1962) is the King of Jordan, having ascended the throne on <strong>7 February 1999</strong>. He is a member of the Hashemites, who have been the reigning royal family of Jordan since 1921, and is traditionally regarded a 41st-generation direct descendant of ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Abdullah of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdullah_of_Saudi_Arabia",
    "snippet": "After King Fahd suffered a serious stroke in 1995, Abdullah became the de facto ruler of Saudi Arabia until ascending the throne a decade later. During his reign, Abdullah maintained close relations with the United States and the United Kingdom and bought billions of dollars&#x27; worth of defense equipment from both states.",
    "published": "October 12, 2025"
  },
  {
    "title": "Saudi Arabia - Monarchy, Reforms, Oil | Britannica",
    "url": "https://www.britannica.com/place/Saudi-Arabia/Reign-of-King-Abdullah-2005-15",
    "snippet": "Saudi Arabia - Monarchy, Reforms, Oil: Following Fahd’s death on August 1, 2005, Abdullah ascended the throne. The new king subsequently introduced a program of moderate reform to address a number of challenges facing Saudi Arabia. The country’s continued reliance on oil revenue was of particular concern, and among the economic reforms he introduced were limited deregulation, foreign investment, and privatization.",
    "published": "July 26, 1999"
  },
  {
    "title": "Abdullah II | Biography, Education, Family, History, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Abdullah-II",
    "snippet": "Abdullah II Early Life and Education ... and Controversies Legacy and Impact ... Abdullah II became king of Jordan on <strong>February 7, 1999</strong>....",
    "published": "May 12, 2005"
  },
  {
    "title": "Abdullah I of Jordan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdullah_I_of_Jordan",
    "snippet": "Abdullah I (Abdullah bin Hussein; 2 February 1882 – 20 July 1951) was the ruler of Jordan from <strong>11 April 1921 until his assassination in 1951</strong>. He was the Emir of Transjordan, a British protectorate, until 25 May 1946, after which he was king ...",
    "published": "November 10, 2025"
  }
]