[
  {
    "title": "House of Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/House_of_Saud",
    "snippet": "<strong>The Al Saudi family became known as the &quot;royal family&quot;, and each member, male and female, was accorded the title amir (&quot;prince&quot;) or amira (&quot;princess&quot;), respectively</strong>. Ibn Saud died in 1953, after having cemented an alliance with the United States in 1945. He is still celebrated officially as ...",
    "published": "1 month ago"
  },
  {
    "title": "Family Tree",
    "url": "https://www.datarabia.com/royals/familytree.do",
    "snippet": "History · [ Family Tree ] Family Directory · Family Tree · Sponsored Links · Top 5 Royal Biographies · <strong>Al Walid bin Talal Abdallah bin Abd al-Aziz Salman bin Abd al-Aziz Sultan bin Abd al-Aziz Nayif bin Abdallah</strong> Search: Sponsored Links · Information · Saudi Business Directory Gain unlimited ...",
    "published": null
  },
  {
    "title": "Saudi Royal Family Tree: Tracing Saudi Arabia's Royal Lineage | History Cooperative",
    "url": "https://historycooperative.org/saudi-royal-family-tree/",
    "snippet": "Explore the Saudi royal family tree, tracing the lineage of Saudi Arabia&#x27;s rulers from Ibn Saud to Abdulaziz, and the legacy of the Al Saud family.",
    "published": "January 13, 2025"
  },
  {
    "title": "The royal family - Saudipedia",
    "url": "https://saudipedia.com/en/the-royal-family",
    "snippet": "... The Second Saudi State was established by Imam Turki Bin Abdullah Bin Mohammed Bin Saud in 1824 and... ... The Kingdom of Saudi Arabia was <strong>founded by King Abdulaziz Bin Abdulrahman Al Saud</strong>, who began his jo...",
    "published": null
  },
  {
    "title": "House of Saud | Royal Family Members & History | Study.com",
    "url": "https://study.com/academy/lesson/house-saud-history-members-royal-family-saudi-arabia.html",
    "snippet": "The House of Saud is the ruling family of the Kingdom of Saudi Arabia, one of the few remaining absolute monarchies in the world. Because of this, the Saudi royal family is extensively wealthy and powerful, dominating the politics and economy of Saudi Arabia.",
    "published": null
  }
]