[
  {
    "title": "Mergers: Commission approves acquisition of Com Hem by Tele2",
    "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_18_6065",
    "snippet": "<strong>The European Commission has approved unconditionally, under the EU Merger Regulation, the proposed acquisition of Com Hem by Tele2.</strong> The Commission concluded that the transaction would raise no competition concerns as the companies\\&#x27; activities ...",
    "published": null
  },
  {
    "title": "The merger between Tele2 and Com Hem is completed - Tele2",
    "url": "https://www.tele2.com/media/news/2018/the-merger-between-tele2-and-com-hem-is-completed/",
    "snippet": "<strong>Com Hem shareholders will receive the Tele2 shares i.e. the non-cash merger consideration on November 7, 2018 and the cash merger consideration on November 7-8, 2018. Trading in the Tele2 share takes place as usual and will not be affected by the merger process</strong>...",
    "published": null
  },
  {
    "title": "Tele2 and Com Hem merger - Tele2",
    "url": "https://www.tele2.com/investors/tele2-and-com-hem-merger",
    "snippet": "The merger between Tele2 and Com Hem was <strong>completed on 5 November 2018</strong>. Com Hem Holding was dissolved and all of its assets and liabilities were transferred to Tele2. ... This website uses cookies to provide the best possible user experience.",
    "published": null
  },
  {
    "title": "The European Commission has approved the merger of Tele2 and Com Hem - Inderes",
    "url": "https://www.inderes.fi/en/releases/the-european-commission-has-approved-the-merger-of-tele2-and-com-hem",
    "snippet": "Today <strong>the European Commission approved the merger of Tele2 and Com Hem unconditionally</strong>. The merger will combine two highly cash generative businesses with clear synergies to create a leading integrated connectivity provider in the Baltic Sea region.",
    "published": null
  },
  {
    "title": "The European Commission has approved the merger of Tele2 and Com Hem - Tele2",
    "url": "https://www.tele2.com/media/news/2018/the-european-commission-has-approved-the-merger-of-tele2-and-com-hem",
    "snippet": "Today <strong>the European Commission approved the merger of Tele2 and Com Hem unconditionally</strong>. The merger will combine two highly cash generative businesses with clear synergies to create a leading integrated connectivity provider in the Baltic Sea region.",
    "published": null
  }
]