[
  {
    "title": "Business Council of Australia",
    "url": "https://www.bca.com.au/",
    "snippet": "The Business Council of Australia drives the nation’s economic agenda, leveraging the expertise of Australia’s leading businesses to advocate for policy solutions that ensure prosperity and fairness.",
    "published": "August 26, 2024"
  },
  {
    "title": "Business Council of Australia Information",
    "url": "https://rocketreach.co/business-council-of-australia-profile_b5ca60d8f42e0bf8",
    "snippet": "Business Council of Australia is a Public Policy Offices, Membership Organizations, and Organizations company located in <strong>Melbourne, Victoria</strong> with $43.5 million in revenue and 46 employees.",
    "published": null
  },
  {
    "title": "Business Council of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Business_Council_of_Australia",
    "snippet": "The Australian Industries Protection League (AIPL) was established in Melbourne in January 1919 as a successor to the Protectionist Association of Victoria. James Hume Cook, a former federal MP and ally of Nationalist leader Billy Hughes, was appointed secretary of the organisation in 1922 and held the position until his death in 1942. He represented the league at the British Empire Economic Conference in Ottawa in 1932.",
    "published": "April 1, 2025"
  },
  {
    "title": "Business Council of Australia | Melbourne VIC | Facebook",
    "url": "https://www.facebook.com/BCAcomau/",
    "snippet": "Business Council of Australia, <strong>Melbourne</strong>. 15,768 likes · 6 talking about this · 5 were here. Authorised by W. Black, Business Council of Australia, <strong>Melbourne</strong>.",
    "published": null
  },
  {
    "title": "Business Council of Australia | LinkedIn",
    "url": "https://au.linkedin.com/company/business-council-of-australia",
    "snippet": "The National Reform Fund is one way we can build homes faster, and sustainably grow wages, grow jobs and maintain our valued quality of life. You can read more from me in today’s The Daily Telegraph. https://bit.ly/3T9bbs8 ... New Zealand’s Finance Minister the Hon Nicola Willis MP, Business Council Chief Economist Stephen Walters and BCA members participated in an Australia New Zealand Leadership Forum roundtable in Sydney to hear what the new New Zealand Government is doing to reduce regulation and red tape, boost economic growth, invest in infrastructure and ease cross border transactions.",
    "published": null
  }
]