[
  {
    "title": "ANÍBAL FERNÁNDEZ ASUME LA PRESIDENCIA DE LA CAH | Novedades | Confederación Argentina de Hockey",
    "url": "https://www.cahockey.org.ar/noticia/anibal-fernandez-asume-la-presidencia-de-la-cah/3237",
    "snippet": "Aníbal Fernández resultó electo <strong>presidente de la Confederación Argentina de Hockey</strong> luego de la realización de la Asamblea Anual Ordinaria de la institución y ocupará el máximo cargo hasta el año 2025.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "Throughout his career, he has remained a close ally to the former Presidents Néstor Kirchner and Cristina Fernández de Kirchner. Between 2021 and 2023, he served as Argentina&#x27;s <strong>Minister of Security</strong> in the cabinet of President Alberto Fernández. He has held several cabinet positions under ...",
    "published": "November 15, 2025"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Entre 1985 y 1987 fue <strong>secretario administrativo del Movimiento Peronista</strong> de dicha Cámara y luego accedió a la secretaría administrativa de esta institución. Durante el gobierno del Presidente Duhalde, Fernández fue designado secretario ...",
    "published": null
  },
  {
    "title": "The disgraceful Aníbal Fernández was reelected as president of the CAH",
    "url": "https://derechadiario.com.ar/us/argentina/unpresentable-anibal-fernandez-was-reelected-as-president-cah",
    "snippet": "Previously, Fernández had been in charge of the confederation in a first stage between 2013 and 2016, when he was still <strong>president of Quilmes, National Senator, and General Secretary of the convicted Cristina Fernández de Kirchner</strong>.",
    "published": "April 27, 2025"
  },
  {
    "title": "Aníbal Fernández - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/anibal-fernandez/profil/trainer/22238",
    "snippet": "Without Club Last position: President Quilmes AC Date left: Jun 30, 2016",
    "published": null
  }
]