[
  {
    "title": "Svenja Huth: Players 'live for these type of games' vs Real Madrid",
    "url": "https://shekicks.net/svenja-huth-says-players-live-for-these-games-as-wolfsburg-prepare-to-face-real-madrid/",
    "snippet": "— VfL Wolfsburg Frauen (@VfL_Frauen) December 8, 2025 · Wolfsburg returned from the international break with a win but their game against Real Madrid on Tuesday is their biggest of the season so far. “It wasn’t easy for the team to get back into the normal rhythm again after only one training session together,” said Wolfsburg’s Svenja Huth.",
    "published": "1 week ago"
  },
  {
    "title": "VfL-Star Svenja Huth: Darum ist sie so wichtig für die Wölfinnen",
    "url": "https://www.braunschweiger-zeitung.de/sport/vfl-wolfsburg/article410659043/vfl-star-svenja-huth-so-wichtig-ist-sie-fuer-die-woelfinnen.html",
    "snippet": "Madrid/Wolfsburg. Alter schützt vor Leistung nicht: <strong>Im Kader der Fußballerinnen des VfL Wolfsburg ist Svenja Huth die älteste Spielerin, ihr Stellenwert ist weiter immens</strong>. Von Daniel Hotop, Sport Wolfsburg/Braunschweig 08.12.2025, 19:29 Uhr",
    "published": "1 week ago"
  },
  {
    "title": "Kapitänin verlängert | VfL Wolfsburg",
    "url": "https://www.vfl-wolfsburg.de/newsdetails/news-detail/detail/news/kapitaenin-verlaengert",
    "snippet": "Ralf Kellermann, Direktor Frauenfußball beim VfL Wolfsburg, freut sich sehr darüber, dass Huth ihre Karriere beim VfL fortsetzt: „Svenja zeigt seit Jahren konstante Leistungen auf einem Top-Niveau. Sie ist ein zentraler Eckpfeiler in unserem Spiel und hat das in den vergangenen Wochen einmal mehr unter Beweis gestellt.",
    "published": null
  },
  {
    "title": "Svenja Huth | News - Infos - Videos - kicker",
    "url": "https://www.kicker.de/svenja-huth/spieler-news",
    "snippet": "Jetzt soll vieles besser werden - mit zwölf neuen Spielerinnen und einem altbekannten Trainer. ... <strong>Svenja Huth spricht über die &quot;negative Dynamik&quot; in der Vorsaison, den Umbruch in diesem Sommer - und den Kampf um Titel mit dem VfL Wolfsburg</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Svenja Huth - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Svenja_Huth",
    "snippet": "In 2020 she won the German Championship and the DFB Cup with Wolfsburg. In 2021, the cup was defended with a 1–0 win after extra time against Eintracht Frankfurt. <strong>In January 2025 Huth extended her contract in Wolfsburg until 2026</strong>.",
    "published": "July 29, 2025"
  }
]