[
  {
    "title": "ESPN Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ESPN_Inc.",
    "snippet": "Under the Canadian Radio-television and Telecommunications Commission&#x27;s rules regarding foreign broadcasters, ESPN has been prohibited from acquiring majority ownership of any channel operating in Canada. Instead, ESPN partnered with several Canadian firms to form a privately held consortium named NetStar Communications in 1995, which then acquired the sports networks TSN and RDS.",
    "published": "4 days ago"
  },
  {
    "title": "Television News Daily: ESPN Strikes $3B NFL Media Ownership Deal",
    "url": "https://www.mediapost.com/publications/article/407972/espn-strikes-3b-nfl-media-ownership-deal.html",
    "snippet": "Fostering stronger ties with the most powerful U.S. sports league owner, <strong>ESPN is acquiring the NFL Network, a linear cable TV network, and other NFL media assets in exchange for a significant 10% stake in ESPN for the football league</strong>.",
    "published": null
  },
  {
    "title": "ESPN, Inc. Fact Sheet - ESPN Press Room U.S.",
    "url": "https://espnpressroom.com/us/espn-inc-fact-sheet/",
    "snippet": "ESPN is <strong>80 percent owned by ABC, Inc.</strong>",
    "published": "September 22, 2025"
  },
  {
    "title": "Espn Owners: Fascinating Ownership Snapshot | muleforce.com",
    "url": "https://muleforce.com/espn-owners/",
    "snippet": "<strong>By 1996, Hearst joined the action with a 20% stake</strong>, a clever move highlighting ESPN&#x27;s fast-growing reputation in a competitive sports media world. Each of these moves helped transform ESPN from a scrappy, founder-driven startup into a major league player with diverse backing.",
    "published": null
  },
  {
    "title": "ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ESPN",
    "snippet": "<strong>The NFL would take a 10% equity stake in ESPN</strong>, NFL Network and RedZone would become part of the forthcoming ESPN streaming service, the NFL would license content from NFL Films to air on ESPN networks, and ESPN will reassign selected games from ...",
    "published": "4 days ago"
  }
]