[
  {
    "title": "Banijay Entertainment - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banijay_Entertainment",
    "snippet": "Banijay Entertainment S.A. (formerly ... 185,000 hours of original programming. Headquartered in Paris, the company was founded in January 2008 by <strong>Stéphane Courbit</strong>, former president of Endemol France, and has risen since its inception, to become a €3.2bn turnover ...",
    "published": "1 day ago"
  },
  {
    "title": "Banijay Group is a leader in the entertainment business",
    "url": "https://group.banijay.com/who-we-are/",
    "snippet": "... Equity investment of Société des Bains de Mer in Betclic. ... Acquisition of Zodiak Media through merger with Banijay (Vivendi retaining 26% of the combined entity). ... Acquisition of Endemol Shine by Banijay. ... Listing of FL Entertainment in July 2022. ... <strong>Stéphane Courbit</strong> is the founder ...",
    "published": "May 24, 2024"
  },
  {
    "title": "Banijay UK (company) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banijay_UK_Productions",
    "snippet": "A month later in July of that year, French production &amp; distribution company Banijay Group (who owns its British subsidiaries) completed its merger with Endemol Shine UK&#x27;s Dutch-based global production and distribution parent Endemol Shine Group from The Walt Disney Company and Apollo Global Management turning Banijay Group into a global international production and distribution titan as Endemol Shine UK became Banijay&#x27;s new British production division with Banijay placing all of its British subsidiaries such as RDF Television and IWC Media (the two were former Zodiak Media subsidiaries) into the acquired Endemol.Shine UK division and had it renamed to Banijay UK although it retained the former name until 2023.",
    "published": "1 month ago"
  },
  {
    "title": "Banijay - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/Banijay",
    "snippet": "It is the world&#x27;s largest international ... programming. It is headquartered in Paris. It was founded in January 2008 by <strong>Stéphane Courbit</strong>. ↑ &quot;Our People - Banijay Group&quot;....",
    "published": "October 15, 2025"
  },
  {
    "title": "Banijay Entertainment (company) | JH Wiki Collection Wiki | Fandom",
    "url": "https://jhmovie.fandom.com/wiki/Banijay_Entertainment_(company)",
    "snippet": "Headquartered in Paris, the company was founded in January 2008 by <strong>Stéphane Courbit</strong>, former president of Endemol France, and has risen since its inception, to become a €3.2bn turnover business.",
    "published": "October 29, 2024"
  }
]