[
  {
    "title": "Timeline of the Sudanese civil war (2025) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Timeline_of_the_Sudanese_civil_war_(2025)",
    "snippet": "The Leadership Council of the Sudan Founding Alliance (TASIS), a coalition led by the RSF, <strong>announced a parallel government with Hemedti as chair of a 15-person presidential council and Mohammed Hassan Osman al-Ta&#x27;ishi as prime minister</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Amid Sudan’s unimaginable crisis, its people endure with hope | UN News",
    "url": "https://news.un.org/en/story/2025/12/1166514",
    "snippet": "Li Fung, Representative of the Office of the High Commissioner for Human Rights (OHCHR) in Sudan, during a visit to Khartoum with Radhouane Nouicer, the Designated Expert on Sudan of the UN High Commissioner for Human Rights. ... As the world prepares to mark Human Rights Day on 10 December, the UN is warning that war-torn Sudan is in the midst of arguably the gravest human rights crisis of our time.",
    "published": "2 weeks ago"
  },
  {
    "title": "Briefing on the situation in Sudan – Amani Africa",
    "url": "https://amaniafrica-et.org/briefing-on-the-situation-in-sudan-16-december-2025/",
    "snippet": "From the communiqué it adopted after the session, the PSC tasked the AU Commission ‘to regularly monitor and report such heinous crimes committed throughout Sudan, in order to put in place preventive measures and reduce the risk of recurrence; develop proposals on how to address them to prevent their further escalation; [and] develop a plan for the protection of civilians, and make recommendations to the PSC within three weeks.’ · PSC went further and directed the Chairperson of the AU Commission to engage with the Members of the PSC Presidential Ad-hoc Committee, under the leadership of Yoweri Kaguta Museveni, President of Uganda, to urgently facilitate the negotiation process between the leaders of the Sudanese Armed Forces (SAF) and the paramilitary Rapid Support Forces (RSF), including the holding of an AU Special Summit on Sudan.",
    "published": null
  },
  {
    "title": "South Sudan says its troops are guarding strategic Heglig oil field in Sudan | Reuters",
    "url": "https://www.reuters.com/world/africa/south-sudan-says-its-troops-are-guarding-strategic-heglig-oil-field-sudan-2025-12-11/",
    "snippet": "NAIROBI, Dec 11 (Reuters) - <strong>South Sudan has sent its troops to neighbouring Sudan to guard the strategic Heglig oil field near the border</strong>, its military head said on Thursday, days after the paramilitary Rapid Support Forces (RSF) took control of it.",
    "published": "5 days ago"
  },
  {
    "title": "Sudan: Statement by the High Representative on behalf of the European Union - Consilium",
    "url": "https://www.consilium.europa.eu/en/press/press-releases/2025/11/20/sudan-statement-by-the-high-representative-on-behalf-of-the-european-union-20-november-2025/",
    "snippet": "<strong>The culture of impunity in Sudan must end</strong>. Those responsible must be held to account. The primary responsibility for ending the conflict rests with the leadership of both the RSF, the SAF and their allied militias, as well as those providing ...",
    "published": null
  }
]