[
  {
    "title": "Julian Nagelsmann - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Julian_Nagelsmann",
    "snippet": "Nagelsmann ended his tenure at Bayern with a <strong>71.4% win rate</strong>, with only Pep Guardiola, Hansi Flick and Carlo Ancelotti averaging more Bundesliga points than him.",
    "published": "3 days ago"
  },
  {
    "title": "The reasons why Bayern Munich sacked Julian Nagelsmann | Bavarian Football Works",
    "url": "https://www.bavarianfootballworks.com/2023/4/24/23694862/bayern-munich-nagelsmann-kahn-brazzo-termination-tuchel-lewandowski-transfer-mane-sane-kimmich-coman",
    "snippet": "The marquee event of this season is clearly the removal of Julian Nagelsmann as the coach of Bayern Munich. While the move has not produced the desired results, there is still a great deal of confusion as to why Bayern’s leadership made this decision at that juncture of the season. Here we will try to explore the factors that led the executives to pull the trigger on Nagelsmann’s tenure, for good or ill.",
    "published": "April 26, 2023"
  },
  {
    "title": "Bayern Munich’s 60 Million Dollar Fiasco: 3 Reasons Nagelsmann Was Fired",
    "url": "https://www.forbes.com/sites/marieschultebockum/2023/03/24/bayern-munichs-60-million-dollar-fiasco-3-reasons-nagelsmann-was-fired/",
    "snippet": "<strong>Bayern Munich have fired Julian Nagelsmann</strong>. The 35-year-old spent less than two years on the Allianz Arena bench. Thomas Tuchel will likely succeed him. But why does Nagelsmann have to go?",
    "published": "March 27, 2023"
  },
  {
    "title": "Contingency Plan: Julian Nagelsmann’s Germany contract contains termination clause | Bavarian Football Works",
    "url": "https://www.bavarianfootballworks.com/fifa-world-cup/152668/contingency-plan-julian-nagelsmanns-germany-contract-contains-termination-clause",
    "snippet": "Bayern Munich were interested in potentially bringing him back as manager after the decision was made to part ways with Thomas Tuchel at the end of the <strong>2023/24 season</strong>, but Nagelsmann’s mind had already been set on the national team.",
    "published": "5 days ago"
  },
  {
    "title": "Bayern Munich, Julian Nagelsmann and a very surprising sacking ...",
    "url": "https://theathletic.com/4343865/2023/03/24/bayern-munich-julian-nagelsmann-sacked-inside-story/",
    "snippet": "Disconnect with the dressing room, PR missteps and poor results combined to end highly rated coach&#x27;s Bayern tenure",
    "published": "March 27, 2023"
  }
]