[
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "Presidents Daniel Burley Woolfall, Rodolphe Seeldrayers, and Arthur Drewry died during their term in office. The current president is Swiss-Italian Gianni Infantino, elected on <strong>26 February 2016</strong> during ...",
    "published": "1 month ago"
  },
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/organisation/president/past-presidents",
    "snippet": "On <strong>22 May 1904</strong>, Guerin - then just 28 - was elected president at the inaugural FIFA Congress and remained in his post for two years, during which time another eight associations came on board, including the English Football Association.",
    "published": null
  },
  {
    "title": "List of presidents of FIFA facts for kids",
    "url": "https://kids.kiddle.co/List_of_presidents_of_FIFA",
    "snippet": "Before him, Issa Hayatou from Cameroon was acting president for a short time. This happened after Sepp Blatter was removed from his position on October 8, 2015. Blatter was later not allowed to be involved in football activities for a period of time. Leaders of FIFA · Timeline of FIFA Presidents ·",
    "published": null
  },
  {
    "title": "FIFA Presidents - My Football Facts",
    "url": "https://www.myfootballfacts.com/world-football/fifa/world-cup/fifa-all-time-world-cup/fifa-presidents/",
    "snippet": "The current FIFA president name is Gianni Infantino. The <strong>2015 election took place on 29th May with Sepp Blatter winning a 5th term in office (to 2019)</strong> while",
    "published": "April 30, 2025"
  },
  {
    "title": "World Football Historic Center: The House of FIFA Presidents",
    "url": "http://xtrahistory.blogspot.com/2013/02/FIFA-President.html",
    "snippet": "Daniel Burley Woolfall (June 15, 1852 - October 24, 1918[1]) was an English FA administrator from Blackburn, Woolfall was elected as president on <strong>4 June 1906</strong>. A key aim during his presidency was to achieve uniform football rules on an international level and he played a prominent role in the ...",
    "published": null
  }
]