[
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "He is <strong>leading the SAF against the Rapid Support Forces (RSF) in the ongoing Sudanese civil war</strong>. Al-Burhan survived an assassination attempt in July 2024. Abdel Fattah al-Burhan was born in 1960 in the village of Gandatu in northern Sudan, to a Sufi Ja&#x27;ali family.",
    "published": "3 weeks ago"
  },
  {
    "title": "Abdel Fattah al-Burhan | Sudanese politician | Britannica",
    "url": "https://www.britannica.com/biography/Abdel-Fattah-al-Burhan",
    "snippet": "Other articles where Abdel Fattah al-Burhan is discussed: Sudan: Transition: Abdel Fattah al-Burhan, who had been leading the military-led transition council, was <strong>named president</strong>.",
    "published": null
  },
  {
    "title": "How the Conflict in Sudan Became a Humanitarian Catastrophe | The New Yorker",
    "url": "https://www.newyorker.com/news/q-and-a/how-the-conflict-in-sudan-became-a-humanitarian-catastrophe",
    "snippet": "In 2021, Sudan’s military, in coördination with a paramilitary group called the Rapid Support Forces (R.S.F.), launched a coup. But the alliance between the Sudanese Armed Forces (SAF), led by Abdel Fattah al-Burhan, and the R.S.F., led by Mohamed Hamdan Dagalo, known as Hemedti, quickly crumbled, and by April of 2023, the two sides were openly at war.",
    "published": "1 month ago"
  },
  {
    "title": "Abdel Fattah al-Burhan (1960- ) | BlackPast.org",
    "url": "https://blackpast.org/global-african-history/people-global-african-history/abdel-fattah-al-burhan-1960/",
    "snippet": "Abdel Fattah al-Burhan, the current <strong>ruler of Sudan</strong>, was born on July 11, 1960, in Gandatu, Sudan. He was educated in local schools and joined the military as a young man. He rose through the ranks and in the early 2000s he was posted in the ...",
    "published": "May 20, 2025"
  },
  {
    "title": "Israel, a behind-the-scenes powerbroker in Sudan | Responsible Statecraft",
    "url": "https://responsiblestatecraft.org/sudan-war/",
    "snippet": "In 2020, as part of a deal in which the Trump Administration removed Sudan’s designation as a state sponsor of terrorism, Sudan agreed to join the Abraham Accords. General Abdel Fattah al Burhan, head of Sudan’s sovereignty council and de facto head of state,",
    "published": "October 23, 2024"
  }
]