[
  {
    "title": "Modern history of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Modern_history_of_Ukraine",
    "snippet": "In 1954 the Crimean Oblast was transferred from the RSFSR to the Ukrainian SSR. <strong>Following the dissolution of the Soviet Union in 1991, Ukraine became an independent state, formalized with a referendum</strong>. With the enlargement of the European Union in 2004, Ukraine became an area of overlapping ...",
    "published": "1 week ago"
  },
  {
    "title": "A historical timeline of post-independence Ukraine | PBS News",
    "url": "https://www.pbs.org/newshour/world/a-historical-timeline-of-post-independence-ukraine",
    "snippet": "The Ecumenical Patriarch of Constantinople, the leading authority for Orthodox Christianity, recognizes the independence of the Ukrainian Orthodox Church, formally severing it from the Russian Orthodox Church, which has close reported ties to the Kremlin and had overseen the Ukrainian church for centuries. Russia accuses the United States of encouraging the break in order to weaken Moscow, and a Kremlin spokesperson reissues a promise to defend “the interests of Russians and Russian-speakers.” · Volodymyr Zelenskyy, a television comedian and political novice, wins a presidential runoff with more than 70 percent of the vote, defeating Poroshenko.",
    "published": "March 12, 2025"
  },
  {
    "title": "History of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Ukraine",
    "snippet": "<strong>The Cossack Hetmanate, also known as the Hetmanate of Ukraine, was a self-governing Cossack state that existed between 1649 and 1764</strong>. It arose during a particularly volatile era in Eastern European history, following the seismic upheaval of the Khmelnytsky Uprising.",
    "published": "3 weeks ago"
  },
  {
    "title": "Ukraine Since Independence (1991-Present) - The War in Ukraine - LibGuides at University of Connecticut",
    "url": "https://guides.lib.uconn.edu/ukraine/independent",
    "snippet": "The last two decades have been ... of other formerly socialist states of Eastern Europe, <strong>has often been characterized as being &quot;in transition,&quot; moving from a Soviet system to one more closely aligned with Western models</strong>....",
    "published": null
  },
  {
    "title": "Ukraine's Political Transformation: a Journey From Independence To the Present Day - UkraineWorld",
    "url": "https://ukraineworld.org/en/articles/basics/ukraines-political-transformation",
    "snippet": "Since Ukraine gained independence from the Soviet Union in 1991, its political regime has undergone several significant transformations.",
    "published": null
  }
]