[
  {
    "title": "Nicholas Burns | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty/nicholas-burns",
    "snippet": "He is the Founder and Faculty Chair of the Future of Diplomacy Project. He is also a Faculty Affiliate at Harvard’s Fairbank Center for Chinese Studies. Burns <strong>served as the U.S. Ambassador to the People&#x27;s Republic of China from 2021-2025</strong>...",
    "published": null
  },
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "In July 2023, it was reported that Burns&#x27;s email account had been hacked in a breach of Microsoft emails by the Chinese government. On February 3, 2025, The Cohen Group announced that <strong>Burns will rejoin as a vice chair on February 17, 2025</strong>.",
    "published": "September 26, 2025"
  },
  {
    "title": "‘Be Nice to Allies’: Former Ambassador to China Nicholas Burns Emphasizes Diplomatic Civility at IOP Forum | News | The Harvard Crimson",
    "url": "https://www.thecrimson.com/article/2025/4/3/iop-forum-burns/",
    "snippet": "Though Burns commended the Trump administration’s decision to keep tariffs on Chinese technology sectors, and applauded their decision to sanction Chinese officials for human rights violations, he strongly criticized the government’s aggression against nations historically allied with the U.S.",
    "published": null
  },
  {
    "title": "Ambassador Nicholas Burns to Rejoin The Cohen Group as a Vice Chair | The Cohen Group",
    "url": "https://cohengroup.net/ambassador-nicholas-burns-rejoin-cohen-group-vice-chair",
    "snippet": "<strong>Ambassador Nicholas Burns will return to The Cohen Group following his service as US Ambassador to China from 2021 to early 2025</strong>, the firm announced today.",
    "published": "February 3, 2025"
  },
  {
    "title": "Former U.S. Ambassador to China To Return to Kennedy School Professorship | News | The Harvard Crimson",
    "url": "https://www.thecrimson.com/article/2025/1/27/burns-hks-return/",
    "snippet": "Former U.S. Ambassador to China R. Nicholas Burns <strong>will return to the Harvard Kennedy School as a professor this April</strong>, joining the Fairbank Center for Chinese Studies, the University announced earlier this week.",
    "published": null
  }
]