[
  {
    "title": "Kevin Volland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kevin_Volland",
    "snippet": "After starting his football career with <strong>FC Thalhofen</strong>, Volland transferred to FC Memmingen&#x27;s C-Youth squad, playing in the Bavarian League, the top amateur division at that time. After relegation in 2006, he moved on to TSG Thannhausen, in order to remain in the higher division.",
    "published": "3 weeks ago"
  },
  {
    "title": "Kevin Volland Stats, Form Index and Match Ratings",
    "url": "https://www.footballcritic.com/kevin-volland/profile/11288",
    "snippet": "All matches played by Volland · ... foot: Left · Height: 179 cm · Weight: 82 kg · Previous teams: Union Berlin, <strong>Monaco, Bayer 04, Hoffenheim</strong> ·...",
    "published": null
  },
  {
    "title": "Kevin Volland: Who is the Union Berlin forward with a better record than Kai Havertz? | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/who-is-kevin-volland-union-berlin-signing-monaco-leverkusen-germany-forward-24402",
    "snippet": "Volland was sixth league wide for both goals (16) and assists (seven) in his debut season of French football, having previously trumped former Leverkusen teammate Kai Havertz&#x27;s total contribution in each of the pair&#x27;s final two campaigns at Leverkusen, 26 to 21 and 18 to 17. Watch: Kevin Volland shares the record for the fastest Bundesliga goal",
    "published": "August 18, 2023"
  },
  {
    "title": "Ex-Germany player Volland to leave Union for boyhood club 1860 Munich - Yahoo Sports",
    "url": "https://sports.yahoo.com/article/ex-germany-player-volland-leave-094329191.html",
    "snippet": "Volland will return to 1860 where he arrived as a teenager and made his first team debut in 2010, before moving on to Hoffenheim two years later, followed by terms at <strong>Bayer Leverkusen and then Monaco</strong>.",
    "published": "April 21, 2025"
  },
  {
    "title": "Kevin Volland to Return to TSV 1860 München | 1. FC Union Berlin",
    "url": "https://www.fc-union-berlin.de/en/news/kevin-volland-to-return-to-tsv-1860-muenchen--lPiUbM",
    "snippet": "1. FC Union Berlin and Kevin Volland have agreed to end their partnership in the summer, with the 32-year-old attacking all-rounder to return to the club of his youth, <strong>TSV 1860 München</strong>.",
    "published": null
  }
]