[
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The International Mathematical Union (IMU) is an international organization devoted to international cooperation in the field of mathematics across the world. It is a member of the International Science Council (ISC) and supports the International Congress of Mathematicians (ICM).",
    "published": "February 24, 2025"
  },
  {
    "title": "Past ICMI Executive Committees | History & Members of ICMI Leadership",
    "url": "https://www.mathunion.org/icmi/organization/icmi-executive-committee/past-icmi-executive-committees",
    "snippet": "Explore the history and members of past ICMI Executive Committees since 1908, including presidents, vice-presidents, and secretaries-general.",
    "published": null
  },
  {
    "title": "IMU Executive Committee | International Mathematical Union Leadership 2023-2026",
    "url": "https://www.mathunion.org/organization/imu-executive-committee",
    "snippet": "Four former IMU Presidents at the Abel Banquet, on the occasion of the Abel Prize Ceremonies in Oslo, Norway, in May 2007. The picture shows from left to right: <strong>L. Lovász, L. Carleson, L. Faddeev, and J.</strong>",
    "published": null
  },
  {
    "title": "| International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/",
    "snippet": "ICM 2026 Program Committee Chair <strong>Claire Voisin</strong> (CNRS, Institut de Mathématiques de Jussieu-Paris Rive Gauche) has been awarded the Crafoord Prize in Mathematics 2024 by the Royal Swedish Academy of Sciences.",
    "published": null
  },
  {
    "title": "International Mathematical Union | international organization | Britannica",
    "url": "https://www.britannica.com/topic/International-Mathematical-Union",
    "snippet": "Other articles where International Mathematical Union is discussed: Lars V. Hörmander: …a vice president of the International Mathematical Union. In 1988 Hörmander was awarded the Wolf Prize.",
    "published": null
  }
]