[
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "The current president of the European Central Bank is <strong>Christine Lagarde</strong>, previously the chair and managing director of the International Monetary Fund.",
    "published": "September 25, 2025"
  },
  {
    "title": "European Central Bank",
    "url": "https://www.ecb.europa.eu/",
    "snippet": "Interview with Isabel Schnabel, Member of the Executive Board of the ECB, conducted by Jana Randow and Mark Schrörs on 3 December 2025 ... Interview with Piero Cipollone, Member of the Executive Board of the ECB, conducted by Takerou Minami on 26 November 2025 ... Interview with Frank Elderson, Member of the Executive Board of the ECB and Vice-Chair of the Supervisory Board of the ECB, conducted by Andrés Stumpf on 4 November 2025",
    "published": null
  },
  {
    "title": "Christine Lagarde - President of the European Central Bank | LinkedIn",
    "url": "https://de.linkedin.com/in/christinelagarde",
    "snippet": "1 February 2025 Authors: <strong>Christine Lagarde</strong>, President of the European Central Bank, and Ursula von der Leyen, President…",
    "published": "October 1, 2025"
  },
  {
    "title": "European Parliament wins chance of bigger say in ECB vice president race – POLITICO",
    "url": "https://www.politico.eu/article/eu-parliament-european-central-bank-vice-presidency-luis-de-guindos/",
    "snippet": "December 9, 2025 5:45 pm CET · By Carlo Boffa and Giovanna Faggionato · The European Parliament could have an early say in the race for the European Central Bank vice presidency, a win for lawmakers after years of pushing for more influence over the EU’s top appointments.",
    "published": "1 week ago"
  },
  {
    "title": "Christine Lagarde - European Central Bank",
    "url": "https://www.ecb.europa.eu/ecb/decisions/html/cvlagarde.en.html",
    "snippet": "<strong>Christine Lagarde</strong>, President of the European Central Bank",
    "published": "November 22, 2023"
  }
]