[
  {
    "title": "Home | President of India",
    "url": "https://www.presidentofindia.gov.in/",
    "snippet": "She has devoted her life to empowering the downtrodden as well as the marginalised sections of society and deepening the democratic values. ... 14 Dec 25 भारत की राष्ट्रपति, <strong>श्रीमती द्रौपदी मुर्मु</strong> का राष्ट...",
    "published": null
  },
  {
    "title": "Profile | President of India",
    "url": "https://www.presidentofindia.gov.in/Profile",
    "snippet": "She has also travelled abroad to enhance India&#x27;s global outreach and footprint. She visited the United Kingdom in 2022 and Vatican City in April 2025, and has also paid State Visits to Suriname and Serbia in 2023, Mauritius, Fiji, New Zealand, Timor-Leste, Algeria, Mauritania, Malawi in 2024, Portugal and Slovakia in 2025.",
    "published": null
  },
  {
    "title": "List of current Indian chief ministers | 2025, States, & Union Territories | Britannica",
    "url": "https://www.britannica.com/topic/List-of-current-Indian-chief-ministers",
    "snippet": "Last updated Nov. 22, 2025 •History ... A <strong>chief minister</strong> in India is the elected head of government of each of the 28 states and 3 of the 8 union territories (Delhi, Jammu and Kashmir, and Puducherry).",
    "published": "4 weeks ago"
  },
  {
    "title": "List of Office Holders in India: Present Important Posts and Officials List",
    "url": "https://testbook.com/static-gk/list-of-office-holders-in-india",
    "snippet": "<strong>Droupadi Murmu</strong> currently serves this role and represents the nation as head of state under the Indian Constitution. The important office holders in India include the President, Prime Minister, Chief Justice, Speaker of Lok Sabha, and Chief Election ...",
    "published": null
  },
  {
    "title": "Government of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_India",
    "snippet": "The government is led by the president of India (currently <strong>Droupadi Murmu</strong> since 25 July 2022) who as head of state holds formal executive power, and thus (following parliamentary elections) appoints, as head of government, the prime minister, ...",
    "published": "1 month ago"
  }
]