[
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "^ Following the provisional exclusion on Sepp Blatter, <strong>Issa Hayatou</strong> assumed the Office of FIFA President on an interim basis in accordance with article 32(6) of the FIFA Statutes because Hayatou was the longest-serving vice-president on FIFA&#x27;s ...",
    "published": "1 month ago"
  },
  {
    "title": "Gianni Infantino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gianni_Infantino",
    "snippet": "Infantino was implicated in the FIFA corruption scandal in documents released in the 2016 Panama Papers. They show that UEFA undertook deals with indicted figures where previously they had denied any relationship.",
    "published": "1 day ago"
  },
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/organisation/president",
    "snippet": "The official site of the international governing body of football with news, national associations, competitions, results, fixtures, development, organisation, world rankings, statistics, the International Football Association Board, history, laws of the game, futsal, publications, downloads, ...",
    "published": null
  },
  {
    "title": "Gianni Infantino",
    "url": "https://www.forbes.com/profile/gianni-infantino/",
    "snippet": "A big proponent of Video Assistant Referee (VAR), Infantino successfully push for the feature to be present for the first time at the 2018 World Cup. Infantino took the helm at FIFA in February 2016, a few months after his predecessor, <strong>Sepp Blatter</strong> ...",
    "published": null
  },
  {
    "title": "Gianni Infantino: FIFA's First Italian President | Al Majalla",
    "url": "https://en.majalla.com/node/271741",
    "snippet": "Infantino took over as FIFA president in February 2016, just months after his predecessor, <strong>Sepp Blatter</strong>, resigned after a 17-year scandal-plagued reign. In June 2019, he was re-elected as FIFA President.",
    "published": null
  }
]