[
  {
    "title": "Arnon Milchan",
    "url": "https://www.forbes.com/profile/arnon-milchan/",
    "snippet": "Arnon Milchan owns <strong>film and TV production company New Regency Enterprises</strong>.",
    "published": null
  },
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Therefore, <strong>Regency International Pictures</strong> became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: ...",
    "published": "2 days ago"
  },
  {
    "title": "Arnon Milchan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Arnon_Milchan",
    "snippet": "Through his company Regency, in partnership with Warner Bros., and later with Rupert Murdoch at 20th Century Fox, and other business ventures, such as Puma AG, <strong>Milchan acquired a net worth estimated at $5.1 billion as of 2015.</strong>",
    "published": "2 weeks ago"
  },
  {
    "title": "Regency Enterprises",
    "url": "https://grokipedia.com/page/Regency_Enterprises",
    "snippet": "Regency Enterprises, Inc., commonly ... by Yariv Milchan as Chairman and CEO, overseeing creative development and global operations.[2] In June 2025, Regency formed a long-term partnership with <strong>Shamrock Capital</strong>, providing library investment ...",
    "published": null
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "Arnon Milchan (PRODUCER) is widely renowned as one of the most prolific and successful independent film producers of his time, with over 100 feature films to his credit. Born in Israel, Milchan was educated at the University of Geneva. His first business venture was transforming his father’s modest business into one of his country’s largest agro-chemical companies.",
    "published": null
  }
]