[
  {
    "title": "Zelenskiy says he is open to elections if US ensures security | Reuters",
    "url": "https://www.reuters.com/world/europe/ukraines-zelenskiy-says-ready-elections-calls-partners-ensure-security-2025-12-09/",
    "snippet": "Ukraine&#x27;s President <strong>Volodymyr Zelenskiy</strong> looks on at Chigi Palace, on the day he meets Italy&#x27;s Prime Minister Giorgia Meloni in Rome, Italy, December 9, 2025.",
    "published": "1 week ago"
  },
  {
    "title": "PM's engagements with President Zelenskyy of Ukraine, President Macron of France, Chancellor Merz of Germany and European partners: 8 December 2025 - GOV.UK",
    "url": "https://www.gov.uk/government/news/pms-engagements-with-president-zelenskyy-of-ukraine-president-macron-of-france-chancellor-merz-of-germany-and-european-partners-8-december-2025",
    "snippet": "The Prime Minister welcomed the President of Ukraine, <strong>Volodymyr Zelenskyy</strong>, the President of France, Emmanuel Macron, and the Chancellor of Germany, Friedrich Merz, to Downing Street today.",
    "published": "1 week ago"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "In his address marking Ukrainian Armed Forces Day, President of Ukraine <strong>Volodymyr Zelenskyy</strong> spoke about Ukrainian warriors honored through murals in Ukraine and around the world. ... The parties covered multiple aspects and went through key ...",
    "published": "1 week ago"
  },
  {
    "title": "Speeches — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/speeches",
    "snippet": "12 December 2025 - 14:38 · Today, I am in the Kupyansk sector, with our warriors who are getting the job done for Ukraine here. The Russians kept going on about Kupyansk – the reality speaks for itself. I visited our troops and congratulated them. I thank each of the units, everyone who is fighting here, everyone who is destroying the occupier.",
    "published": "2 days ago"
  },
  {
    "title": "Russian Offensive Campaign Assessment, December 13, 2025",
    "url": "https://understandingwar.org/research/russia-ukraine/russian-offensive-campaign-assessment-december-13-2025/",
    "snippet": "Russian forces launched 495 total missiles and drones against Ukraine overnight on December 12 to 13, heavily targeting energy infrastructure across the country. Ukrainian President <strong>Volodymyr Zelensky</strong> announced that he will hold discussions ...",
    "published": "20 hours ago"
  }
]