[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "Mary Alexandra Earps MBE (born 7 March 1993) is an English professional footballer who plays as a goalkeeper for Première Ligue club <strong>Paris Saint-Germain</strong>. At the 2023 FIFA Women&#x27;s World Cup, she served as the vice captain for England, and received the Golden Glove award for best goalkeeper ...",
    "published": "1 month ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "One of the stars of UEFA EURO 2022, Mary&#x27;s performances for England as they went on to become European Champions will live long in the memory as well as completing a remarkable journey for the affable goalkeeper who announced her retirement from international football in May 2025. The two-time FIFA Best and Golden Glove winner had to wait patiently for her senior team bow, which came in Switzerland in June 2017. After that, Earps became a regular fixture in the Lionesses squad and was named in a major tournament squad for the second time in a row when she went to the FIFA Women&#x27;s World Cup in France 2019.",
    "published": null
  },
  {
    "title": "Mary Earps MBE (@maryearps) - Instagram",
    "url": "https://www.instagram.com/maryearps/",
    "snippet": "See Instagram photos and videos from <strong>Mary</strong> <strong>Earps</strong> MBE (@maryearps)",
    "published": null
  },
  {
    "title": "Mary Earps MBE - Professional Football Player at PSG",
    "url": "https://uk.linkedin.com/in/1maryearps",
    "snippet": "<strong>1 billion members</strong> | Manage your professional identity. Build and engage with your professional network. Access knowledge, insights and opportunities.",
    "published": null
  },
  {
    "title": "Mary Earps left Manchester United to become a better player at PSG, England goalkeeper tells Pitch to Pod | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13340388/mary-earps-left-manchester-united-to-become-a-better-player-at-psg-england-goalkeeper-tells-pitch-to-pod",
    "snippet": "England and Paris Saint-Germain goalkeeper Mary Earps has admitted it was a difficult decision to leave <strong>Manchester United</strong> but says she was determined to push herself out of her comfort zone in order to become a better player.",
    "published": "April 4, 2025"
  }
]