[
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "Her successor, <strong>Almazbek Atambayev</strong>, was elected in the 2011 Kyrgyzstani presidential election and subsequently succeeded Otunbayeva on 1 December that year. On 16 October 2017, Sooronbay Jeenbekov, the former prime minister, was elected president of the country.",
    "published": "November 11, 2025"
  },
  {
    "title": "Sadyr Japarov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sadyr_Japarov",
    "snippet": "Another relative of the president, Akylbek Tumonbaev, is the leader of the Eldik parliamentary group, and Turusbek Tumonbaed is head of Bishkekasphaltservice. Investigative journalists also identified relatives of the head of state in the Vostokelectro company. Japarov&#x27;s niece Perizat Japarova holds the position of Deputy Head of the Digital Development Department of the Presidential Administration. Since the start of Japarov&#x27;s presidency, Kyrgyzstan has dropped 70 positions in Reporters Without Borders&#x27; freedom of speech rating - from 72nd in 2022 to 144 in 2025.",
    "published": "3 weeks ago"
  },
  {
    "title": "List of leaders of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_leaders_of_Kyrgyzstan",
    "snippet": "After the death of Joseph Stalin, the level of repression declined and less surveillance from the KGB and Moscow led to an increase in the importance of tribes in communal affairs.",
    "published": "October 3, 2025"
  },
  {
    "title": "Chairman of the Cabinet of Ministers of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Kyrgyzstan",
    "snippet": "Following election protests, <strong>Boronov resigned and was replaced on 6 October 2020 by opposition party founder Sadyr Japarov and again by Artem Novikov</strong> on 14 November 2020 to 3 February 2021.",
    "published": "July 17, 2025"
  },
  {
    "title": "Kyrgyz President Japarov Brings Together All Five Of Country's Former Leaders",
    "url": "https://www.rferl.org/a/kyrgyzstan-japarov-five-former-leaders/32277505.html",
    "snippet": "The past six presidents of Kyrgyzstan: <strong>Askar Akaev, Kurmanbek Bakiev, Roza Otunbaeva, Almazbek Atambaev, Sooronbay Jeenbekov, and Sadyr Japarov</strong>. ... Kyrgyz President Sadyr Japarov said he brought together all five former presidents of his Central ...",
    "published": "February 18, 2023"
  }
]