[
  {
    "title": "Jennifer Westacott AC",
    "url": "https://www.wesfarmers.com.au/who-we-are/leadership-team/profile/jennifer-westacott",
    "snippet": "Jennifer was Chief Executive of the Business Council of Australia, the leading forum for the heads of over 100 of Australia&#x27;s top companies to contribute to public policy debate, from February 2011 until October 2023. Prior to that, she was a board director and lead partner at KPMG, heading its Sustainability, Climate Change and Water practice, and its NSW State Government practice.",
    "published": null
  },
  {
    "title": "Jennifer Westacott - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jennifer_Westacott",
    "snippet": "Jennifer Westacott AC is an Australian business executive. She served as the chief executive of the Business Council of Australia (BCA) from 2011 to 2023. She is the current chancellor of Western Sydney University. She grew up in <strong>Springfield in New South Wales, Australia</strong> and completed her secondary ...",
    "published": "June 10, 2025"
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "From 2005 to 2011 Jennifer was senior partner at KPMG, heading up the firm’s Sustainability, Climate Change and Water practice and its NSW State Government practice.",
    "published": null
  },
  {
    "title": "The boss of the Business Council defies the stereotype of the blue-blooded big shot",
    "url": "https://www.smh.com.au/politics/federal/the-boss-of-the-business-council-defies-the-stereotype-of-the-blue-blooded-big-shot-20180322-p4z5l6.html",
    "snippet": "Craig Knowles, a Carr government cabinet minister who worked with Westacott, says his former departmental secretary shared little about her personal background but worked hard. And made enemies. &quot;She had a great strategic mind,&quot; says Knowles. &quot;The problem I think for Jennifer was she probably bruised a few people along the way.",
    "published": "March 24, 2018"
  },
  {
    "title": "Jennifer Westacott - QueerBio.com",
    "url": "https://queerbio.com/wiki/index.php?title=Jennifer_Westacott",
    "snippet": "Jennifer Westacott · 1 Country · 2 Birth - Death · 3 Occupation · 4 Description · 5 See Also · 6 Further Reading/Research · Australia · Business · Chief Executive, Business Council of Australia since 2011. Former Senior Partner, KPMG (2005-2011). Prior to that, was <strong>Director of Housing</strong> ...",
    "published": null
  }
]