[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "Mary Alexandra Earps MBE (born 7 March 1993) is an English professional footballer who plays as a <strong>goalkeeper for Première Ligue club Paris Saint-Germain</strong>. At the 2023 FIFA Women&#x27;s World Cup, she served as the vice captain for England, and received the Golden Glove award for best goalkeeper ...",
    "published": "3 days ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "<strong>Before arriving at Manchester United, Earps spent time playing for hometown club Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg</strong>. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in ...",
    "published": null
  },
  {
    "title": "Mary Earps MBE (@maryearps) - Instagram",
    "url": "https://www.instagram.com/maryearps/",
    "snippet": "See Instagram photos and videos from <strong>Mary</strong> <strong>Earps</strong> MBE (@maryearps)",
    "published": null
  },
  {
    "title": "Mary Earps stuns England teammates by retiring from international football | Mary Earps | The Guardian",
    "url": "https://www.theguardian.com/football/2025/may/27/england-goalkeeper-mary-earps-retires-from-international-football-before-euro-2025",
    "snippet": "Mary Earps won 53 caps for England in an <strong>eight-year international career</strong>. Photograph: Will Matthews/PA ... Mary Earps has shocked her England teammates by retiring from international football with immediate effect, saying it is the right time ...",
    "published": "June 5, 2025"
  },
  {
    "title": "Mary Earps has announced her decision to retire from international football",
    "url": "https://www.englandfootball.com/articles/2025/May/27/mary-earps-retires-from-international-football-20252705",
    "snippet": "The decision marks the end of a memorable <strong>eight-year international career</strong> and comes as the Lionesses prepare for the culmination of their UEFA Women’s Nations League group stage campaign.",
    "published": null
  }
]