[
  {
    "title": "World Athletics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/World_Athletics",
    "snippet": "There are <strong>four committees: the Cross Country Committee, the Race Walking Committee, the Technical Committee, and the Women&#x27;s Committee</strong>. A further three committees were launched in 2019: Development, Governance and Competitions. The governance structure is outlined in the World Athletics ...",
    "published": "1 week ago"
  },
  {
    "title": "World Athletics sets ambitious targets with three-year gender leadership strategy | World Athletics",
    "url": "https://worldathletics.org/women-in-athletics/news/world-athletics-targets-gender-leadership-strategy",
    "snippet": "Develop gender leadership and ... for Athletics) <strong>The Gender Leadership Strategy 2025-2027 builds on the previous strategy and work done since the establishment of the Gender Leadership Taskforce in 2017.</strong>...",
    "published": null
  },
  {
    "title": "World Athletics | Council",
    "url": "https://worldathletics.org/about-iaaf/structure/council",
    "snippet": "Council has the powers and responsibilities to develop the World Plan for athletics and approve and review the World Athletics Strategic Plan; adopt, amend and repeal rules and regulations; decide all matters relating to the competition calendar and World Athletics competitions, world records, bidding procedures and selection of host cities; develop policies for training and appointing technical officials; review and monitor the global athletics development programme; appoint Commissions and Working Groups and make recommendations to Congress on membership of various independent panels and bodies of World Athletics.",
    "published": null
  },
  {
    "title": "World Athletics | Executive Board",
    "url": "https://worldathletics.org/about-iaaf/structure/executive-board",
    "snippet": "The Executive Board has responsibility for all decisions related to the business of World Athletics including developing and reviewing the World Athletics Strategic Plan; adopting and monitoring the annual plan and budget; appointing and monitoring the Chief Executive; financial planning and controlling income and expenditure; identifying and managing risks; and developing internal controls, organisational policies, procedures and systems (e.g., human resources, IT).",
    "published": null
  },
  {
    "title": "New Athletes' Commission members announced | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/athletes-commission-members-2025-2029",
    "snippet": "Les six sièges ouverts à l’élection en 2025 incluent celui de <strong>vice-président de la commission</strong>. Ce poste sera maintenant pourvu par un vote des membres de la commission, les élections étant achevées.",
    "published": null
  }
]