[
  {
    "title": "LFI « n’acceptera jamais l’entrisme religieux », assure Jean-Luc Mélenchon devant une commission d’enquête sur l’islamisme",
    "url": "https://www.lemonde.fr/politique/article/2025/12/06/lfi-n-acceptera-jamais-l-entrisme-religieux-assure-jean-luc-melenchon-devant-une-commission-d-enquete-sur-l-islamisme_6656279_823448.html",
    "snippet": "La <strong>France insoumise</strong> « n’acceptera jamais l’entrisme religieux », a assuré samedi 6 décembre Jean-Luc Mélenchon lors de son audition devant la commission d’enquête parlementaire sur des liens supposés entre mouvements politiques ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Melenchon.fr le blog — Jean-Luc Mélenchon Le blog",
    "url": "https://melenchon.fr/",
    "snippet": "<strong>Jean-Luc Mélenchon est intervenu pour revenir sur les mobilisations des agriculteurs, le 16 décembre 2025</strong>. Il [...] ... Le calendrier peut être une mèche longue pour les événements explosifs.",
    "published": "July 18, 2024"
  },
  {
    "title": "Jean-Luc Mélenchon ridiculise la commission d'enquête anti-LFI : retour sur le cours magistral du leader insoumis - L'insoumission",
    "url": "https://linsoumission.fr/2025/12/08/melenchon-audition-wauquiez/",
    "snippet": "Le 6 <strong>décembre 2025</strong>, Jean-Luc Mélenchon acceptait de se présenter devant la « commission d’enquête » anti-LFI destinée à faire croire à l’existence de liens entre la France insoumise et des groupes terroristes.",
    "published": "4 days ago"
  },
  {
    "title": "Jean-Luc Mélenchon - Actualités, vidéos et infos en direct",
    "url": "https://www.lemonde.fr/jean-luc-melenchon/",
    "snippet": "Publié le 20 <strong>décembre 2025</strong> à 07h00, modifié le 20 <strong>décembre 2025</strong> à 12h39 Olivier Pérou ... La commission d’enquête parlementaire, voulue par la droite pour viser La France insoumise, pointe dans son rapport le clientélisme du mouvement ...",
    "published": null
  },
  {
    "title": "Jean-Luc Mélenchon : actualités en direct et info en continu",
    "url": "https://www.nouvelobs.com/jean-luc-melenchon/",
    "snippet": "Le fondateur de La <strong>France insoumise</strong> était auditionné ce samedi par la commission d’enquête parlementaire sur les liens supposés entre mouvements politiques et réseaux islamistes.",
    "published": null
  }
]