[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "The PD was <strong>established in 2007 upon the merger of various centre-left parties which had been part of The Olive Tree list in the 2006 Italian general election</strong>, mainly the social democratic Democrats of the Left (DS), successor of the Italian Communist Party and the Democratic Party of the Left, ...",
    "published": "1 day ago"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "The party was <strong>founded in 2007 as a result of the convergence of the Democrats of the Left (direct heirs of the Italian Communist Party) and the Margherita (heir to part of Christian Democracy).</strong>",
    "published": null
  },
  {
    "title": "A Brief History of the Italian Democratic Party and Its (Declining) Support | SpringerLink",
    "url": "https://link.springer.com/chapter/10.1007/978-3-031-54059-2_2",
    "snippet": "The creation of the Democratic Party (PD), from a certain point of view, was the realisation of Moro’s and Berlinguer’s dream of the past century, the so-called Compromesso storico (“Historic Compromise”), an attempt to achieve an agreement between what had been the most popular political traditions in Italian society: progressive Catholicism on the one hand and socialism-communism on the other.",
    "published": null
  },
  {
    "title": "Democratic Party – Democratic and Progressive Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_–_Democratic_and_Progressive_Italy",
    "snippet": "Prior to the formation of the group, its name was that of the lead electoral list of the centre-left coalition in the 2022 Italian general election. In July 2022, the centre-right coalition was forecast to win a parliamentary absolute majority under the Rosatellum electoral law of 2017, which was pushed by the Democratic Party (PD) under Matteo Renzi&#x27;s leadership and was now rejected by the party under the leadership of Enrico Letta.",
    "published": "August 9, 2025"
  },
  {
    "title": "Democratic Party | political party, Italy | Britannica",
    "url": "https://www.britannica.com/topic/Democratic-Party-political-party-Italy",
    "snippet": "…party, known simply as the Democratic Party (Partito Democratico), <strong>emerged when the DS merged with the centrist Daisy (Margherita) party</strong>. Soon afterward the FI joined with the AN to create the new center-right People of Freedom (Popolo della ...",
    "published": null
  }
]