[
  {
    "title": "Jashodaben Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jashodaben_Modi",
    "snippet": "<strong>Jashodaben Narendrabhai Modi</strong> (née Chimanlal Modi; born 1952) is an Indian former school teacher and the estranged wife of Narendra Modi, the Prime Minister of India. The couple were married in 1968 when she was about 16 and Modi was 18. A couple years into the marriage, her husband, Narendra ...",
    "published": "1 month ago"
  },
  {
    "title": "The relationship between Narendra Modi and his wife ...",
    "url": "https://www.facebook.com/100085231120558/posts/the-relationship-between-narendra-modi-and-his-wife-jashodaben-has-always-been-i/754862157364815/",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "Jashodaben Narendrabhai Modi: Latest News, Videos and Photos of Jashodaben Narendrabhai Modi | Times of India",
    "url": "https://timesofindia.indiatimes.com/topic/jashodaben-narendrabhai-modi",
    "snippet": "<strong>Jashodaben Modi</strong> is the ex wife of Prime Minister Narendra Modi. She had an arranged marriage with Modi in 1968.",
    "published": "September 28, 2023"
  },
  {
    "title": "Meet Jashodaben Chimanlal: The Estranged Wife of Narendra Modi",
    "url": "https://www.bbntimes.com/society/meet-jashodaben-chimanlal-the-estranged-wife-of-narendra-modi",
    "snippet": "<strong>Jashodaben Chimanlal</strong>, also known as Jashodaben Narendrabhai Modi, is a retired Indian schoolteacher whose life has been thrust into the public eye as the estranged wife of India’s Prime Minister, Narendra Modi.",
    "published": "May 18, 2025"
  },
  {
    "title": "India PM Narendra Modi's wife survives fatal car crash",
    "url": "https://www.bbc.com/news/world-asia-india-42971500",
    "snippet": "Indian prime minister Narendra Modi&#x27;s estranged wife, <strong>Jashodaben</strong>, survived a fatal crash on Wednesday on a national highway, police confirmed to the BBC.",
    "published": "February 7, 2018"
  }
]