[
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "Throughout his career, he has remained a close ally to the former Presidents Néstor Kirchner and Cristina Fernández de Kirchner. Between 2021 and 2023, he served as Argentina&#x27;s <strong>Minister of Security</strong> in the cabinet of President Alberto Fernández. He has held several cabinet positions under ...",
    "published": "November 15, 2025"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Aníbal Fernández is a candidate for <strong>governor of the Province of Buenos Aires and currently chief of staff</strong> of the Minister’s Cabinet for the presidency. Previously, he served in the National Senate as representative for the province of Buenos ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "From 2021 to 2023, he served as Argentina&#x27;s <strong>Minister of Security</strong> under President Alberto Fernández. He has held many important government jobs under three different presidents. He worked in these roles for more than nine years in total.",
    "published": null
  },
  {
    "title": "Aníbal Fernández (@FernandezAnibal) / X",
    "url": "https://twitter.com/FernandezAnibal",
    "snippet": "JavaScript is not available · We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center · Help Center · Terms of Service Privacy Policy ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q2857937",
    "snippet": "Aníbal Fernández, nuevo abogado de Cristóbal López: lo defenderá en las causas civiles (Spanish)",
    "published": null
  }
]