[
  {
    "title": "Juventus Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_Stadium",
    "snippet": "<strong>Juventus Stadium</strong> (Italian pronunciation: [juˈvɛntus ˈstaːdjum]), known for sponsorship reasons as the Allianz Stadium since July 2017, sometimes simply known in Italy as the Stadium (Italian: Lo Stadium), is an all-seater football stadium in the Vallette borough of Turin, Italy, and the ...",
    "published": "October 14, 2025"
  },
  {
    "title": "Allianz Stadium Juventus",
    "url": "https://www.juventus.com/en/allianz-stadium/",
    "snippet": "<strong>Allianz Stadium</strong>, the home of Juventus FC and Bianconeri. Directions and access, accreditation and welcoming activities.",
    "published": null
  },
  {
    "title": "Our Home: Allianz Stadium Juventus",
    "url": "https://www.juventus.com/en/allianz-stadium/our-home",
    "snippet": "Discover more about the <strong>Allianz Stadium</strong>, the home of Juventus Football Club, a real black and white jewel.",
    "published": null
  },
  {
    "title": "Where is Juventus Stadium: Home of Juventus FC and Iconic Venue for Major Football Events on Map Lat Long Coordinates",
    "url": "https://www.latlong.net/place/juventus-stadium-home-of-juventus-fc-and-iconic-venue-for-major-football-events-33778.html",
    "snippet": "<strong>Juventus Stadium</strong>, also known as Allianz Stadium, is a world-class sports venue located in the Area12 Shopping Center at Corso Gaetano Scirea, 50, Torino, Italy. With a seating capacity of 41,507, this state-of-the-art stadium offers an exceptional experience for football fans and visitors alike.",
    "published": null
  },
  {
    "title": "Allianz Stadium (Juventus Stadium) - Turin - The Stadium Guide",
    "url": "https://www.stadiumguide.com/juventusstadium/",
    "snippet": "<strong>Allianz Stadium</strong>, previously known as Juventus Stadium, replaced Juventus’ old Stadio Delle Alpi, which had only been the home of the club since 1990.",
    "published": "June 9, 2020"
  }
]