[
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "In July 2023, it was reported that Burns&#x27;s email account had been hacked in a breach of Microsoft emails by the Chinese government. On February 3, 2025, The Cohen Group announced that Burns will rejoin as a <strong>vice chair</strong> on February 17, 2025.",
    "published": "September 26, 2025"
  },
  {
    "title": "Ambassador Nicholas Burns to Rejoin The Cohen Group as a Vice Chair | The Cohen Group",
    "url": "https://cohengroup.net/ambassador-nicholas-burns-rejoin-cohen-group-vice-chair",
    "snippet": "Ambassador Burns will rejoin the firm as a <strong>Vice Chair on February 17, 2025</strong>. Prior to his work in China, Ambassador Burns was a Senior Counselor at The Cohen Group for 12 years following an extraordinary career in the US Foreign Service.",
    "published": "February 3, 2025"
  },
  {
    "title": "R. Nicholas Burns, U.S. Ambassador, Says China Is Aligned With ‘Agents of Disorder’ - The New York Times",
    "url": "https://www.nytimes.com/2025/01/10/business/nicholas-burns-ambassador-china.html",
    "snippet": "R. Nicholas Burns, the top U.S. diplomat in Beijing, says <strong>the Biden administration is making a final push to urge China to reconsider its tilt toward Russia, Iran and North Korea</strong>.",
    "published": "January 10, 2025"
  },
  {
    "title": "Nicholas Burns | The Belfer Center for Science and International Affairs",
    "url": "https://www.belfercenter.org/person/nicholas-burns",
    "snippet": "3, 2025 · It’s a remarkable, historic success that 80 years after World War II, Japan and Germany have become vital U.S. allies.&amp;amp;nbsp;But as Beijing... Professor Nicholas Burns is the Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations at Harvard University’s Kennedy School of Government.",
    "published": null
  },
  {
    "title": "R Nicholas Burns - The New York Times",
    "url": "https://www.nytimes.com/topic/r-nicholas-burns",
    "snippet": "“Beijing proclaims that the East is rising, and the West is in decline,” said R. Nicholas Burns, President Biden’s nominee to be the <strong>U.S. ambassador to China</strong>.",
    "published": null
  }
]