[
  {
    "title": "Government and Politics - About Greece",
    "url": "https://www.mfa.gr/usa/en/about-greece/government-and-politics/",
    "snippet": "Greece (Ελλάδα, Hellada or Hellas), officially the Hellenic Republic (Ελληνική Δημοκρατία, Elliniki Dimokratia) is a <strong>Parliamentary Republic</strong>. The President, elected by Parliament every five years, is Head of State. The Prime Minister is Head of Government.",
    "published": null
  },
  {
    "title": "Politics of Greece - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Greece",
    "snippet": "Greece is a <strong>parliamentary representative democratic republic</strong>, where the President of Greece is the head of state and the Prime Minister of Greece is the head of government within a multi-party system. Legislative power is vested in both the government and the Hellenic Parliament.",
    "published": "October 14, 2025"
  },
  {
    "title": "Greece – EU country | European Union",
    "url": "https://european-union.europa.eu/principles-countries-history/eu-countries/greece_en",
    "snippet": "Greece is a <strong>parliamentary republic</strong>. The prime minister who is the head of government has the most political power. The president is the head of state and has largely ceremonial duties.",
    "published": null
  },
  {
    "title": "Political System - Greece",
    "url": "https://athens.embassy.qa/en/greece/political-system",
    "snippet": "HE Mr. Kyriakos Mitsotakis, is the new Greek Prime Minister, after the victory of the New Democracy during the Parliamentary Elections held on 7/7/2019. He succeeded to announce an independent Government · The Greek Prime Minister announced the new Ministerial Council, where the Ministers ...",
    "published": null
  },
  {
    "title": "Greece: Government",
    "url": "https://globaledge.msu.edu/countries/greece/government",
    "snippet": "Mount Olympus is the highest point in Greece, and it was believed to be the home of the Olympian Gods and Goddesses. ... How Do I... ... Adopted: 1975; Constitution aims to protect religious freedom, define individual social rights, and dictate the structure and functions of the Greek government.",
    "published": null
  }
]