[
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "<strong>On July 22, 2013, ESPN (a subsidiary of the Walt Disney Company) announced that it had acquired ownership of the FiveThirtyEight website and brand</strong>, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming ...",
    "published": "1 week ago"
  },
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "In August 2010, the blog became a licensed feature of The New York Times online and was renamed FiveThirtyEight: Nate Silver&#x27;s Political Calculus. <strong>In July 2013, ESPN acquired FiveThirtyEight</strong>, hiring Silver as editor-in-chief and a contributor for ESPN.com; the new publication launched on March ...",
    "published": "November 19, 2025"
  },
  {
    "title": "Nate Silver – FiveThirtyEight",
    "url": "https://fivethirtyeight.com/contributors/nate-silver/",
    "snippet": "Nate Silver <strong>founded and was the editor in chief of FiveThirtyEight</strong>.",
    "published": null
  },
  {
    "title": "Nate Silver of FiveThirtyEight’s advice to founders | Fortune",
    "url": "https://fortune.com/2023/08/15/fivethirtyeight-nate-silver-advice-founders-disney-espn-abc-acquisition-departure/",
    "snippet": "Silver’s first commercial deal as a founder was to license FiveThirtyEight to the New York Times’ Upshot sectionfrom 2010 to 2013. When his three-year contract with the Times expired, Disney’s ESPN acquired the brand and website. In 2018, the site moved within the Disney portfolio to ABC News as ESPN revised its digital strategy.",
    "published": "August 15, 2023"
  },
  {
    "title": "MIT Sloan Sports Analytics Conference Speaker | Nate Silver",
    "url": "https://www.sloansportsconference.com/people/nate-silver",
    "snippet": "Nate Silver is the <strong>founder and former editor-in-chief (2008-2023)</strong> of FiveThirtyEight, which was published by The New York Times, ESPN, and ABC News. FiveThirtyEight first gained national attention during the 2008 presidential election, when ...",
    "published": null
  }
]