[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "He was the deputy in the National Assembly for the 4th constituency of Bouches-du-Rhône from 2017 to 2022 and <strong>led the La France Insoumise group in the National Assembly from 2017 to 2021</strong>. Mélenchon was previously elected as a Member of the European Parliament (MEP) in 2009 and reelected in 2014.",
    "published": "1 week ago"
  },
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "&#x27;France Unbowed&#x27; or &#x27;France in Revolt&#x27;) is a left-wing political party in France. It was <strong>launched in 2016</strong> by Jean-Luc Mélenchon, then a Member of the European Parliament (MEP) and former co-president of the Left Party (PG). It aims to implement the eco-socialist and democratic socialist programme ...",
    "published": "1 week ago"
  },
  {
    "title": "French elections: Who is Mélenchon and what does his Nupes alliance want?",
    "url": "https://www.bbc.com/news/world-europe-61737537",
    "snippet": "<strong>By corralling together the combined forces of Greens, Communists and Socialists with his own France Insoumise, he attracted 25.66% of the vote</strong>, a whisker behind the centrist Ensemble alliance of President Macron.",
    "published": "June 15, 2022"
  },
  {
    "title": "1 Jean-Luc Mélenchon and France Insoumise: the manufacturing of ...",
    "url": "https://discovery.ucl.ac.uk/10053910/1/P. Marliere-France Insoumise.pdf",
    "snippet": "Having diagnosed that social democracy was a spent force as a progressive · organisation (Mélenchon 2009), Mélenchon <strong>left the PS in 2008</strong> and launched the Left · Party (Parti de Gauche / PG). He was elected twice a member of the European ... This being said, Jean-Luc Mélenchon is no standard ...",
    "published": null
  },
  {
    "title": "France’s Jean-luc Mélenchon announces a “New popular union” with the capitalist Socialist Party - World Socialist Web Site",
    "url": "https://www.wsws.org/en/articles/2022/05/12/hyoh-m12.html",
    "snippet": "On Friday night, on the France2 news station, <strong>Jean-Luc Mélenchon announced the New Popular Ecological and Social Union (NUPES) between his party, Unsubmissive France (La France Insoumise—LFI), and the Socialist Party (PS).</strong>",
    "published": null
  }
]