[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: one to do business in the United States and legally named Regency Entertainment (USA), Inc., one to do business overseas and legally named Monarchy Enterprises S.á.r.l.",
    "published": "2 days ago"
  },
  {
    "title": "Regency Enterprises - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Regency_Enterprises",
    "snippet": "Regency Enterprises is an American film production company formed in 1991 as a joint venture between <strong>Arnon Milchan, Scriba &amp; Deyle and Canal+</strong> to finance 20 films in five years, with New Regency Productions acting as its production and sales arm.",
    "published": "2 weeks ago"
  },
  {
    "title": "Regency Enterprises | Golden",
    "url": "https://golden.com/wiki/Regency_Enterprises-PPNRR5",
    "snippet": "Regency Enterprises is a <strong>privately held</strong> company involved in the video production industry and founded on January 1, 1982 by Arnon Milchan and Joseph Patrick Grace.",
    "published": null
  },
  {
    "title": "Regency Enterprises | Corus Entertainment Fandom | Fandom",
    "url": "https://corusentertainment.fandom.com/wiki/Regency_Enterprises",
    "snippet": "Regency Television is a <strong>joint venture between Regency Enterprises and Fox Television Studios</strong> founded in 1998.",
    "published": "October 29, 2024"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "Milchan has also successfully diversified his company’s activities within the sphere of entertainment, most specifically in the realm of television through Regency Television (“Malcom in the Middle” and “The Bernie Mac Show”), and sports where the company was once the largest shareholder of PUMA, the worldwide athletic apparel and show conglomerate based in Germany, which was later sold after a successful re-branding in 2003.",
    "published": null
  }
]