[
  {
    "title": "Business Council of Australia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Business_Council_of_Australia",
    "snippet": "It was formed in 1983 by the merger of the Business Roundtable – a spin-off of the Committee for Economic Development of Australia – and the Australian Industry Development Association. The organisation is <strong>headquartered in Melbourne with offices in Sydney and Canberra</strong>.",
    "published": "April 1, 2025"
  },
  {
    "title": "Business Council of Australia",
    "url": "https://www.bca.com.au/",
    "snippet": "We bring together the expertise and influence of our members to strengthen the Australian quality of life and ensure more opportunities for all Australians. ... The Business Council of Australia drives the nation’s economic agenda, leveraging the expertise of Australia’s leading businesses to advocate for policy solutions that lift living standards for all Australians.",
    "published": "August 26, 2024"
  },
  {
    "title": "Business Council of Australia | LinkedIn",
    "url": "https://au.linkedin.com/company/business-council-of-australia",
    "snippet": "Business Council of Australia | 11,093 followers on LinkedIn. For a stronger Australia. | The BCA represents Australia’s largest employers, advocating for good policy on behalf of the business community and the Australians they employ. Our online community guidelines can be found at: ...",
    "published": null
  },
  {
    "title": "Business Council of Australia | Melbourne VIC | Facebook",
    "url": "https://www.facebook.com/BCAcomau/",
    "snippet": "<strong>Business Council of Australia, Melbourne</strong>. 15,768 likes · 6 talking about this · 5 were here. Authorised by W. Black, <strong>Business Council of Australia, Melbourne</strong>.",
    "published": null
  },
  {
    "title": "Client Challenge",
    "url": "https://www.bca.com.au/about/",
    "snippet": "JavaScript is disabled in your browser · Please enable JavaScript to proceed · A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser",
    "published": null
  }
]