[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "A versatile player, he primarily plays as a central midfielder, but is also capable of playing as a defensive midfielder, centre-back, or full-back. He began his senior career at <strong>Bayern Munich</strong>, playing mostly in the club&#x27;s reserve side before his 2013 transfer to Bayer Leverkusen.",
    "published": "2 days ago"
  },
  {
    "title": "Emre Can",
    "url": "https://www.bvb.de/de/en/teams/football/player/emre-can.html",
    "snippet": "Can played for Eintracht’s youth team for three years (2006 to 2009) before moving to Bayern Munich’s U17 team. In Munich, he made his first appearance for the senior team on 12 August 2012 in a 2-1 Super Cup win against Borussia Dortmund. In 2013/14, he joined Bayer 04 Leverkusen and was signed by Liverpool just one year later, where he played a total of 167 games between 2014 and 2018.",
    "published": null
  },
  {
    "title": "Liverpool career stats for Emre Can - LFChistory - Stats galore for Liverpool FC!",
    "url": "https://www.lfchistory.net/players/player/profile/1272",
    "snippet": "He had to serve an apprenticeship with Bayern’s Regional League South team before being named in a senior matchday squad for the first time for the home march against Schalke at the end of February 2012. Then came four successive Bundesliga appearances towards the end of the next season and his first senior Bayern goal, the only strike of a home match against SC Freiburg on 27 April 2013. He had also played in the German Supercup match against Borussia Dortmund at the start of the season when Bayern beat their fierce rivals 2-1 at the Allianz Arena in front of a crowd of nearly 70,000.",
    "published": null
  },
  {
    "title": "Emre Can | EA Sports FC wiki | Fandom",
    "url": "https://easportsfc.fandom.com/wiki/Emre_Can",
    "snippet": "A versatile player, Can has also played as a defensive midfielder, centre back and full back. He began his senior career at <strong>Bayern Munich</strong>, playing mostly in the club&#x27;s reserve side before transferring to Bayer Leverkusen in 2013.",
    "published": "October 29, 2024"
  },
  {
    "title": "Emre Can | Borussia Dortmund | Player Profile | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/player/emre-can",
    "snippet": "Borussia Dortmund · Nationality · DEU , TUR · 12.01.1994 31 years · Height186 cm · Weight86 kg · Goals · 1 · Assists · 0 · Penalties · 1 · Penalties scored · 1 · Shots on goal · 2 · Woodwork · 0 · Tackles won · 19 · Aerial duels won · 6 · Fouls ·",
    "published": null
  }
]