[
  {
    "title": "Debra Elmegreen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Debra_Elmegreen",
    "snippet": "Debra Meloy Elmegreen (born November 23, 1952 in South Bend, Indiana) is an American astronomer. She was the first woman to graduate from Princeton University with a degree in astrophysics, and she was the first female post-doctoral researcher at the Carnegie Observatories.",
    "published": "December 25, 2024"
  },
  {
    "title": "Debra Elmegreen - Poughkeepsie, New York, United States | Professional Profile | LinkedIn",
    "url": "https://www.linkedin.com/in/debra-elmegreen-9ab1552a/",
    "snippet": "Past President, International Astronomical Union; Professor Emerita of Astronomy, Vassar College · Debra Meloy Elmegreen was Professor of Astronomy on the Maria Mitchell Chair in the Department of Physics and Astronomy for 37 years and is now Professor Emerita.",
    "published": null
  },
  {
    "title": "Debra Meloy Elmegreen ￼",
    "url": "http://facultysites.vassar.edu/elmegree/Site/Welcome.html",
    "snippet": "Dr. Elmegreen is Professor of Astronomy on the Maria Mitchell Chair and Chair of the Department of Physics and Astronomy at Vassar College in Poughkeepsie, New York. She has been a member of the faculty since 1985. Her research interests include structure, interactions, and star formation in galaxies in the local universe and at high redshift.",
    "published": null
  },
  {
    "title": "Debra Elmegreen (0000-0002-1392-3520)",
    "url": "https://orcid.org/0000-0002-1392-3520",
    "snippet": "Please enable JavaScript to continue using this application",
    "published": null
  },
  {
    "title": "Debra Elmegreen - Society for Science",
    "url": "https://www.societyforscience.org/alumni/notable/debra-elmegreen/",
    "snippet": "Barrier-breaking astrophysicist Debra Elmegreen competed in the 1971 STS and 1970 ISEF. In her career, she has served as a professor of astronomy at Vassar College and president of the International Astronomical Union and American Astronomical Society. She and her husband study galaxy evolution and discovered Little Blue Dots, a new type of galaxy.",
    "published": "March 4, 2022"
  }
]