[
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "He is <strong>leading the SAF against the Rapid Support Forces (RSF) in the ongoing Sudanese civil war</strong>. Al-Burhan survived an assassination attempt in July 2024. Abdel Fattah al-Burhan was born in 1960 in the village of Gandatu in northern Sudan, to a Sufi Ja&#x27;ali family.",
    "published": "3 weeks ago"
  },
  {
    "title": "Al Burhan insists RSF must be dismantled and calls for return of Sudan's old flag | The National",
    "url": "https://www.thenationalnews.com/news/mena/2025/12/02/al-burhan-insists-rsf-must-be-dismantled-and-calls-for-return-of-sudans-old-flag/",
    "snippet": "<strong>Sudanese Armed Forces chief</strong> Gen Abdel Fattah Al Burhan insisted he will not consider any peace proposal that fails to dismantle the paramilitary Rapid Support Forces.",
    "published": "2 weeks ago"
  },
  {
    "title": "Abdel Fattah al-Burhan - BBC News",
    "url": "https://www.bbc.com/news/topics/cg338nl57emt",
    "snippet": "Gen Burhan&#x27;s army has been fighting a brutal war against the Rapid Support Forces since April.",
    "published": null
  },
  {
    "title": "Abdel Fattah al-Burhan | Sudanese politician | Britannica",
    "url": "https://www.britannica.com/biography/Abdel-Fattah-al-Burhan",
    "snippet": "Other articles where Abdel Fattah al-Burhan is discussed: Sudan: Transition: Abdel Fattah al-Burhan, who had been leading the military-led transition council, was <strong>named president</strong>.",
    "published": null
  },
  {
    "title": "Norway says no new U.S. Sudan truce plan after Burhan outburst - Sudan Tribune",
    "url": "https://sudantribune.com/article/307565",
    "snippet": "November 27, 2025 (PORT SUDAN) – A senior Norwegian envoy said on Thursday the United States has tabled no new truce proposals for Sudan, a clarification welcomed by <strong>army chief and Sovereign Council head</strong> Abdel Fattah al-Burhan after he angrily ...",
    "published": "3 weeks ago"
  }
]