[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "In 1995, he was appointed Simonyi ... of some scientific field&quot;, and that its first holder should be Richard Dawkins. He held that <strong>professorship from 1995 until 2008.</strong>...",
    "published": "1 week ago"
  },
  {
    "title": "Richard Dawkins: A Biography | Discovery Institute",
    "url": "https://www.discovery.org/a/10291/",
    "snippet": "The most readily recognizable figure in the Darwin debate, Dawkins <strong>retired in 2008 as Professor for Public Understanding of Science at Oxford University</strong>, a position he held from 1995, by which time he had effectively discontinued his career ...",
    "published": "October 15, 2024"
  },
  {
    "title": "Richard Dawkins | Biography, Books, The God Delusion, The Selfish Gene, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Richard-Dawkins",
    "snippet": "(2006) and The Enemies of Reason (2007) and celebrating the achievements of Darwin in The Genius of Charles Darwin (2008). Sex, Death, and the Meaning of Life (2012) explores the implications of living without religious faith. In the memoir An Appetite for Wonder: The Making of a Scientist (2013), Dawkins chronicled his life up to the publication of The Selfish Gene. A second volume of memoir, Brief Candle in the Dark: My Life in Science (2015), recorded episodes from the latter part of his career. ... NPR - Atheist Richard Dawkins Celebrates Reason, Ridicules Faith (Nov.",
    "published": "July 15, 2009"
  },
  {
    "title": "Richard Dawkins | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/richarddawkins/",
    "snippet": "One of the most respected scientists ... the catalyst who galvanizes it. From 1995 to 2008 Richard Dawkins was the <strong>Charles Simonyi Professor of the Public Understanding of Science at Oxford University</strong>....",
    "published": "April 21, 2022"
  },
  {
    "title": "Professor Richard Dawkins FRS",
    "url": "https://royalsociety.org/people/richard-dawkins-11316/",
    "snippet": "Richard is a prominent scientist, having <strong>published bestselling books on genetics and evolution, including The Selfish Gene (1976), The Blind Watchmaker (1986)</strong> — with the latter winning a number of awards.",
    "published": null
  }
]