[
  {
    "title": "Leadership - IAU",
    "url": "https://www.iau-aiu.net/Leadership",
    "snippet": "About the Executive Leadership Program (ELP) The IAU is pleased to announce that the third edition of the IAU Executive Leadership Programme (ELP), scheduled to run from Autumn 2025 to 2026, is now accepting applications.",
    "published": null
  },
  {
    "title": "Leadership — International Association of Universities",
    "url": "https://iau.global/leadership",
    "snippet": "IAU at the 2025 Magna Charta Observatory Conference · Executive Leadership Programme (ELP) Meeting in Kigali · Advancing Fair, Transparent, and Cross-border Recognition of Higher Education Qualifications · What Role for Universities in Democracy? Application Deadline Extended: ELP 2025-2026 ·",
    "published": null
  },
  {
    "title": "Apply Now: Executive Leadership Programme (ELP) — International Association of Universities",
    "url": "https://iau.global/news/executive-leadership-programme-elp24-25",
    "snippet": "The 2024-2025 cohort will begin at the IAU 2024 International Conference in Tokyo, Japan and will continue through the IAU 2025 International Conference to be held in Autumn 2025. The ELP will meet in person and online over the course of one year. Each module is complimented by Action Leadership Groups, separated into current and emerging leaders for true peer-to-peer exchange.",
    "published": "August 8, 2025"
  },
  {
    "title": "Executive Leadership Programme — International Association of Universities",
    "url": "https://iau.global/elp",
    "snippet": "<strong>Develop Effective Teams</strong>: Explore leadership expectations and improve interpersonal management skills to unlock the full potential of diverse high-performing teams. Build a Global Network of Peers: Create long-term partnerships, connect with ...",
    "published": null
  },
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "Hilligje van’t Land serves the global higher education community as <strong>Secretary General of the International Association of Universities</strong> (IAU) - a global NGO with UNESCO Associate Status. The IAU will celebrate its 75th Anniversary in 2025. Dr van’t Land fosters the key role of higher education ...",
    "published": null
  }
]