[
  {
    "title": "Coraggio Italia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Coraggio_Italia",
    "snippet": "Coraggio Italia (lit. &#x27;Courage Italy&#x27;, also translatable as &#x27;Cheer up Italy&#x27;, CI) is a liberal-conservative political party in Italy, led by <strong>Luigi Brugnaro</strong>. In February 2021, amid the formation of Mario Draghi&#x27;s national unity government, Cambiamo!",
    "published": "1 month ago"
  },
  {
    "title": "Coraggio Italia | Historica Wiki | Fandom",
    "url": "https://historica.fandom.com/wiki/Coraggio_Italia",
    "snippet": "The party&#x27;s co-founder <strong>Giovanni Toti</strong> said that it was time for the center-right to move on from Berlusconi, and the party attracted defectors from Cambiamo!, Identity and Action, Lega Nord, the Five Star Movement, and the Democratic Center.",
    "published": null
  },
  {
    "title": "Emilia-Romagna Coraggiosa | Elezioni regionali 2020 in Emilia-Romagna",
    "url": "https://www.coraggiosa.it/",
    "snippet": "Il 26 Gennaio 2020, alle elezioni regionali vota per un Emilia-Romagna Coraggiosa, ecologista, progressista, femminista, che dovrà affrontare nuove sfide epocali come l’emergenza climatica e la crescita delle diseguaglianze. Diamoci da fare!",
    "published": "February 18, 2020"
  },
  {
    "title": "Veronica Crisafulli - Sisters Founders | LinkedIn",
    "url": "https://www.linkedin.com/in/veronica-crisafulli-03192012a/",
    "snippet": "“Veronica è una forza propulsiva, sempre proiettata a rendere concrete idee che possano fare stare bene le persone. Coraggiosa (non ha paura di fallire), segue il suo istinto creativo e si fa ispirare dai grandi personaggi della storia imprenditoriale. Con lei ogni frase ti porta a fare curve che aprono su un mondo dove vuole che tu stia bene, ogni idea ti parla di innovazione e ogni parola ti lancia in un futuro ideale.",
    "published": null
  },
  {
    "title": "Our Campaigns - Political Party - Emilia Romagna Coraggiosa (ERC)",
    "url": "https://www.ourcampaigns.com/PartyDetail.html?PartyID=9300",
    "snippet": "New User Account",
    "published": null
  }
]