[
  {
    "title": "Peter Norvig is stepping back from Google after 20 years",
    "url": "https://searchengineland.com/peter-norvig-is-stepping-back-from-google-after-20-years-375108",
    "snippet": "The announcement said “<strong>artificial intelligence expert Peter Norvig is joining the Stanford Institute for Human-Centered AI this fall as a Distinguished Education Fellow</strong>, with the task of developing tools and materials to explain the key concepts ...",
    "published": "October 17, 2022"
  },
  {
    "title": "Fame | Peter Norvig net worth and salary income estimation Jul, 2025 | People Ai",
    "url": "https://peopleai.com/fame/identities/peter-norvig",
    "snippet": "Are you also wondering how much money is Peter Norvig making on Youtube, Twitter, Facebook and Instagram? Or, Peter Norvig&#x27;s net worth in US Dollar Jul, 2025? Peter Norvig salary income and net worth data provided by People Ai provides an estimation for any internet celebrity&#x27;s real salary ...",
    "published": null
  },
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "Time magazine has chosen &quot;<strong>Architects of AI</strong>&quot; as its Person of the Year 2025.",
    "published": "1 week ago"
  },
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Peter Norvig (born 14 December 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google. Norvig is the co-author with Stuart J. Russell of the most ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Norvig - AI for Good",
    "url": "https://aiforgood.itu.int/speaker/peter-norvig/",
    "snippet": "Peter Norvig is a Director of Research at <strong>Google Inc</strong>. Previously he was head of Google’s core search algorithms group, and of NASA Ames’s Computational Sciences Division, making him NASA’s senior computer scientist.",
    "published": "March 25, 2025"
  }
]