[
  {
    "title": "From Intensification to Sustainability? Political Leadership and Agricultural Transformation in Ethiopia",
    "url": "https://www.mdpi.com/2073-445X/14/12/2406",
    "snippet": "Submission received: 15 October ... Published: 11 December 2025 · (This article belongs to the Special Issue Feature Papers for the ‘Land Socio-Economic and Political Issues’ Section: Achieving the Sustainable Development Goals—2nd Edition) ... Ethiopia achieved a remarkable ...",
    "published": "5 days ago"
  },
  {
    "title": "Politics - ENA English - ENA",
    "url": "https://www.ena.et/web/eng/politics",
    "snippet": "Addis Ababa, December 3, 2025—Ethiopia remains firmly committed to supporting the development of a strong, modern and integrated African statistical system that drives the continent’s development goals, <strong>Deputy Prime Minister Temesgen Tiruneh</strong> said.",
    "published": null
  },
  {
    "title": "ENA - ENA English - ENA",
    "url": "https://www.ena.et/web/eng",
    "snippet": "ENDC Laying Foundation for Establishing Culture of Dialogue: Commissioner ... Addis Ababa, December 12, 2025 (ENA) —<strong>Ethiopian National Dialogue Commission (ENDC) has been laying foundation for establishing a culture of dialogue in the country</strong>, National Dialogue Commissioner Yonas Adaye told ENA.",
    "published": null
  },
  {
    "title": "Ethiopia situation update (5 February 2025) | ACLED",
    "url": "https://acleddata.com/update/ethiopia-situation-update-5-february-2025",
    "snippet": "For the first time since September ... From 15 December 2024 to 31 January 2025, <strong>ACLED records 97 battles between these actors, a 44% decrease compared to the previous seven weeks</strong>....",
    "published": null
  },
  {
    "title": "Politics | Latest Ethiopian Political News | Political News In Ethiopia",
    "url": "https://www.thereporterethiopia.com/latest-ethiopian-political-news/",
    "snippet": "Nardos Yoseph - October 18, 2025 · News · A comprehensive gender analysis of Ethiopia&#x27;s sixth general elections has exposed a stark deficit in women&#x27;s political leadership, revealing that women lead only one... Abraham Tekle - October 18, 2025 · News · Members of the House of Federation (HoF) have decried the exclusion of newly formed regional states and disputed territories from federal budget subsidy allocations.",
    "published": null
  }
]