[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "During his political career, Mélenchon crossed various tendencies of the French left, from Trotskyism in his youth to more moderate socialism, as <strong>he was in the Socialist Party for almost thirty years</strong>, occupying a place on the left wing of the party, before he began a companionship with the ...",
    "published": "1 week ago"
  },
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "La France Insoumise (LFI or FI; [la fʁɑ̃s ɛ̃sumiz], lit. &#x27;France Unbowed&#x27; or &#x27;France in Revolt&#x27;) is a left-wing political party in France. It was <strong>launched in 2016</strong> by Jean-Luc Mélenchon, then a Member of the European Parliament (MEP) and former co-president of the Left Party (PG).",
    "published": "5 days ago"
  },
  {
    "title": "Who is Jean-Luc Melenchon, the hard left-leader dubbed 'France's Jeremy Corbyn'? | World News | Sky News",
    "url": "https://news.sky.com/story/who-is-jean-luc-melenchon-the-hard-left-leader-dubbed-frances-jeremy-corbyn-13174952",
    "snippet": "Mr Melenchon has been a fixture in French left-wing politics for decades. <strong>He spent 30 years in the Socialist Party and held ministerial posts before breaking with the party in 2008.</strong>",
    "published": "July 8, 2024"
  },
  {
    "title": "Jean-Luc Mélenchon, the rabble-rouser leading the new French left – POLITICO",
    "url": "https://www.politico.eu/article/jean-luc-melenchon-rabble-rouser-leader-new-france-left/",
    "snippet": "<strong>In 2016, he founded the France Unbowed party</strong>. In a display of his canny political instinct, Mélenchon was able to benefit from the collapse of the Socialists after two historic defeats at presidential elections in 2017 and 2022.",
    "published": "May 22, 2022"
  },
  {
    "title": "1 Jean-Luc Mélenchon and France Insoumise: the manufacturing of ...",
    "url": "https://discovery.ucl.ac.uk/10053910/1/P. Marliere-France Insoumise.pdf",
    "snippet": "organisation (Mélenchon 2009), Mélenchon <strong>left the PS in 2008 and launched the Left · Party (Parti de Gauche / PG).</strong> He was elected twice a member of the European ... This being said, Jean-Luc Mélenchon is no standard left-winger.",
    "published": null
  }
]