[
  {
    "title": "David Hurley - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/David_Hurley",
    "snippet": "General David John Hurley (born 26 August 1953) is an Australian former politician and military officer. A senior officer in the Australian Army, he served as the 27th governor-general of Australia from 2019 to 2024. He was previously the <strong>38th governor of New South Wales from 2014 to 2019.</strong>",
    "published": "October 31, 2025"
  },
  {
    "title": "David Hurley - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/David_Hurley",
    "snippet": "He served as the <strong>Chief of Capability Development Group (2003–2007), the Chief of Joint Operations (2007–2008).</strong> He later served as the AF&#x27;s Vice Chief (2008–2011), and as Chief (2011–2014), in succession to Air Chief Marshal Angus Houston.",
    "published": "May 3, 2025"
  },
  {
    "title": "David Hurley facts for kids",
    "url": "https://kids.kiddle.co/David_Hurley",
    "snippet": "He also led important military groups, including the 1st Brigade. He became the first Chief of Capability Development Group. He also served as <strong>Chief of Joint Operations and Vice Chief of the Defence Force</strong>.",
    "published": null
  },
  {
    "title": "DAVID HURLEY – Living Legends of Aviation",
    "url": "https://living-legends-of-aviation.myshopify.com/pages/david-hurley",
    "snippet": "In 1976, he went to <strong>General Dynamics, Canadair Division</strong>, to launch the LearStar 600, later renamed the “Canadair Challenger.” In 1983, Hurley founded Flight Services Group or “FSG”. His entrepreneurial approach led to the successful growth of FSG, creating one of the world’s largest ...",
    "published": null
  },
  {
    "title": "David Hurley Stats, Info and performances",
    "url": "https://www.footballcritic.com/david-hurley/profile/247024",
    "snippet": "David Hurley is 25-years-old, born on 21 October 1998, and is a professional football player from Republic of Ireland. David Hurley is currently playing for Cobh Ramblers in First Division as a Midfielder ... The main positions in which David Hurley starts for Cobh Ramblers.",
    "published": null
  }
]