[
  {
    "title": "Olympedia – Lamine Diack",
    "url": "https://www.olympedia.org/athletes/899103",
    "snippet": "Diack became an IOC Member in 2000 as President of the IAAF. He <strong>served until 2013 after which he became an Honorary Member</strong>. During his tenure on the IOC, Diack was a member of several commissions, including Olympic Games Study, International Relations, and the 2009 Congress Commission.",
    "published": null
  },
  {
    "title": "Lamine Diack - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lamine_Diack",
    "snippet": "Lamine Diack (7 June 1933 – 3 December 2021) was a Senegalese businessman, sports administrator, and athlete. He was president of the International Association of Athletics Federations (IAAF) from <strong>1999 to 2015.</strong> He was the subject of numerous investigations into corruption during his tenure ...",
    "published": "October 18, 2025"
  },
  {
    "title": "Lamine Diack | MLSsoccer.com",
    "url": "https://www.mlssoccer.com/players/lamine-diack/",
    "snippet": "TRANSFER TRACKER STATUS: Loan ended The Colorado Rapids and FC Nantes have agreed to end Lamine Diack’s loan spell, the club announced Sunday.",
    "published": null
  },
  {
    "title": "LAMINE DIACK - Player Details TFF",
    "url": "https://tff.org/Default.aspx?pageId=526&kisiId=2294055",
    "snippet": "LAMINE DIACK - Turkish Football Federation Offical Site - National Teams, Leagues, Cups, Info Bank, Super League, Players, Coaches, Referees, Stadiums, Clubs, National Team Matches, Observers, Delegates, Week Infos",
    "published": null
  },
  {
    "title": "Lamine Diack (footballer)",
    "url": "https://grokipedia.com/page/Lamine_Diack_(footballer)",
    "snippet": "Lamine Diack joined MKE Ankaragücü on 25 July 2022, signing a <strong>multi-year contract that ran until 31 May 2025</strong>.[19] Building briefly on his European experience in the Balkans, Diack made his Süper Lig debut just two weeks later on 8 August ...",
    "published": null
  }
]