[
  {
    "title": "Apple announces executive transitions - Apple",
    "url": "https://www.apple.com/newsroom/2025/12/apple-announces-executive-transitions/",
    "snippet": "“She brings an extraordinary depth of experience and skill to the role, and will advance Apple’s important work all over the world. We are also pleased that Jennifer will be overseeing both the Legal and Government Affairs organizations, given the increasing overlap between the work of both teams and her substantial background in international affairs.",
    "published": "4 days ago"
  },
  {
    "title": "Apple announces chief operating officer transition - Apple",
    "url": "https://www.apple.com/newsroom/2025/07/apple-announces-chief-operating-officer-transition/",
    "snippet": "Apple today announced Jeff Williams will transition his role as chief operating officer later this month to <strong>Sabih Khan</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Apple is experiencing its biggest leadership shake-up since Steve Jobs died, with over half a dozen key executives headed for the exits | Fortune",
    "url": "https://fortune.com/2025/12/05/apple-executive-leadership-exodus-biggest-shakeup-since-steve-jobs-death/",
    "snippet": "John Gruber, who’s reported on Apple for decades and has deep ties within the company, wrote a pretty scathing critique of Dye, and in that same breath said employees are borderline “giddy” about Lemay—who has worked on every major Apple interface design since 1999, including the very first iPhone—taking over.",
    "published": "2 weeks ago"
  },
  {
    "title": "Apple won’t be the same in 2026 as these rising stars follow its biggest executive exodus in years | Fortune",
    "url": "https://fortune.com/2025/12/08/apple-executive-exodus-2026-new-leadership-team-rising-stars-tim-cook-successor/",
    "snippet": "Her experience in government affairs at Meta, where she managed relations with policymakers globally, makes her well-suited to handle Apple’s expanding regulatory obligations. <strong>Kevan Parekh</strong> assumed the chief financial officer role on Jan. 1, ...",
    "published": "2 weeks ago"
  },
  {
    "title": "What the heck is going on at Apple? | CNN Business",
    "url": "https://www.cnn.com/2025/12/06/tech/apple-tim-cook-leadership-changes",
    "snippet": "The changes come as critics say Apple, once a tech leader, is behind in the next big wave: artificial intelligence. For one of the world’s most valuable tech companies, a change in leadership could mean a change in how it conceives, designs and creates products used around the world every single day. “The only thing we can read into this is that we’re headed to a time of increased volatility for Apple,” said Robert Siegel, a longtime venture capitalist and lecturer at Stanford’s Graduate School of Business.",
    "published": "2 weeks ago"
  }
]