[
  {
    "title": "TU Dresden - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TU_Dresden",
    "snippet": "The main campus is located <strong>south of the city center, mostly in the area bordered by Nöthnitzer Straße, Fritz-Förster-Platz and Münchner Platz</strong>; the medical faculty can be found in the Johannstadt district. The faculty of forestry, formerly the Royal Saxon Academy of Forestry, resides in ...",
    "published": "4 days ago"
  },
  {
    "title": "Locations — TU Dresden — TU Dresden",
    "url": "https://tu-dresden.de/tu-dresden/campus/standorte?set_language=en",
    "snippet": "TU Dresden has two central locations <strong>in the city of Dresden - the TUD|Campus Südvorstadt and the TUD|Campus Johannstadt</strong>. There are also other locations such as the Botanical Garden and university …",
    "published": null
  },
  {
    "title": "Campus — TU Dresden — TU Dresden",
    "url": "https://tu-dresden.de/tu-dresden/campus?set_language=en",
    "snippet": "The main campus of TUD Dresden University of Technology is located <strong>south Dresden&#x27;s city centre</strong> and can be easily reached by bus (bus lines 61, 66, 85) and by tram (tram lines 3 and 8) or via the A17 highway (exit: “Dresden Südvorstadt”).",
    "published": null
  },
  {
    "title": "Contact — TU Dresden",
    "url": "https://tu-dresden.de/kontakt?set_language=en",
    "snippet": "Show map of this location. ... TUD Dresden University of Technology Sachgebiet 7.2 Nöthnitzer Str.",
    "published": null
  },
  {
    "title": "Dresden University of Technology - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/Dresden_University_of_Technology",
    "snippet": "The Dresden University of Technology (German: Technische Universität Dresden · ; TUD) is a university in <strong>Dresden, in Germany</strong>. It is the largest university in the state of Saxony and one of the ten largest universities in Germany with around ...",
    "published": "September 13, 2025"
  }
]