[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "After the Liberal-National coalition&#x27;s victory at the 2013 election, Morrison was appointed Minister for Immigration and Border Protection in the Abbott government, where he was responsible for implementing Operation Sovereign Borders. In a reshuffle the following year, he became Minister for Social Services, where he established the Robodebt scheme. He was later promoted to the role of Treasurer in September 2015, after Malcolm Turnbull replaced Abbott as prime minister.",
    "published": "1 week ago"
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "Morrison remained loyal to Turnbull when a challenge was mounted to his leadership of the party in August 2018 by Minister of Home Affairs Peter Dutton. Turnbull survived one vote on his leadership, but the party’s right wing was quickly able to compel his resignation. Dutton, however, fell short of the support needed to replace Turnbull as the party turned instead to Morrison as a compromise choice and elected him leader. On August 24 he became Australia’s 30th prime minister.",
    "published": "August 30, 2018"
  },
  {
    "title": "Scott Morrison: Rise and fall of Australia's divisive pandemic leader",
    "url": "https://www.bbc.com/news/world-australia-45292331",
    "snippet": "Mr Morrison was the country&#x27;s leader from 2018 to 2022, famously <strong>winning an against-odds election victory in 2019</strong> that he dubbed &quot;a miracle&quot;. But support for his Liberal-National government collapsed as the pandemic wore on.",
    "published": "January 23, 2024"
  },
  {
    "title": "Scott Morrison: timeline | naa.gov.au",
    "url": "https://www.naa.gov.au/explore-collection/australias-prime-ministers/scott-morrison/timeline",
    "snippet": "The Morrison government announced an increased emphasis on Pacific nations in Australia’s international relations, including <strong>increased defence cooperation and a $2 billion infrastructure development fund</strong>. The Royal Commission into Misconduct in the Banking, Superannuation and Financial Services ...",
    "published": null
  },
  {
    "title": "Morrison government - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Morrison_government",
    "snippet": "On 21 August, ahead of his 39th consecutive Newspoll loss, Turnbull announced a leadership spill, which he narrowly won against Peter Dutton. Turnbull resigned three days later after losing the confidence of his party room. Scott Morrison declared himself a candidate for leadership and won the resultant spill, defeating Dutton and Julie Bishop. He became Australia&#x27;s 30th Prime Minister.",
    "published": "3 weeks ago"
  }
]