[
  {
    "title": "Catherine Cesarsky: 2023 Centennial Medal Citation | The Harvard Kenneth C. Griffin Graduate School of Arts and Sciences",
    "url": "https://gsas.harvard.edu/news/catherine-cesarsky-2023-centennial-medal-citation",
    "snippet": "Born in France, Cesarsky earned her undergraduate degree in physics at the University of Buenos Aires and her <strong>PhD in astronomy</strong> at Harvard in 1971. After a postdoctoral fellowship at Caltech, she returned to Europe in 1974 to launch an illustrious career in the French Alternative Energies and ...",
    "published": null
  },
  {
    "title": "Harvard Astronomy Alum Catherine Cesarsky (PhD ’71) to receive Centennial Medal | Department of Astronomy",
    "url": "https://astronomy.fas.harvard.edu/news/harvard-astronomy-alum-catherine-cesarsky-phd-%E2%80%9971-receive-centennial-medal",
    "snippet": "Catherine Cesarsky has performed ... Born in France, she holds a Physics degree from University of Buenos Aires, and a <strong>PhD in Astronomy</strong> from Harvard University....",
    "published": null
  },
  {
    "title": "Dr Catherine Cesarsky | SKAO",
    "url": "https://www.skao.int/en/540/dr-catherine-cesarsky",
    "snippet": "<strong>After graduating from Harvard University with a PhD in astronomy in 1971</strong>, Prof Cesarsky was a research fellow at the California Institute of Technology for 3 years before joining and later taking the leadership of the astrophysics department of the Commissariat à l’énergie atomique et aux ...",
    "published": null
  },
  {
    "title": "Catherine Cesarsky - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Catherine_Cesarsky",
    "snippet": "Born in France, Catherine Cesarsky was largely raised in Argentina and she received a degree in physical sciences at the University of Buenos Aires. She <strong>graduated with a PhD in astronomy in 1971</strong> from Harvard University (Cambridge, Mass., USA).",
    "published": "December 25, 2024"
  },
  {
    "title": "Dr. Catherine Cesarsky | ESO",
    "url": "https://www.eso.org/public/about-eso/dg-office/ccesarsk/",
    "snippet": "Born in France, Catherine Cesarsky received a degree in Physical Sciences at the University of Buenos Aires and <strong>graduated with a PhD in Astronomy in 1971</strong> from Harvard University (Cambridge, Mass., USA). She worked at the California Institute of Technology. In 1974, she moved to France, becoming ...",
    "published": null
  }
]