[
  {
    "title": "University of Paris-Sud - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q1480643",
    "snippet": "M. <strong>JEAN-PIERRE KAHANE</strong> EST ÉLU PRÉSIDENT DE L&#x27;UNIVERSITÉ PARIS-SUD (French)",
    "published": null
  },
  {
    "title": "History & Leadership — PCA",
    "url": "https://www.paris.edu/home-2/about/history-leadership/",
    "snippet": "Recognized as a leader in the field, Linda has served as a consultant to elite preparatory schools (e.g., Choate Rosemary Hall) and universities (e.g., MIT) on issues of learning, assessment and admissions. In her 8 years as Dean, she worked alongside PCA’s academic and administrative teams to improve facilities, secure re-accreditation, develop new undergraduate majors, and launch PCA’s graduate school, the latter under the leadership of Associate Dean Klaus Fruchtnis.",
    "published": "August 19, 2025"
  },
  {
    "title": "Paris-Saclay University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris-Saclay_University",
    "snippet": "In 1965, the Orsay science campus officially became independent from the University of Paris. After being the Orsay Faculty of Sciences of the University of Paris, separate from the Paris Faculty of Sciences, it became a full university, the University of Paris-Sud (Paris XI) in 1971.",
    "published": "3 weeks ago"
  },
  {
    "title": "86 Notable Alumni of Paris-Sud University [Sorted List]",
    "url": "https://edurank.org/uni/paris-sud-university/alumni/",
    "snippet": "<strong>Sylvie Retailleau</strong> is a French physicist and politician who has been serving as Minister of Higher Education in the government of successive Prime Ministers Élisabeth Borne and Gabriel Attal since 20 May 2022.",
    "published": "March 2, 2025"
  },
  {
    "title": "Paris-Sud University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris-Sud_University",
    "snippet": "<strong>Pierre-Gilles de Gennes and Albert Fert</strong>, two Nobel Prize winners of physics, were affiliated to the University of Paris-Sud. A number of the most renowned French mathematicians were affiliated with the University of Paris-Sud as well.",
    "published": "October 7, 2025"
  }
]