[
  {
    "title": "Samy Bengio - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Samy_Bengio",
    "snippet": "Bengio is senior director of Artificial Intelligence and Machine Learning Research at Apple and an adjunct professor at École Polytechnique Fédérale de Lausanne. He was a longtime scientist at Google, where he led a large group of researchers working in machine learning, including adversarial settings.",
    "published": "November 14, 2025"
  },
  {
    "title": "r/MachineLearning on Reddit: [D] Samy Bengio resigns from Google",
    "url": "https://www.reddit.com/r/MachineLearning/comments/mloj16/d_samy_bengio_resigns_from_google/",
    "snippet": "Apple has hired Samy Bengio, a former AI scientist who resigned in protest of Google&#x27;s firing of two employees, to lead a new AI team under John Giannandrea.",
    "published": "April 7, 2021"
  },
  {
    "title": "Google AI manager resigns following controversial firings of two top researchers | The Verge",
    "url": "https://www.theverge.com/2021/4/6/22370372/google-research-manager-resigns-timnit-gebru-margaret-mitchell-firing",
    "snippet": "A Google researcher manager has resigned following the controversial firings of two female leaders in his organization. Samy Bengio, who oversaw the ethical AI team prior to a reorganization in February, is leaving to pursue other opportunities, according to Bloomberg.",
    "published": "April 6, 2021"
  },
  {
    "title": "Samy Bengio - Research at Google",
    "url": "https://research.google.com/pubs/bengio.html?viewType=Print&viewClass=Print",
    "snippet": "Samy Bengio (PhD in computer science, University of Montreal, 1993) is a research scientist at Google <strong>since 2007.</strong> Before that, he was senior researcher in statistical machine learning at IDIAP Research Institute since 1999, where he supervised PhD students and postdoctoral fellows.",
    "published": null
  },
  {
    "title": "Samy Bengio",
    "url": "https://scholar.google.com/citations?user=Vs-MdPcAAAAJ&hl=en",
    "snippet": "fabien cardinauxSony Stuttgart Technology CenterVerified email at sony.com · View all · Follow · Samy Bengio · Senior Director, AI and ML Research, Apple · Verified email at apple.com - Homepage · Machine LearningDeep LearningRepresentation LearningReasoningProf EPFL ·",
    "published": null
  }
]