[
  {
    "title": "Prime Minister of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Saudi_Arabia",
    "snippet": "After the deposition of Saud in 1964, Faisal succeeded him as king, while remaining prime minister. From that point until the appointment of <strong>Mohammed bin Salman</strong> as prime minister by King Salman, the two offices were merged.",
    "published": "November 10, 2025"
  },
  {
    "title": "Prime ministers of Saudi Arabia | Amwaj.media",
    "url": "https://amwaj.media/en/data/country/saudi-arabia/politics/individuals/prime-ministers-of-saudi-arabia",
    "snippet": "The office was created by royal decree in 1953.",
    "published": null
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing - HOG",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?OpenForm=&ExpandView=&RestrictToCategory=Saudi+Arabia",
    "snippet": "The Heads of Government listing is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers and in some cases, ministers responsible for development assistance.",
    "published": null
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?RestrictToCategory=Saudi+Arabia",
    "snippet": "The heads of government list is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers, trade ministers and in some cases, ministers responsible for development assistance.&amp;nbsp It has been prepared using information provided by ...",
    "published": null
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Saudi Arabian banks froze more than 2,000 domestic accounts as part of the crackdown. According to The Wall Street Journal, the Saudi government targeted cash and assets worth up to $800 billion. The Saudi authorities claimed that amount was composed of assets worth around $300 billion to $400 billion that they can prove was linked to corruption. On 27 September 2022, Mohammed was appointed as Prime Minister of Saudi Arabia by King Salman.",
    "published": "11 hours ago"
  }
]