[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "In pursuit of those ends his government has launched large-scale populist spending programmes (such as the free nutritious meals scheme and rice-aid and electricity-discount policies) while simultaneously ordering a budget-efficiency sweep: a January 2025 presidential instruction cut Rp 306.6 trillion of spending to redirect funds into social programmes. To complement this, his government has shifted the revenue-mobilisation paradigm: the 2026 draft budget sets a growth target of 5.4 % (with a long-term aspiration of 8 %) and projects a deficit cap of ~2.5 % of GDP, emphasising better tax-to-GDP ratio rather than raw debt expansion. Prabowo Subianto’s decision to appoint Purbaya Yudhi Sadewa as Minister of Finance on 8 September 2025 signaled a change in economic policymaking, a departure from the fiscal-orthodoxy of his predecessor Sri Mulyani Indrawati.",
    "published": "1 day ago"
  },
  {
    "title": "Prabowo Subianto Age, Net Worth, Bio, Height [Updated February 2025 ]",
    "url": "https://superstarsculture.com/prabowo-subianto/",
    "snippet": "Check back often as we will continue ... relationships, ex-girlfriends and previous hookups. Prabowo Subianto <strong>prefers not to tell the details of marital status &amp; divorce</strong>....",
    "published": "December 11, 2023"
  },
  {
    "title": "Prabowo Subianto - The Muslim 500",
    "url": "https://themuslim500.com/profiles/prabowo-subianto/",
    "snippet": "He rose through the ranks of the Indonesian Army, becoming a lieutenant general and commander of the Army’s Strategic Reserve Command. Prabowo was also married to Suharto’s daughter, Siti Hediati Hariyadi, from 1983 to 1998, further cementing his ties to Indonesia’s political elite.",
    "published": "May 29, 2018"
  },
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "Indonesian government faces backlash over Riau land seizures • Nov. 21, 2025, 9:23 PM ET (The Star) ... Prabowo Subianto (born October 17, 1951, Jakarta, Indonesia) is a former general of the Indonesian army and businessman who is now president of Indonesia (2024– ).",
    "published": "December 9, 2024"
  },
  {
    "title": "Inauguration of Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Inauguration_of_Prabowo_Subianto",
    "snippet": "Titiek Suharto, ex-wife of Prabowo Subianto and member of House of Representatives",
    "published": "October 20, 2025"
  }
]