[
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "Earlier, Nehru had served as prime minister of the Interim Government of India during the British Raj from 2 September 1946 until 14 August 1947, his party, the Indian National Congress having won the 1946 Indian provincial elections. Nehru was succeeded by Lal Bahadur Shastri, whose 1 year 7-month term ended in his death in Tashkent, then in the USSR, where he had signed the Tashkent Declaration between India and Pakistan.",
    "published": "1 day ago"
  },
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "The longest-serving prime minister was the first prime minister, <strong>Jawaharlal Nehru, whose tenure lasted 16 years and 286 days</strong>. His premiership was followed by Lal Bahadur Shastri&#x27;s short tenure and Indira Gandhi&#x27;s 11- and 4-year-long tenures, with both politicians belonging to the Indian National ...",
    "published": "3 days ago"
  },
  {
    "title": "Former Prime Ministers | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former-prime-ministers/",
    "snippet": "A Civil Engineering Diploma holder, Shri Deve Gowda plunged into active politics at the early ... More Archive Link ... A man of the masses, firm in his political convictions. On <strong>October 13, 1999</strong>, he took charge as Prime Minister of India for the second consecutive term at the head of a new ...",
    "published": null
  },
  {
    "title": "Prime Ministers of India",
    "url": "https://archivepmo.nic.in/",
    "snippet": "<strong>May 22, 2004 - 26th May 2014</strong> · Shri Atal Bihari Vajpayee",
    "published": null
  },
  {
    "title": "List of all Prime Ministers of India (1947-2025) | India PM List",
    "url": "https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1",
    "snippet": "List of all Prime Ministers of India till 2025: <strong>Narendra Modi is the current and 14th Prime Minister of India who assumed office on 10 June 2024</strong>. Jawaharlal Nehru is the first and the longest-serving Prime Minister of India while Indira Gandhi ...",
    "published": "August 22, 2025"
  }
]