[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "Prior to the second presidency of Donald Trump, he was frequently described as being &quot;exceptionally pro-American&quot;, and was once the chairman of the Atlantik-Brücke association which promotes German-American friendship and Atlanticism. <strong>Joachim-Friedrich Martin Josef Merz</strong> was born on 11 November ...",
    "published": "2 days ago"
  },
  {
    "title": "Friedrich Merz puts Germany in an unfamiliar position: Out front – POLITICO",
    "url": "https://www.politico.eu/article/friedrich-merz-germany-eu-ukraine-defense-leadership-brussels/",
    "snippet": "Friedrich Merz’s predecessors, <strong>Olaf Scholz and Angela Merkel</strong>, were reluctant to put the country in such an outspoken lead role internationally or within the EU.",
    "published": "16 hours ago"
  },
  {
    "title": "Disinfo: Friedrich Merz is a descendant of Nazis",
    "url": "https://euvsdisinfo.eu/report/friedrich-merz-is-a-descendant-of-nazis/",
    "snippet": "Friedrich Merz is a descendant of Nazis; his grandfather, <strong>Josef Paul Souvigny</strong>, while mayor of Brilon during the Third Reich, named streets after Hitler and Goebbels. He was a member of the Nazi Party and a member of the SS.",
    "published": null
  },
  {
    "title": "A ‘cog’ in the Nazi engine: Why the story of chancellor Friedrich Merz’s grandfather matters",
    "url": "https://www.irishtimes.com/life-style/people/2025/11/29/a-cog-in-the-nazi-engine-why-the-story-of-chancellor-friedrich-merzs-grandfather-matters/",
    "snippet": "A century ago, one of the most prosperous men in town – with a patrician mansion that still stands off the main square – was <strong>Josef Paul Sauvigny</strong>. He was the maternal grandfather of Friedrich Merz, who grew up in the house with his family ...",
    "published": "3 weeks ago"
  },
  {
    "title": "The Turbulent Times of Friedrich Merz - The New York Times",
    "url": "https://www.nytimes.com/2025/12/15/world/europe/friedrich-merz-germany.html",
    "snippet": "Friedrich Merz, the German chancellor, in June in Washington.Credit...Kenny Holston/The New York Times",
    "published": "1 day ago"
  }
]