[
  {
    "title": "Al Hilal SFC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al_Hilal_SFC",
    "snippet": "The club&#x27;s name lasted for only one year before it was changed to its current name on 3 December 1958 by King Saud. He changed the name after he attended a tournament that was contested between the Olympic Club, Al Shabab, Al Riyadh and Al-Kawkab clubs. As soon as the club&#x27;s establishment, Al-Hilal enjoyed not only grassroots support but also royal attention.",
    "published": "3 weeks ago"
  },
  {
    "title": "Who owns Al Hilal FC?",
    "url": "https://thefootballlovers.com/football-questions/who-owns-al-hilal-fc",
    "snippet": "Al Nassr, and Al Hilal – have been transformed into companies, each of which is owned by PIF and non-profit foundations for each club. ... <strong>Saudi Arabia&#x27;s Public Investment Fund</strong> has taken ownership control of four soccer clubs in the Saudi Pro League—Al-Ittihad, Al-Nassr, Al-Hilal, and ...",
    "published": null
  },
  {
    "title": "Al-Hilal United FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Al-Hilal_United_FC",
    "snippet": "Al-Hilal United FC was founded in 2019 in Al Lisaili, Dubai, United Arab Emirates, and around February 2020, it was announced that <strong>Abdullah bin Musa&#x27;ad bin Abdulaziz Al Saud</strong> has ownership to the newly established club.",
    "published": "August 11, 2025"
  },
  {
    "title": "Prince Al-Waleed in talks to buy PIF stake in Al-Hilal Club | AGBI",
    "url": "https://www.agbi.com/business-of-sport/2025/09/prince-alwaleed-in-talks-to-buy-pif-stake-in-al-hilal-club/",
    "snippet": "As well as a <strong>75 percent</strong> stake in Al-Hilal, PIF has a similar share in Al-Ahli, while it owns Al-Ittihad and Al-Nassr, home of Portuguese star Cristiano Ronaldo. Oil major Aramco owns Al-Qadsiah and the Diriyah Gate Development Authority is taking ...",
    "published": "September 3, 2025"
  },
  {
    "title": "Saudi Prince Alwaleed in Talks with PIF to Acquire Al Hilal FC - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-09-02/saudi-prince-alwaleed-in-talks-with-pif-to-acquire-al-hilal-fc",
    "snippet": "<strong>Saudi billionaire Prince Alwaleed bin Talal is in talks with the Public Investment Fund to acquire a majority of Al Hilal Football Club</strong>, in what would mark one of the most high-profile privatization efforts in the kingdom’s football sector.",
    "published": "September 2, 2025"
  }
]