[
  {
    "title": "John Heitinga - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Heitinga",
    "snippet": "He was featured in a documentary ... Lens. Heitinga quickly established himself as a strong addition to the team and <strong>became first-choice player under coach Co Adriaanse and later Ronald Koeman</strong> until he suffered a serious knee injury which kept him on the sidelines for over six ...",
    "published": "2 weeks ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "After years in the youth academy, hundreds of matches for Ajax’s first team, various coaching roles at the De Toekomst training complex, and a stint as assistant coach with Jong Ajax, he now embarks on his second spell as the club’s head coach. ... Technical Director Alex Kroes is pleased with the appointment of John Heitinga as Ajax’s new head coach.",
    "published": null
  },
  {
    "title": "Heitinga: back in Mokum, back at 'his' Ajax",
    "url": "https://english.ajax.nl/articles/heitinga-back-in-mokum-back-at-his-ajax",
    "snippet": "Heitinga quickly rose through the ranks of the famed academy and, <strong>during the 1998/1999 season, played in the B1 team under coach John van &#x27;t Schip</strong> alongside teammates like Maarten Stekelenburg and Rafael van der Vaart.",
    "published": null
  },
  {
    "title": "John Heitinga - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.com/john-heitinga/profil/trainer/51774",
    "snippet": "Avg. term as coach : <strong>1.17 Years</strong>",
    "published": null
  },
  {
    "title": "Liverpool assistant manager John Heitinga appointed Ajax head coach - The Athletic",
    "url": "https://www.nytimes.com/athletic/6386426/2025/05/31/liverpool-heitinga-ajax-manager/",
    "snippet": "Heitina <strong>made 218 first-team appearances over two spells at Ajax and moved into coaching after retiring in 2016</strong>, working as coach of Jong Ajax — their youth side which competes in the second-tier of Dutch football — for 18 months before his ...",
    "published": "May 31, 2025"
  }
]