[
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "Ten people (nine men and one woman) have served as chancellor of the Federal Republic of Germany, the first being Konrad Adenauer from 1949 to 1963. (Another 26 men had served as &quot;Reich chancellors&quot; of the previous German Empire from 1871 to 1945.) The current officeholder is <strong>Friedrich Merz</strong> of the ...",
    "published": "3 weeks ago"
  },
  {
    "title": "German election 2025 – DW",
    "url": "https://www.dw.com/en/german-election-2025/t-70794502",
    "snippet": "Germans have backed conservative <strong>Friedrich Merz</strong> to lead Germany, and by extension Europe.",
    "published": null
  },
  {
    "title": "Website of the Federal Government | Bundesregierung",
    "url": "https://www.bundesregierung.de/breg-en",
    "snippet": "Federal Chancellor <strong>Friedrich Merz</strong> met with the heads of the Federal State governments to discuss current topics of significance. Reducing bureaucracy, efficient procedures and digital processes are the focus of the Federal Modernisation Agenda.",
    "published": null
  },
  {
    "title": "2025 German federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_German_federal_election",
    "snippet": "Greece: Prime Minister Kyriakos Mitsotakis called the election &quot;A decisive victory for our political family, for Germany, and for Europe. Congratulations <strong>Friedrich Merz</strong>!",
    "published": "2 weeks ago"
  },
  {
    "title": "Germany accuses Russia of 2024 cyber attack and election disinformation campaign",
    "url": "https://www.bbc.com/news/articles/cvgrrnylzzyo",
    "snippet": "12 December 2025 · ShareSave · ShareSave · Bloomberg via Getty Images · George Wrightand · Bethany Bell,Berlin · Germany has accused Russia of a cyber-attack on air traffic control and attempted electoral interference, and summoned the Russian ambassador. A foreign ministry spokesman said Russian military intelligence was behind a &quot;cyber-attack against German air traffic control in August 2024&quot;.",
    "published": "2 weeks ago"
  }
]