[
  {
    "title": "Katerina Sakellaropoulou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Katerina_Sakellaropoulou",
    "snippet": "Katerina N. Sakellaropoulou (Greek: Κατερίνα Ν. Σακελλαροπούλου [kateˈrina sacelaroˈpulu]; born 30 May 1956) is a Greek retired judge who <strong>served as the president of Greece from 2020 to 2025</strong>. She was elected by the Hellenic Parliament to succeed Prokopis Pavlopoulos ...",
    "published": "October 2, 2025"
  },
  {
    "title": "Ekaterini Sakellaropoulou elected President of Greece - Greek News Agenda",
    "url": "https://www.greeknewsagenda.gr/sakellaropoulou/",
    "snippet": "Ekaterini Sakellaropoulou was <strong>elected by the Hellenic Parliament as the new President of the Hellenic Republic on 22 January 2020</strong> with 261 votes in favour. She will succeed Prokopis Pavlopoulosafter the end of the latter’s term; she is due ...",
    "published": "January 22, 2020"
  },
  {
    "title": "Katerina Sakellaropoulou | president of Greece | Britannica",
    "url": "https://www.britannica.com/biography/Katerina-Sakellaropoulou",
    "snippet": "Other articles where Katerina Sakellaropoulou is discussed: Greece: Greece’s debt crisis: <strong>In mid-January 2020</strong> Mitsotakis nominated Katerina Sakellaropoulou, a high court judge, to become the country’s president.",
    "published": null
  },
  {
    "title": "Katerina Sakellaropoulou: first-elect female President of the Hellenic Republic - International Alliance of Women",
    "url": "https://womenalliance.org/katerina-sakellaropoulou-first-elect-female-president-of-the-hellenic-republic/",
    "snippet": "International Alliance of Women congratulates Katerina Sakellaropoulou, a high court judge, a human rights advocate and an expert in environmental and constitutional law for being the <strong>first-elect female President of Greece</strong>.",
    "published": "February 26, 2020"
  },
  {
    "title": "KATERINA SAKELLAROPOULOU - Aρχική",
    "url": "https://www.presidency.gr/en/katerina-sakellaropoulou-en/",
    "snippet": "KATERINA SAKELLAROPOULOU Back to Former Presidents Katerina Sakellaropoulou (2020-2025) biography Katerina N. Sakellaropoulou was <strong>born in Thessaloniki in 1956</strong>. She is a graduate of the Arsakeio School and has earned a degree from the University ...",
    "published": "March 23, 2025"
  }
]