[
  {
    "title": "Prime Minister of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Ukraine",
    "snippet": "Two prime ministers were born in the Russian SFSR. The current prime minister is <strong>Yulia Svyrydenko</strong>, who was confirmed by the Verkhovna Rada on 17 July 2025. She replaced Denys Shmyhal, who had been sworn in on 4 March 2020 following the resignation of Oleksiy Honcharuk.",
    "published": "2 weeks ago"
  },
  {
    "title": "Yulia Svyrydenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yulia_Svyrydenko",
    "snippet": "<strong>Yulia Anatoliivna Svyrydenko</strong> (Ukrainian: Юлія Анатоліївна Свириденко, IPA: [ˈjul⁽ʲ⁾ijɐ ɐnɐˈtɔl⁽ʲ⁾ijiu̯nɐ swɪrɪˈdɛnko]; born 25 December 1985) is a Ukrainian politician who has served as the 19th prime minister of Ukraine since 17 July 2025.",
    "published": "3 weeks ago"
  },
  {
    "title": "List of prime ministers of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Ukraine",
    "snippet": "Unlike the president of Ukraine, who is directly elected by popular vote every five years, the prime minister is appointed by the president upon the ratification of the candidate by the parliament, the Verkhovna Rada. <strong>Denys Shmyhal</strong> is the current ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Zelenskyy appoints Yulia Svyrydenko as new prime minister for war-weary Ukraine | PBS News",
    "url": "https://www.pbs.org/newshour/world/zelenskyy-appoints-yulia-svyrydenko-as-new-prime-minister-for-war-weary-ukraine",
    "snippet": "Donate now · Left: Newly appointed Ukrainian Prime Minister <strong>Yulia Svyrydenko</strong> attends a session of Ukrainian parliament, amid Russia&#x27;s attack on Ukraine, in Kyiv, Ukraine July 17, 2025.",
    "published": "July 17, 2025"
  },
  {
    "title": "Government of Ukraine | Cabinet of Ministers of Ukraine",
    "url": "https://www.kmu.gov.ua/en/team",
    "snippet": "Taras Kachka Deputy Prime Minister for European and Euro-Atlantic Integration of Ukraine",
    "published": null
  }
]