[
  {
    "title": "History of ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_ESPN",
    "snippet": "ESPN was founded by <strong>Bill Rasmussen, his son Scott Rasmussen, and 43 year old eye doctor and Aetna insurance agent Ed Eagan</strong>. Bill, who had an affinity with sports for much of his life, was fired from his position as the communications manager for the New England Whalers in 1978.",
    "published": "November 11, 2025"
  },
  {
    "title": "ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ESPN",
    "snippet": "<strong>Bill Rasmussen</strong> came up with the concept of ESPN in May 1978, after he was fired from his job with the World Hockey Association&#x27;s New England Whalers. Rasmussen and his ESPN co-founder Ed Eagan, joined by Rasmussen&#x27;s son Scott (who had also been let go by the Whalers), first rented office space ...",
    "published": "4 days ago"
  },
  {
    "title": "ESPN Founder",
    "url": "https://www.espnfounder.com/",
    "snippet": "A life-long entrepreneur and sports fan, <strong>Bill Rasmussen</strong>’s innovations in advertising, sports and broadcasting are numerous, including the creation of ESPN, the world’s first 24-hour, 7-days-a-week sports television network; the network’s signature program SportsCenter; wall-to-wall coverage ...",
    "published": null
  },
  {
    "title": "Alumnus Founded ESPN, Creating First 24-Hour TV Network",
    "url": "https://ucmweb.rutgers.edu/250/sites/default/files/RutgersRevolutionaries_07-Rasmussen.pdf",
    "snippet": "when he founded ESPN, which became the · world’s first network to broadcast around the · clock when it went live on September 7, 1979. “You have to remember that there was no · CNN, no Fox News, no MTV,” says Ras­ · mussen, who also served as the network’s first ·",
    "published": null
  },
  {
    "title": "Speaker: Bill Rasmussen, Founder of ESPN | LAI",
    "url": "https://www.leadingauthorities.com/speakers/bill-rasmussen",
    "snippet": "<strong>Rasmussen</strong> founded ESPN in the summer of 1978. He had his innovative brainstorm for an all-sports cable TV network within days of his firing by the New England Whalers of the World Hockey Association on Memorial Day weekend.",
    "published": null
  }
]