[
  {
    "title": "Tiger Aspect Productions 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/120957-76",
    "snippet": "Information on acquisition, funding, investors, and executives for Tiger Aspect Productions. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "TIGER ASPECT PRODUCTIONS LIMITED overview - Find and update company information - GOV.UK",
    "url": "https://find-and-update.company-information.service.gov.uk/company/03643117",
    "snippet": "More for TIGER ASPECT PRODUCTIONS ... limited Company · Incorporated on · 2 October 1998 · <strong>Next accounts made up to 31 December 2025 due by 30 September 2026</strong> ·...",
    "published": null
  },
  {
    "title": "Tiger Aspect Productions - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Tiger_Aspect_Productions",
    "snippet": "Tiger Aspect Productions is a British film and television production company of Peter Bennett-Jones, founded in 1993 from the merger between Tiger Television and Aspect Film &amp; Television. In June 2006, the company was purchased by IMG Media, but was later sold to the UK division of Endemol in November 2009.",
    "published": "November 12, 2025"
  },
  {
    "title": "Tiger Aspect Productions updates: news & description",
    "url": "https://www.theofficialboard.com/news/tiger-aspect-productions",
    "snippet": "<strong>Tiger Aspect Productions is owned by Banijay Group</strong>. Banijay Group has a direct presence in 10 countries. Banijay Group has 22 subsidiaries including 51 Minds, Banijay Entertainment and Banijay Finland. ... François Laroze, Non-Executive Director, has left the company (posted on September 16 2025).",
    "published": null
  },
  {
    "title": "Tiger Aspect - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tiger_Aspect",
    "snippet": "In June 2006, Tiger Aspect and Tigress Productions were purchased by <strong>IMG Media</strong>, an international talent and rights group, but were then sold to Endemol UK in November 2009.",
    "published": "1 week ago"
  }
]