[
  {
    "title": "Sadyr Japarov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sadyr_Japarov",
    "snippet": "Sadyr Nurgojo uulu Japarov (born 6 December 1968) is a Kyrgyz politician who has been serving as the <strong>sixth president of Kyrgyzstan since 28 January 2021</strong>. He previously served as the 22nd prime minister in the 2020 interim government, following the resignation of President Sooronbay Jeenbekov.",
    "published": "2 weeks ago"
  },
  {
    "title": "Presidency of Sadyr Japarov: What Kyrgyzstan achieved for four years - | 24.KG",
    "url": "https://24.kg/english/318050_Presidency_of_Sadyr_Japarov_What_Kyrgyzstan_achieved_for_four_years/",
    "snippet": "Four years have passed since Sadyr Japarov took office as president of Kyrgyzstan. The head of the Information Policy Service of the head of state, Daiyrbek Orunbekov, posted a statement on Facebook about the achievements of the country’s leader, noting that he took office when the economy was suffering from the consequences of the coronavirus pandemic, international ties had weakened and a lot of external debt had accumulated.",
    "published": "January 27, 2025"
  },
  {
    "title": "Sadyr Japarov | president of Kyrgyzstan | Britannica",
    "url": "https://www.britannica.com/biography/Sadyr-Japarov",
    "snippet": "Other articles where Sadyr Japarov is discussed: Kyrgyzstan: Presidency of Sadyr Japarov: …detention, including Atambayev, Isakov, and Sadyr Japarov (Zhaparov), a former associate of Bakiyev imprisoned after his supporters took a government official hostage in 2013.",
    "published": null
  },
  {
    "title": "Kyrgyzstan election: Sadyr Japarov wins presidency with landslide",
    "url": "https://www.bbc.com/news/world-asia-55613552",
    "snippet": "The frontrunner in Kyrgyzstan&#x27;s presidential election, Sadyr Japarov, has <strong>won by a landslide</strong>, official results show.",
    "published": "January 11, 2021"
  },
  {
    "title": "Sadyr Japarov",
    "url": "https://www.congress.gov/crs_external_products/IF/HTML/IF10304.web.html",
    "snippet": "Japarov was elected president in <strong>January 2021</strong> with 79% of the vote amid 40% turnout, lower turnout than in previous elections. In the concurrent referendum, 84% of voters supported reverting to a presidential system. A new constitution approved in a second referendum in April 2021 significantly ...",
    "published": null
  }
]