[
  {
    "title": "Minister for Children, Disability and Equality - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_for_Children,_Equality,_Disability,_Integration_and_Youth",
    "snippet": "<strong>Hildegarde Naughton, TD</strong> – Minister of State at the Department of Children, Disability and Equality with responsibility for disability. The office was created in 1956 as the Minister for the Gaeltacht. Its title and functions have changed several times, with the current title adopted in 2025.",
    "published": "September 7, 2025"
  },
  {
    "title": "Department of Children, Equality, Disability, Integration and ...",
    "url": "https://www.earlychildhoodireland.ie/wp-content/uploads/2023/08/Explainers_DCEDIY.pdf",
    "snippet": "The Office of the Minister of Children was established in December 2005, allowing the · Minister to attend Cabinet meetings, but this did not change the functions of the role. The · last Minister of State for Children was <strong>Barry Andrews</strong>.",
    "published": null
  },
  {
    "title": "Minister for Children, Equality, Disability, Integration and Youth - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_for_Children_and_Youth_Affairs",
    "snippet": "The minister for children, equality, disability, integration and youth (Irish: An tAire Leanaí, Comhionannais, Míchumais, Lánpháirtíochta agus Óige) is a senior minister in the government of Ireland and leads the Department of Children, Equality, Disability, Integration and Youth. The current Minister for Children, Equality, Disability, Integration and Youth is Roderic O&#x27;Gorman, TD. ... The department was created in 1956 as the Department of the Gaeltacht. Its title and functions have changed several times, with the current title adopted in 2020. An office of minister of state for children existed from 1994 to 2011.",
    "published": "July 2, 2024"
  },
  {
    "title": "Roderic O'Gorman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Roderic_O'Gorman",
    "snippet": "<strong>Roderic O&#x27;Gorman</strong> (born 12 December 1981) is an Irish Green Party politician who has served as leader of the Green Party since July 2024. He has been a Teachta Dála (TD) for the Dublin West constituency since 2020.",
    "published": "1 month ago"
  },
  {
    "title": "Minister Norma Foley and Minister of State Hildegarde ...",
    "url": "https://gov.ie/en/department-of-children-disability-and-equality/press-releases/minister-norma-foley-and-minister-of-state-hildegarde-naughton-meet-with-the-disability-stakeholder-strategic-advisory-group/",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  }
]