[
  {
    "title": "2025 Portuguese legislative election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Portuguese_legislative_election",
    "snippet": "The The Public Prosecutor&#x27;s Office closed the preliminary investigation, with no charges filed, in December 2025, 9 months after it was opened. On 11 March 2025, <strong>Luís Montenegro</strong>&#x27;s government fell after losing a vote of confidence in Parliament, 137 against with 87 in favour.",
    "published": "2 days ago"
  },
  {
    "title": "The Portuguese Government in 2025: What Expats Should Know",
    "url": "https://www.portugalresidencyadvisors.com/the-political-system-in-portugal-an-expat-guide/",
    "snippet": "<strong>Luís Montenegro</strong>, leader of the centre-right Democratic Alliance (AD) and head of the Social Democratic Party (PSD), was appointed Prime Minister after his bloc won the most seats (91) in parliament.",
    "published": "3 weeks ago"
  },
  {
    "title": "Next Portuguese legislative election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Portuguese_legislative_election",
    "snippet": "There were 598 delegates eligible to vote at the party convention, and, on 30 November 2025, <strong>José Manuel Pureza</strong> was easily elected as new leader with more than 81% of the delegates votes: The People Animals Nature (PAN) held a leadership congress on 20 December 2025.",
    "published": "3 days ago"
  },
  {
    "title": "Luís Montenegro - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lu%C3%ADs_Montenegro",
    "snippet": "An election was called for 18 May 2025, in which Montenegro&#x27;s alliance retained its plurality in parliament, but again fell short of a majority. The Democratic Alliance gained seats, while the PS lost seats and Chega made gains. On 29 May, Montenegro was invited once again to form a new government. The XXV Constitutional Government of Portugal was sworn in on 5 June.",
    "published": "6 days ago"
  },
  {
    "title": "General election in Portugal 2025 - statistics & facts | Statista",
    "url": "https://www.statista.com/topics/11910/general-election-in-portugal-2024/",
    "snippet": "<strong>Luís Montenegro</strong> was considered the best current political party leader in Portugal, scoring one point higher than Pedro Nuno Santos, the leader of PS, and more than four points higher than André Ventura, the leader of CHEGA.",
    "published": null
  }
]