[
  {
    "title": "2025 Greek presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Greek_presidential_election",
    "snippet": "A third round of voting was held on 6 February 2025, where no candidate reached the reduced required majority of 180. The fourth round was held on 12 February 2025, where <strong>Konstantinos Tasoulas</strong> was elected as President of Greece.",
    "published": "September 8, 2025"
  },
  {
    "title": "Greece Elects New President Despite MPs' Walkout Over Train Crash | Balkan Insight",
    "url": "https://balkaninsight.com/2025/02/12/greece-elects-new-president-despite-mps-walkout-over-train-crash/",
    "snippet": "His inauguration will take place on March 13, when the term of the current President, <strong>Katerina Sakellaropoulou</strong>, ends.",
    "published": "February 12, 2025"
  },
  {
    "title": "Presidential Election 2025 Greece",
    "url": "https://www.robert-schuman.eu/en/monitor/6474-konstantinos-tasoulas-is-elected-president-of-greece",
    "snippet": "<strong>Konstantinos Tasoulas</strong> is elected President of Greece",
    "published": null
  },
  {
    "title": "Konstantinos Tasoulas Becomes the New President of Greece - GreekReporter.com",
    "url": "https://greekreporter.com/2025/02/12/konstantinos-tasoulas-new-president-greece/",
    "snippet": "Greece’s Parliament elected <strong>Konstantinos Tasoulas</strong> as the next President of the Republic on Wednesday. In the fourth round of voting, Tasoulas gained 160 votes in the 300-member chamber.",
    "published": "February 12, 2025"
  },
  {
    "title": "Konstantinos Tasoulas - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Konstantinos_Tasoulas",
    "snippet": "Following the 2019 election, Tasoulas was elected President of the Hellenic Parliament with a record of 283 votes in favor, from the government ND party, as well as the opposition parties of Syriza, KINAL, EL, and MeRA25, with the Communist Party of Greece submitting a notion of 15 &quot;present&quot; voters, and two abstentions (by Dimitris Tzanakopoulos and Effie Achtsioglou). It was also the first time a Speaker of the Parliament was elected by open ballot. In January 2025, Prime Minister Kyriakos Mitsotakis submitted to the Parliament for approval the candidacy of Tasoulas for the office of the Greek Presidency.",
    "published": "3 weeks ago"
  }
]