[
  {
    "title": "Christine Lagarde",
    "url": "https://www.ecb.europa.eu/ecb/decisions/html/cvlagarde.en.html",
    "snippet": "Christine Lagarde, President of the European Central Bank",
    "published": "November 22, 2023"
  },
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "On 2 July 2019, Christine Lagarde was nominated by the European Council to succeed Mario Draghi as President of the European Central Bank (ECB) on <strong>1 November 2019.</strong>",
    "published": "6 days ago"
  },
  {
    "title": "Europe’s economy is geared towards a disappearing world, says ECB’s Lagarde | European Central Bank | The Guardian",
    "url": "https://www.theguardian.com/business/2025/nov/21/eu-economy-international-trade-reliance-vulnerable-ecb-lagarde",
    "snippet": "Europe’s economy is “geared towards a world that is gradually disappearing”, according to a warning from Christine Lagarde that the EU needs reforms to spur growth. The president of the European Central Bank (ECB) said the EU’s dependence on international trade had left it vulnerable, ...",
    "published": "4 weeks ago"
  },
  {
    "title": "ECB's Lagarde 'determined' to complete her term",
    "url": "https://www.rte.ie/news/business/2025/0528/1515376-ecbs-lagarde-determined-to-complete-her-term/",
    "snippet": "<strong>Christine Lagarde is determined to complete her eight-year term as president of the European Central Bank</strong>, the ECB said today after the Financial Times reported that she held talks about leaving early to lead the World Economic Forum.",
    "published": "May 28, 2025"
  },
  {
    "title": "ECB President Succession Battle Begins Early German Hawk Executive Director Schnabel expressed his willingness to succeed Lagarde",
    "url": "https://www.webull.com/news/13991112009040896",
    "snippet": "The Zhitong Finance App learned that ECB Executive Committee member Isabelle Schnabel said that when Christine Lagarde&#x27;s term ends in less than two years, <strong>she is willing to take over as ECB president if someone invites her</strong>.",
    "published": null
  }
]