[
  {
    "title": "Televerket (Sweden) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Televerket_(Sweden)",
    "snippet": "Televerket was a Swedish State authority acting as a state-owned corporation (public enterprise), responsible for telecommunications in Sweden from 1853 until 1993. Originally it was named Kongl. Elektriska Telegraf-Werket (literally: Royal Electric Telegraph Agency), which was <strong>founded in 1853</strong>.",
    "published": "June 4, 2025"
  },
  {
    "title": "February 20 in Swedish History - Nordstjernan",
    "url": "https://nordstjernan.com/news/sweden/5206/",
    "snippet": "The Swedish end was Kongl. Telegrafverket (founded in 1853 as Konglige Elektriska Telegraf-Werket - literally: Royal Electric Telegraph Agency), later changed to Kungl. Telegrafverket in 1903. The Kungliga (Royal) was dropped in 1946 and the name was further modernized to Televerket in 1953.",
    "published": null
  },
  {
    "title": "About: Televerket (Sweden)",
    "url": "https://dbpedia.org/page/Televerket_(Sweden)",
    "snippet": "Televerket was a Swedish State ... Elektriska Telegraf-Werket (literally: Royal Electric Telegraph Agency), which was <strong>founded in 1853</strong>....",
    "published": null
  },
  {
    "title": "Ellemtel and the axe - Ericsson",
    "url": "https://www.ericsson.com/en/about-us/history/changing-the-world/the-nordics-take-charge/ellemtel-and-the-axe",
    "snippet": "<strong>Ellemtel Utvecklings AB was established in May 1970 as a company owned jointly by L.M. Ericsson and Televerket</strong>. Over the following year both companies focused on formulating specifications for the joint exchange. It was a meeting of two worlds.",
    "published": null
  },
  {
    "title": "Televerket – Artist & Author Joakim Lloyd Raboff",
    "url": "https://raboff.com/televerket/",
    "snippet": "There was no posting on it, and therefore only interesting as a relic of Televerket, the precursor of today’s Telia, Sweden’s partially state-owned telecom company. When I moved to Sweden in 1978, Televerket was a monopoly and omnipresent in society.",
    "published": null
  }
]