[
  {
    "title": "Mary Earps signs for Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/womens-team/content/mary-earps-signs-for-paris-saint-germain-psg-feminines-women-mercato-2024-2025",
    "snippet": "Paris Saint-Germain are delighted to announce that <strong>Mary Earps has joined their women&#x27;s team</strong>.",
    "published": null
  },
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "On 1 July 2024, Earps joined Première Ligue club Paris Saint-Germain on a two-year contract until June 2026. She and Paris Saint-Germain lost 5–2 on aggregate to Juventus in the 2024–25 UEFA Women&#x27;s Champions League qualifying rounds. On 12 November 2025, Earps returned to Manchester United in the Champions League for the first time since her move, where they lost 2-1.",
    "published": "6 hours ago"
  },
  {
    "title": "Mary Earps exclusive: Lionesses icon on watching England's Euro 2025 triumph from the outside, returning to Man Utd in the Champions League and trying to dethrone Lyon with PSG | Goal.com US",
    "url": "https://www.goal.com/en-us/lists/mary-earps-exclusive-psg-lionesses-england-euro-2025-man-utd-champions-league-lyon/blt5f3459bc50945ba0",
    "snippet": "Mary Earps speaks about her England retirement, watching the Lionesses win Euro 2025, returning to Man Utd in the Champions League and trying to dethrone Lyon with PSG in an exclusive interview with GOAL",
    "published": "October 2, 2025"
  },
  {
    "title": "Mary Earps on life at PSG: ‘There was a lot of noise so it’s been nice to escape’ | Sport | The Guardian",
    "url": "https://www.theguardian.com/football/2025/apr/03/mary-earps-psg-england-interview-moving-the-goalposts",
    "snippet": "England goalkeeper tells Tom Garry she has fine-tuned her game since moving to France and is ‘loving the architecture’ in Paris",
    "published": "April 4, 2025"
  },
  {
    "title": "Mary Earps exclusive: Lionesses icon on watching England's Euro 2025 triumph from the outside, returning to Man Utd in the Champions League and trying to dethrone Lyon with PSG - BALLGM",
    "url": "https://ballgm.com/womens-football/mary-earps-exclusive-lionesses-icon-on-watching-englands-euro-2025-triumph-from-the-outside-returning-to-man-utd-in-the-champions-league-and-trying-to-dethrone-lyon-with-psg.html",
    "snippet": "Earps’ full focus from here on out is on PSG then, as they look to bounce back from the disappointments of last season. They were dealt some blows in the transfer market, losing Marie-Antoinette Katoto and Korbin Albert to bitter rivals Lyon while captain Grace Geyoro became the most expensive women’s player of all-time when she signed for London City Lionesses.",
    "published": "October 2, 2025"
  }
]