[
  {
    "title": "DFG, German Research Foundation - Professor Dr. Katja Becker - President of the DFG",
    "url": "https://www.dfg.de/en/about-us/statutory-bodies/executive-committee/members/becker",
    "snippet": "President of the DFG, Professor Dr. Katja Becker · © DFG / David Ausserhofer",
    "published": null
  },
  {
    "title": "DFG - Deutsche Forschungsgemeinschaft - Professorin Dr. Katja Becker",
    "url": "https://www.dfg.de/dfg_profil/gremien/praesidium/mitglieder_praesidiums/becker/",
    "snippet": "DFG-Präsidentin Prof. Dr. Katja Becker",
    "published": null
  },
  {
    "title": "Katja Becker - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Katja_Becker",
    "snippet": "Katja Becker (born 7 March 1965, also known as Katja Becker-Brandenburg in some older publications) is a German physician and biochemist who has been serving as the <strong>president of the German Research Foundation (DFG) since 2020.</strong> She had previously been the organization&#x27;s vice president from 2014 ...",
    "published": "September 22, 2025"
  },
  {
    "title": "DFG, German Research Foundation - Katja Becker Elected President of the DFG",
    "url": "https://www.dfg.de/en/service/press/press-releases/2019/press-release-no-24",
    "snippet": "Becker has served as DFG Vice President since 2014 and will take office on 1 January 2020 for an initial term of four years. She succeeds German medievalist Prof. Dr. Peter Strohschneider, who has served as President of the DFG since 2013 and will leave office at the end of his second term. The General Assembly of the DFG elected Katja Becker from a pool of three candidates, which also included engineering scientist and process engineer Prof.",
    "published": null
  },
  {
    "title": "Katja Becker | Global Research Council",
    "url": "https://globalresearchcouncil.org/about/governing-board/katja-becker/",
    "snippet": "Professor Katja Becker is the President ... where she also obtained her doctoral degree and habilitation. <strong>After a position at the Center for Infectious Diseases, Würzburg University, she accepted a chair</strong> ......",
    "published": null
  }
]