[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "By 1986, IRI was suffering heavy losses—with Alfa Romeo having not been profitable for the last 13 years—and IRI president Romano Prodi put Alfa Romeo up for sale. <strong>Finmeccanica, the mechanical holdings arm of IRI and its predecessors owned Alfa Romeo since 1932</strong>. Prodi first approached fellow ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "The name Alfa is actually an acronym for, “Anonima Lombarda Fabbrica Automobili” – A.L.F.A. <strong>In the formative years between 1932 and 1986, the Alfa was owned by an Italian state holding company</strong>, which then led to Alfa being under the Fiat ...",
    "published": "April 26, 2021"
  },
  {
    "title": "History of Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Alfa_Romeo",
    "snippet": "Made in 1914, it was produced through a substantial modification of the car&#x27;s structure. This truck inaugurated a tradition that marked the Biscione company for decades. Alfa Romeo produced commercial vehicles until 1988 and was, after FIAT, the Italian company that built this type of transport vehicle for the longest time.",
    "published": "October 20, 2025"
  },
  {
    "title": "Who Are Alfa Romeo Owned By?",
    "url": "https://anusedcar.com/alfa-romeo/who-are-alfa-romeo-owned-by/",
    "snippet": "<strong>Before Stellantis, Alfa Romeo was controlled by Fiat, which took full ownership in the 1980s</strong>.",
    "published": "April 18, 2025"
  },
  {
    "title": "Who Owns Alfa Romeo? | Who Makes Alfa Romeo? | Zeigler Alfa Romeo of Schaumburg",
    "url": "https://www.alfaromeousaofschaumburg.com/who-owns-alfa-romeo/",
    "snippet": "<strong>Alfa Romeo became Alfa Romeo Automobiles S.p.A, which was adopted as a subsidiary of Fiat</strong>. Fiat then was known as Fiat-Chrysler Automobiles (FCA), and after 2007, was responsible for making Alfa Romeo vehicles.",
    "published": "July 13, 2019"
  }
]