[
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "<strong>Juventus Football Club announces that it has today relieved Igor Tudor of his duties as head coach of the Men&#x27;s First Team</strong>, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": null
  },
  {
    "title": "Igor Tudor - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Igor_Tudor",
    "snippet": "<strong>On 23 March 2025</strong>, Tudor replaced Thiago Motta as head coach of Serie A club Juventus. This appointment marked the first time Juventus had appointed a foreign manager since Didier Deschamps in the 2006–07 season. He eventually guided the club to the fourth place of league table and Champions ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Igor Tudor to remain as Juventus head coach for 2025-26 season - The Athletic",
    "url": "https://www.nytimes.com/athletic/6415592/2025/06/10/igor-tudor-juventus-next-season/",
    "snippet": "Juventus have confirmed that head coach Igor Tudor will stay with the club for the <strong>2025-26 season</strong>.",
    "published": "June 19, 2025"
  },
  {
    "title": "Back in Bianconero | All you need to know about new Juventus coach Igor Tudor - Juventus",
    "url": "https://www.juventus.com/en/news/articles/back-in-bianconero-all-you-need-to-know-about-new-juventus-coach-igor-tudor",
    "snippet": "Igor Tudor’s Juventus history is set to have a new chapter written. A solid defender at first, and then a coach later, Igor is back with the Bianconeri to lead the men’s first team.",
    "published": null
  },
  {
    "title": "r/soccer on Reddit: Igor Tudor is no longer Juventus' head coach",
    "url": "https://www.reddit.com/r/soccer/comments/1ohc7qk/igor_tudor_is_no_longer_juventus_head_coach/",
    "snippet": "&quot;<strong>Juventus FC announces that it has today relieved Igor Tudor of his duties as head coach of the Men&#x27;s First Team</strong>, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": "October 27, 2025"
  }
]