[
  {
    "title": "Princeton & Slavery | Princeton’s Founding Trustees",
    "url": "https://slavery.princeton.edu/stories/founding-trustees",
    "snippet": "In short order, the ministers convinced three Presbyterian laymen from New York City to join them: William Smith, Peter Van Brugh Livingston, and William Peartree Smith.[1] As a result of the efforts of these seven individuals, <strong>King George II</strong> chartered the College of New Jersey (now Princeton ...",
    "published": null
  },
  {
    "title": "Who Founded Princeton University? – University Archives",
    "url": "https://universityarchives.princeton.edu/2016/01/who-founded-princeton-university/",
    "snippet": "The principles on which Princeton University was founded may be traced to the Log College in Bucks County, Pennsylvania, founded by <strong>William Tennent</strong> in 1726. Tennent was a Presbyterian minister who, along with fellow evangelists Theodorus Jacobus ...",
    "published": "January 7, 2016"
  },
  {
    "title": "Princeton University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Princeton_University",
    "snippet": "Princeton University is a private Ivy League research university in Princeton, New Jersey, United States. Founded in 1746 in Elizabeth as the College of New Jersey, Princeton is the fourth-oldest institution of higher education in the United States and one of the nine colonial colleges chartered before the American Revolution.",
    "published": "September 10, 2001"
  },
  {
    "title": "Governor Jonathan Belcher: Founder of Princeton University",
    "url": "https://www.belcherfoundation.org/princeton.htm",
    "snippet": "Governor <strong>Jonathan Belcher</strong>: Founder of Princeton University",
    "published": null
  },
  {
    "title": "HISTORY OF PRINCETON FROM FOUNDING TO PRESENT TIME | News | The Harvard Crimson",
    "url": "https://www.thecrimson.com/article/1916/11/11/history-of-princeton-from-founding-to/",
    "snippet": "The name of <strong>John Hamilton</strong>, therefore, is given a conspicuous place in every list of founders of Princeton University.",
    "published": null
  }
]