[
  {
    "title": "Olena Zelenska - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olena_Zelenska",
    "snippet": "On 9 November 2022, Olena Zelenska was included in the ELLE 100 Women. On 6 December 2022, the First Lady of Ukraine Olena Zelenska received the Hillary Rodham Clinton Awards, presented annually by the Georgetown Institute for Women, Peace and Security for exceptional leadership in recognizing the exceptional leadership in promoting women’s rights and creating a more peaceful and secure world for all.",
    "published": "2 weeks ago"
  },
  {
    "title": "olena zelenska: Who is Olena Zelenska, Ukraine’s First Lady, and what is her love story with Volodymyr Zelenskyy? - The Economic Times",
    "url": "https://economictimes.indiatimes.com/news/international/us/who-is-olena-zelenska-ukraines-first-lady-and-what-is-her-love-story-with-volodymyr-zelenskyy/articleshow/118768636.cms",
    "snippet": "As First Lady, she goes beyond her duties because she is also <strong>a mother, an activist, and a leader to improve the future of Ukraine</strong>. While Zelenskyy fights for Ukraine’s political liberty, Olena ensures that the Ukrainian spirit does not diminish.",
    "published": "March 6, 2025"
  },
  {
    "title": "President's wife news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/wife",
    "snippet": "This will enable round-the-clock ... region, First Lady of Ukraine Olena Zelenska <strong>took part in the launch of a kitchen factory opened as part of the school nutrition reform</strong>....",
    "published": "1 day ago"
  },
  {
    "title": "Portrait of Bravery: Ukraine’s First Lady, Olena Zelenska | Vogue",
    "url": "https://www.vogue.com/article/portrait-of-bravery-ukraines-first-lady-olena-zelenska",
    "snippet": "Olena really is my best friend.” In this story the first lady wears Ukrainian designers such as Bettter, Six, Hvoya, The Coat, Kachorovska, and Poustovit. In Ukraine, tens of thousands of women have been on the front lines, including in combat, and Zelenska’s role has increasingly turned toward frontline diplomacy.",
    "published": "July 26, 2022"
  },
  {
    "title": "Who Is Ukrainian First Lady Olena Zelenska? - Everything to Know About Volodymyr Zelensky's Wife",
    "url": "https://www.townandcountrymag.com/society/politics/a39944586/ukraine-first-lady-olena-zelenska/",
    "snippet": "Zelenska&#x27;s public appearance was extremely notable—she&#x27;s widely regarded a top target of Russian forces. Since, however, she has been making more visible appearances—including this weekend for the coronation, where she reunited with Biden in London. Here, everything you need to know about the Ukrainian first lady. ... Olena in September 2021 in Virgina, United States.",
    "published": "May 5, 2023"
  }
]