[
  {
    "title": "Alexander De Croo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_De_Croo",
    "snippet": "Alexander De Croo was born on 3 November 1975 in Vilvoorde in Flemish Brabant, Belgium, and was one of two children of the politician and Minister of State Herman De Croo and his wife Françoise Desguin. In 1993, he attended the <strong>Vrije Universiteit Brussel</strong> where he graduated in 1998 in Business ...",
    "published": "1 week ago"
  },
  {
    "title": "Alexander De Croo named as new Administrator of United Nations Development Programme | United Nations Development Programme",
    "url": "https://www.undp.org/press-releases/alexander-de-croo-named-new-administrator-united-nations-development-programme",
    "snippet": "Mr. De Croo holds a Master of Business Administration from the Kellogg School of Management at <strong>Northwestern University in Chicago</strong> and a degree in business engineering from the Solvay Brussels School of Economics and Management.",
    "published": null
  },
  {
    "title": "Alexander De Croo - CERRE",
    "url": "https://cerre.eu/biographies/alexander-de-croo/",
    "snippet": "A business engineer by training, Alexander De Croo obtained an MBA from the Kellogg School of Management, <strong>Northwestern University</strong>, Chicago (United States) in 2004. Between 1999 and 2006, he worked as a strategy consultant at Boston Consulting ...",
    "published": "October 11, 2024"
  },
  {
    "title": "Family tree of Alexander De Croo - Geneastar",
    "url": "https://en.geneastar.org/genealogy/dealexander/alexander-de-croo",
    "snippet": "Early life and career Alexander ... State Herman De Croo and his wife Françoise Desguin. In 1993, he attended the <strong>Vrije Universiteit Brussel</strong> where he graduated in 1998 in Business Engineering....",
    "published": null
  },
  {
    "title": "H.E. Mr. Alexander De Croo | Generation Unlimited",
    "url": "https://www.generationunlimited.org/he-mr-alexander-de-croo",
    "snippet": "In 2019, when he was sworn in as ... Alexander De Croo obtained an MBA from the Kellogg School of Management, <strong>Northwestern University</strong>, ......",
    "published": null
  }
]