[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "Eurosport was closed down in May 1991 after rival Screensport channel filed a complaint to the European Commission over the corporate structure. The channel was saved later that month when the TF1 Group (formed after the French government privatised the post ORTF-split TF1 <strong>5 years</strong> prior to ...",
    "published": "5 days ago"
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "Eurosport 1 is a television sports network channel which is a division of Eurosport and a subsidiary of EMEA version of Warner Bros. Discovery. Discovery took a 20% minority interest share in December 2012, and became majority shareholder in the Eurosport venture with TF1 in <strong>January 2014</strong>, taking ...",
    "published": "October 31, 2025"
  },
  {
    "title": "Eurosport and BT Sport will disappear after TNT Sports rebrand | TNT Sports | The Guardian",
    "url": "https://amp.theguardian.com/media/2023/feb/21/eurosport-bt-sport-disappear-tnt-rebrand-tv",
    "snippet": "WBD, which has a call option to take full control of the joint venture until September 2026, took a 20% stake in Eurosport in <strong>2012 before taking full ownership from French media group TF1 in 2015.</strong>",
    "published": "September 25, 2024"
  },
  {
    "title": "Eurosport | Warner Bros. Entertainment Wiki | Fandom",
    "url": "https://warnerbros.fandom.com/wiki/Eurosport",
    "snippet": "Discovery through its TNT Sports ... territories, and streams on Max and Discovery+. <strong>Originally a joint venture between the European Broadcasting Union and Sky established in 1989</strong>, it was briefly shut down in 1991 following complaints ...",
    "published": null
  },
  {
    "title": "Discovery takes full ownership of Eurosport from TF1 Group | Reuters",
    "url": "https://www.reuters.com/article/us-eurosport-m-a-discovery/discovery-takes-full-ownership-of-eurosport-from-tf1-group-idUSKCN0PW1YT20150722/",
    "snippet": "Since <strong>May 2014</strong>, Discovery and Eurosport have broadcast events such as UEFA Champions League soccer, the Europa League and Major League Soccer. The latest deal also includes a provision for TF1 to buy back Discovery&#x27;s 20 percent interest in TV ...",
    "published": "July 22, 2015"
  }
]