[
  {
    "title": "Anke Domscheit-Berg: \"The most important complex is digital sovereignty\" | heise online",
    "url": "https://www.heise.de/en/news/Anke-Domscheit-Berg-The-most-important-complex-is-digital-sovereignty-10328983.html",
    "snippet": "Anke Domscheit-Berg, Germany&#x27;s best-known digital politician, <strong>has left the Bundestag</strong>. In an interview with c&#x27;t, she takes stock and makes demands.",
    "published": "March 26, 2025"
  },
  {
    "title": "Digitalexpertin vergleicht neue KI-Verordnung mit zahnlosem Tiger | MDR.DE",
    "url": "https://www.mdr.de/nachrichten/deutschland/politik/domscheit-berg-kritik-ki-gesetz-100.html",
    "snippet": "Aber die gesetzliche Grundlage fehlt trotzdem. Außerdem braucht die BNetzA dafür Haushaltsmittel – und es gibt immer noch keinen Bundeshaushalt für <strong>2025</strong> – daran wird sich auch bis mindestens Ende September nichts ändern und es ist absehbar, dass es sowieso zu wenig wird.",
    "published": "August 4, 2025"
  },
  {
    "title": "Anke Domscheit-Berg | taz.de",
    "url": "https://taz.de/Anke-Domscheit-Berg/!t5032646/",
    "snippet": "Nach Lauer geht nun auch Netzaktivistin Domscheit-Berg. ... Die Piratenpartei will trotz ihrer schlechten Umfrageergebnisse ins EU-Parlament. Auf dem Parteitag in Bochum werden die Wahlkampfthemen bestimmt. ... Hier finden Sie weitere Antworten auf die sonntaz-Frage „Brauchen wir die Piraten noch?“ – unter anderem von Anke Domscheit-Berg.",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg: Alle News, Analysen und Berichte",
    "url": "https://www.berliner-zeitung.de/topics/anke-domscheit-berg",
    "snippet": "Die Linke Domscheit-Berg ist in ihrem Wahlkreis in Brandenburg von fünf Kandidaten der größeren Parteien die einzige Ostdeutsche. Sie sagt, da laufe was falsch. ... Als ein großer Schritt in der Covid-Bekämpfung wurde die Corona-Warn-App bezeichnet. Hat sie die Erwartungen erfüllt? Experten-Meinungen aus Berlin. ... Die Netzpolitikerin Anke Domscheit-Berg sieht die Aktion von Jan Josef Liefers &amp; Co.",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg - Aktivistin, Publizistin, Mitglied des Deutschen Bundestages",
    "url": "https://mdb.anke.domscheit-berg.de/",
    "snippet": "Mitglied des Deutschen Bundestages Oktober 2017 – März 2025 Mein BlogMedienecho ... Highlights aus den aktuellen Presseberichten. ... „Wir haben kein Geldmangelproblem und mehr Geld hilft nicht“, sagt auch Anke Domscheit-Berg, (Linksfraktion). Es brauche eher ein zentralgesteuertes ...",
    "published": "March 24, 2025"
  }
]