[
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Al-Bashir served as head of state, under the title of Chairman of the Revolutionary Command Council for National Salvation from 1989 to 1993 and as president from 1993 to 2019 (and from 1996 as the leader of the National Congress Party). Al-Bashir was removed from power by the Sudanese Armed Forces on 11 April 2019, amid the Sudanese revolution after holding the office for nearly 30 years.",
    "published": "November 14, 2025"
  },
  {
    "title": "List of heads of government of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_government_of_Sudan",
    "snippet": "The office of prime minister was abolished after the 1989 coup d&#x27;état, and reestablished in 2017 as deputy head of government when <strong>Bakri Hassan Saleh</strong> was appointed prime minister by President Omar al-Bashir.",
    "published": "October 23, 2025"
  },
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "It was reported that Sudan wanted Israeli support following the capture of Khartoum by the SAF in exchange for Sudan&#x27;s recognition. On 6 March 2024, al-Burhan&#x27;s son, Mohammed Fattah Burhan Rahman, was severely injured after his motorcycle collided with another vehicle in Ankara, Turkey. He died of his injuries on 3 May after spending nearly two months in intensive care. ... ^ While al-Burhan heads the Transitional Sovereignty Council, his role in the council is weak and thus, al-Burhan and the council both served as collective head of state until a coup led by al-Burhan in October 2021 where the council was dissolved and al-Burhan became the sole head of state.",
    "published": "3 weeks ago"
  },
  {
    "title": "Omar al-Bashir - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Omar_al-Bashir",
    "snippet": "<strong>Omar Hassan Ahmad al-Bashir</strong> (born 1 January 1944) is a Sudanese former military officer and politician who served as Sudan&#x27;s head of state under various titles from 1989 until 2019, when he was deposed in a coup d&#x27;état.",
    "published": "2 days ago"
  },
  {
    "title": "Heads of State of Sudan (1956–Present)",
    "url": "https://www.sudanembassy.de/index.php/ct-menu-item-14/ct-menu-item-15",
    "snippet": "Most important achievements of ... that stated granting autonomy to Sudan . Afterward a parliament was formed of the Senate and the Parliament of 50 members he aded by Ahmed Mohamed Yasin then by Mohamed Al - Hassan Dyab. The Parliament was formed of 97 members headed by Babikir ...",
    "published": null
  }
]