[
  {
    "title": "Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mark_Carney",
    "snippet": "Mark Joseph Carney (born March 16, 1965) is a Canadian politician and economist who has been serving as the <strong>24th prime minister of Canada since 2025</strong>. He has also been leader of the Liberal Party and the member of Parliament (MP) for Nepean since 2025.",
    "published": "1 day ago"
  },
  {
    "title": "Mark Carney - Prime Minister of Canada | Prime Minister of Canada",
    "url": "https://www.pm.gc.ca/en",
    "snippet": "Statement by Prime Minister Carney marking 10 years since the release of the Final Report of the Truth and Reconciliation Commission · December 15, 2025 · Published · 52087 · Media Advisories · Sunday, December 14, 2025 · December 14, 2025 · Published · 52092 ·",
    "published": null
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "He was elected Leader of the Liberal Party of Canada and <strong>sworn in as Prime Minister in March 2025</strong>. He leads a government that will take action to unite Canadians, defend Canada’s sovereignty, ...",
    "published": null
  },
  {
    "title": "Premiership of Mark Carney - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Premiership_of_Mark_Carney",
    "snippet": "The premiership of Mark Carney began on <strong>March 14, 2025</strong>, when the first Cabinet headed by Mark Carney was sworn in by Governor General Mary Simon. Carney was invited to form the 30th Canadian Ministry and become the 24th Prime Minister of Canada ...",
    "published": "2 days ago"
  },
  {
    "title": "Oil executives once booed Canada’s prime minister. Now they cheer him.",
    "url": "https://www.washingtonpost.com/world/2025/12/13/canada-carney-climate-oil-pipeline/",
    "snippet": "Mark Carney, once a U.N. special envoy on climate action and finance, is now winning praise from industry but alienating former environmental allies. ... Canadian Prime Minister Mark Carney, as governor of the Bank of England in 2015, attends the U.N. Climate Change Conference in Paris, where nations negotiated the Paris agreement.",
    "published": "3 days ago"
  }
]