[
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "At this time, Mohammed began to move from one position to another, such as secretary-general of the Riyadh Competitive Council, special advisor to the chairman of the board for the King Abdulaziz Foundation for Research and Archives, and a member of the board of trustees for Albir Society in the Riyadh region. In October 2011, Crown Prince Sultan bin Abdulaziz died. Prince Salman began his ascent to power by becoming second deputy prime minister and minister of defence.",
    "published": "2 weeks ago"
  },
  {
    "title": "How rich is Saudi Arabia’s King Salman bin Abdulaziz Al Saud? Net worth in 2025 | World News - The Times of India",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/how-rich-is-saudi-arabias-king-salman-bin-abdulaziz-al-saud-net-worth-in-2025/articleshow/125961000.cms",
    "snippet": "Fahda bint Falah Al Hithlain – ... arm, gallbladder surgery in 2020, and reported mild dementia, yet he <strong>continues to perform ceremonial duties as king</strong>.King Salman’s legacy is defined by modernizing Riyadh, steering the kingdom ...",
    "published": "7 hours ago"
  },
  {
    "title": "Sara bint Mashour Al Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sara_bint_Mashour_Al_Saud",
    "snippet": "Her mother, Noura, is the daughter of Mohammed bin Saud Al Kabeer and granddaughter of Noura bint Abdul Rahman Al Saud and Saud Al Kabeer. Princess Sara married Prince Mohammed on 6 April 2008. They have five children, three boys and two girls: Prince Salman, Prince Mashour, Princess Fahda, Princess Noura and Prince Abdulaziz (born April 2021).",
    "published": "1 day ago"
  },
  {
    "title": "Saudi crown prince hosted at friendlier US Congress | Reuters",
    "url": "https://www.reuters.com/world/us/saudi-crown-prince-heads-us-congress-no-longer-railing-against-him-2025-11-19/",
    "snippet": "The crown prince has denied ordering the operation but acknowledged responsibility as Saudi Arabia&#x27;s de facto ruler. Although memories of that time may have faded, bin Salman&#x27;s reception on Capitol Hill was more subdued than welcomes given other world leaders.",
    "published": "1 month ago"
  },
  {
    "title": "Crown Prince Mohammed bin Salman: Latest News and Updates | South China Morning Post",
    "url": "https://www.scmp.com/topics/crown-prince-mohammed-bin-salman",
    "snippet": "The latest news on Crown Prince Mohammed bin Salman, Crown Prince and Prime Minister of Saudi Arabia, including Saudi Arabian political news and updates.",
    "published": null
  }
]