[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "De Havilland Aircraft of Canada Limited (DHC) is a Canadian aircraft manufacturer founded in 2018 that purchased the aircraft programs of the original the de Havilland Canada, which was founded in 1928. The aircraft types currently in production or planned for production include the DHC-6 Twin Otter, DHC-8 Dash 8, and DHC-515 Firefighter turboprop aircraft.",
    "published": "1 month ago"
  },
  {
    "title": "About - De Havilland Canada",
    "url": "https://dehavilland.com/about/",
    "snippet": "With more than 5,000 aircraft delivered, De Havilland Aircraft of Canada Limited is a global leader in turboprop and special-mission aircraft.",
    "published": "March 15, 2023"
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "In November 2018, <strong>Longview Aviation Capital Corp.</strong> acquired the Dash 8 programme and the de Havilland Canada brand from Bombardier, adding them to the rights and type certificates for all of the out-of-production aircraft (DHC-1 through DHC-7) already sold to its subsidiary Viking Air in 2005.",
    "published": "November 1, 2025"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited",
    "url": "https://www.baesystems.com/en/heritage/de-havilland-canada",
    "snippet": "In 1980, the Canadian Government forced the privatisation of De Havilland Aircraft of Canada and in 1986 it sold the company to Boeing. The company and name is now in the ownership of <strong>Bombardier Aerospace</strong>.",
    "published": null
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "It has designed and built iconic Canadian bush planes such as the Beaver, the Otter and the Twin Otter, as well as transport and commuter aircraft. Owned by <strong>Longview Aviation Capital</strong>, de Havilland currently manufactures the Dash 8 commuter plane.",
    "published": null
  }
]