[
  {
    "title": "FC Versailles 78 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FC_Versailles_78",
    "snippet": "The club is an official academy of the French Football Federation. Since 2024, the club has been <strong>partially owned by French Formula One driver Pierre Gasly</strong>. FC Versailles was formed in 1989 as the result of a merger between Racing Club Versailles and Companion Sports Versailles.",
    "published": "3 weeks ago"
  },
  {
    "title": "FC Versailles 78",
    "url": "https://grokipedia.com/page/FC_Versailles_78",
    "snippet": "FC Versailles 78 is a French semi-professional football club based in Versailles, in the Yvelines department (department 78), that currently competes in the Championnat National, the third tier of the French football league system.[1][2] Formed in 1989 through the merger of Racing Club de Versailles and Compagnons Sportifs de Versailles, the club adopted the name Football Club de Versailles 78 and has since risen through the regional and national divisions, achieving promotion to the Championnat National in 2023 after winning the Championnat National 2 title.[3][4] The club&#x27;s home matches are",
    "published": null
  },
  {
    "title": "r/formula1 on Reddit: Pierre Gasly becomes the 3rd partner owner of FC Versailles",
    "url": "https://www.reddit.com/r/formula1/comments/1bhvt10/pierre_gasly_becomes_the_3rd_partner_owner_of_fc/",
    "snippet": "Pierre&#x27;s decision to invest in FC Versailles demonstrates his desire to commit to the club&#x27;s long-term development and to contribute to its success. As an accomplished top-level sportsman, he will bring all his knowledge in terms of sporting performance. His visibility in France and internationally will also enhance the club&#x27;s profile. Our shared ambition is to structure ...",
    "published": "March 18, 2024"
  },
  {
    "title": "Gasly named co-owner of third-division French football club - Motorsport Week",
    "url": "https://www.motorsportweek.com/2024/03/19/gasly-named-co-owner-of-third-division-french-football-club/",
    "snippet": "The club is situated in the commute ... merged. <strong>The Frenchman has been revealed as the third partner in FC Versailles, becoming an equal shareholder with President Alexandre Mulliez and his partner Fabien Lazare</strong>....",
    "published": "March 19, 2024"
  },
  {
    "title": "Formula 1 driver Pierre Gasly becomes French football club's co-owner",
    "url": "https://www.aa.com.tr/en/sports/formula-1-driver-pierre-gasly-becomes-french-football-clubs-co-owner/3168580",
    "snippet": "Formula 1 driver <strong>Pierre Gasly</strong> has become co-owner of FC Versailles, a semi-professional French football club based near Paris.",
    "published": null
  }
]