[
  {
    "title": "All news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/all",
    "snippet": "15 December 2025 - 16:31 · <strong>The Head of State thanked Julia Klöckner and the entire Bundestag for allocating €11.5 billion in defense assistance to Ukraine for next year</strong>. 15 December 2025 - 16:08 ·",
    "published": "13 hours ago"
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "7 December 2025 - 14:00 · On Local Self-Government Day, President of Ukraine <strong>Volodymyr Zelenskyy signed a decree awarding state honors to heads and employees of local authorities</strong>. 7 December 2025 - 13:53 ·",
    "published": "1 week ago"
  },
  {
    "title": "Russian Offensive Campaign Assessment, December 13, 2025",
    "url": "https://understandingwar.org/research/russia-ukraine/russian-offensive-campaign-assessment-december-13-2025/",
    "snippet": "Ukrainian President <strong>Volodymyr Zelensky</strong> announced that he will hold discussions regarding a peace settlement with US and European delegations in Berlin in the coming days.[21] Two White House officials told Axios on December 13 that US Special ...",
    "published": "20 hours ago"
  },
  {
    "title": "The President of Ukraine and the Prime Minister of Canada Discussed the Development of Steps Needed to End the War",
    "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251209-ukraine-president02.htm",
    "snippet": "Home :: WMD :: Library :: News :: Ukraine :: 2025 :: December :: ... <strong>President of Ukraine Volodymyr Zelenskyy had a phone call with Prime Minister of Canada Mark Carney</strong>. The leaders discussed the development of steps necessary to end the war and diplomatic work with partners.",
    "published": null
  },
  {
    "title": "December 4, 2025 — Trump administration news, scrutiny over strikes on alleged drug boats | CNN Politics",
    "url": "https://www.cnn.com/politics/live-news/trump-russia-ukraine-venezuela-12-04-2025",
    "snippet": "I commend the leadership and persistent diplomacy of Russia and Ukraine in the pursuit of the reunification of children and families,” Trump said in a press release announcing the release of the children, six boys and one girl. She added, “In close partnership, my representative and I have provided humanitarian support from the United States to enhance the reunification initiative’s outcome.",
    "published": "2 weeks ago"
  }
]