[
  {
    "title": "Alexander De Croo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_De_Croo",
    "snippet": "De Croo was born in Vilvoorde and <strong>studied business engineering at the Vrije Universiteit Brussel before attaining an MBA at Northwestern University in the United States</strong>. He worked for Boston Consulting Group before starting his own company, Darts-ip, in 2006.",
    "published": "1 week ago"
  },
  {
    "title": "Alexander De Croo named as new Administrator of United Nations Development Programme | United Nations Development Programme",
    "url": "https://www.undp.org/press-releases/alexander-de-croo-named-new-administrator-united-nations-development-programme",
    "snippet": "De Croo holds a <strong>Master of Business Administration from the Kellogg School of Management at Northwestern University in Chicago and a degree in business engineering from the Solvay Brussels School of Economics and Management</strong>.",
    "published": null
  },
  {
    "title": "In Conversation with Alexander De Croo",
    "url": "https://fordschool.umich.edu/event/2025/conversation-alexander-de-croo",
    "snippet": "A business engineer by training, De Croo <strong>obtained an MBA from the Kellogg School of Management, Northwestern University, Chicago in 2004.</strong>",
    "published": null
  },
  {
    "title": "From Business Leader to Belgian Prime Minister | Spring/Summer 2021 Kellogg Magazine",
    "url": "https://www.kellogg.northwestern.edu/magazine/features/spring-summer-2021/from-business-leader-to-belgian-prime-minister.aspx",
    "snippet": "Indeed, De Croo initially steered away from a political career — first, working as a consultant for a global firm, then pursuing <strong>business school at Kellogg</strong> and founding his own startup.",
    "published": null
  },
  {
    "title": "H.E. Mr. Alexander De Croo | Generation Unlimited",
    "url": "https://www.generationunlimited.org/he-mr-alexander-de-croo",
    "snippet": "In 2019, when he was sworn in as ... by training, Alexander De Croo <strong>obtained an MBA from the Kellogg School of Management, Northwestern University, Chicago (United States) in 2004.</strong>...",
    "published": null
  }
]