[
  {
    "title": "2025 German federal election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_German_federal_election",
    "snippet": "Following a government crisis, <strong>Olaf Scholz</strong> dismissed FDP leader Christian Lindner from the incumbent government on 6 November 2024, triggering the collapse of the traffic light coalition and leaving the government without a majority. On the same day, Chancellor Scholz announced he would submit ...",
    "published": "4 days ago"
  },
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "The current officeholder is <strong>Friedrich Merz</strong> of the Christian Democratic Union, sworn in on 6 May 2025. The office of chancellor has a long history, stemming back to the Holy Roman Empire (c. 900–1806). The title of chancellor (Latin: cancellarius) was given to the head of the clerics at the ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Germany's new chancellor: Who is Friedrich Merz? – DW – 05/06/2025",
    "url": "https://www.dw.com/en/germanys-new-chancellor-who-is-friedrich-merz/a-72314352",
    "snippet": "But as the would-be head of government, Merz hopes to lead a coalition between the CDU and these parties, and mediate between their interests. To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video · According to the German business magazine Wirtschaftswoche, Merz is a &quot;trans-atlanticist, friend of Europe, and reformer.&quot; This, it wrote, could mean he was &quot;exactly the right person for the current ...",
    "published": "May 6, 2025"
  },
  {
    "title": "Meet Germany's new government – DW – 05/06/2025",
    "url": "https://www.dw.com/en/meet-germanys-new-government/g-72377502",
    "snippet": "Germany&#x27;s new government is in place. Cabinet ministers include loyal allies of CDU Chancellor <strong>Friedrich Merz and SPD leader Lars Klingbeil</strong>. However, some of the appointments are surprising.",
    "published": null
  },
  {
    "title": "Who is Friedrich Merz, Germany's likely next chancellor? – DW – 04/09/2025",
    "url": "https://www.dw.com/en/german-election-2025-cdu-friedrich-merz-angela-merkel-chancellor-business-v3/a-70845544",
    "snippet": "Christoph Strack | Rina Goldenberg04/09/2025April 9, 2025 · <strong>Friedrich Merz</strong> is set to become Germany&#x27;s next chancellor. He has a checkered history in German politics — from challenging Angela Merkel to causing controversy by aligning with ...",
    "published": "April 11, 2025"
  }
]