[
  {
    "title": "High Representative of the Union for Foreign Affairs and Security Policy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/High_Representative_of_the_Union_for_Foreign_Affairs_and_Security_Policy",
    "snippet": "The position&#x27;s purview was augmented ... for Foreign Affairs and Security Policy, inaugurated upon the coming into force of the Treaty of Lisbon, was <strong>Catherine Ashton</strong>....",
    "published": "October 20, 2025"
  },
  {
    "title": "High Representative / Vice President | EEAS - European Union",
    "url": "https://www.eeas.europa.eu/eeas/high-representative-vice-president_en",
    "snippet": "The role of &#x27;High Representative for Common Foreign and Security Policy&#x27; was <strong>created by the Treaty of Amsterdam, which entered into force in 1999</strong>. A decade later, the Treaty of Lisbon expanded the role, adding significant new responsibilities.",
    "published": null
  },
  {
    "title": "High Representative of the Union for Foreign Affairs and Security Policy - EUR-Lex",
    "url": "https://eur-lex.europa.eu/EN/legal-content/glossary/high-representative-of-the-union-for-foreign-affairs-and-security-policy.html",
    "snippet": "The post of HR was <strong>originally created in 1997 under the Amsterdam Treaty</strong> and the first holder of the post was Javier Solana, Secretary-General of the Council of the European Union. The Lisbon Treaty, which entered into force in December 2009, maintained the function of the HR, albeit with a ...",
    "published": null
  },
  {
    "title": "EU High Representative for Foreign Affairs and Security Policy - Consilium",
    "url": "https://www.consilium.europa.eu/en/council-eu/high-representative-foreign-affairs-security-policy/",
    "snippet": "<strong>The Lisbon Treaty, which entered into force in December 2009</strong>, extended the responsibilities of the High Representative by including the presidency of the Foreign Affairs Council and the role of vice-president of the Commission.",
    "published": null
  },
  {
    "title": "High Representative of the Union for Foreign Affairs and Security Policy (EU) | Practical Law",
    "url": "https://uk.practicallaw.thomsonreuters.com/w-014-6457?transitionType=Default&contextData=(sc.Default)",
    "snippet": "The chief co-ordinator and representative of the Common Foreign and Security Policy (CFSP), including the Common Security and Defence Policy (CSDP), within the EU. The High Representative is also one of the Vice-Presidents of the European Commission and chairs the Council of the EU when it sits in its Foreign Affairs configuration.",
    "published": null
  }
]