[
  {
    "title": "Curtis Samuel: Player News - NBC Sports - NBC Sports",
    "url": "https://www.nbcsports.com/nfl/curtis-samuel/5323/news",
    "snippet": "Get all the most recent Curtis Samuel player news, headlines, injury updates, transactions, and more on NBC Sports.",
    "published": null
  },
  {
    "title": "Is Curtis Samuel Playing This Week? | Are They Playing? (2025) | FantasyPros",
    "url": "https://www.fantasypros.com/nfl/myplaybook/are-they-playing/curtis-samuel",
    "snippet": "Will Curtis Samuel play? Our highly-accurate AI model looks at the latest injury information to tell you his chance of playing this week.",
    "published": null
  },
  {
    "title": "Buffalo Bills injury report has Mecole Hardman, Curtis Samuel listed",
    "url": "https://www.democratandchronicle.com/story/sports/football/nfl/bills/2025/11/18/buffalo-bills-injury-report-mecole-hardman-curtis-samuel/87338234007/",
    "snippet": "Bringing Codrington back is a tell-tale sign that the Bills will not have new kick returner Mecole Hardman, or wide receiver/returner Curtis Samuel, available for the game. Both Samuel (elbow and neck) and Hardman (calf) were hurt in last Sunday’s victory over Tampa Bay. Hardman, who was just signed as a free agent last week which led to the release of Codrington from the 53-man roster, ripped off a 61-yard kickoff return on his first play with the team, but then later lost a fumble on a punt return and suffered the injury.",
    "published": "1 month ago"
  },
  {
    "title": "Curtis Samuel - NFL News, Rumors, & Updates | FOX Sports",
    "url": "https://www.foxsports.com/nfl/curtis-samuel-player",
    "snippet": "He missed almost three weeks of practice due to a <strong>hamstring injury</strong> before returning to the field as a limited participant as of Aug. 15. Considering the Bills would incur a $8.635 million dead cap hit if he&#x27;s cut this coming week, Samuel appears certain to included among the Bills&#x27; initial ...",
    "published": null
  },
  {
    "title": "Curtis Samuel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Curtis_Samuel",
    "snippet": "Samuel began the 2025 season operating as a backup wide receiver, recording seven receptions for 81 yards and a touchdown across six appearances. He was placed on <strong>injured reserve</strong> on November 28, 2025, due to an elbow injury.",
    "published": "1 week ago"
  }
]