[
  {
    "title": "1. FFC Turbine Potsdam - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/1._FFC_Turbine_Potsdam",
    "snippet": "The left part of the inner side shows an eagle. It is taken from the badge of state of Brandenburg. The upper right part shows football. The lower right side shows the letters &quot;TP&quot; which stand for &quot;Turbine Potsdam&quot;. The club plays their home games at <strong>Karl Liebknecht Stadion in Potsdam-Babelsberg</strong>.",
    "published": "October 24, 2025"
  },
  {
    "title": "1. FFC Turbine Potsdam live score, schedule & player stats | Sofascore",
    "url": "https://www.sofascore.com/team/football/1-ffc-turbine-potsdam/5542",
    "snippet": "Venue · Name<strong>Karl-Liebknecht-Stadion</strong> · Capacity10499 · CityPotsdam-Babelsberg, Germany · 1. FFC Turbine Potsdam live scores, players, season schedule and today’s results are available on Sofascore. 1. FFC Turbine Potsdam will play the next match against SC Sand on Sep 14, 2025, 12:00:00 ...",
    "published": null
  },
  {
    "title": "Karl-Liebknecht-Stadion Potsdam - order tickets online for events in Potsdam - Reservix - your ticket portal",
    "url": "https://www.reservix.de/potsdam/venue/karl-liebknecht-stadion/v16683",
    "snippet": "Das <strong>Karl-Liebknecht-Stadion, kurz „KarLi“,</strong> ist die Heimstätte des SV Babelsberg 03 und des 1.FFC Turbine Potsdam. In diesem brandenburgischen Stadion geht jede Woche während der Saison die Post ab wenn die Heimvereine auf ihre Gegner treffen. Schon zum Ende des 19.",
    "published": null
  },
  {
    "title": "Karl-Liebknecht-Stadion, Potsdam | cityseeker",
    "url": "https://cityseeker.com/potsdam-de/689134-karl-liebknecht-stadion",
    "snippet": "Home stadium of FFC Turbine Potsdam and SV Babelsberg 03, <strong>Karl-Liebknecht-Stadion</strong> is a huge football stadium with excellent views of the ground. With a seating capacity of 2003 and a standing capacity of 8784, it can accommodate all of 10,787 ...",
    "published": null
  },
  {
    "title": "1. FFC Turbine Potsdam | Potsdam | Facebook",
    "url": "https://www.facebook.com/turbinepotsdam/",
    "snippet": "1. FFC Turbine Potsdam, Potsdam. 28,489 likes · 1,210 talking about this · 487 were here. Offizielle FB-Seite des 1. FFC Turbine Potsdam. Bitte achtet die Netiquette &amp; einen respektvollen Umgang!",
    "published": null
  }
]