[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She previously played for WSL clubs <strong>Manchester United, Bristol Academy, Birmingham City, Doncaster Belles, and Reading</strong>, and in the Bundesliga with VfL Wolfsburg. Earps has represented England at under-17, under-19, and under-23 levels, and won her first senior cap in 2017.",
    "published": "8 hours ago"
  },
  {
    "title": "Mary Earps | Paris Saint-Germain",
    "url": "https://en.psg.fr/teams/womens-team/squad/mary-earps",
    "snippet": "After a short spell abroad, she returned to England in summer 2019 to sign for Manchester United. In five seasons with the <strong>Red Devils</strong>, Mary Earps played nearly 100 games and won the 2024 Women’s FA Cup shortly before joining Paris Saint-Germain ...",
    "published": null
  },
  {
    "title": "Mary Earps MBE (@maryearps) - Instagram",
    "url": "https://www.instagram.com/maryearps/",
    "snippet": "See Instagram photos and videos from <strong>Mary</strong> <strong>Earps</strong> MBE (@maryearps)",
    "published": null
  },
  {
    "title": "r/WomensSoccer on Reddit: Mary Earps: from Spoty winner to PSG bench (with no shirts in club shop)",
    "url": "https://www.reddit.com/r/WomensSoccer/comments/1ft17uf/mary_earps_from_spoty_winner_to_psg_bench_with_no/",
    "snippet": "I was thinking about this Mary Earps club choice yesterday and couldn&#x27;t figure out the real reason apart from oil money offered by psg. In France, psg are not even the biggest club in women&#x27;s football and they have been known for being losers all around the club from the men&#x27;s team in UCL to ...",
    "published": "September 30, 2024"
  },
  {
    "title": "Mary Earps on life at PSG: ‘There was a lot of noise so it’s been nice to escape’ | Sport | The Guardian",
    "url": "https://www.theguardian.com/football/2025/apr/03/mary-earps-psg-england-interview-moving-the-goalposts",
    "snippet": "Photograph: Eurasia Sport Images/Getty Images · The 32-year-old former <strong>Manchester United</strong> goalkeeper had played abroad before, for the German club Wolfsburg in 2018-19, but that was long before she helped England win 2022’s Euros and received ...",
    "published": "April 4, 2025"
  }
]