[
  {
    "title": "VfL Wolfsburg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/VfL_Wolfsburg",
    "snippet": "June 2025, prematurely terminated in March 2024. Wolfsburg plays at the <strong>Volkswagen Arena</strong>, a multi-purpose stadium which seats a total capacity of 30,000 spectators. Before construction was finished in 2002, Wolfsburg played their home games at the 21,600 capacity VfL-Stadium.",
    "published": "1 day ago"
  },
  {
    "title": "Stadium | Volkswagen Arena and AOK Stadion | VfL Wolfsburg",
    "url": "https://www.vfl-wolfsburg.de/en/stadium",
    "snippet": "The VfL-Stadion on Elsterweg - which still hosts VfL Ladies’ reserve team games, among others - no longer met the club’s requirements and, in 2002, the <strong>Volkswagen Arena</strong> became the Wolves’ new home. The new 30,000-capacity stadium, which is located on In den Allerwiesen, was officially ...",
    "published": null
  },
  {
    "title": "VfL Wolfsburg - Stadium - Volkswagen Arena | Transfermarkt",
    "url": "https://www.transfermarkt.us/vfl-wolfsburg/stadion/verein/82",
    "snippet": "This page provides you with information about the stadium of the selected club. In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights.",
    "published": null
  },
  {
    "title": "Volkswagen Arena | VfL Wolfsburg | VfL Wolfsburg",
    "url": "https://www.vfl-wolfsburg.de/en/stadium/volkswagen-arena",
    "snippet": "Since 2002 the <strong>Volkswagen Arena</strong> has brought these terms together as one. Regardless of age, everyone has a place in the <strong>Volkswagen Arena</strong> · It&#x27;s all about getting behind the team for 90 minutes, giving it everything and winning together. Any trip includes cutting-edge technology and first-class ...",
    "published": null
  },
  {
    "title": "Volkswagen Arena - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volkswagen_Arena",
    "snippet": "<strong>Volkswagen Arena</strong> (German pronunciation: [ˈfɔlksvaːɡn̩ ʔaˌʁeːnaː]; also known as the VfL Wolfsburg Arena due to UEFA sponsorship regulations) is a football stadium in the German city of Wolfsburg, Lower Saxony.",
    "published": "1 month ago"
  }
]