[
  {
    "title": "Spalletti: Now I know more about the players I have at my disposal - Juventus",
    "url": "https://www.juventus.com/en/news/articles/ucl-2025-2026-conferenza-stampa-spalletti-e-kalulu-vigilia-juventus-pafos",
    "snippet": "On <strong>Wednesday, December 10, 2025, at 21:00 CET, Juventus will host Pafos at the Allianz Stadium for Matchday 6 of the UEFA Champions League League Phase</strong>. Coach Luciano Spalletti and Pierre Kalulu spoke on the match against the Cypriots at a press ...",
    "published": null
  },
  {
    "title": "Spalletti urges 'sloppy' Cabal to improve despite Juventus winner | Juvefc.com",
    "url": "https://www.juvefc.com/luciano-spalletti-juan-cabal-juventus-bologna/",
    "snippet": "Luciano Spalletti on the sidelines ... am · Juventus manager Luciano Spalletti <strong>wants to see further improvement from Juan Cabal, despite his decisive contribution against Bologna</strong>....",
    "published": "1 day ago"
  },
  {
    "title": "Official: Spalletti confirms 23-man Juventus squad for Bologna - Yahoo Sports",
    "url": "https://sports.yahoo.com/articles/official-spalletti-confirms-23-man-154500457.html",
    "snippet": "TURIN, ITALY – DECEMBER 02: Luciano Spalletti, Head Coach of Juventus, <strong>looks on prior to the Serie C match between Ternana Calcio and Juventus Next Gen at Allianz Stadium on December 02, 2025 in Turin, Italy</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Spalletti: I hope to be in the title race - Juventus",
    "url": "https://www.juventus.com/en/news/articles/spalletti-i-hope-to-be-in-the-title-race-31-10-25",
    "snippet": "“<strong>We are truly delighted to welcome Luciano Spalletti to Juventus</strong>. He has a proven track record of success, as demonstrated by his experiences throughout his career, both nationally and internationally.",
    "published": null
  },
  {
    "title": "Spalletti: 'Most important Juventus win, but I have to be hard on them' after 1-0 victory",
    "url": "https://football-italia.net/spalletti-most-important-juventus-win-hard/",
    "snippet": "BOLOGNA, ITALY – DECEMBER 14: Luciano Spalletti, Head Coach of Juventus, greets Vincenzo Italiano, Head Coach of Bologna, prior to the Serie A match between Bologna FC 1909 and Juventus FC at Renato Dall’Ara Stadium on <strong>December 14, 2025</strong> in ...",
    "published": "2 days ago"
  }
]