[
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "The president of Portugal, officially the president of the Portuguese Republic (Portuguese: Presidente da República Portuguesa, pronounced [pɾɨziˈðẽtɨ ðɐ ʁɛˈpuβlikɐ puɾtuˈɣezɐ]), is the head of state and highest office of Portugal.",
    "published": "3 days ago"
  },
  {
    "title": "Portugal: president dissolves parliament",
    "url": "https://www.eunews.it/en/2025/03/21/portugal-president-dissolves-parliament/",
    "snippet": "Portuguese President <strong>Marcelo Rebelo de Sousa</strong> arrives to address the Portuguese after the Portuguese State Council meeting at Belem Palace in Lisbon on March 13, 2025. Portugal&#x27;s president took steps on March 13, 2025 toward calling a third ...",
    "published": "March 21, 2025"
  },
  {
    "title": "Portugal's president invites caretaker PM to lead new government | Reuters",
    "url": "https://www.reuters.com/world/europe/portugals-president-invites-caretaker-pm-lead-new-government-2025-05-29/",
    "snippet": "Luis Montenegro, Social Democratic Party (PSD) and Democratic Alliance (AD) leader, meets with Portugal President <strong>Marcelo Rebelo de Sousa</strong> at Belem Palace, following the final results of the general elections in Lisbon, Portugal, May 29, 2025.",
    "published": "May 29, 2025"
  },
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "Only indoor audiences at Belém Palace remained scheduled. On 1 December 2025, <strong>Marcelo Rebelo de Sousa</strong> was admitted to University Hospital of São João, in Porto, for urgent surgery due to an incarcerated hernia, after feeling unwell.",
    "published": "1 week ago"
  },
  {
    "title": "Luís Montenegro - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lu%C3%ADs_Montenegro",
    "snippet": "He was appointed prime minister by President <strong>Marcelo Rebelo de Sousa</strong>, leading the XXIV Constitutional Government, a coalition minority government. His government fell in March 2025 after losing ...",
    "published": "3 days ago"
  }
]