[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "The site&#x27;s new owner, Disney, hired G. Elliott Morris to develop a new model. On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to ABC News pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight.",
    "published": "1 month ago"
  },
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "On July 22, 2013, <strong>ESPN (a subsidiary of the Walt Disney Company)</strong> announced that it had acquired ownership of the FiveThirtyEight website and brand, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming ...",
    "published": "1 day ago"
  },
  {
    "title": "Nate Silver – FiveThirtyEight",
    "url": "https://fivethirtyeight.com/contributors/nate-silver/",
    "snippet": "<strong>Nate Silver</strong> founded and was the editor in chief of FiveThirtyEight.",
    "published": null
  },
  {
    "title": "Nate Silver, FiveThirtyEight Founder, Expects to Depart ABC News Amid Layoffs - The New York Times",
    "url": "https://www.nytimes.com/2023/04/25/business/media/nate-silver-abc-disney-fivethirtyeight.html",
    "snippet": "In 2013, the franchise moved to ESPN, the sports empire controlled by the Walt Disney Company. It was acquired by <strong>ABC News</strong> in 2018. Livia Albeck-Ripka is a reporter for The Times based in California.",
    "published": "April 25, 2023"
  },
  {
    "title": "FiveThirtyEight joins ABC News - ABC News",
    "url": "https://abcnews.go.com/US/fivethirtyeight-joins-abc-news/story?id=54531745",
    "snippet": "ABC News announced today it has reached an agreement in principle to acquire the renowned data journalism organization FiveThirtyEight from ESPN.",
    "published": "April 17, 2018"
  }
]