[
  {
    "title": "Curtis Samuel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Curtis_Samuel",
    "snippet": "He was named the 2013 New York Gatorade Player of the Year and was invited to All-American Bowl. A 4-star running-back recruit, Samuel committed to play college football for the <strong>Ohio State Buckeyes</strong>. He contributed in the 2014–2016 seasons under head coach Urban Meyer.",
    "published": "2 weeks ago"
  },
  {
    "title": "Curtis Samuel - Buffalo Bills Wide Receiver - ESPN",
    "url": "https://www.espn.com/nfl/player/_/id/3121427/curtis-samuel",
    "snippet": "View the profile of <strong>Buffalo Bills</strong> Wide Receiver Curtis Samuel on ESPN. Get the latest news, live stats and game highlights.",
    "published": null
  },
  {
    "title": "Curtis Samuel Profile - Bio, Game Log, Career Stats, Draft, College, News & Videos",
    "url": "https://www.sportskeeda.com/nfl/curtis-samuel",
    "snippet": "He scored his first career touchdown against the New York Giants. Samuel then joined the <strong>Washington Commanders</strong> in 2021 and is currently playing with them. Carolina Panthers and <strong>Washington Commanders</strong> are the teams that he has played for so far in his professional playing career.",
    "published": null
  },
  {
    "title": "Curtis Samuel's Contract Breakdown, Salary Cap Details, Bonuses, Terms & More",
    "url": "https://www.sportskeeda.com/nfl/curtis-samuel-contract",
    "snippet": "Q. Which NFL teams has Curtis Samuel played for? - + A. Curtis Samuel has played for the <strong>Carolina Panthers</strong> (2017-2020), Washington Commanders (2021-2023), and Buffalo Bills. Q. How tall is Curtis Samuel? - + A. Curtis Samuel stands 5 feet 11 inches, or 180 cm, tall.",
    "published": "January 13, 2025"
  },
  {
    "title": "Curtis Samuel (WR): Bio, News, Stats & more",
    "url": "https://www.buffalobills.com/team/players-roster/curtis-samuel/",
    "snippet": "<strong>Buffalo Bills</strong> quarterback Josh Allen unbelievably scrambles in circles away from the entire Miami Dolphins defense for an INSANE 21-yard pass to to wide receiver Curtis Samuel.",
    "published": null
  }
]