[
  {
    "title": "Tele2 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tele2",
    "snippet": "In November 2018, <strong>Tele2 was merged with telecom operator Com Hem</strong>, which delivered, among other things, TV, broadband and telephony.",
    "published": "November 2, 2025"
  },
  {
    "title": "Tele2 and Com Hem merger - Tele2",
    "url": "https://www.tele2.com/investors/tele2-and-com-hem-merger",
    "snippet": "<strong>Com Hem Holding was dissolved</strong> and all of its assets and liabilities were transferred to Tele2.",
    "published": null
  },
  {
    "title": "The merger between Tele2 and Com Hem is completed - Tele2",
    "url": "https://www.tele2.com/media/news/2018/the-merger-between-tele2-and-com-hem-is-completed/",
    "snippet": "Stockholm – The Swedish Companies ... The merger between Tele2 and Com Hem Holding is thereby completed and <strong>Com Hem Holding has been dissolved</strong>....",
    "published": null
  },
  {
    "title": "The European Commission has approved the merger of Tele2 and Com Hem - Inderes",
    "url": "https://www.inderes.fi/en/releases/the-european-commission-has-approved-the-merger-of-tele2-and-com-hem",
    "snippet": "Today <strong>the European Commission approved the merger of Tele2 and Com Hem unconditionally</strong>. The merger will combine two highly cash generative businesses with clear synergies to create a leading integrated connectivity provider in the Baltic Sea region.",
    "published": null
  },
  {
    "title": "The European Commission has approved the merger of Tele2 and Com Hem - Tele2",
    "url": "https://www.tele2.com/media/news/2018/the-european-commission-has-approved-the-merger-of-tele2-and-com-hem",
    "snippet": "Stockholm – The European Commission today announced that it has approved the merger of Tele2 AB (publ) (“Tele2”) (Nasdaq Stockholm: TEL2 A and TEL2 B) and Com Hem Holding AB (publ) (“Com Hem”) (Nasdaq Stockholm: COMH) <strong>unconditionally</strong>.",
    "published": null
  }
]