[
  {
    "title": "Terry Pegula - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Terry_Pegula",
    "snippet": "On June 23, 2025, it was announced that Pegula would divest ownership of the Knighthawks franchise. It was later announced on August 5, 2025 that the <strong>Seneca Nation of New York</strong> had purchased the team. In 2012, he won a bid for the development rights to the Webster Block on Buffalo&#x27;s waterfront.",
    "published": "1 week ago"
  },
  {
    "title": "Kim Pegula net worth 2025: How the Buffalo Bills owner built her NFL fortune | NFL News - The Times of India",
    "url": "https://timesofindia.indiatimes.com/sports/nfl/news/kim-pegula-net-worth-2025-how-the-buffalo-bills-owner-built-her-nfl-fortune/articleshow/124347716.cms",
    "snippet": "... <strong>Kim Pegula</strong> has had a wonderful transforming journey. Once an abandoned child in South Korea, she is successfully becoming one of the most powerful figures in American sports. As of 2025, Pegula and her husband, Terry Pegula, own a combined ...",
    "published": "October 8, 2025"
  },
  {
    "title": "Kim Pegula - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kim_Pegula",
    "snippet": "Her husband, Terry, took up Kim&#x27;s president position with the Bills and Sabres, which like all other former PSE properties, would be managed separately. Pegula is also one of a handful of female NFL owners, including Sheila Ford Hamp (Detroit Lions), Virginia Halas McCaskey (Chicago Bears), Amy Adams Strunk (Tennessee Titans), Carol Davis (Las Vegas Raiders), Denise DeBartolo York (San Francisco 49ers), Gayle Benson (New Orleans Saints), Janice McNair (Houston Texans), Jody Allen (Seattle Seahawks) and Dee Haslam (Cleveland Browns).",
    "published": "August 22, 2025"
  },
  {
    "title": "'Small-market' Bills rewarding owner Terry Pegula with hefty return on investment",
    "url": "https://www.si.com/nfl/bills/news/business-small-market-bills-rewarding-owner-terry-pegula-with-hefty-return-on-investment",
    "snippet": "Roger Goodell, the NFL commissioner, talks with majority owner of the Buffalo Bills, <strong>Terry Pegula</strong>, during the Bills warm up before the Buffalo Bills divisional game against the Baltimore Ravens at Highmark Stadium in Orchard Park on Jan. 19, 2025.",
    "published": "August 15, 2025"
  },
  {
    "title": "Bills owner Terry Pegula faces backlash over $100M yacht while New York taxpayers help fund new stadium",
    "url": "https://www.foxnews.com/sports/bills-owner-terry-pegula-faces-backlash-over-100m-yacht-while-new-york-taxpayers-help-fund-new-stadium",
    "snippet": "New York Gov. Kathy Hochul visits with Bills owner <strong>Terry Pegula</strong> and his daughter, Laura Pegula, during her visit to the team’s training camp at St. John Fisher University July 24, 2025, in Pittsford, N.Y.",
    "published": "August 21, 2025"
  }
]