[
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "She was officially inaugurated on 3 July 2010, as president for a limited term, until elections could be organised. Her successor, <strong>Almazbek Atambayev</strong>, was elected in the 2011 Kyrgyzstani presidential election and subsequently succeeded Otunbayeva on 1 December that year. On 16 October 2017, ...",
    "published": "November 11, 2025"
  },
  {
    "title": "Sadyr Japarov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sadyr_Japarov",
    "snippet": "<strong>Sadyr Nurgojo uulu Japarov</strong> (born 6 December 1968) is a Kyrgyz politician who has been serving as the sixth president of Kyrgyzstan since 28 January 2021. He previously served as the 22nd prime minister in the 2020 interim government, following the resignation of President Sooronbay Jeenbekov.",
    "published": "3 weeks ago"
  },
  {
    "title": "Kyrgyz President Japarov Brings Together All Five Of Country's Former Leaders",
    "url": "https://www.rferl.org/a/kyrgyzstan-japarov-five-former-leaders/32277505.html",
    "snippet": "Since her stint in 2010-2011, <strong>Otunbaeva</strong> has remained active in Kyrgyz politics and was appointed last year by UN Secretary-General Antonio Guterres as the UN&#x27;s special representative for Afghanistan.",
    "published": "February 18, 2023"
  },
  {
    "title": "Sooronbay Jeenbekov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sooronbay_Jeenbekov",
    "snippet": "Prior to that he served as the Prime Minister of Kyrgyzstan from April 2016 to August 2017. As president, Jeenbekov dealt with issues specifically in foreign policy and corruption in which several juridical reforms were implemented to improve public trust.",
    "published": "October 3, 2025"
  },
  {
    "title": "Kyrgyz president quits; prime minister, newly sprung from jail, ...",
    "url": "https://www.reuters.com/article/kyrgyzstan-protests-int/kyrgyz-president-quits-prime-minister-newly-sprung-from-jail-takes-over-idUSKBN2700YS",
    "snippet": "Kyrgyzstan&#x27;s constitution requires a new election for president within three months. The rules appear to bar <strong>Japarov</strong>, as interim president, from standing again. Kyrgyzstan has been in turmoil since an Oct.",
    "published": "October 15, 2020"
  }
]