[
  {
    "title": "2025 Georgia Power 50: The state’s most influential leaders - State Affairs Pro",
    "url": "https://pro.stateaffairs.com/ga/politics/georgia-power-50-influential-leaders",
    "snippet": "Who are Georgia’s influential leaders shaping the political and policy landscape in 2025, from Gov. <strong>Brian Kemp</strong> to other key decisionmakers?",
    "published": null
  },
  {
    "title": "Party control of Georgia state government - Ballotpedia",
    "url": "https://ballotpedia.org/Party_control_of_Georgia_state_government",
    "snippet": "The Republican Party controls the offices of governor, secretary of state, attorney general, and both chambers of the state legislature. As of December 10, 2025, there are <strong>23 Republican trifectas, 15 Democratic trifectas, and 12 divided governments where neither party holds trifecta control</strong>.",
    "published": null
  },
  {
    "title": "Georgia State Senate - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Georgia_State_Senate",
    "snippet": "As of June 2025, the majority and minority leadership is as follows: According to the state constitution of 1983, this body is to be composed of no more than 56 members elected for two-year terms. Current state law provides for 56 members. Elections are held the first Tuesday after the first Monday in November in even-numbered years. Senators must be at least 25 years old, a citizen of the United States, and a resident of Georgia for two years and their senatorial district for one year (preceding the election).",
    "published": "5 days ago"
  },
  {
    "title": "Georgia Election Results: Full Breakdown of Winners, Turnout, and 2025 Political Shifts",
    "url": "https://legalunitedstates.com/georgia-election-results/",
    "snippet": "Both parties will use the lessons of 2025 to refine their strategies. Republicans hope to build on legislative gains and reinforce their rural coalition. Democrats aim to expand in the suburbs and drive higher turnout among young voters. Given the narrow margins seen in recent statewide elections, Georgia’s political balance remains finely tuned.",
    "published": "November 5, 2025"
  },
  {
    "title": "Georgia Democrat Eric Gisler flips a state House seat in district Trump won by double digits | CNN Politics",
    "url": "https://www.cnn.com/2025/12/09/politics/georgia-democrat-eric-gisler",
    "snippet": "<strong>Republicans still control a significant majority in the Georgia House</strong>, but Tuesday’s results come just a month after Democrats won two statewide elections to flip two seats on the state’s Public Service Commission.",
    "published": "6 days ago"
  }
]