[
  {
    "title": "Alexander Van der Bellen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_Van_der_Bellen",
    "snippet": "Despite the far-right Freedom Party winning a plurality, <strong>Van der Bellen</strong> asked caretaker Chancellor Karl Nehammer of the People&#x27;s Party to form the next government instead, citing other parties&#x27; refusals to join a coalition with the Freedom Party. After the Nehammer-led coalition talks collapsed, ...",
    "published": "5 days ago"
  },
  {
    "title": "Chancellor of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Austria",
    "snippet": "The current officeholder is <strong>Christian Stocker</strong>, who was sworn in as chancellor on 3 March 2025 by President Alexander Van der Bellen. The use of the term Chancellor (Kanzler, derived from Latin: cancellarius) as head of the chancery writing office can be traced back as far as the 9th century, ...",
    "published": "September 29, 2025"
  },
  {
    "title": "Austrian Federal President Alexander Van der Bellen",
    "url": "https://www.bundespraesident.at/en/index",
    "snippet": "The Federal President is at the service of all Austrian citizens. He is the only state representative on the federal level to be elected directly by the citizens. This places the President in a strong position within the constitutional framework, as he is backed by a majority of the electorate. As the Head of State of the Republic, the Federal President has extensive, clearly defined powers:",
    "published": null
  },
  {
    "title": "The Federal President of the Republic of Austria — Austria in USA",
    "url": "https://www.austria.org/the-federal-president",
    "snippet": "The Federal President Presidential Elections The Federal Chancellor The Parliament Legislation The State Governments · The Federal President of the Republic of Austria, Dr. <strong>Alexander Van der Bellen</strong>",
    "published": null
  },
  {
    "title": "Federal Ministers and State Secretaries - Federal Chancellery of Austria",
    "url": "https://www.bundeskanzleramt.gv.at/en/federal-chancellery/the-austrian-federal-government/ministers.html",
    "snippet": "Bundesministeriengesetz-Novelle <strong>2025</strong>, BGBl.",
    "published": null
  }
]