[
  {
    "title": "Debra Elmegreen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Debra_Elmegreen",
    "snippet": "Debra Meloy Elmegreen (born November 23, 1952 in South Bend, Indiana) is an American astronomer. She was the first woman to graduate from Princeton University with a degree in astrophysics, and she was the first female post-doctoral researcher at the Carnegie Observatories.",
    "published": "December 25, 2024"
  },
  {
    "title": "Debra Elmegreen - Society for Science",
    "url": "https://www.societyforscience.org/alumni/notable/debra-elmegreen/",
    "snippet": "Barrier-breaking astrophysicist Debra Elmegreen competed in the 1971 STS and 1970 ISEF. In her career, she has served as a professor of astronomy at Vassar College and president of the International Astronomical Union and American Astronomical Society. She and her husband study galaxy evolution and discovered Little Blue Dots, a new type of galaxy.",
    "published": "March 4, 2022"
  },
  {
    "title": "Debra Meloy Elmegreen (born November 23, 1952), American Astronomer, educator | World Biographical Encyclopedia",
    "url": "https://prabook.com/web/debra_meloy.elmegreen/1373642",
    "snippet": "Married <strong>Bruce Gordon Elmegreen</strong>, August 21, 1976.",
    "published": null
  },
  {
    "title": "Debra Elmegreen - Poughkeepsie, New York, United States | Professional Profile | LinkedIn",
    "url": "https://www.linkedin.com/in/debra-elmegreen-9ab1552a/",
    "snippet": "Past President, International Astronomical Union; Professor Emerita of Astronomy, Vassar College · Debra Meloy Elmegreen was Professor of Astronomy on the Maria Mitchell Chair in the Department of Physics and Astronomy for 37 years and is now Professor Emerita.",
    "published": null
  },
  {
    "title": "Bruce Gordon Elmegreen | Department of Physics & Astronomy at Sonoma State University",
    "url": "https://phys-astro.sonoma.edu/brucemedalists/bruce-elmegreen",
    "snippet": "In 1984, after 6 years on the faculty of Columbia University, Elmegreen joined the staff of IBM Research, where he remains. There he began studies of galactic spirals with his spouse, <strong>Debra Meloy Elmegreen</strong> of Vassar College, making the first digitized color images of galaxies and examining ...",
    "published": null
  }
]