[
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "The European Film Academy was founded in 1989 under the name European Cinema Society by Swedish director <strong>Ingmar Bergman</strong>, along with forty other filmmakers from across Europe, including Bernardo Bertolucci, Claude Chabrol, Dušan Makavejev, István Szabó, and Wim Wenders.",
    "published": "September 3, 2025"
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) - IMDb",
    "url": "https://www.imdb.com/news/ni65127703/",
    "snippet": "<strong>Mike Downey</strong>, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) Producer <strong>Mike Downey</strong>, who is chair of the European Film Academy and whose co-production “Girls on Wire” is in Berlin competition, has ...",
    "published": null
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "Includes new chair <strong>Ada Solomon</strong> and deputy chairs to be Leontine Petit and Matthieu Darras · The European Film Academy membership has concluded its voting procedures for the 2026 intake, and as well as re-electing 10 members the election results ...",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "The European Film Academy has announced three new board appointments, with <strong>Ada Solomon</strong> to become chair and Leontine Petit and Matthieu Darras to be deputy chairs. The EFA membership recently concluded its voting procedures for the 2026 intake, ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Producer <strong>Ada Solomon</strong> has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian film industry has achieved within the institution.",
    "published": "2 weeks ago"
  }
]