[
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "BILL 1. H.R.6198 — 119th Congress (2025-2026) Rear Admiral Alene Duerk Ship Renaming Act of 2025 Sponsor: Kaptur, Marcy [Rep.-D-OH-9] (Introduced 11/20/2025) Cosponsors: (3) Committees: House - Armed Services Latest Action: House - 11/20/2025 Referred to the House Committee on Armed Services.",
    "published": null
  },
  {
    "title": "Longest-serving woman in Congress says she’s not stopping anytime soon - Roll Call",
    "url": "https://rollcall.com/2025/06/23/marcy-kaptur-ohio-democrat-election/",
    "snippet": "Ohio Rep. Marcy Kaptur, here at an event in Toledo last year, is the longest-serving woman in congressional history. (Tom Williams/CQ Roll Call) By Daniela Altimari Posted June 23, 2025 at 6:47pm",
    "published": "June 24, 2025"
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Kaptur was one of the 53 Democrats in the House to sign the letter.[39][40] ... Ballotpedia monitors legislation that receives a vote and highlights the ones that we consider to be key to understanding where elected officials stand on the issues. To read more about how we identify key votes, click here. The 118th United States Congress began on January 3, 2023, and ended on January 3, 2025.",
    "published": null
  },
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "She later supported the measure, voting in favor of the DREAM Act in 2021. Kaptur voted against the Equal Representation Act in 2024, which proposed excluding noncitizens ineligible to vote from the population counts used to determine congressional representation. In February 2025, Kaptur raised ...",
    "published": "1 week ago"
  },
  {
    "title": "Rep. Marcy Kaptur [D-OH9, 1983-2026], Representative for Ohio's 9th Congressional District - GovTrack.us",
    "url": "https://www.govtrack.us/congress/members/marcy_kaptur/400211",
    "snippet": "Legislative Preview Dec. 15, 2025: Congress&#x27;s Last Week of Work of the Year » ... Kaptur is the representative for Ohio’s 9th congressional district (view map) and is a Democrat. She has served since Jan. 3, 1983. Kaptur is next up for reelection in 2026 and serves until Jan.",
    "published": null
  }
]