[
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Producer <strong>Ada Solomon</strong> has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian film industry has achieved within the institution.",
    "published": "2 weeks ago"
  },
  {
    "title": "Board membership restructuring for 2024 - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/european-film-academy-to-restructure-board-membership-for-2024/",
    "snippet": "The 15 new regions have been defined by the board of the Academy as follows and will all have one representative in the board from 2024 or 2025 onwards: Albania, Bosnia and Herzegovina, Croatia, Kosovo, Montenegro, North Macedonia, Serbia, Slovenia · Austria, Germany, Switzerland, Liechtenstein (as of 2025, after current mandates end) ... With a two-year transition to a new board structure through the upcoming elections in 2023 and 2024, the European Film ...",
    "published": "August 15, 2023"
  },
  {
    "title": "Academy new members 2025: check the full list - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/new-members-2025-full-list/",
    "snippet": "34th European Film Awards Berlin PLEASE NOTE: Accreditation to the European Film Awards is limited to people who have been fully vaccinated against Covid-19 or who have recovered after a Covid-19 infection – provided they do not show typical Covid-19 symptoms.",
    "published": "May 16, 2025"
  },
  {
    "title": "European Film Academy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Film_Academy",
    "snippet": "Based on a decision of the general assembly, the number of members, limited initially to 99, has been allowed to expand. The academy invites new members once per year. As of 1 January 2025, membership has 5,383. Listed are all countries with more than 20 European Film Academy members.",
    "published": "September 3, 2025"
  },
  {
    "title": "Europe's Largest Filmmaker Community - European Film Academy e.V.",
    "url": "https://www.europeanfilmacademy.org/",
    "snippet": "07 Jul 2025 Show more · Actor / Italy · Director / UK · Actress / Germany · Acting coach / Serbia · Director / Czech Republic · Actress / Australia and UK · Actress/ Bulgaria · Director / Greece · Producer / France Join the Academy ·",
    "published": "March 9, 2021"
  }
]