[
  {
    "title": "Ohio’s 9th Congressional District - OH-09 Representatives & District Map - GovTrack.us",
    "url": "https://www.govtrack.us/congress/members/OH/9",
    "snippet": "Find your U.S. Congress senators and representative in Ohio’s 9th Congressional District (OH09) using a map.",
    "published": null
  },
  {
    "title": "Ohio's 9th congressional district - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ohio's_9th_congressional_district",
    "snippet": "Ohio&#x27;s 9th congressional district has been represented by Representative <strong>Marcy Kaptur (D)</strong> since 1983. This district is located in the northwestern part of the state, bordering Michigan, Indiana, and Ontario, Canada (via Lake Erie), and includes all of Defiance, Williams, Fulton, Lucas, Ottawa, ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Congresswoman Marcy Kaptur |Representing the 9th District of Ohio",
    "url": "https://kaptur.house.gov/",
    "snippet": "Toledo, OH — Today, Congresswoman Marcy Kaptur (OH-09) denounced the Trump Administration Commerce Department’s abrupt decision to freeze all federal support and funding, effective immediately for Ohio’s Manufacturing Extension Partnership (MEP) program — a bipartisan, Congressionally-ap...",
    "published": null
  },
  {
    "title": "Ohio's 9th Congressional District - Ballotpedia",
    "url": "https://ballotpedia.org/Ohio's_9th_Congressional_District",
    "snippet": "Voters will elect representatives under the new map in 2026. Click here to read more about mid-decade redistricting ahead of the 2026 elections. ... Ohio&#x27;s 9th Congressional District in the United States House of Representatives is represented by <strong>Marcy Kaptur (D).</strong>",
    "published": null
  },
  {
    "title": "District | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about/district",
    "snippet": "The Ninth Congressional District encompasses most of Northwestern Ohio, and much of the southern border of Lake Erie. The district is an amalgam of Northwest Ohio with communities in Defiance, Erie, Fulton, Ottawa, Lucas, Sandusky, Williams, and Wood counties.",
    "published": "October 5, 2023"
  }
]