[
  {
    "title": "Patricia Bullrich | AS/COA",
    "url": "https://www.as-coa.org/speakers/patricia-bullrich",
    "snippet": "Antes de su rol actual, Bullrich se desempeñ como Ministra de Seguridad de la Nación durante la administración <strong>2015-2019</strong>. Su extensa carrera política incluye haber sido diputada nacional por la Ciudad Autónoma de Buenos Aires de 2007 a ...",
    "published": null
  },
  {
    "title": "Patricia Bullrich - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Patricia_Bullrich",
    "snippet": "She currently serves as a National Senator for the Autonomous City of Buenos Aires since December 2025, representing La Libertad Avanza. She previously served as the Minister of National Security from <strong>2023 to 2025</strong> under president Javier Milei and from 2015 to 2019 under president Mauricio Macri.",
    "published": "5 days ago"
  },
  {
    "title": "Patricia Bullrich confirmed as security minister of Milei government - Buenos Aires Herald",
    "url": "https://buenosairesherald.com/politics/patricia-bullrich-confirmed-as-security-minister-of-milei-government",
    "snippet": "Patricia Bullrich will be Javier Milei’s security minister, the president-elect’s press team announced in a release posted Friday morning on the website X.",
    "published": "December 1, 2023"
  },
  {
    "title": "Patricia Bullrich",
    "url": "https://grokipedia.com/page/Patricia_Bullrich",
    "snippet": "Patricia Bullrich (born 11 June 1956) is an Argentine politician serving as Minister of Security since <strong>December 2023</strong> under President Javier Milei. She previously occupied the same role from 2015 to 2019 during Mauricio Macri&#x27;s presidency, where ...",
    "published": null
  },
  {
    "title": "Bullrich resigns as security minister to take up Senate seat | Buenos Aires Times",
    "url": "https://www.batimes.com.ar/news/amp/argentina/patricia-bullrich-resigns-as-security-minister-to-take-up-senate-seat.phtml",
    "snippet": "Upon his inauguration, Milei appointed Bullrich to the security minister post, a position she had previously serviced in former president Mauricio Macri’s <strong>2015-2019 government</strong>.",
    "published": null
  }
]