[
  {
    "title": "Juventus FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_FC",
    "snippet": "2000s footballer Igor Tudor. On 7 October 2025, Juventus announced that its chief executive officer, <strong>Maurizio Scanavino</strong>, would step down from his position on 7 November 2025, concluding a three-year tenure that began in late 2022 following the resignation of the club’s previous ...",
    "published": "1 week ago"
  },
  {
    "title": "Andrea Agnelli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Andrea_Agnelli",
    "snippet": "On the management side, after having promoted turnaround management through a renewal process aimed at overcoming the financial crisis in which the club had been stagnating for some years, he led Juventus to achieve results never before achieved in the economic sphere by an Italian football club. In regards to sports policy, Agnelli took a tougher position than that of the previous Juventus management, led by Giovanni Cobolli Gigli and subsequently by Jean-Claude Blanc, in the aftermath of the post-Calciopoli. Several observers allege that Calciopoli and its aftermath were also a dispute within Juventus and between the club&#x27;s owners, including Franzo Grande Stevens and Gianluigi Gabetti who favoured Elkann over Agnelli as chairman, and wanted to get rid of Luciano Moggi, Antonio Giraudo, and Roberto Bettega, whose shares in the club increased.",
    "published": "3 weeks ago"
  },
  {
    "title": "Tether Submits Proposal to Acquire Juventus Football Club - Tether.io",
    "url": "https://tether.io/news/tether-submits-proposal-to-acquire-juventus-football-club/",
    "snippet": "12 December 2025 – <strong>Tether has submitted a binding all cash proposal to Exor to acquire its entire stake in Juventus Football Club</strong>. Subject to regulatory approvals, Tether intends to make a public offer for the remaining shares at the same ...",
    "published": null
  },
  {
    "title": "Current Shareholding - Juventus Football Club",
    "url": "https://www.juventus.com/en/club/investor-relations/shareholding-title/current-shareholding",
    "snippet": "As of 7 November 2025 the shareholding structure of Juventus Football Club S.p.A.",
    "published": null
  },
  {
    "title": "Tuttosport claims Andrea Agnelli wants to return to Juventus as majority owner | Black & White & Read All Over",
    "url": "https://www.blackwhitereadallover.com/2025/3/13/24383859/juventus-andrea-agnelli-john-elkann-jurgen-klopp-2025-serie-a-ownership-agnelli-family",
    "snippet": "Agnelli, who served as Juve president and chairman for 12 years starting in 2010, would almost certainly need a heavy financial backing to make such a move happen, with Red Bull being tossed out as said fund that would back the former Juve president’s bid to take sole control of the club that his family has owned since 1923. The report states that current Juventus president Gianluca Ferrero, who took over as president in 2023 following Agnelli’s departure, has been “managing” a potential deal for months.",
    "published": "March 13, 2025"
  }
]