[
  {
    "title": "4 questions as France faces critical budget crunch – POLITICO",
    "url": "https://www.politico.eu/article/french-government-faces-crucial-vote-social-security-budget-lecornu/",
    "snippet": "France&#x27;s Prime Minister Sébastien Lecornu <strong>during a debate on the 2026 social security budget bill in the National Assembly Dec. 5, 2025</strong>. The issue has doomed his two immediate predecessors.",
    "published": "2 weeks ago"
  },
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "<strong>He was in office as a caretaker prime minister until he was reappointed by President Macron on 10 October 2025</strong>. Lecornu was born on 11 June 1986 in Eaubonne, Val-d&#x27;Oise Department, to Jean-Pierre Lecornu, an aeronautical technician at the Safran Aircraft Engines factory in Vernon, and Martine ...",
    "published": "1 week ago"
  },
  {
    "title": "Macron presses PM Lecornu to secure a budget for France",
    "url": "https://www.lemonde.fr/en/politics/article/2025/12/23/macron-presses-pm-lecornu-to-secure-a-budget-for-france_6748779_5.html",
    "snippet": "Prime Minister Sébastien Lecornu, <strong>at the Elysée Palace in Paris, on December 22, 2025</strong>.",
    "published": "10 hours ago"
  },
  {
    "title": "Re-appointed French Prime Minister Sébastien Lecornu names new cabinet after meeting with Macron | Euronews",
    "url": "https://www.euronews.com/2025/10/12/reappointed-french-prime-minister-sebastien-lecornu-names-new-cabinet-after-meeting-with-m",
    "snippet": "France&#x27;s Socialist Party was less straightforward, with its leader Olivier Faure saying &quot;No Comment&quot; in his own post on X. <strong>Sebastien Lecornu was re-appointed prime minister on Friday</strong> and has been working to quickly appoint key cabinet members ...",
    "published": "October 13, 2025"
  },
  {
    "title": "Opinion | France Needs a New France - The New York Times",
    "url": "https://www.nytimes.com/2025/12/22/opinion/france-macron-sixth-republic.html",
    "snippet": "Lecornu, returned to the office he had so hurriedly vacated, has managed to bring some stability by making concessions to rivals. He might even succeed in passing a budget. But he is not out of the woods yet. Without a clear majority in the National Assembly, the government remains vulnerable to a motion of no confidence. That could force Mr. Macron to name yet another prime minister — the sixth of his second term — or call snap legislative elections.",
    "published": "1 day ago"
  }
]