[
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "Sebastian Coe is Chancellor of Loughborough University, Executive Chairman of CSM Sport and Entertainment and a member of the IOC Tokyo 2020 Coordination Committee and council member of the Association of Summer Olympic International Federations. He was Chairman of the London 2012 Organising Committee for the Olympic and Paralympic Games, having previously been Chairman of the London 2012 bid company. Seb set 12 world records during his athletics ...",
    "published": null
  },
  {
    "title": "Sebastian Coe - World Athletics President | Facebook",
    "url": "https://www.facebook.com/p/Sebastian-Coe-World-Athletics-President-100069033975532/",
    "snippet": "Sebastian Coe - World Athletics President. 2,946 likes · 7 talking about this. One of the great runners ever, multiple World Record Holder and Two-Time Olympic Gold Medalist Seb Coe has been serving...",
    "published": null
  },
  {
    "title": "Sebastian Coe - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sebastian_Coe",
    "snippet": "In November 2012, he was appointed chairman of the British Olympic Association. Coe was presented with the Lifetime Achievement award at the BBC Sports Personality of the Year in December 2012. <strong>At the 2024 Millrose Games, Coe was awarded The Armory&#x27;s Presidents</strong> ...",
    "published": "1 month ago"
  },
  {
    "title": "Coe re-elected and will preside over historic gender equal Council | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/sebastian-coe-president-congress-2023-gender-equal-council",
    "snippet": "A total of 192 voting members of Congress voted for Coe and three abstained. Under the World Athletics Constitution, this will be Coe’s final term as President. In 2019, Restrepo, the 1992 Olympic 400m bronze medallist from Colombia, became the first woman to be elected as a World Athletics Vice President.",
    "published": null
  },
  {
    "title": "World Athletics Convention inspires innovation action | PRESS-RELEASES | World Athletics",
    "url": "https://worldathletics.org/news/press-releases/world-athletics-convention-tokyo-2025-innovation-action",
    "snippet": "Inspired by the trail blazed by keynote speaker Bob Weis, World Athletics President Sebastian Coe reinforced the imperative that innovation drives the future of athletics during his opening speech for the World Athletics Convention",
    "published": null
  }
]