[
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "Modi won the constituency of Maninagar, defeating Shweta Bhatt of the INC. The BJP won 115 of the 182 seats, continuing its majority during his tenure. After his election as Prime Minister of India, Modi resigned as the Gujarat chief minister and as MLA for Maninagar. <strong>Anandiben Patel</strong> succeeded ...",
    "published": "1 day ago"
  },
  {
    "title": "Premiership of Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Premiership_of_Narendra_Modi",
    "snippet": "The premiership of Narendra Modi began 26 May 2014 with his swearing-in as the prime minister of India at the Rashtrapati Bhavan. He succeeded <strong>Manmohan Singh</strong> of the Indian National Congress (INC).",
    "published": "3 weeks ago"
  },
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "After Indira Gandhi&#x27;s assassination, her son Rajiv Gandhi took charge until 1989, when a decade with five unstable governments began. This was followed by the full terms of P. V. Narasimha Rao, Atal Bihari Vajpayee, <strong>Manmohan Singh</strong>, and Narendra Modi, who is the current prime minister of India, ...",
    "published": "2 days ago"
  },
  {
    "title": "List of prime ministers of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India",
    "snippet": "The Congress and its United Progressive Alliance (UPA) won the general elections in 2004 and 2009, <strong>Manmohan Singh</strong> serving as prime minister between 2004 and 2014. The BJP won the 2014 Indian general election, and its parliamentary leader Narendra Modi formed the first non-Congress single-party ...",
    "published": "1 week ago"
  },
  {
    "title": "Know the PM | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/pms-profile/",
    "snippet": "Shri Modi believes that no Indian should be homeless and to realise this vision, over 4.2 crore houses were sanctionedunder the PM Awas Yojana between 2014 and 2024. In June 2024, after assuming office for the third term, one of the first decisions of the Cabinet was to assist 3 crore additional rural and urban households for the construction of houses, underscoring Shri Narendra Modi’s commitment to addressing the nation’s housing needs and ensuring dignity and a quality life for every citizen.",
    "published": null
  }
]