[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The paper was founded with the 1897 merger of the Summit Beacon, first published in 1839, and the Akron Evening Journal, founded in 1896. In 1903, the Beacon Journal was purchased by <strong>Charles Landon Knight</strong>. His son John S. Knight inherited the paper, in 1933, on Charles&#x27; death.",
    "published": "September 20, 2025"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "The Akron paper was owned by <strong>the Knight family</strong> for nearly seven decades starting in 1907, and then the Knight Ridder company beginning in 1974. That company sold the Beacon Journal to McClatchy Co. in 2006, which sold it that same year to Black ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media | Crain's Cleveland Business",
    "url": "https://www.crainscleveland.com/article/20180411/news/157966/akron-beacon-journal-sold-gatehouse-media",
    "snippet": "The award-winning paper had long been owned by <strong>Knight Ridder</strong>, but was sold to Black Press when <strong>Knight Ridder</strong> was McClatchy Co. Rick O&#x27;Connor, president and chief executive officer of Black Press, told Ohio.com that the company, based in British ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal History: Founding, Timeline, and Milestones - Zippia",
    "url": "https://www.zippia.com/the-akron-beacon-journal-careers-1163355/history/",
    "snippet": "David Black says he will remain chairman of the company that bought the Beacon Journal in 2006 from McClatchy Co. ... In 2018, <strong>GateHouse Media</strong> bought the newspaper. ... Rate Akron Beacon Journal&#x27;s efforts to communicate its history to employees.",
    "published": "July 21, 2023"
  },
  {
    "title": "Gatehouse Media purchases Akron Beacon Journal - cleveland.com",
    "url": "https://www.cleveland.com/akron/2018/04/gatehouse_media_purchases_akro.html",
    "snippet": "The Beacon Journal in downtown Akron has served the Akron community since 1839 when it launched as the Summit Beacon. It was the flagship newspaper for the <strong>Knight Newspaper Co.</strong>, which later became Knight Ridder. In addition to its daily papers, ...",
    "published": "April 11, 2018"
  }
]