[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "By 1986, IRI was suffering heavy losses—with Alfa Romeo having not been profitable for the last 13 years—and IRI president <strong>Romano Prodi</strong> put Alfa Romeo up for sale. Finmeccanica, the mechanical holdings arm of IRI and its predecessors owned Alfa Romeo since 1932.",
    "published": "3 weeks ago"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "Many Sterling Heights drivers may be surprised to know that the history of Alfa Romeo dates back to 1910. When <strong>Cavalier Ugo Stella</strong> purchased the shares of an italian automotive plant in Milan, the company’s legacy of sport-oriented vehicles began.",
    "published": "April 26, 2021"
  },
  {
    "title": "Is Alfa Romeo Part of Stellantis? | Benson Alfa Romeo",
    "url": "https://www.alfaromeousaofgreer.com/research/is-alfa-romeo-part-of-stellantis.htm",
    "snippet": "So who owned Alfa Romeo during this time? Between 1932 and 1986, <strong>an Italian state-holding company</strong> owned Alfa, and Alfa Romeo joined the Fiat Chrysler Group. The company then became Alfa Romeo Automobiles S.p.A as a subsidiary of Fiat, also known as FCA or Fiat Chrysler Automobiles.",
    "published": null
  },
  {
    "title": "Who Owns Alfa Romeo? | Where is Alfa Romeo Made?",
    "url": "https://www.aristocratmotorsalfaromeo.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "In 1932, <strong>the Italian state holding company</strong> owned Alfa, which lasted until 1986. During these years, Alfa joined the Fiat group. Then in February 2007, it became Alfa Romeo Automobiles S.p.A.",
    "published": "July 25, 2025"
  },
  {
    "title": "Who Makes Alfa Romeo? | Alfa Romeo of Omaha",
    "url": "https://www.alfaromeoomaha.com/alfaromeo-research/who-owns-alfa-romeo/",
    "snippet": "The history of who owns Alfa Romeo then becomes complicated. Twenty-two years later, in 1932, Alfa was owned by an Italian state holding company, which would last until 1986. Alfa would also merge with the Fiat group. In the 21st century, Alfa Romeo became Alfa Romeo Automobiles S.p.A., which later became a subsidiary of Fiat-Chrysler Automobiles.",
    "published": "January 13, 2024"
  }
]