[
  {
    "title": "Martin 'absolutely' confident he will remain FF leader",
    "url": "https://www.rte.ie/news/politics/2025/1216/1549211-fianna-fail-review/",
    "snippet": "<strong>Taoiseach Micheál Martin has said he has absolute confidence in remaining as Fianna Fáil leader</strong> after receiving the review of his party&#x27;s presidential election campaign.",
    "published": "21 minutes ago"
  },
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "Martin was awarded &quot;Politician of the Year&quot; by the Journal for his performance and election result. <strong>He was elected again as Taoiseach in a 95–76 vote by the Dáil on 23 January 2025</strong> following a coalition agreement between Fianna Fáil, Fine Gael and with the support of several independent TDs.",
    "published": "2 weeks ago"
  },
  {
    "title": "Taoiseach Micheál Martin attends meeting of the Coalition of the Willing in support of Ukraine",
    "url": "https://www.gov.ie/en/department-of-the-taoiseach/press-releases/taoiseach-miche%C3%A1l-martin-attends-meeting-of-the-coalition-of-the-willing-in-support-of-ukraine-/",
    "snippet": "Last updated on: 11 December 2025 · Taoiseach Micheál Martin participated in a meeting this evening of the Coalition of the Willing in support of Ukraine. The video meeting was co-chaired by British Prime Minister Keir Starmer, and President of France Emmanuel Macron and was joined also by President Volodymyr Zelenskyy of Ukraine.",
    "published": "5 days ago"
  },
  {
    "title": "Statement by Taoiseach Micheál Martin on Sydney attack",
    "url": "https://www.gov.ie/en/department-of-the-taoiseach/press-releases/statement-by-taoiseach-miche%C3%A1l-martin-on-sydney-attack/",
    "snippet": "From: Department of the Taoiseach · Published on: 14 December 2025 · Last updated on: 14 December 2025 · I am shocked and appalled by the gun attack targeting Sydney’s Jewish community that has left at least twelve dead and dozens more injured. Our thoughts and prayers go to the families ...",
    "published": "2 days ago"
  },
  {
    "title": "Taoiseach ‘absolutely’ confident as Fianna Fáil to consider presidential election review",
    "url": "https://www.irishtimes.com/politics/2025/12/16/taoiseach-absolutely-confident-as-fianna-fail-to-consider-presidential-election-review/",
    "snippet": "Taoiseach Micheál Martin has said he has ‘absolute’ confidence in his leadership of Fianna Fáil as the parliamentary party is to meet on Tuesday evening to discuss its review of the presidential election.",
    "published": "6 hours ago"
  }
]