[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "In 2000, following the announcement of a new law that raised the electoral threshold for State Duma elections, Navalny joined the <strong>Russian United Democratic Party</strong> Yabloko. According to Navalny, the law was stacked against Yabloko and Union of Right Forces, and he decided to join, even though ...",
    "published": "1 week ago"
  },
  {
    "title": "Yabloko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yabloko",
    "snippet": "In March 2002, the party became ... the Liberal International and winner of its Prize for Freedom. Yabloko was a member of the <strong>Alliance of Liberals and Democrats for Europe (ALDE)</strong> from 2006 to 2025....",
    "published": "3 weeks ago"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "Navalny joined the <strong>Russian United Democratic Party</strong>, also known as “Yabloko.” It was immediately clear to him that the new law was directed at Yabloko, encouraging him to take a more active role in the party, despite him claiming in an interview ...",
    "published": null
  },
  {
    "title": "Russia’s ‘Last Liberal Party’ Cuts Ties With Navalny Supporters - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/10/18/russias-last-liberal-party-cuts-ties-with-navalny-supporters-a75327",
    "snippet": "<strong>Russian liberal party</strong> Yabloko announced Monday it will cut ties with members who had backed jailed Kremlin critic Alexei Navalny’s anti-Kremlin voting initiative, a move that underlines bitter divisions in the country’s fragmented opposition.",
    "published": "September 10, 2025"
  },
  {
    "title": "‘We consider Alexey Navalny’s ideas destructive and dangerous for Russia’ | openDemocracy",
    "url": "https://www.opendemocracy.net/en/odr/yablokov-russia-navalny-rybakov/",
    "snippet": "How do you feel about the words of journalist Ilya Azar, who wrote on social media that Yabloko’s only chance to prove its independence from the Kremlin is to nominate Andrei Pivovarov, the recently arrested former director of Open Russia, and Lyubov Sobol, a Navalny ally, as its candidates? We take these kinds of statements into account, but do not act on calls from social networks. Lyubov Sobol herself contacted us, but recently announced that she was refusing to participate in the elections, because she understood that she would be removed.",
    "published": "July 8, 2021"
  }
]