[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "He had a lengthy tenure in the ... acting career, appearing in films such as Predator and The Running Man. Ventura <strong>entered politics in 1991 when he was elected mayor of Brooklyn Park, Minnesota</strong>, a position he held until 1995....",
    "published": "3 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Biden received 306 electoral votes and President Donald Trump (R) received 232 electoral votes. In the national popular vote, Biden received 81.2 million votes and Trump received 74.2 million votes. The Green Party of Alaska nominated Ventura as its nominee rather than Howie Hawkins, the national nominee for the Green Party, on September 1, 2020.[3]",
    "published": null
  },
  {
    "title": "Jesse Ventura | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/jesse-ventura",
    "snippet": "During the 1990s, Ventura became increasingly involved in state politics. He joined the <strong>Minnesota Independence Party (later affiliated with H. Ross Perot as the Minnesota Reform Party)</strong> and supported MIP candidate Dean Barkley for the US Senate.",
    "published": null
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "Upon leaving wrestling, Ventura ... the title of his 1999 autobiography. His first foray into politics was as <strong>mayor of Brooklyn Park (1991–95)</strong>....",
    "published": "January 14, 2009"
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th Governor of Minnesota on November 3, 1998 defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He served as Governor for one term. Shocking the political establishment, Ventura became the only Reform Party candidate to ...",
    "published": null
  }
]