[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "<strong>WBD would serve as managing partner, with Eurosport&#x27;s UK operations to be merged with the BT Sport networks</strong>. As part of the agreement, WBD also negotiated a deal for BT Group to distribute Discovery+ to its television and BT Sport subscribers. WBD would rebrand BT Sport as TNT Sports, deriving ...",
    "published": "5 days ago"
  },
  {
    "title": "EURO SPORT & EVENT MANAGEMENT LTD overview - Find and update company information - GOV.UK",
    "url": "https://find-and-update.company-information.service.gov.uk/company/05036028",
    "snippet": "EURO SPORT &amp; EVENT MANAGEMENT LTD - Free company information from Companies House including registered office address, filing history, accounts, annual return, officers, charges, business activity",
    "published": null
  },
  {
    "title": "Eurosport Management Team | Org Chart",
    "url": "https://rocketreach.co/eurosport-management_b5c4665cf42e0dc0",
    "snippet": "The Eurosport management team includes <strong>Patrick Maitrot (VP International Sales France, South Europe, Switzerland &amp; LATAM), Philippe Pichon (Director - Financial Planning and Analysis), and Wendy Hung (Head of Communications, Asia-Pacific).</strong>",
    "published": null
  },
  {
    "title": "European Sport Management Quarterly: Vol 25, No 6 (Current issue)",
    "url": "https://www.tandfonline.com/toc/resm20/current",
    "snippet": "Explore the current issue of European Sport Management Quarterly, Volume 25, Issue 6, 2025",
    "published": null
  },
  {
    "title": "Eurosport International 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/63601-30",
    "snippet": "Information on acquisition, funding, investors, and executives for Eurosport International. Use the PitchBook Platform to explore the full profile.",
    "published": null
  }
]