[
  {
    "title": "Mike Downey - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q41249585",
    "snippet": "Mike Downey, photo by Damil Kalogjera.jpg 2,000 × 1,338; 1.34 MB · 0 references · sex or gender · male · 1 reference · stated in · Integrated Authority File · GND ID · 1061259013 · retrieved · 2 August 2024 · country of citizenship · France · 0 references ·",
    "published": null
  },
  {
    "title": "Mike Downey | Producer, Actor, Writer",
    "url": "https://www.imdb.com/name/nm0236026/",
    "snippet": "Mike Downey. Producer: Elvis Walks Home. Mike Downey, producer, and CEO of Film and Music Entertainment (F&amp;ME), launched his independent UK production company on the Frankfurt DAX in 2009. Since then, he has produced more than 40 feature films, with producing partner Sam Taylor and company chairman Stephen Daldry.",
    "published": null
  },
  {
    "title": "Mike Downey (producer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mike_Downey_(producer)",
    "snippet": "After gaining a BA degree in French with Theatre Studies at the University of Warwick, Downey went on to continue post-graduate studies at the University of Paris III: Sorbonne Nouvelle (as a Boursier du Gouvernement Francais/French Government Scholar), and Paris X Nanterre.",
    "published": "July 19, 2025"
  },
  {
    "title": "Mike Downey (columnist) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mike_Downey_(columnist)",
    "snippet": "Mike Downey (August 9, 1951 – June 12, 2024) was an <strong>American</strong> newspaper columnist. He was known for his columns in the Chicago area, such as writing pieces for the Chicago Tribune, the Chicago Sun-Times and Chicago Daily News.",
    "published": "2 weeks ago"
  },
  {
    "title": "Biography — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/biography/",
    "snippet": "Mike Downey founded the UK-based independent production house Film and Music Entertainment (F&amp;ME) in 2000 as part of an IPO on the Frankfurt DAX and to date has production credits nigh on 100 feature films.",
    "published": null
  }
]