[
  {
    "title": "Sam Mostyn - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sam_Mostyn",
    "snippet": "On 3 April 2024, Prime Minister Anthony Albanese announced that King Charles III had approved the appointment of Mostyn as the next governor-general of Australia, succeeding David Hurley, and that she would be sworn in on <strong>1 July 2024</strong>.",
    "published": "1 week ago"
  },
  {
    "title": "Sam Mostyn facts for kids",
    "url": "https://kids.kiddle.co/Sam_Mostyn",
    "snippet": "On <strong>3 April 2024</strong>, Prime Minister ... approved Mostyn to be the next governor-general of Australia. She officially began her role on 1 July 2024. She is the first governor-general to have been born in Canberra.",
    "published": null
  },
  {
    "title": "The Governor-General's biography | Governor-General of the Commonwealth of Australia",
    "url": "https://www.gg.gov.au/about-governor-general/governor-generals-biography",
    "snippet": "Ms Sam Mostyn AC was sworn in as Australia’s 28th Governor-General on <strong>1 July 2024</strong>. A businesswoman and community leader, Ms Mostyn is known for her exceptional service to the Australian community. She has a long history in executive and governance roles across diverse sectors, including business, ...",
    "published": null
  },
  {
    "title": "Her Excellency the Honourable Ms Sam Mostyn AC",
    "url": "https://www.aiiw.org.au/team-profiles/sam-mostyn/",
    "snippet": "Ms Sam Mostyn AC was sworn in as Australia’s 28th Governor-General on <strong>1 July 2024</strong>. A businesswoman and community leader, Ms Mostyn is known for her exceptional service to the Australian community.",
    "published": "March 6, 2025"
  },
  {
    "title": "Former DCA Deputy Chair Sam Mostyn to become next Governor-General - Diversity Council Australia",
    "url": "https://www.dca.org.au/news/media-releases/former-dca-deputy-chair-sam-mostyn-to-become-next-governor-general",
    "snippet": "DCA congratulates Sam Mostyn AO on her appointment as Australia&#x27;s 28th Governor-General, to be sworn in on <strong>1 July 2024</strong>.",
    "published": "April 3, 2024"
  }
]