[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Two subsidiaries of the IAU were also created at this assembly: the International Time Commission seated at the International Time Bureau in Paris, France, and the International Central Bureau of Astronomical Telegrams initially seated in Copenhagen, Denmark. The seven initial member states were Belgium, Canada, France, Great Britain, Greece, Japan, and the United States, soon to be followed by Italy and Mexico. The first executive committee consisted of Benjamin Baillaud (President, France), Alfred Fowler (General Secretary, UK), and four vice presidents: William Campbell (US), Frank Dyson (UK), Georges Lecointe (Belgium), and Annibale Riccò (Italy).",
    "published": "5 days ago"
  },
  {
    "title": "Category:Presidents of the International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Category:Presidents_of_the_International_Astronomical_Union",
    "snippet": "Category:Presidents of the International Astronomical Union ·",
    "published": null
  },
  {
    "title": "The Founding of the IAU and the First Executive Committee",
    "url": "https://www.iau.org/about/first_executive_committee/",
    "snippet": "He was the founder of the Bureau International de l&#x27;Heure, one of the two original IAU subsidiaries. ... Fowler was a world leader in the field of spectroscopy, demonstrating in particular that sunspots were cooler than the solar photosphere. Elected Fellow of the Royal Society in 1910, he became its President from 1919 to 1921. He also drafted the first statutes of the IAU. ... Abetti contributed to positional astronomy and performed detailed observations of minor planets, comets and star occultations.",
    "published": null
  },
  {
    "title": "International Astronomical Union – GKToday",
    "url": "https://www.gktoday.in/international-astronomical-union/",
    "snippet": "Later Presidents have included <strong>Jan Oort, Victor Ambartsumian, Otto Heckmann, Adriaan Blaauw, Vainu Bappu, Robert Hanbury Brown, Catherine Cesarsky, Norio Kaifu, and Silvia Torres</strong>, reflecting the Union’s global and disciplinary diversity. The International Astronomical Union remains central ...",
    "published": null
  },
  {
    "title": "Catherine Cesarsky elected President of the International Astronomical Union and Ian Corbett elected Assistant General Secretary | ESO France",
    "url": "https://www.eso.org/public/france/news/eso0632/",
    "snippet": "The General Assembly of the International Astronomical Union (IAU), meeting in Prague (Czechia), has elected the ESO Director General, Dr. <strong>Catherine Cesarsky</strong>, as President for a three-year period (2006-2009). The IAU is a body of distinguished ...",
    "published": null
  }
]