[
  {
    "title": "Droupadi Murmu | Life, Education, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Droupadi-Murmu",
    "snippet": "Murmu experienced poverty as a child. She completed her <strong>primary education in the village school</strong>, and she subsequently earned a Bachelor of Arts degree from Rama Devi Women’s College in Bhubaneswar.",
    "published": "3 weeks ago"
  },
  {
    "title": "Droupadi Murmu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Droupadi_Murmu",
    "snippet": "Her family named her Durgi Tudu, ... changed several times to those including Durpadi and Dorpdi in the past. Murmu studied <strong>elementary education at the local primary school in Upar Beda</strong>....",
    "published": "2 days ago"
  },
  {
    "title": "Profile | President of India",
    "url": "https://www.presidentofindia.gov.in/Profile",
    "snippet": "Droupadi Murmu was born on June 20, 1958, to a Santhal tribal family in Uparbeda in the remote Mayurbhanj district of Odisha. Her educational journey began at <strong>Uparbeda Primary School</strong>. Through her determination and passion for learning, she went on to study in Bhubaneshwar from class-VIII onwards.",
    "published": "1 week ago"
  },
  {
    "title": "Draupadi Murmu Biography",
    "url": "https://www.draupadi-murmu-biography.site/",
    "snippet": "Draupadi Murmu pursued her <strong>elementary education at a local primary school, Uparbeda</strong>. Later, she moved to Bhubaneswar for higher studies when she was only five. And then, Murmu completed secondary education at Girl&#x27;s High School Unit-2; and earned ...",
    "published": null
  },
  {
    "title": "Educational Qualification of Droupadi Murmu - Careerindia",
    "url": "https://www.careerindia.com/features/educational-qualification-of-droupadi-murmu-047777.html",
    "snippet": "She went on to pursue higher education and graduated with a <strong>Bachelor&#x27;s degree in Arts from Rama Devi Women&#x27;s College, Bhubaneswar</strong>, a well-known institution in Odisha. Her choice to study arts reflects her broader interests in social and cultural ...",
    "published": "February 1, 2025"
  }
]