[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Alfa Romeo has since maintained its distinct identity and brand through several ownership changes, including Fiat&#x27;s merger with the American Chrysler Group in 2014, forming <strong>Fiat Chrysler Automobiles (FCA), and FCA&#x27;s subsequent merger in 2021 with the French PSA Group</strong> to form Stellantis.",
    "published": "3 weeks ago"
  },
  {
    "title": "Is Alfa Romeo Part of Stellantis? | Benson Alfa Romeo",
    "url": "https://www.alfaromeousaofgreer.com/research/is-alfa-romeo-part-of-stellantis.htm",
    "snippet": "Since 2007, <strong>Fiat Chrysler Automobiles</strong> (FCA) owned Alfa Romeo. But in 2021, a new player came onto the board in the form of a new car conglomerate called Stelantis. Stelantis was formed with a joint venture, a 50-50 merger of two well-known automotive empires: the Italian-American conglomerate ...",
    "published": null
  },
  {
    "title": "Who Makes Alfa Romeo? | Alfa Romeo of Omaha",
    "url": "https://www.alfaromeoomaha.com/alfaromeo-research/who-owns-alfa-romeo/",
    "snippet": "Twenty-two years later, in 1932, Alfa was owned by an Italian state holding company, which would last until 1986. Alfa would also merge with the Fiat group. In the 21st century, Alfa Romeo became Alfa Romeo Automobiles S.p.A., which later became a subsidiary of Fiat-Chrysler Automobiles. In 2019, FCA would merge with the French Groupe PSA to rebrand as Stellantis.",
    "published": "January 13, 2024"
  },
  {
    "title": "Who Makes Alfa Romeo? | Ron Lewis Alfa Romeo",
    "url": "https://www.ronlewisalfaromeo.com/who-makes-alfa-romeo/",
    "snippet": "Who Makes Alfa Romeo: Stellantis currently oversees the production and development of Alfa Romeo vehicles. This multinational corporation was established in 2021 through the merger of <strong>Fiat Chrysler Automobiles (FCA) and PSA Group</strong>.",
    "published": "October 31, 2025"
  },
  {
    "title": "Who Owns Alfa Romeo? | Alfa Romeo of Plano",
    "url": "https://www.alfaofplano.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "From 2007 on, Alfa Romeo was owned by <strong>Fiat Chrysler Automobiles (FCA).</strong> However, on January 16, 2021, FCA merged its operations with the French PSA Group, Peugeot S.A., to form Stellantis, now recognized as the fourth largest automaker globally.",
    "published": "August 25, 2025"
  }
]