[
  {
    "title": "Sepp Blatter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sepp_Blatter",
    "snippet": "From a background in business, public relations, and sports administration, Blatter became general secretary of FIFA in 1981 and was then elected president at the 51st FIFA Congress on <strong>8 June 1998</strong>, succeeding João Havelange, who had headed the organization since 1974.",
    "published": "February 28, 2002"
  },
  {
    "title": "Joseph Sepp Blatter (1936 - ) | The Presidency",
    "url": "https://www.thepresidency.gov.za/joseph-sepp-blatter-1936",
    "snippet": "Blatter has been working at FIFA since 1975, first as technical director (1975 – 1981) and then as general secretary (1981 – 1998) before his <strong>election as FIFA president in 1998</strong>. He was re-elected as head of FIFA in 2002, and was re-elected unopposed for another four years on 31 May 2007.",
    "published": null
  },
  {
    "title": "Sepp Blatter | Biography, FIFA, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Sepp-Blatter",
    "snippet": "Sepp Blatter is a Swiss sports executive who served as the president <strong>(1998–2015)</strong> of FIFA (Fédération...",
    "published": null
  },
  {
    "title": "FIFA president Sepp Blatter announces resignation amidst corruption scandal | June 2, 2015 | HISTORY",
    "url": "https://www.history.com/this-day-in-history/june-2/sepp-blatter-announces-resignation-fifa-corruption",
    "snippet": "On <strong>June 2, 2015,</strong> Sepp Blatter, president of international soccer’s governing body FIFA, steps down, just a few days after he had been re-elected to a fifth four-year term. His resignation came amid rumors that he would soon be under investigation ...",
    "published": "May 27, 2025"
  },
  {
    "title": "The Rise and Fall of Sepp Blatter - The New York Times",
    "url": "https://www.nytimes.com/interactive/2015/05/27/sports/soccer/sepp-blatter-fifa-timeline.html",
    "snippet": "The Blatter Reign Begins After 17 years as the top deputy to the retiring Joao Havelange, Sepp Blatter is <strong>elected FIFA president in 1998</strong> in a close vote over a Swedish rival, Lennart Johansson.",
    "published": "May 27, 2015"
  }
]