[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "The ownership of the certificates gave Viking the exclusive right to manufacture new aircraft; previously, Viking had purchased in May 2005 the right to manufacture spares and distribute the de Havilland heritage aircraft product line. In addition to the de Havilland type certificates, Viking Air also acquired the Canadair CL-415 program in October 2018.",
    "published": "1 month ago"
  },
  {
    "title": "De Havilland Aircraft of Canada Acquires Fleet Canada Inc.",
    "url": "https://www.globenewswire.com/news-release/2025/04/01/3053557/0/en/De-Havilland-Aircraft-of-Canada-Acquires-Fleet-Canada-Inc.html",
    "snippet": "CALGARY, Alberta, April 01, 2025 (GLOBE NEWSWIRE) -- Today, <strong>De Havilland Aircraft of Canada (DHC) announced that it has acquired all of the shares of Fleet Canada Inc.</strong>",
    "published": null
  },
  {
    "title": "News Release Longview Aviation Capital Announces ...",
    "url": "https://dehavilland.com/en/news/posts/longview-aviation-capital-announces-consolidation-of-companies-under-de-havilland-aircraft-of-canada-limited",
    "snippet": "Victoria, BC, February 2, 2022 – Longview Aviation Capital has announced that <strong>De Havilland Aircraft of Canada Limited will become the operating brand</strong> for the companies currently operating as Longview Aviation, Viking Air, Pacific Sky Training ...",
    "published": "March 18, 2024"
  },
  {
    "title": "De Havilland Aircraft of Canada 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/292700-62",
    "snippet": "De Havilland Aircraft of Canada’s most recent deal was a <strong>Merger/Acquisition with Fleet Canada</strong>.",
    "published": null
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "The deal, which <strong>closed on 3 June 2019 following regulatory approval</strong>, brought the entire de Havilland Canada product line under the same banner for the first time in decades, under a new holding company bearing a name almost identical to the ...",
    "published": "November 1, 2025"
  }
]