[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Alexei Anatolyevich Navalny (Russian: Алексей Анатольевич Навальный, IPA: [ɐlʲɪkˈsʲej ɐnɐˈtolʲjɪvʲɪtɕ nɐˈvalʲnɨj]; <strong>4 June 1976 – 16 February 2024</strong>) was a Russian opposition leader, anti-corruption activist and political prisoner.",
    "published": "1 week ago"
  },
  {
    "title": "Who was Aleksei Navalny? - The New York Times",
    "url": "https://www.nytimes.com/newsgraphics/card-story/aleksei-navalny-timeline",
    "snippet": "Aleksei Navalny, the outspoken activist who died in prison on Friday, was born on June 4, 1976, according to his website, and grew up outside Moscow to liberal parents who opposed Soviet rule. <strong>Starting his political career as an anticorruption blogger who organized street protests</strong>, Navalny ...",
    "published": null
  },
  {
    "title": "Protests, poisoning and prison: The life of Russian opposition leader Alexei Navalny | AP News",
    "url": "https://apnews.com/article/russia-navalny-life-timeline-fa3792f839e78140dfbede5057ed65de",
    "snippet": "In a span of a decade, Alexei Navalny has gone from the Kremlin’s biggest foe to Russia’s most prominent political prisoner.",
    "published": "July 10, 2025"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice ... of the Russian Federation. <strong>In 2000, while he was still a student, Navalny joined Yabloko, a political party that promoted liberal democracy and a market economy</strong>....",
    "published": "March 7, 2023"
  },
  {
    "title": "Alexei Navalny’s rise from blogger to Putin’s chief rival: Timeline",
    "url": "https://thehill.com/policy/international/4473313-alexei-navalny-life-death-timeline/",
    "snippet": "Russian opposition leader Alexei Navalny reportedly died Friday, leading to an outpouring of grief worldwide. Navalny emerged as one of the most vocal critics of Russian President Vladimir Putin and was a popular figure known for standing up to the Kremlin and corruption in Russia. From a small-time politician and blogger to a major opposition leader and Russian presidential candidate who was poisoned and then imprisoned until his death, here’s a timeline of the life of Navalny.",
    "published": "February 16, 2024"
  }
]