[
  {
    "title": "Anne-Marie Slaughter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anne-Marie_Slaughter",
    "snippet": "Renewal: From Crisis to Transformation in Our Lives, Work, and Politics. The Public Square. Princeton University Press. ISBN ... Slaughter, Anne-Marie (2017). The Chessboard and the Web: Strategies of Connection in a Networked World. New Haven: Yale University Press.",
    "published": "October 1, 2025"
  },
  {
    "title": "BIOGRAPHY: Anne-Marie Slaughter",
    "url": "https://2009-2017.state.gov/s/p/fapb/185598.htm",
    "snippet": "Anne-Marie Slaughter is the President ... International Affairs at Princeton University. <strong>From 2009-2011 she served as the director of Policy Planning for the United States Department of State</strong>, the first woman to hold that positi...",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter | Wilson Center",
    "url": "https://www.wilsoncenter.org/person/anne-marie-slaughter",
    "snippet": "Anne-Marie Slaughter is the President ... International Affairs at Princeton University. <strong>From 2009 to 2011 she served as Director of Policy Planning for the U.S. Department of State</strong>, the first woman to hold that position...",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter | Princeton Politics",
    "url": "https://politics.princeton.edu/people/anne-marie-slaughter",
    "snippet": "Upon leaving the State Department she received the Secretary’s Distinguished Service Award for her work leading the Quadrennial Diplomacy and Development Review, as well as meritorious service awards from USAID and the Supreme Allied Commander for Europe. Prior to her government service, Dr. Slaughter was the Dean of Princeton’s Woodrow Wilson School of Public and International Affairs from 2002–2009 and the J.",
    "published": null
  },
  {
    "title": "Biography | Anne-Marie Slaughter",
    "url": "https://slaughter.scholar.princeton.edu/biocv",
    "snippet": "Currently <strong>CEO of the think and action tank New America</strong>, Anne-Marie Slaughter is a global leader, scholar and public intellectual. She was the J. Sinclair Armstrong Professor of International, Foreign, and Comparative Law at Harvard Law School and served as President of the American Society ...",
    "published": null
  }
]