[
  {
    "title": "The merger between Tele2 and Com Hem is completed - Tele2",
    "url": "https://www.tele2.com/media/news/2018/the-merger-between-tele2-and-com-hem-is-completed/",
    "snippet": "<strong>Each share in Com Hem will be exchanged for 1.0374 new shares of class B in Tele2 and SEK 37.02 in cash</strong>. Com Hem shareholders will receive the Tele2 shares i.e. the non-cash merger consideration on November 7, 2018 and the cash merger consideration ...",
    "published": null
  },
  {
    "title": "Tele2 and Com Hem merger - Tele2",
    "url": "https://www.tele2.com/investors/tele2-and-com-hem-merger",
    "snippet": "The merger between Tele2 and Com Hem was <strong>completed on 5 November 2018</strong>.",
    "published": null
  },
  {
    "title": "The European Commission has approved the merger of Tele2 and Com Hem - Inderes",
    "url": "https://www.inderes.fi/en/releases/the-european-commission-has-approved-the-merger-of-tele2-and-com-hem",
    "snippet": "November 2, 2018 The Swedish Companies Registration Office grants authorization to implement the merger plan and Tele2 applies for registration of the merger with the Swedish Companies Registration Office · November 5, 2018 The Swedish Companies Registration Office registers the merger and Com Hem is dissolved Admission to trading of the newly issued Tele2 shares on Nasdaq Stockholm",
    "published": null
  },
  {
    "title": "Tele2 AB",
    "url": "https://www.sec.gov/Archives/edgar/data/1122535/000094787118000723/ss105426_425.htm",
    "snippet": "To conclude, we are very excited ... and Com Hem at Tele2’s Extra General Meeting (“EGM”) on September 21, 2018. Please find more information about the EGM and contact details to Tele2’s hotline service further below in this information notice. ... If you own shares in Tele2, regardless of class, you are not obliged to take any action. However, you will have the ability to vote on the statutory merger in the ...",
    "published": null
  },
  {
    "title": "INFORMATION TO THE SHARE- HOLDERS OF TELE2 AB (PUBL) AND COM HEM",
    "url": "https://www.tele2.com/files/globalassets/documents/investors/tele2-com-hem-merger/eng/tele2-com-hem-merger-document-eng.pdf",
    "snippet": "Pursuant to the Merger Plan, one share · in Com Hem entitles the holder to receive <strong>1.0374 new B shares in Tele2</strong> (the “Non-",
    "published": null
  }
]