[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Subsequent history is recorded in the form of reminiscences of past IAU Presidents and General Secretaries. Twelve of the fourteen past General Secretaries in the period 1964–2006 contributed their recollections of the Union&#x27;s history in IAU Information Bulletin No.",
    "published": "3 weeks ago"
  },
  {
    "title": "International Association of Universities",
    "url": "https://www.iau-aiu.net/",
    "snippet": "The IAU counts almost 600 Members from more than 120 countries amongst its four categories of Members: Institutions, Organizations, Affiliates and Associates. Benefiting from the IAU’s complete range of services, institutional and organisational Members may also participate in the election of the President and Administrative Board.",
    "published": null
  },
  {
    "title": "2025 IAU Election Results and New Council Announcement - IAU - International Association of Ultrarunners",
    "url": "https://iau-ultramarathon.org/2025-iau-election-results-and-new-council-announcement.html",
    "snippet": "<strong>Nadeem Khan</strong> was re-elected as President, while Jacek Bedkowski and Robert Boyce assume new roles as Vice President and Treasurer, respectively. Hilary Walker was re-elected and continues as General Secretary.",
    "published": "October 17, 2025"
  },
  {
    "title": "Presidency — International Association of Universities",
    "url": "https://iau.global/presidency",
    "snippet": "Read the President’s Message here. IAU President 2016-2022 Pam Fredmam and IAU President 2022-2026 <strong>Andrew Deeks</strong>",
    "published": null
  },
  {
    "title": "About IAU - IAU",
    "url": "https://www.iau-aiu.net/About-IAU",
    "snippet": "The General Conference meets every four years. The General Conference decides on the main strategic goals of the association, approves its four year plans, any policy statements or positions elaborated. It elects the President and members of the Administrative Board.",
    "published": null
  }
]