[
  {
    "title": "Bayern head coaches in the Bundesliga",
    "url": "https://fcbayern.com/en/club/history/coaches",
    "snippet": "The head coaches from promotion in 1965 until today.",
    "published": "June 11, 2024"
  },
  {
    "title": "From Zlatko Čajkovski to Vincent Kompany: A history of Bayern Munich coaches | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/a-history-of-bayern-munich-s-coaches-nagelsmann-flick-guardiola-heynckes-15694",
    "snippet": "He subsequently became Germany coach, taking over at the international helm from another former Bayern man, Hansi Flick. <strong>Julian Nagelsmann</strong> oversaw 84 games at the Bayern Munich helm.",
    "published": "November 4, 2025"
  },
  {
    "title": "FC Bayern Munich - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FC_Bayern_Munich",
    "snippet": "... Bayern has had 20 coaches since its promotion to the Bundesliga in 1965. <strong>Udo Lattek, Giovanni Trapattoni and Ottmar Hitzfeld served two terms as head coach</strong>. Franz Beckenbauer served one term as head coach and one as caretaker, while Jupp Heynckes had four separate spells as coach, including ...",
    "published": "1 day ago"
  },
  {
    "title": "List of FC Bayern Munich records and statistics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_FC_Bayern_Munich_records_and_statistics",
    "snippet": "The following FIFA World Cup winning players played for Bayern Munich at some point during their careers. Highlighted players were playing for Bayern Munich when they won the World Cup. ... * <strong>Franz Beckenbauer</strong> won the World Cup in 1974 as player and in 1990 as a coach.",
    "published": "1 week ago"
  },
  {
    "title": "Bayern Munich - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/bayern-munich/mitarbeiterhistorie/verein/27",
    "snippet": "FC Bayern München Youth · Bayern Munich UEFA U19 · The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along. Under &quot;Position&quot;, you can select a specific role from the drop-down menu.",
    "published": null
  }
]