[
  {
    "title": "Claire Voisin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Claire_Voisin",
    "snippet": "Claire Voisin (born 4 March 1962) is a French mathematician known for her work in algebraic geometry. She is a member of the French Academy of Sciences and held the chair of algebraic geometry at the <strong>Collège de France</strong> from 2015 to 2020. She is noted for her work in algebraic geometry particularly ...",
    "published": "1 week ago"
  },
  {
    "title": "Claire Voisin (1962 - ) - Biography - MacTutor History of Mathematics",
    "url": "https://mathshistory.st-andrews.ac.uk/Biographies/Voisin/",
    "snippet": "In 1979 Voisin graduated from the Lycée de Taverny with a baccalaureate and left home to spend two years taking preparatory classes for university at the <strong>Lycée Louis-le-Grand</strong>. She lived in the Latin Quarter of Paris while attending the Lycée.",
    "published": null
  },
  {
    "title": "Claire Voisin | EMS Magazine",
    "url": "https://euromathsoc.org/magazine/articles/206",
    "snippet": "Claire Voisin got her PhD at the <strong>Université Paris-Sud, Orsay</strong> in 1986.",
    "published": "December 28, 2024"
  },
  {
    "title": "Claire Voisin - The Shaw Prize",
    "url": "https://www.shawprize.org/autobiography/claire-voisin/",
    "snippet": "We now live in the 5th arrondissement, a very quiet part of Paris where many institutes are traditionally located, like <strong>Sorbonne, Institut Henri Poincaré, Collège de France and Ecole Normale Supérieure</strong>.",
    "published": "August 15, 2023"
  },
  {
    "title": "Claire Voisin – European Women in Mathematics",
    "url": "https://www.europeanwomeninmaths.org/claire-voisin/",
    "snippet": "Claire Voisin is Professor at <strong>Collège de France</strong> (Algebraic geometry chair), and member of the Académie des sciences (Paris). In September 2016 she was awarded the CNRS Gold medal, the highest scientific award in France. She has been plenary speaker at the International Congress of Mathematicians.",
    "published": null
  }
]