[
  {
    "title": "Office of the Chancellor – The Office of the Chancellor at UC Santa Cruz.",
    "url": "https://chancellor.ucsc.edu/",
    "snippet": "Chancellor Cynthia Larive · <strong>Campus notification procedures for immigration enforcement (SB 98)December 4, 2025</strong> · Announcing Inspiring Change: The Campaign for UC Santa CruzNovember 16, 2025 · Campus Provost and Executive Vice Chancellor recruitment underwayNovember 7, 2025 ·",
    "published": null
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "<strong>UC Santa Cruz Chancellor Cynthia Larive is set to undergo an overdue five-year performance review</strong>, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  },
  {
    "title": "Inspiring Change: UC Santa Cruz launches $750M campaign - News",
    "url": "https://news.ucsc.edu/2025/11/inspiring-change-uc-santa-cruz-launches-750m-campaign/",
    "snippet": "“Since our founding, UC Santa Cruz has pursued solutions that benefit society, whether it’s increasing our resilience in the face of climate change, advancing health solutions, or sharing the untold stories of communities, locally and globally,” Chancellor Cynthia Larive said.",
    "published": "1 month ago"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "She gained approval for the campus Long Range Development Plan that will serve as a blueprint for development on campus over the next two decades and completed “Leading the Change: The UC Santa Cruz Strategic Plan,” which details the campus community’s collective vision for the university over the next decade. An accomplished bioanalytical chemist, Larive served as the primary mentor to 30 doctoral and master’s students with whom she co-authored more than 160 scientific publications.",
    "published": null
  },
  {
    "title": "Letter from Chancellor Cynthia Larive – UC Santa Cruz",
    "url": "https://www.ucsc.edu/annual-report/letter-from-chancellor-cynthia-larive-2025/",
    "snippet": "We also celebrated the UC Regents’ approval of Strathearn Ranch near Hollister as the newest UC Santa Cruz natural reserve.",
    "published": null
  }
]