[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Singh was <strong>initially educated at a local gurdwara, where he began studying Urdu and Punjabi</strong>. On 17 April 1937, he was enrolled in the local Government Primary School, where he continued his Urdu-medium education until the age of 10 (Class 4), after which he and his family moved to Peshawar.",
    "published": "2 days ago"
  },
  {
    "title": "Manmohan Singh Education: Former PM Schooling, Colleges, Degrees and Academic Achievements",
    "url": "https://www.jagranjosh.com/articles/manmohan-singh-education-qualification-1735280163-1",
    "snippet": "Singh completed his Master’s degree in Economics from Punjab University in 1954 with excellent results. Dr Manmohan Singh&#x27;s hunt for knowledge took him to the University of Cambridge in the United Kingdom, where he enrolled at St. John’s College.",
    "published": "December 27, 2024"
  },
  {
    "title": "CURRICULUM VITAE DR. MANMOHAN SINGH PRIME MINISTER OF INDIA ACADEMIC RECORD",
    "url": "https://www.visvabharati.ac.in/files/6340200114_Manmohan.pdf",
    "snippet": "DR. MANMOHAN SINGH",
    "published": null
  },
  {
    "title": "Manmohan Singh Death: A Timeline of Former PM Dr. Manmohan Singh Impressive Educational Qualification and Career Details",
    "url": "https://indianexpress.com/article/education/dr-manmohan-singhs-education-alumnus-of-punjab-university-oxford-cambridge-university-9746763/",
    "snippet": "He completed his <strong>matriculation and intermediate education at the Panjab University</strong>. In 1952, he pursued a bachelor’s in Economics (Honours) from Panjab University. In 1954, he achieved a first-class master’s in Economics and the first position ...",
    "published": "December 28, 2024"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "Manmohan Singh was born on September 26, 1932, in a village in the Punjab province of undivided India. He <strong>completed his Matriculation examinations from Punjab University in 1948</strong>. His illustrious academic journey took him from Punjab to the University of Cambridge, UK, where he earned a First ...",
    "published": null
  }
]