[
  {
    "title": "Hiraku Nakajima elected President of the International Mathematical Union | Kavli IPMU-カブリ数物連携宇宙研究機構",
    "url": "https://www.ipmu.jp/en/20220704-IMU",
    "snippet": "July 4, 2022 Kavli Institute for ... IPMU) <strong>Hiraku Nakajima, Professor at the Kavli Institute for the Physics and Mathematics of the Universe (Kavli IPMU), has been elected the upcoming President of the International Mathematical Union (IMU),</strong> it was announced ...",
    "published": null
  },
  {
    "title": "Hiraku Nakajima - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Hiraku_Nakajima",
    "snippet": "Hiraku Nakajima (Japanese: 中島 啓 Nakajima Hiraku; born November 30, 1962) is a Japanese mathematician, and a professor of the Kavli Institute for the Physics and Mathematics of the Universe at the University of Tokyo. He is <strong>International Mathematical Union president for the 2023–2026 term</strong>.",
    "published": "June 5, 2025"
  },
  {
    "title": "Hiraku Nakajima (Kavli IPMU) elected President of the International Mathematical Union | The University of Tokyo",
    "url": "https://www.u-tokyo.ac.jp/focus/en/articles/z0402_00022.html",
    "snippet": "<strong>Hiraku Nakajima, Professor at the Kavli Institute for the Physics and Mathematics of the Universe (Kavli IPMU), has been elected the upcoming President of the International Mathematical Union (IMU),</strong> it was announced at the IMU general assembly ...",
    "published": null
  },
  {
    "title": "Hiraku Nakajima",
    "url": "https://member.ipmu.jp/hiraku.nakajima/",
    "snippet": "Although I send emails to ask help as the President of the IMU, they are sent from a special email address which has mathunion.org after @. They are also digitally signed.",
    "published": null
  },
  {
    "title": "CGTN exclusive: IMU President Hiraku Nakajima speaks on math cooperation, AI, young talents",
    "url": "https://news.cgtn.com/news/2024-07-16/IMU-president-speaks-on-math-cooperation-AI-young-talents-1vhuWyg1EFW/p.html",
    "snippet": "During the event, CGTN&#x27;s Liu Jiaxin spoke with Hiraku Nakajima, <strong>president of the International Mathematical Union (IMU) and professor at the University of Tokyo</strong>, about his passion for geometric representation theory, global cooperation, AI ...",
    "published": "July 16, 2024"
  }
]