[
  {
    "title": "Com Hem",
    "url": "https://eqtgroup.com/current-portfolio/com-hem/",
    "snippet": "During EQT&#x27;s ownership, the company underwent extensive programmes of transformation and investments, which propelled the company&#x27;s growth and profitability. <strong>EQT III sold Com Hem AB in 2006.</strong>",
    "published": null
  },
  {
    "title": "EQT AB - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/EQT_AB",
    "snippet": "As of 2025, EQT&#x27;s assets under ... 2024 edition of Private Equity International&#x27;s PEI 300 ranking. The company was founded in 1994 by <strong>SEB, AEA Investors, and Investor AB</strong>......",
    "published": "3 weeks ago"
  },
  {
    "title": "EQT acquires Com Hem from TeliaSonera",
    "url": "https://eqtgroup.com/news/2003/EQT-acquires-Com-Hem-from-TeliaSonera/",
    "snippet": "<strong>EQT NORTHERN EUROPE PRIVATE EQUITY FUND</strong> HAS SIGNED AN AGREEMENT WITH TELIASONERA TO ACQUIRE SWEDEN&#x27;S LEADING CABLE TV OPERATOR COM HEM FOR SEK 2,150 MILLION.",
    "published": null
  },
  {
    "title": "EQT completes the acquisition of Com Hem",
    "url": "https://eqtgroup.com/news/2003/EQT-completes-the-acquisition-of-Com-Hem-/",
    "snippet": "<strong>EQT Northern Europe private equity fund</strong> has today completed the acquisition of Com Hem. Closing of the deal had been conditioned upon e.g. approvals from Swedish regulatory authorities, which now have been received. The Board of Directors will include Bengt Halse, Kjell Hellberg, Håkan Johansson, ...",
    "published": null
  },
  {
    "title": "EQT sells Com Hem",
    "url": "https://eqtgroup.com/news/2005/EQT-sells-Com-Hem/",
    "snippet": "Under EQT’s ownership, Com Hem underwent extensive programmes of transformation and investment, which has propelled the company’s growth and profitability. Almost SEK 1 billion has been invested in infrastructure for broadband and telephony offering. The measures implemented have shown significant and tangible results in terms of market positions on all relevant markets. Com Hem is today the leading triple play provider in Sweden with about ...",
    "published": null
  }
]