[
  {
    "title": "Politics of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Austria",
    "snippet": "<strong>Foreign Minister Alexander Schallenberg of ÖVP succeeded him as chancellor</strong>. Following a corruption scandal involving the ruling People&#x27;s Party, Austria got its third conservative chancellor in two months after Karl Nehammer was sworn into office on 6 December 2021.",
    "published": "October 8, 2025"
  },
  {
    "title": "Austria and Germany: How Firewalls Fall | Carnegie Endowment for International Peace",
    "url": "https://carnegieendowment.org/europe/strategic-europe/2025/01/austria-and-germany-how-firewalls-fall?lang=en",
    "snippet": "The far right in Europe is about to take two decisive steps forward. Herbert Kickl, the head of the FPÖ, appears about to become Austria’s chancellor and in Germany, AfD is succeeding in imposing its anti-migration policies on large parts of the German political mainstream.",
    "published": null
  },
  {
    "title": "Austria to go ahead with Eurovision despite financial impact of boycott | Eurovision | The Guardian",
    "url": "https://www.theguardian.com/tv-and-radio/2025/dec/05/austria-eurovision-boycott-over-israel-financial-impact",
    "snippet": "Austria, alongside Germany, was among the countries to come out most firmly in favour of Israeli participation in the run-up to Thursday’s general assembly. Germany’s foreign minister, Johann Wadephul, said he welcomed the decision, saying the Israel “traditionally” belonged in the song contest. The Christian Democrat politician urged the boycotting nations to rethink their stance, saying: “Culture should always have something that connects people …",
    "published": "2 weeks ago"
  },
  {
    "title": "POLITICO Poll of Polls — Austrian polls, trends and election news for Austria",
    "url": "https://www.politico.eu/europe-poll-of-polls/austria/",
    "snippet": "POLLING FROM ACROSS EUROPE. UPDATED DAILY. Austria — National parliament voting intention What is Poll of Polls and how does it work? Read more here. Austria — 2024 general election Austria — Europ…",
    "published": "August 8, 2025"
  },
  {
    "title": "Austria’s Arduous Path to a New Government: Without the Far-Right",
    "url": "https://www.fairobserver.com/politics/austrias-arduous-path-to-a-new-government-without-the-far-right/",
    "snippet": "The Social Democrats advocate for new taxes on businesses and inheritance, which the liberal NEOS oppose. A continued coalition with the Greens may be less advantageous politically for the People’s Party (ÖVP), as it has not been popular with voters. The election result is a clear signal that change is needed in Austrian politics.",
    "published": "November 9, 2024"
  }
]