[
  {
    "title": "Anke Domscheit-Berg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anke_Domscheit-Berg",
    "snippet": "<strong>Domscheit-Berg will not run again in the 2025 federal election</strong>. Anke Domscheit-Berg is committed to gender equality in all areas of society. In lectures, workshops and publications, she campaigns against sexism, violence against girls and women and unequal treatment in the workplace and politics.",
    "published": "August 13, 2025"
  },
  {
    "title": "Anke Domscheit-Berg - Aktivistin, Publizistin, Mitglied des Deutschen Bundestages",
    "url": "https://mdb.anke.domscheit-berg.de/",
    "snippet": "... „<strong>Wir haben kein Geldmangelproblem und mehr Geld hilft nicht</strong>“, sagt auch Anke Domscheit-Berg, (Linksfraktion). Es brauche eher ein zentralgesteuertes Digitalbudget und eine Grundgesetzänderung, damit in diesem Bereich mehr Hilfen vom Bund auf föderaler Ebene ankommen.",
    "published": "March 24, 2025"
  },
  {
    "title": "Anke Domscheit-Berg | taz.de",
    "url": "https://taz.de/Anke-Domscheit-Berg/!t5032646/",
    "snippet": "Nach Lauer geht nun auch Netzaktivistin Domscheit-Berg. ... Die Piratenpartei will trotz ihrer schlechten Umfrageergebnisse ins EU-Parlament. Auf dem Parteitag in Bochum werden die Wahlkampfthemen bestimmt. ... Hier finden Sie weitere Antworten auf die sonntaz-Frage „Brauchen wir die Piraten noch?“ – unter anderem von Anke Domscheit-Berg.",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://grokipedia.com/page/Anke_Domscheit-Berg",
    "snippet": "Following the end of her Bundestag mandate on March 25, 2025, after choosing not to seek re-election following two terms, Anke Domscheit-Berg <strong>returned to freelance work as a publicist specializing in digital policy</strong>.[57] She has expressed intentions ...",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg: \"The most important complex is digital sovereignty\" | heise online",
    "url": "https://www.heise.de/en/news/Anke-Domscheit-Berg-The-most-important-complex-is-digital-sovereignty-10328983.html",
    "snippet": "Anke Domscheit-Berg, Germany&#x27;s best-known digital politician, <strong>has left the Bundestag</strong>. In an interview with c&#x27;t, she takes stock and makes demands.",
    "published": "March 26, 2025"
  }
]