[
  {
    "title": "Italy's left picks 'anti-Meloni' politician Elly Schlein to lead the party | Euronews",
    "url": "https://www.euronews.com/my-europe/2023/02/27/the-anti-meloni-meet-elly-schlein-italys-breakout-left-wing-star",
    "snippet": "All the while, her supporters sang &quot;Bella Ciao&quot; - Italy’s anti-fascist Resistance anthem. Schlein, who belongs to the PD’s more socialist wing, <strong>aims to present a fresh and unifying vision for the left and the country</strong>.",
    "published": "March 1, 2023"
  },
  {
    "title": "Elly Schlein voted leader of Italy’s most important leftwing party in surprise win | Italy | The Guardian",
    "url": "https://www.theguardian.com/world/2023/feb/27/elly-schlein-voted-leader-of-italy-democratic-party-surprise-win",
    "snippet": "Schlein, a former MEP, first came to prominence in early 2020 after her small party, <strong>Coraggiosa (Courageous),</strong> played a pivotal role in stopping the far right from seizing power in the traditionally leftwing Emilia-Romagna region.",
    "published": "February 27, 2023"
  },
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "In an upset, for the first time ... became <strong>the PD&#x27;s first female, as well as the youngest person, to be elected leader of the PD since the formation of the party in 2007. She is also the first publicly-declared LGBTQ secretary of the Italian centre-left leading party</strong>...",
    "published": "1 week ago"
  },
  {
    "title": "Meet the Italian left’s rising star",
    "url": "https://www.politico.eu/article/meet-the-italian-left-rising-star-elly-schlein-pd/",
    "snippet": "<strong>Elly Schlein, a former MEP, is hoping to reinvigorate the left</strong>. Schlein&#x27;s optimism and left-wing focus has earned her comparisons to a fellow leftist across the Atlantic. | Zumapress via Belga ...",
    "published": "February 13, 2020"
  },
  {
    "title": "A former Obama campaign staffer is the first woman to lead Italy's main left-wing party",
    "url": "https://qz.com/italy-politics-opposition-leader-young-progressive-1850164116",
    "snippet": "A rising star of the Italian left has won election to the leadership of the <strong>Democratic Party</strong>, the country’s second-largest political group. Thirty-seven-year-old Elly Schlein will serve as the main opposition leader to Giorgia Meloni, the ...",
    "published": "February 27, 2023"
  }
]