[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "A versatile player, he primarily plays as a central midfielder, but is also capable of playing as a defensive midfielder, centre-back, or full-back. He <strong>began his senior career at Bayern Munich, playing mostly in the club&#x27;s reserve side before his 2013 transfer to Bayer Leverkusen</strong>.",
    "published": "5 days ago"
  },
  {
    "title": "Emre Can",
    "url": "https://www.bvb.de/de/en/teams/football/player/emre-can.html",
    "snippet": "Emre Can has <strong>played for all of Germany&#x27;s youth national teams since the U15s and made his debut for the senior national team on 4 September 2015</strong> in his hometown of Frankfurt in a European Championship qualifier against Poland. He was a member of the squad at the 2017 Confederations Cup, where ...",
    "published": null
  },
  {
    "title": "Liverpool career stats for Emre Can - LFChistory - Stats galore for Liverpool FC!",
    "url": "https://www.lfchistory.net/players/player/profile/1272",
    "snippet": "As a youth, he was associated with a local amateur club, SV Blau-Gelb Frankfurt, but was quickly recruited by the area’s big Bundesliga club, Eintracht Frankfurt, around the time he entered his teenage years. Eintracht nurtured their prodigy well but had little chance of holding on to him once the country’s biggest club started to show an interest. In July 2009 at the age of fifteen, Can moved to Bavaria to join the European champions Bayern Munich.",
    "published": null
  },
  {
    "title": "Emre Can | Borussia Dortmund | Player Profile | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/player/emre-can",
    "snippet": "All official season statistics and career data on Emre Can. With news, videos and goals from Emre Can in the Bundesliga this season",
    "published": null
  },
  {
    "title": "Emre Can – Exceptional talent at Borussia Dortmund and Germany's national team",
    "url": "https://www.emrecan.com/index.en.html",
    "snippet": "<strong>I have almost spent my whole youngster career at FC Bayern Munich</strong>. From the U17 to the first team, I have gone through all stages in this great club which is one of the biggest sports clubs worldwide.",
    "published": null
  }
]