[
  {
    "title": "Former Malaysian PM Mahathir joins little-known party Putra | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/former-malaysian-pm-mahathir-joins-little-known-party-putra",
    "snippet": "It is not known if Tun Dr Mahathir Mohamad, 97, will hold any posts in Putra. ... <strong>Former Malaysian prime minister Mahathir Mohamad has joined little-known Parti Bumiputera Perkasa Malaysia (Putra).</strong>",
    "published": "November 25, 2024"
  },
  {
    "title": "Parti Bumiputera Perkasa Malaysia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Parti_Bumiputera_Perkasa_Malaysia",
    "snippet": "On <strong>25 February 2023</strong>, Mahathir joined PUTRA along with 12 other former PEJUANG members, including Mohd Tahir Kassim (Pahang) and Liza Meman (Perak). PUTRA had made a debut contesting for 5 seats in the 2021 Malacca state election.",
    "published": "October 16, 2025"
  },
  {
    "title": "Dr Mahathir receives invitation to join Putra as adviser",
    "url": "https://www.malaysiakini.com/news/655590",
    "snippet": "<strong>Dr Mahathir Mohamad is seriously considering an invitation by Parti Bumiputera Perkasa Malaysia (Putra) to join the party as an adviser</strong>.",
    "published": "February 18, 2023"
  },
  {
    "title": "BERNAMA - Dr Mahathir receives invitation to join Putra as adviser",
    "url": "https://www.bernama.com/en/news.php?id=2165703",
    "snippet": "According to Dr Mahathir, Putra president Datuk Ibrahim Ali made the offer to join the four-year-old party after the party’s Supreme Council decided on the matter at its meeting today.",
    "published": null
  },
  {
    "title": "Mahathir’s former party Pejuang applies to join opposition pact Perikatan Nasional | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/mahathir-s-former-party-pejuang-applies-to-join-opposition-pact-perikatan-nasional",
    "snippet": "This prompted Dr Mahathir to quit Pejuang, and he subsequently joined little-known party Putra on <strong>Feb 25.</strong>",
    "published": "March 2, 2023"
  }
]