[
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "Their latest championship win was in 2025 under head coach <strong>Fabien Galthié</strong>, who is also a former captain of the team. France has competed in every Rugby World Cup since it began in 1987, and have qualified for the knock-out stage each time. They have reached the final three times, losing to ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Galthié was contacted by Max Guazzini to take up the coaching job. In the first season, Stade Français made it to the final of both the Top 14 and Heineken Cup finals, but were beaten by Biarritz Olympique and Toulouse respectively. The following season Stade Français were beaten by Toulouse in the Top 14 semi-final, and they were knocked out of the Heineken Cup by Leicester. He eventually won the Top 14 by beating Clermont 23–18 in 2007.",
    "published": "1 month ago"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "Winning four Six Nations titles, including two Grand Slams, the 60-year-old was the IRB International Coach of the Year in 2002 and helped his country to fourth-place finishes at the 2003 and 2007 Rugby World Cups. After his tenure finished Laporte entered the world of administration, firstly as the Secretary of State for Youth and Sports. Later elected as president of the French Rugby Federation in 2016, joined the World Rugby executive committee in 2017 and Agustin Pichot as vice-chairman of World Rugby in 2020.",
    "published": "May 30, 2025"
  },
  {
    "title": "France national rugby union team coaches - FamousFix.com list",
    "url": "https://m.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "Overview: <strong>Bernard Laporte</strong> (born 1 July 1964) is a rugby player, coach and former French Secretary of State for Sport. From 1999 to 2007, Laporte was the head coach of the France national team.",
    "published": null
  },
  {
    "title": "France rugby union team: Fixtures, squad and head coach",
    "url": "https://news.bet365.com/en-gb/article/france-rugby-union-team-profile/2025012409221201023",
    "snippet": "The top tryscorer in the Six Nations in both 2022 and 2023, Bordeaux Begles wing Penaud is a gamechanger for this France side who time and time again is on hand to apply the finishing touches for <strong>Fabien Galthe</strong>&#x27;s side. A distinguished former player himself, receiving 64 international caps for ...",
    "published": null
  }
]