[
  {
    "title": "Italian Communist Party - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Italian_Communist_Party",
    "snippet": "The party&#x27;s peaceful and national road to socialism, or the Italian road to socialism, the realisation of the communist project through democracy, repudiating the use of violence and applying the Constitution of Italy in all its parts, a strategy inaugurated under Palmiro Togliatti but that some date back to Gramsci, would become the leitmotif of the party&#x27;s history.",
    "published": "1 week ago"
  },
  {
    "title": "Palmiro Togliatti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Palmiro_Togliatti",
    "snippet": "Considered one of the founding fathers of the Italian Republic, he led Italy&#x27;s Communist party from a few thousand members in 1943 to two million members in 1946. Born in Genoa but culturally formed in Turin during the first decades of the 1900s, when the first Fiat workshops were built and the Italian labour movement began its battles, Togliatti&#x27;s history is linked to that of Lingotto.",
    "published": "September 8, 2025"
  },
  {
    "title": "The Rise and Fall of the Italian Communist Party | Stanford University Press",
    "url": "https://www.sup.org/books/history/rise-and-fall-italian-communist-party",
    "snippet": "Following three leaders of the Italian Communist Party (<strong>Antonio Gramsci, Palmiro Togliatti, and Enrico Berlinguer</strong>) from the First World War to the fall of the Soviet Union, Silvio Pons considers the broader relationship between communism and ...",
    "published": null
  },
  {
    "title": "Enrico Berlinguer | Communist leader, Italian Communist Party | Britannica",
    "url": "https://www.britannica.com/biography/Enrico-Berlinguer",
    "snippet": "<strong>Enrico Berlinguer</strong> (born May 25, 1922, Sassari, Sardinia, Italy—died June 11, 1984, Padua) was the secretary-general of the Italian Communist Party (Partito Comunista Italiano) from March 1972 until his death.",
    "published": "July 20, 1998"
  },
  {
    "title": "Full article: The Italian Communist Party in the 1980s and the denouement of the Italian party system",
    "url": "https://www.tandfonline.com/doi/full/10.1080/1354571X.2022.2097690",
    "snippet": "The last leader of the Italian Communist Party (P.C.I.), <strong>Achille Occhetto</strong> (1994, 72–73), reflecting on his decision to dissolve the P.C.I. in 1989 and form a new non-communist party of the left, ar...",
    "published": null
  }
]