[
  {
    "title": "Georgia's outgoing president Salome Zourabichvili refuses to quit as successor Mikheil Kavelashvili sworn in",
    "url": "https://www.bbc.com/news/articles/c0rn2w0zw08o",
    "snippet": "Mikheil Kavelashvili (left) was sworn in as Georgia&#x27;s president on Sunday. Outgoing president Salome Zourabichvili (right) has refused to recognise his appointment",
    "published": "December 29, 2024"
  },
  {
    "title": "Kavelashvili is inaugurated as Georgia's president, complicating its path toward EU | AP News",
    "url": "https://apnews.com/article/georgia-president-zourabichvili-russia-kavelashvili-215020983cefb6ce1eb2ecad184a9c1e",
    "snippet": "Former soccer player <strong>Mikheil Kavelashvili was formally inaugurated president of Georgia on Sunday</strong>, as the ruling party tightened its grip in what the opposition calls a blow to the country’s EU aspirations and a victory for former imperial ...",
    "published": "December 30, 2024"
  },
  {
    "title": "Salomé Zourabichvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salome_Zourabichvili",
    "snippet": "He wrote on X: &quot;As the only legitimate ... assault by Ivanishvili and his friends in the CCP &amp; Iranian regime.&quot; <strong>Zourabichvili left the official presidential residence, Orbeliani Palace, on 29 December 2024</strong>, when Mikheil Kavelashvili was inaugurated....",
    "published": "November 13, 2025"
  },
  {
    "title": "Utkarsh",
    "url": "https://utkarsh.com/current-affairs/international/person-in-news-updates/ex-footballer-mikheil-kavelashvili-elected-georgias-president",
    "snippet": "The pro-Russian and anti-west <strong>Mikheil Kavelashvili will replace the pro-western incumbent President Salome Zourabichvili</strong>.",
    "published": "1 month ago"
  },
  {
    "title": "Former Manchester City footballer sworn in as Georgia's president | World News | Sky News",
    "url": "https://news.sky.com/story/former-manchester-city-footballer-sworn-in-as-georgias-president-13281110",
    "snippet": "Former Manchester City footballer <strong>Mikheil Kavelashvili has been sworn in as the president of Georgia</strong>. The outgoing pro-Western president Salome Zourabichvili has insisted she is still the legitimate officer holder and does not recognise her ...",
    "published": "December 29, 2024"
  }
]