[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "He had a brief career as a child actor, appearing in several television commercials and small roles in local shows. Morrison attended <strong>Sydney Boys High School</strong> before going on to complete a Bachelor of Science (B.Sc.) honours degree in applied economic geography at the University of New South Wales.",
    "published": "6 days ago"
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "During his childhood Morrison also acted in television commercials. He attended the prestigious <strong>Sydney Boys High</strong> before matriculating at the University of New South Wales, where he studied economics and geography.",
    "published": "August 30, 2018"
  },
  {
    "title": "Scott Morrison: before office | naa.gov.au",
    "url": "https://www.naa.gov.au/explore-collection/australias-prime-ministers/scott-morrison/before-office",
    "snippet": "Scott John Morrison was born on 13 May 1968 in Sydney, New South Wales, to John Morrison, a policeman, and his wife Marion. He was educated at <strong>Sydney Boys High School</strong>, then attended the University of New South Wales, where he received an honours degree in applied economic geography.",
    "published": null
  },
  {
    "title": "Scott Morrison - EVP, Business Development at After | The Org",
    "url": "https://theorg.com/org/after/org-chart/scott-morrison",
    "snippet": "Scott Morrison has a BBA from the University of Miami Herbert Business School in marketing and advertising and an MBA from Widener University in marketing. Scott also attended <strong>Brandywine High School</strong>.",
    "published": null
  },
  {
    "title": "Why Scott Morrison sends his daughters to private school",
    "url": "https://www.smh.com.au/education/skin-curling-why-scott-morrison-sends-his-daughters-to-private-school-20180903-p501gl.html",
    "snippet": "&quot;Students who are struggling in our schools, for whatever reason, need support and will continue to receive it in NSW public schools.&quot; Mr Morrison attended the public selective school <strong>Sydney Boys&#x27; High</strong>.",
    "published": "September 3, 2018"
  }
]