[
  {
    "title": "List of prime ministers of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Spain",
    "snippet": "In contemporary Spain, the first prime minister of the Kingdom of Spain since the approval of the Constitution of 1978 was Adolfo Suárez. Due to the gradual evolution of the post, the title has been applied to early prime ministers retroactively. The following list therefore includes those who have been referred to as various other titles since the creation of the Council of Ministers in 1823.",
    "published": "6 days ago"
  },
  {
    "title": "List of Prime Ministers of Spain (A United Kingdom of Scandinavia) | Alternative History | Fandom",
    "url": "https://althistory.fandom.com/wiki/List_of_Prime_Ministers_of_Spain_(A_United_Kingdom_of_Scandinavia)",
    "snippet": "Alternative History · Sign In · Don&#x27;t have an account · Register · Skip to content · 110,333 · pages · in: A United Kingdom of Scandinavia",
    "published": null
  },
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "Both positions were de facto prime ministers (as demonstrated by the fact that since the tenure of the count-duke of Olivares, valido of Felipe IV, the validos were often called by courtiers and authors already in the 17th century as &quot;principal minister or prime minister of Spain&quot;) although they can not be completely compared.",
    "published": "3 weeks ago"
  },
  {
    "title": "List Of Prime Ministers Of Spain",
    "url": "https://www.worldatlas.com/articles/list-of-prime-ministers-of-spain.html",
    "snippet": "When Carlos Navaro resigned in July 1976, he was temporarily replaced by Fernando de Santiago y Díaz who was the deputy prime minister of Defense. Born in July 1910, Santiago was an active soldier who participated in both the Spanish Civil War and Second Moroccan War. Before becoming Spain’s deputy prime minister and interim prime minister, he was appointed the governor-general of Spanish Sahara where he introduced limited home-rule in the region.",
    "published": "December 22, 2020"
  },
  {
    "title": "List of prime ministers of Spain facts for kids",
    "url": "https://kids.kiddle.co/List_of_prime_ministers_of_Spain",
    "snippet": "In modern Spain, after the 1978 Constitution was approved, Adolfo Suárez became the first Prime Minister of the Kingdom of Spain. Because the role developed gradually, the title &quot;Prime Minister&quot; has been used for earlier leaders even if they had different titles back then. The list below includes people who held similar top government roles since the Council of Ministers was created in 1823.",
    "published": "October 17, 2025"
  }
]