[
  {
    "title": "Jonathan Kodjia",
    "url": "https://grokipedia.com/page/Jonathan_Kodjia",
    "snippet": "Jonathan Adjo Kodjia (born 22 October ... the lower tiers of French football before achieving prominence in England with <strong>Bristol City and Aston Villa</strong>, where he became known for his goal-scoring prowess and physical presence as a 1.89 ...",
    "published": null
  },
  {
    "title": "J19 - JONATHAN KODJIA (conférence de presse avant match) - YouTube",
    "url": "https://www.youtube.com/watch?v=AjPYXwF-Qko",
    "snippet": "🔴 FC Annecy - Rodez Aveyron Football : <strong>Jonathan Kodjia était en conférence de presse avant la rencontre face au RAF</strong>.🔔 Abonnez-vous pour suivre toutes les v...",
    "published": "December 18, 2023"
  },
  {
    "title": "Jonathan Kodjia rejoint le FC Versailles en provenance du FC Annecy !",
    "url": "https://fcversailles.com/jonathan-kodjia-rejoint-le-fc-versailles/",
    "snippet": "<strong>Jonathan est notamment passé par Aston Villa, Bristol, Caen et Angers</strong>, où il a été élu meilleur joueur de Ligue 2 en 2015. Cette année, il s’est distingué lors de la préparation d’avant-saison qu’il a effectuée avec l’UNFP, ...",
    "published": "August 16, 2024"
  },
  {
    "title": "Jonathan Kodjia",
    "url": "https://www.worldfootball.net/player_summary/jonathan-kodjia/",
    "snippet": "Jonathan Kodjia - FC Versailles, FC Annecy, Umm-Salal, Al Gharafa, Aston Villa, Aston Villa U23, Bristol City, Angers SCO, SM Caen, Amiens SC, AS Cherbourg, Stade de Reims /",
    "published": null
  },
  {
    "title": "Jonathan Kodjia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jonathan_Kodjia",
    "snippet": "Jonathan Adjo Kodjia (born 22 October 1989) is a professional footballer who plays as a forward for Championnat National club Versailles. Born in France, he represents the Ivory Coast national team. Kodjia <strong>started his career at Reims</strong> and gained experience in the Championnat National (French ...",
    "published": "October 3, 2025"
  }
]