[
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "The president of Portugal, officially the president of the Portuguese Republic (Portuguese: Presidente da República Portuguesa, pronounced [pɾɨziˈðẽtɨ ðɐ ʁɛˈpuβlikɐ puɾtuˈɣezɐ]), is the head of state and highest office of Portugal.",
    "published": "3 days ago"
  },
  {
    "title": "2026 Portuguese presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2026_Portuguese_presidential_election",
    "snippet": "Since the Carnation Revolution, there has only ever been a single runoff election, in the 1986 Portuguese presidential election, when Diogo Freitas do Amaral (46.3% of votes in the first round and 48.8% in the second) lost to Mário Soares (25.4% in the first round and 51.2% in the second). Candidates who formalized their candidacy and claim to have already submitted enough signatures to the Constitutional Court. The deadline to submit candidacies to the Court is 18 December 2025.",
    "published": "12 hours ago"
  },
  {
    "title": "Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en",
    "snippet": "Versão Portuguesa · Presidente da República promulgou três diplomas do Governo · 04 of December of 2025 · Presidente da República lembra <strong>Francisco Sá Carneiro e Adelino Amaro da Costa</strong> · 04 of December of 2025 · Presidente da República promulgou diploma do Governo ·",
    "published": null
  },
  {
    "title": "Luís Montenegro - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lu%C3%ADs_Montenegro",
    "snippet": "<strong>Luís Filipe Montenegro Cardoso de Morais Esteves</strong> (European Portuguese: [luˈiʒ mõtɨˈneɣɾu]; born 16 February 1973) is a Portuguese politician and lawyer serving as the prime minister of Portugal since April 2024.",
    "published": "2 days ago"
  },
  {
    "title": "2025 Portuguese legislative election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Portuguese_legislative_election",
    "snippet": "In normal circumstances, the next legislative election would, therefore, have taken place no later than 8 October 2028, but it was called early for 18 May 2025. The President of Portugal has the power to dissolve the Assembly of the Republic by his/her own will.",
    "published": "1 week ago"
  }
]