[
  {
    "title": "All About Justin Trudeau's Estranged Wife, Sophie Grégoire Trudeau",
    "url": "https://people.com/all-about-justin-trudeau-wife-sophie-gregoire-trudeau-11781151",
    "snippet": "Justin Trudeau and Sophie Grégoire Trudeau wed in 2005 and <strong>announced their separation in 2023</strong> ... Trudeau sparked romance rumors with Katy Perry in July 2025 and confirmed their relationship in October",
    "published": "July 29, 2025"
  },
  {
    "title": "Why Justin Trudeau And Wife, Sophie Gregoire Separated? Busy Political Life To Alleged Infidelity",
    "url": "https://www.bollywoodshaadis.com/articles/why-did-trudeau-and-his-wife-sophie-gregoire-separate-66496",
    "snippet": "Published: apr. 5, 2025 | 15:43:28 IST · However, on August 2, 2023, Justin Trudeau announced <strong>separation from his wife, Sophie Gregoire Trudeau</strong>. The unanticipated and tragic ending of the almost two-decade-long partnership of Justin and Sophie ...",
    "published": "July 30, 2025"
  },
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "Trudeau remained <strong>Liberal leader ... MP at the 2025 federal election. On June 23, 1971, the Prime Minister&#x27;s Office (PMO) announced that Prime Minister Pierre Trudeau&#x27;s wife of four months, Margaret Trudeau (née Sinclair),</strong> was pregnant and due in December. Justin Trudeau was ...",
    "published": "4 days ago"
  },
  {
    "title": "Canadian Prime Minister Justin Trudeau and his wife announce their separation : NPR",
    "url": "https://www.npr.org/2023/08/03/1191789443/canadian-prime-minister-justin-trudeau-and-his-wife-announce-their-separation",
    "snippet": "TORONTO — Canadian Prime Minister Justin Trudeau and his wife, Sophie Gregoire Trudeau, announced Wednesday that they are <strong>separating after 18 years of marriage</strong>.",
    "published": "August 3, 2023"
  },
  {
    "title": "Justin Trudeau Katy Perry dinner: Justin Trudeau has found love again? A look at ex-Canadian PM's marriage to estranged wife Sophie Gregoire - The Economic Times",
    "url": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-justin-trudeau-katy-perry-dinner-may-have-a-new-romance-brewing-ex-canadian-pms-love-life-in-spotlight-after-sophie-gregoire-separation/articleshow/122997170.cms?from=mdr",
    "snippet": "<strong>Justin Trudeau and Sophie Grégoire are currently separated</strong> — but the former Canadian prime minister may have a new romance brewing. Justin and Sophie married in 2005 when Trudeau became prime minister in 2015, a position he held until March.",
    "published": "July 30, 2025"
  }
]