[
  {
    "title": "Anne-Marie Slaughter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anne-Marie_Slaughter",
    "snippet": "Anne-Marie Slaughter (born September 27, 1958) is an American lawyer and political scientist, and author.",
    "published": "October 1, 2025"
  },
  {
    "title": "Anne-Marie Slaughter",
    "url": "https://www.newamerica.org/our-people/anne-marie-slaughter/",
    "snippet": "In 2009 Secretary of State Hillary Clinton appointed her as the first woman <strong>Director of Policy Planning in the U.S. State Department</strong>. Slaughter has written and lectured widely on global network design and leadership; on gender equality and elevating ...",
    "published": null
  },
  {
    "title": "BIOGRAPHY: Anne-Marie Slaughter",
    "url": "https://2009-2017.state.gov/s/p/fapb/185598.htm",
    "snippet": "Anne-Marie Slaughter is the President and CEO of New America and the Bert G. Kerstetter ’66 University Professor Emerita of Politics and International Affairs at Princeton University. From 2009-2011 she served as the director of Policy Planning for the United States Department of State, the first woman to hold that position.",
    "published": null
  },
  {
    "title": "slaughtr | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/faculty/slaughtr",
    "snippet": "Anne-Marie Slaughter was the first woman to serve as <strong>director of policy planning for the U.S. Department of State</strong>. She served as dean of the Princeton School of Public and International Affairs from 2002 to 2009.For more information, visit ...",
    "published": null
  },
  {
    "title": "Anne-Marie Slaughter | World Leaders Forum",
    "url": "https://worldleaders.columbia.edu/directory/anne-marie-slaughter",
    "snippet": "Anne-Marie Slaughter is currently the <strong>Bert G. Kerstetter &#x27;66 University Professor of Politics and International Affairs at Princeton University</strong>.",
    "published": null
  }
]