[
  {
    "title": "Alexander Van der Bellen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_Van_der_Bellen",
    "snippet": "After the Nehammer-led coalition talks collapsed after several weeks Van der Bellen reversed course and asked Herbert Kickl to attempt to form a coalition government with the People&#x27;s Party on 5 January 2025. After the Freedom Party also proved to be unable to form a coalition and returned the mandate to do so, the original coalition negotiations restarted and the involved parties subsequently formed a government. Since August 2014 Van der Bellen has already been regarded as a presidential candidate.",
    "published": "1 week ago"
  },
  {
    "title": "Austrian Federal President Alexander Van der Bellen",
    "url": "https://www.bundespraesident.at/en/index",
    "snippet": "Austria is our homeland, where everyone has the right to live in peace and dignity. This is an integral dimension of human rights, and I truly believe in them. ... Download the English CV of Alexander Van der Bellen here.",
    "published": null
  },
  {
    "title": "Alexander Van der Bellen – POLITICO",
    "url": "https://www.politico.eu/person/alexander-van-der-bellen/",
    "snippet": "<strong>Liberal Alexander Van der Bellen wins presidency</strong>, beating Freedom Party’s Norbert Hofer. ... The result of Sunday’s election do-over could destabilize Europe’s political landscape.",
    "published": null
  },
  {
    "title": "The Federal President of the Republic of Austria — Austria in USA",
    "url": "https://www.austria.org/the-federal-president",
    "snippet": "Dr. Alexander Van der Bellen was inaugurated as the Federal President of the Republic of Austria on January 26, 2017, and <strong>re-elected in October 2022</strong> for a second six-year term. As a member of the Green Party, he served as Federal Spokesperson ...",
    "published": null
  },
  {
    "title": "Van der Bellen re-elected Austrian president in first round | Euractiv",
    "url": "https://www.euractiv.com/section/all/short_news/van-der-bellen-re-elected-austrian-president-in-first-round/",
    "snippet": "<strong>Austria elected its federal president on Sunday, choosing to keep the incumbent Alexander Van der Bellen, who won a clear majority against the other six candidates in the first round</strong>, current projections show.",
    "published": "September 29, 2024"
  }
]