[
  {
    "title": "List of Juventus FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Juventus_FC_managers",
    "snippet": "The most successful person to manage Juventus is <strong>Giovanni Trapattoni</strong>, who won six Football League titles (Scudetto), two Coppa Italias, one European Champions Clubs&#x27; Cup, one UEFA Cup Winners&#x27; Cup, two UEFA Cups, one UEFA Super Cup and one Intercontinental Cup in two periods from 1976 and 1986 ...",
    "published": "November 2, 2025"
  },
  {
    "title": "Juventus Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=1408&teamTabs=managers",
    "snippet": "Juventus Football Club Managers, full history, past and present. Provided courtesy of Soccerbase.com, the Football Betting Site.",
    "published": null
  },
  {
    "title": "Igor Tudor is no longer Juventus' head coach - Juventus",
    "url": "https://www.juventus.com/en/news/articles/igor-tudor-is-no-longer-juventus-head-coach",
    "snippet": "Juventus Football Club announces that it has today relieved <strong>Igor Tudor</strong> of his duties as head coach of the Men&#x27;s First Team, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": null
  },
  {
    "title": "Juventus FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_FC",
    "snippet": "After a two-and-a-half-season absence, Lippi returned to the club in 2001, following his replacement Carlo Ancelotti&#x27;s dismissal, signing big name players like Gianluigi Buffon, David Trezeguet, Pavel Nedvěd, and Lilian Thuram, helping the team to win the 2001–02 Serie A, which was their first since 1998, and confirmed themselves in the 2002–03 Serie A. Juventus were also part of the all Italian 2003 UEFA Champions League final but lost out to Milan on penalties after the game ended in a 0–0 draw. At the conclusion of the following season, Lippi was appointed as the Italy national team&#x27;s head coach, bringing an end to one of the most fruitful managerial spells in Juventus&#x27;s history.",
    "published": "3 days ago"
  },
  {
    "title": "Juventus » Manager history",
    "url": "https://www.worldfootball.net/teams/juventus/9/",
    "snippet": "Juventus on Monday sacked coach <strong>Igor Tudor</strong> after the Serie A club&#x27;s 1-0 defeat by Lazio meant they had accumulated just five points in their last five matches....",
    "published": null
  }
]