[
  {
    "title": "Samy Bengio - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Samy_Bengio",
    "snippet": "Bengio is <strong>senior director of Artificial Intelligence and Machine Learning Research at Apple and an adjunct professor at École Polytechnique Fédérale de Lausanne</strong>. He was a longtime scientist at Google, where he led a large group of researchers working in machine learning, including adversarial ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Samy Bengio",
    "url": "https://bengio.abracadoudou.com/",
    "snippet": "Senior Director, AI and Machine Learning Research Apple Machine Learning Research One Apple Park Way 95014 Cupertino California, USA · I am also an adjunct professor at EPFL",
    "published": null
  },
  {
    "title": "Samy Bengio - Research at Google",
    "url": "https://research.google.com/pubs/bengio.html?viewType=Print&viewClass=Print",
    "snippet": "Samy Bengio (PhD in computer science, University of Montreal, 1993) is a research scientist at Google since 2007. Before that, he was <strong>senior researcher in statistical machine learning at IDIAP Research Institute</strong> since 1999, where he supervised PhD students and postdoctoral fellows.",
    "published": null
  },
  {
    "title": "Samy Bengio - Apple | LinkedIn",
    "url": "https://www.linkedin.com/in/bengio",
    "snippet": "Experience: Apple · Location: Mountain View · 500+ connections on LinkedIn. View Samy Bengio’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": null
  },
  {
    "title": "Apple hires ex-Google AI scientist who resigned after colleagues' firings | Reuters",
    "url": "https://www.reuters.com/technology/apple-hires-ex-google-ai-scientist-who-resigned-after-colleagues-firing-2021-05-03/",
    "snippet": "May 3 (Reuters) - Apple Inc (AAPL.O), opens new tab said on Monday it has hired former distinguished Google (GOOGL.O), opens new tab scientist Samy Bengio, who left the search giant amid turmoil in its artificial intelligence research department.",
    "published": "May 4, 2021"
  }
]