[
  {
    "title": "List of spouses of presidents and chancellors of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_spouses_of_presidents_and_chancellors_of_Germany",
    "snippet": "This is a list of spouses of the president of Germany and the chancellor of Germany.",
    "published": "June 5, 2025"
  },
  {
    "title": "Angela Merkel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Angela_Merkel",
    "snippet": "<strong>Angela Dorothea Merkel</strong> (German pronunciation: [aŋˈɡeːla doʁoˈteːa ˈmɛʁkl̩] ⓘ; née Kasner; born 17 July 1954) is a German retired politician who served as Chancellor of Germany from 2005 to 2021. She is the only woman to have held the office and the only from former East Germany.",
    "published": "1 week ago"
  },
  {
    "title": "Angela Merkel | Book, Biography, Putin, Education, Freedom, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Angela-Merkel",
    "snippet": "Merkel’s stance greatly increased her visibility and popularity with the German public, although it upset Kohl loyalists. On April 10, 2000, Merkel was elected head of the CDU, becoming the first woman and the first non-Catholic to lead the party. As CDU leader, Merkel faced the lingering effects of the finance scandal and a divided party. Although Merkel had hoped to stand as a candidate for chancellor in the 2002 election, a majority of her party expressed a preference for Edmund Stoiber of the Christian Social Union (CSU), the CDU’s sister party in Bavaria.",
    "published": "December 7, 2005"
  },
  {
    "title": "r/germany on Reddit: Does Germany have an official residency of the Chancellor/President",
    "url": "https://www.reddit.com/r/germany/comments/1bqww6v/does_germany_have_an_official_residency_of_the/",
    "snippet": "However, idk if it&#x27;s because of the language barrier but I have never seen Germany host people/groups at their version of the &quot;White House&quot;. The president&#x27;s office is in Bellevue palace in Berlin, the Chancellor&#x27;s office in Bundeskanzleramt. That&#x27;s where they work. The president does also have an official residence while the chancellor doesn&#x27;t. Scholz lives in Potsdam, which is a smaller city right next to Berlin. Merkel had a normal apartment in central Berlin and usually walked to work. His spouse is rarely seen in the public life.",
    "published": "March 29, 2024"
  },
  {
    "title": "List of chancellors of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_chancellors_of_Germany",
    "snippet": "The office was created in the North German Confederation in 1867, when Otto von Bismarck became the first chancellor. With the unification of Germany and establishment of the German Empire in 1871, the Confederation evolved into a German nation-state and its leader became known as the chancellor ...",
    "published": "2 weeks ago"
  }
]