[
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "<strong>He returned to the University of Oxford in 1970 as a lecturer</strong>. In 1990 he became a reader in zoology. In 1995, he was appointed Simonyi Professor for the Public Understanding of Science at Oxford, a position that had been endowed by Charles Simonyi with the express intention that the holder ...",
    "published": "2 days ago"
  },
  {
    "title": "Richard Dawkins' homepage at Oxford University",
    "url": "https://users.ox.ac.uk/~dawkins/",
    "snippet": "I have no official web site. John Catalano has an excellent unofficial one which does everything I could possibly do if I had a site of my own, and much more. It is located at · Quite apart from material connected with me and my books, his pages are a superb resource on all kinds of scientific ...",
    "published": null
  },
  {
    "title": "Richard Dawkins - Oxford Reference",
    "url": "https://www.oxfordreference.com/display/10.1093/oi/authority.20110803095703340",
    "snippet": "(1941– )British scientist whose books on genetics and evolution have found a wide general readership.Born in Nairobi, Kenya, Dawkins studied at Oxford, then taught at the University of California, Berkeley (1967–69), before returning to Oxford as a fellow of New College.",
    "published": null
  },
  {
    "title": "Richard DAWKINS | University of Oxford, Oxford | OX | New College Oxford | Research profile",
    "url": "https://www.researchgate.net/profile/Richard-Dawkins",
    "snippet": "Richard DAWKINS | Cited by 9,910 | of University of Oxford, Oxford (OX) | Read 113 publications | Contact Richard DAWKINS",
    "published": null
  },
  {
    "title": "The Oxford Book of Modern Science Writing (Oxford Landmark Science): Dawkins, Richard: 9780199216819: Amazon.com: Books",
    "url": "https://www.amazon.com/Oxford-Modern-Science-Writing-Landmark/dp/0199216819",
    "snippet": "Richard Dawkins taught zoology at the University of California at Berkeley and at Oxford University and is now the <strong>Charles Simonyi Professor of the Public Understanding of Science at Oxford</strong>, a position he has held since 1995.",
    "published": null
  }
]