[
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "The Sovereignty Council, an 11-member civilian-military collective head of state, is designed to lead the country for 39 months in the transition to democracy, which is supposed to end with the next general election. The Transitional Sovereignty Council was dissolved by al-Burhan on 25 October 2021, following a coup d&#x27;état. Al-Burhan reinstated it on 11 November 2021, with some members replaced. As of 2021, there is a two-term limit for the president in the Constitution of Sudan.",
    "published": "November 14, 2025"
  },
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "On 10 November 2023, <strong>al-Burhan</strong> ... state on the 1967 borders.&quot; On 16 January 2025, the U.S. Treasury Department imposed sanctions on <strong>al-Burhan</strong>. According to sources the reasons were: &quot;targeting of civilians and civilian infrastructure and denial of aid access, as well as refusal to participate ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Republic of The Sudan | African Union",
    "url": "https://au.int/en/countryprofiles-15",
    "snippet": "Head of State: <strong>President Abdel Fattah Abdelrahman al-Burhan</strong> · Head of Government: Prime Minister Abdallah Hamdok · Independence Day : January 01, 1956 · Calling Code: +249 · Currency: Sudanese pound (SDG,SDD) Area: 2,505,813 km2 · Countries Tags: Sudan · 2025 Year of Reparations: Justice ...",
    "published": null
  },
  {
    "title": "South Sudan Government 2024, CIA World Factbook",
    "url": "https://theodora.com/wfbcurrent/south_sudan/south_sudan_government.html",
    "snippet": "citizenship by birth: no citizenship ... of South Sudan dual citizenship recognized: yes residency requirement for naturalization: 10 years ... chief of state: President <strong>Salva KIIR Mayardit</strong> (since 9 July 2011); Vice Presidents Riek MACHAR Teny Dhurgon, TABAN Deng Gai, James Wani IGGA, Rebecca ...",
    "published": null
  },
  {
    "title": "List of heads of government of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_government_of_Sudan",
    "snippet": "The current prime minister is <strong>Kamil Idris</strong>. He was appointed by the Transitional Sovereignty Council on 31 May 2025. ... ^ Briefly interrupted following the 2021 coup d&#x27;état, when Abdel Fattah al-Burhan served as head of state and there was ...",
    "published": "October 23, 2025"
  }
]