[
  {
    "title": "Catherine Cesarsky - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Catherine_Cesarsky",
    "snippet": "Born in France, Catherine Cesarsky was largely raised in Argentina and she <strong>received a degree in physical sciences at the University of Buenos Aires</strong>. She graduated with a PhD in astronomy in 1971 from Harvard University (Cambridge, Mass., USA).",
    "published": "December 25, 2024"
  },
  {
    "title": "Dr. Catherine Cesarsky | ESO",
    "url": "https://eso.org/public/about-eso/dg-office/ccesarsk/?lang=",
    "snippet": "Born in France, Catherine Cesarsky <strong>received a degree in Physical Sciences at the University of Buenos Aires</strong> and graduated with a PhD in Astronomy in 1971 from Harvard University (Cambridge, Mass., USA). She worked at the California Institute of Technology. In 1974, she moved to France, becoming ...",
    "published": null
  },
  {
    "title": "Dr Catherine Cesarsky | SKAO",
    "url": "https://www.skao.int/en/540/dr-catherine-cesarsky",
    "snippet": "Born in France and raised in Argentina, Catherine Cesarsky <strong>received a degree in Physical Sciences</strong> at the University of Buenos Aires.",
    "published": null
  },
  {
    "title": "Catherine Cesarsky",
    "url": "https://www.sheisanastronomer.org/profiles/europe/catherine-cesarsky",
    "snippet": "Born in France, Catherine Cesarsky <strong>received a degree in Physical Sciences at the University of Buenos Aires and graduated with a PhD in Astronomy in 1971 from Harvard University (Cambridge, Mass., USA).</strong> She worked at the California Institute of Technology. In 1974, she moved to France, where ...",
    "published": null
  },
  {
    "title": "ESOblog: In conversation with Catherine Cesarsky: the former ESO Director General talks new projects, leadership and future scientific advances",
    "url": "https://www.eso.org/public/france/blog/in-conversation-with-catherine-cesarsky/",
    "snippet": "Born in France, Catherine Cesarsky <strong>received a degree in Physical Sciences at the University of Buenos Aires</strong> and graduated with a PhD in Astronomy in 1971 from Harvard University. She worked at the California Institute of Technology, before moving ...",
    "published": null
  }
]