[
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Please contact us with any updates. ... Jesse Ventura was the Governor of Minnesota. Ventura assumed office on January 8, 1999. Ventura left office on January 6, 2003. Ventura (<strong>Green Party of Alaska, Unaffiliated</strong>) ran for election for President of the United States.",
    "published": null
  },
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "Jesse Ventura (born James George ... (WWF, now WWE), he served as the 38th governor of Minnesota from 1999 to 2003. He was elected governor with the <strong>Reform Party</strong> and is the party&#x27;s only candidate to win a major government office....",
    "published": "2 days ago"
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th Governor of Minnesota on November 3, 1998 defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He served as Governor for one term. Shocking the political establishment, Ventura became the only <strong>Reform Party</strong> candidate to ...",
    "published": null
  },
  {
    "title": "Green Party Nominee Other: Jesse Ventura is a former ...",
    "url": "https://www.elections.alaska.gov/election/2020/General/Janos-McKinney_Pres-VP_WEB.pdf",
    "snippet": "The views expressed in this statement are from the candidate and not endorsed by the Division of Elections. The text of this statement was provided and paid for by the candidate in accordance with AS 15.58.030 and 6 AAC 25.690. Cynthia McKinney – United States Vice President – <strong>Green Party</strong>",
    "published": null
  },
  {
    "title": "Jesse Ventura: A Profile | MPR Archive Portal",
    "url": "https://archive.mpr.org/collections/special-collections/jesse-ventura",
    "snippet": "He was the first and only candidate of the <strong>Reform Party</strong> to win a major government position. In his role as governor, he was known for both his independence and combativeness with political parties and the press.",
    "published": null
  }
]