[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "On November 15, 2020, The Wall Street Journal reported that Hicks Equity Partners, a private equity firm with ties to a co-chair of the Republican National Committee, was exploring a buyout of Newsmax. The Hicks group identified a team of executives who would manage the network, and had been talking to former Fox News hosts including Megyn Kelly. Media analyst Michael Nathanson reported that if a competing network took 20% of Fox News&#x27; audience, it could sap about $200 million in annual profit from the company.",
    "published": "1 week ago"
  },
  {
    "title": "Who Owns Newsmax: A Friendly Guide To The Media Company's Ownership",
    "url": "https://richniches.com/who-owns-newsmax/",
    "snippet": "<strong>Private shareholders make up the ownership structure, with the exact distribution of shares not publicly disclosed</strong>. Newsmax has pursued private placement offerings to raise capital from accredited investors while maintaining its private company ...",
    "published": "August 28, 2025"
  },
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "<strong>Christopher Ruddy</strong> (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and majority owner of Newsmax Media.",
    "published": "5 days ago"
  },
  {
    "title": "newsmax inc.",
    "url": "https://www.sec.gov/Archives/edgar/data/2026478/000121390025021989/ea0233655-253g1_newsmax.htm",
    "snippet": "Subsequently, Newsmax Media changed its state of domicile from Delaware to Florida. As a result of this reorganization, Newsmax Inc. became the <strong>direct holding company and the sole shareholder of Newsmax Media</strong>. Newsmax Media’s ownership of its subsidiaries was not affected or changed as a ...",
    "published": null
  },
  {
    "title": "Who Owns Newsmax: Top Shareholders – Brands Owned By",
    "url": "https://brandsownedby.com/who-owns-newsmax/",
    "snippet": "Understanding who owns Newsmax highlights the network’s leadership and control structure. The company is <strong>led by its founder and CEO, Christopher Ruddy</strong>, who guides both its editorial direction and overall strategy.",
    "published": "October 6, 2025"
  }
]