[
  {
    "title": "Peter Norvig: Today's Most Pressing Questions in AI Are ...",
    "url": "https://hai.stanford.edu/news/peter-norvig-todays-most-pressing-questions-ai-are-human-centered",
    "snippet": "The AI expert, who joins Stanford HAI as a <strong>Distinguished Education Fellow</strong>, discusses building inclusive education and broadening access to students. Artificial intelligence expert Peter Norvig is joining the Stanford Institute for Human-Centered AI this fall as a <strong>Distinguished Education Fellow</strong>, ...",
    "published": null
  },
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "Programmer, designer, author, and manager in high tech R&amp;D. Specialties: internet… · Experience: Stanford Institute for Human-Centered Artificial Intelligence (HAI) · Location: Palo Alto · 500+ connections on LinkedIn. View Peter Norvig’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": "1 week ago"
  },
  {
    "title": "Peter Norvig - Stanford HAI",
    "url": "https://hai.stanford.edu/people/peter-norvig",
    "snippet": "Peter Norvig is a <strong>Distinguished Education Fellow</strong> at Stanford&#x27;s Human-Centered Artificial Intelligence Institute and a researcher at Google Inc; previously he directed Google&#x27;s core search algorithms group and Google&#x27;s Research group. He was head of NASA Ames&#x27;s Computational Sciences Division, ...",
    "published": null
  },
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Peter Norvig (born 14 December 1956) is an American computer scientist and <strong>Distinguished Education Fellow</strong> at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google.",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Norvig Bio",
    "url": "https://norvig.com/bio.html",
    "snippet": "Peter Norvig is <strong>a Fellow at Stanford&#x27;s Human-Centered AI Institute and a researcher at Google Inc</strong>; previously he directed Google&#x27;s core search algorithms group and Google&#x27;s Research group.",
    "published": null
  }
]