[
  {
    "title": "Malaysia’s ex-PM Mahathir quits Pejuang party he founded, picks GTA as new political platform | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/malaysia-ex-pm-mahathir-quits-the-pejuang-party-he-founded-chooses-gta-as-new-political-platform",
    "snippet": "Tun Dr Mahathir, 97, was one of 13 Pejuang members who sent in a notice to party secretary-general Amiruddin Hamzah on Friday, saying that they were leaving the party and will now continue their political journey with <strong>Gerakan Tanah Air</strong> (GTA), ...",
    "published": "November 22, 2024"
  },
  {
    "title": "Gerakan Tanah Air - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gerakan_Tanah_Air",
    "snippet": "<strong>Gerakan Tanah Air (GTA, Homeland Movement or Homeland Party) is an alliance of Malay political parties, founded in August 2022 by former Prime Minister of Malaysia Mahathir Mohamad</strong>.",
    "published": "October 16, 2025"
  },
  {
    "title": "Gerakan Tanah Air",
    "url": "https://grokipedia.com/page/Gerakan_Tanah_Air",
    "snippet": "Gerakan Tanah Air (GTA), translated ... established in August 2022 by former Prime Minister Mahathir Mohamad to <strong>unite Malay political forces</strong>.[1][2] The alliance positioned itself as a vehicle for addressing perceived erosion ...",
    "published": null
  },
  {
    "title": "Mahathir's GTA to proceed with registration as party",
    "url": "https://www.malaysiakini.com/news/647164",
    "snippet": "<strong>Gerakan Tanah Air</strong>, a new political coalition led by former premier Dr Mahathir Mohamad which suffered a total defeat during its debut in the recent general election, will proceed with its plan to register as a party.",
    "published": "December 6, 2022"
  },
  {
    "title": "Only Gerakan Tanah Air can form good government in Malaysia, says Mahathir - CNA",
    "url": "https://www.channelnewsasia.com/asia/malaysia-sabah-mahathir-mohamad-pejuang-gta-anwar-ibrahim-3049676",
    "snippet": "&quot;The three coalitions - Barisan ... chapter in Kota Kinabalu on Sunday (Nov 6). Dr Mahathir said that <strong>GTA has many plans for how to rebuild Malaysia</strong>....",
    "published": "November 7, 2022"
  }
]