[
  {
    "title": "List of Chelsea F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Chelsea_F.C._managers",
    "snippet": "The first manager of Chelsea Football Club was John Robertson, appointed player-manager in 1905. The current head coach is <strong>Enzo Maresca</strong>. Chelsea have had 32 permanent managers/head coaches (of whom four also served as player-manager), six interim ...",
    "published": "3 days ago"
  },
  {
    "title": "Enzo Maresca - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Enzo_Maresca",
    "snippet": "<strong>Enzo Maresca</strong> (born 10 February 1980) is an Italian professional football manager and former player. He is the head coach of Premier League club Chelsea. After starting out at West Bromwich Albion in 1998, he went on to play for several clubs in his country, including Juventus, who loaned him ...",
    "published": "3 days ago"
  },
  {
    "title": "Chelsea Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=536&teamTabs=managers",
    "snippet": "From Allardyce to Zola, our massive manager database, with histories and win ratios, is sure to get your vote of confidence ... Card-happy control freak? Astute arbiter?",
    "published": null
  },
  {
    "title": "Chelsea Football Club is delighted to announce the appointment of Enzo Maresca as new head coach of the men’s team.",
    "url": "https://www.chelseafc.com/en/news/article/enzo-maresca-to-become-chelsea-mens-head-coach",
    "snippet": "After a stint with Parma and another ... head coach at Leicester City in June 2023. The 44-year-old guided the club to the EFL Championship title and promotion back to the Premier League in his first season in charge. Enzo’s staff will include former Chelsea goalkeeper ...",
    "published": null
  },
  {
    "title": "Enzo Maresca's inspirational journey to becoming Chelsea head coach | News | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/news/article/enzo-marescas-inspirational-journey-to-becoming-chelsea-head-coach",
    "snippet": "A year and a half as assistant manager in east London led to an opportunity with Manchester City’s Elite Development Squad where he would become the boss, nurturing many promising youngsters including current Chelsea players Cole Palmer and Romeo Lavia. Maresca led the Sky Blues to their first-ever Premier League 2 trophy while implementing his style of play and football vision. After a period as head coach at Parma back in Italy, Maresca returned to England, but this time under the tutelage of Guardiola as part of Manchester City’s backroom staff. As one of the Spaniard&#x27;s assistant managers, Enzo helped oversee a historic treble as they secured the Premier League, UEFA Champions League and FA Cup.",
    "published": null
  }
]