[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "In 1996, Prabowo led Operation Mapenduma in the mountainous terrain of Papua. The goal of the operation was the release of 11 scientific researchers who had been taken hostage by the Free Papua Movement (OPM). The researchers were five Indonesians, four Britons, one Dutchman and his pregnant German wife.",
    "published": "1 day ago"
  },
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "The writing was on the wall: Prabowo was soon thereafter discharged from the military, supposedly for his abduction of activists. That same year, Prabowo and his wife, <strong>Titiek</strong>, divorced.",
    "published": "December 9, 2024"
  },
  {
    "title": "Titiek Suharto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Titiek_Suharto",
    "snippet": "In May 1983, <strong>Titiek</strong> married Prabowo Subianto, who was then a senior officer in the Indonesian Army&#x27;s Kopassandha.",
    "published": "3 days ago"
  },
  {
    "title": "Indonesia's first ladies have always been influential, but soon the country won't have one - ABC News",
    "url": "https://www.abc.net.au/news/2024-05-05/role-first-lady-indonesia-election-prabowo-subianto/103787902",
    "snippet": "Prabowo Subianto was married to <strong>Siti Hediati Hariyadi</strong>, daughter of then-president Suharto. (Reuters) There&#x27;s even been speculation the former general could reunite with his ex-wife — the daughter of Indonesia&#x27;s longest-serving president, Suharto.",
    "published": "May 4, 2024"
  },
  {
    "title": "Official Campaign Web Site - Prabowo Subianto | Library of Congress",
    "url": "https://www.loc.gov/item/lcwaN0009998/",
    "snippet": "He is also the former husband of <strong>Titiek Suharto</strong>, the late President Suharto&#x27;s second daughter, they were married in 1983 and divorced in 1998 during Indonesian political crisis.&quot; -- Summary retrieved on October 7, 2019 http://dbpedia.org/re...",
    "published": null
  }
]