[
  {
    "title": "Inspiring Change: UC Santa Cruz launches $750M campaign - News",
    "url": "https://news.ucsc.edu/2025/11/inspiring-change-uc-santa-cruz-launches-750m-campaign/",
    "snippet": "“Since our founding, UC Santa Cruz has pursued solutions that benefit society, whether it’s increasing our resilience in the face of climate change, advancing health solutions, or sharing the untold stories of communities, locally and globally,” Chancellor Cynthia Larive said.",
    "published": "November 16, 2025"
  },
  {
    "title": "Letter from Chancellor Cynthia Larive – UC Santa Cruz",
    "url": "https://www.ucsc.edu/annual-report/letter-from-chancellor-cynthia-larive-2025/",
    "snippet": "And we were thrilled to witness the debut images from the Vera C. Rubin Observatory, home to the largest camera ever built. Its unveiling was decades in the making, and UC Santa Cruz researchers were at the heart of it from the beginning.",
    "published": null
  },
  {
    "title": "Office of the Chancellor – The Office of the Chancellor at UC Santa Cruz.",
    "url": "https://chancellor.ucsc.edu/",
    "snippet": "Chancellor Cynthia Larive · <strong>Campus notification procedures for immigration enforcement (SB 98)December 4, 2025</strong> · Announcing Inspiring Change: The Campaign for UC Santa CruzNovember 16, 2025 · Campus Provost and Executive Vice Chancellor recruitment underwayNovember 7, 2025 ·",
    "published": null
  },
  {
    "title": "UC Santa Cruz chancellor review is underway - Lookout Santa Cruz",
    "url": "https://lookout.co/uc-santa-cruz-chancellor-review-is-underway/story",
    "snippet": "The confidential review — delayed by the pandemic — will assess Larive’s six-year tenure through faculty input and is expected to conclude by February. University of California President James Milliken has initiated UC Santa Cruz Chancellor Cynthia Larive’s regular five-year performance review and it’s expected to last through February, UC officials confirmed.",
    "published": "November 4, 2025"
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "<strong>UC Santa Cruz Chancellor Cynthia Larive is set to undergo an overdue five-year performance review</strong>, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  }
]