[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Die_Linke",
    "snippet": "&#x27;The Left&#x27;), also known as the ... political party in Germany. The party was <strong>founded in 2007 as the result of the merger of the Party of Democratic Socialism (PDS) and Labour and Social Justice – The Electoral Alternative</strong>....",
    "published": "January 7, 2007"
  },
  {
    "title": "Die Linke | Parties in the German Bundestag",
    "url": "https://www.deutschland.de/en/topic/politics/die-linke-parties-in-the-german-bundestag",
    "snippet": "Profile: Die Linke (i.e. the Left) was <strong>formed in 2007 from the merger of the PDS – the democratic successor to the East German party SED – and the left-wing SPD breakaway group WASG</strong>.",
    "published": "May 8, 2025"
  },
  {
    "title": "Left Party | Germany, Politics, Origin, & Election Results | Britannica",
    "url": "https://www.britannica.com/topic/Left-Party-political-party-Germany",
    "snippet": "The Left (Die Linke) is a German political party that ruled East Germany as the Socialist Unity Party of Germany (SED) and now contests elections in united Germany.",
    "published": "November 10, 2006"
  },
  {
    "title": "A Successful Model? Die Linke (the Left Party — Germany) | SpringerLink",
    "url": "https://link.springer.com/chapter/10.1057/9781137265111_5",
    "snippet": "Die Linke is the direct successor to the ruling Socialist Unity Party (SED) of the former German Democratic Republic. It has undergone a significant political transformation, firstly as the Party of Democratic Socialism (PDS), embracing the democratic red, green,...",
    "published": null
  },
  {
    "title": "What Is Left and to Whom? Germany’s Left-wing Party Die Linke and the Search for Its Identity | Ifri",
    "url": "https://www.ifri.org/en/papers/what-left-and-whom-germanys-left-wing-party-die-linke-and-search-its-identity",
    "snippet": "In late February 2021, Germany’s left-wing party Die Linke gave themselves a new party executive. The new team is supposed to lead the party into the federal elections in September and, if possible, into a national center-left government.",
    "published": null
  }
]