[
  {
    "title": "Niko Kovač - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Niko_Kova%C4%8D",
    "snippet": "Kovač managed Croatia at the 2014 FIFA World Cup, then became head coach of Eintracht Frankfurt in 2016, winning the 2018 DFB-Pokal Final with the club. At Bayern, Kovač won the domestic double in 2019 after a strong ending to the season, but lost his job later in autumn. In summer 2020, he was appointed manager of Monaco, but was sacked on 1 January 2022. He then returned to German football as manager of Wolfsburg from 2022 to 2024 before taking over at Borussia Dortmund in January 2025.",
    "published": "3 days ago"
  },
  {
    "title": "Borussia Dortmund appoint Niko Kovač as new head coach | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/niko-kovac-to-become-new-borussia-dortmund-head-coach-sahin-30706",
    "snippet": "Having overseen a 2-2 draw with Werder Bremen in the Bundesliga last weekend, the Shakhtar win marked his first as interim coach and Dortmund&#x27;s first in 2025. The result set up a Champions League last 16 play-off against either Sporting Lisbon or Club Brugge.",
    "published": "January 31, 2025"
  },
  {
    "title": "Borussia Dortmund head coach Niko Kovac signs new contract - The Athletic",
    "url": "https://www.nytimes.com/athletic/6575678/2025/08/26/borussia-dortmund-niko-kovac-signs-new-contract/",
    "snippet": "Aug. 26, 2025 ... Borussia Dortmund head coach <strong>Niko Kovac</strong> has signed a new contract until June 2027.",
    "published": "August 26, 2025"
  },
  {
    "title": "Niko Kovac succeeds Nuri Sahin as Borussia Dortmund coach - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/43621138/niko-kovac-succeeds-nuri-sahin-borussia-dortmund-coach",
    "snippet": "ESPNJan 30, 2025, 03:48 AM ET · Email · Print · Open Extended Reactions · <strong>Niko Kovac</strong> has been named the new head coach of Borussia Dortmund. Cathrin Mueller/Getty Images · Borussia Dortmund have appointed <strong>Niko Kovac</strong> as their new head coach, ...",
    "published": "January 30, 2025"
  },
  {
    "title": "Niko Kovac: Borussia Dortmund appoint former Bayern Munich manager as head coach - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cgq0lp8l078o",
    "snippet": "Updated 30 January 2025 · Borussia Dortmund have appointed former Bayern Munich manager <strong>Niko Kovac</strong> as their new head coach. The Bundesliga club sacked Nuri Sahin last week after their Champions League loss at Bologna, which was their fourth ...",
    "published": "January 30, 2025"
  }
]