[
  {
    "title": "Akron Beacon Journal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Akron_Beacon_Journal",
    "snippet": "The McClatchy Company bought Knight Ridder in June 2006 with intentions of selling 12 Knight Ridder newspapers. On August 2, 2006, McClatchy sold the Beacon Journal to Black Press. In 2018, <strong>GateHouse Media</strong> bought the newspaper. On November 11, 2013, the Akron Beacon Journal printed its last ...",
    "published": "6 days ago"
  },
  {
    "title": "The Akron Beacon Journal (Akron, Ohio) 1903-Current | Library of Congress",
    "url": "https://www.loc.gov/item/sn84028149/",
    "snippet": "Daily 34th year, no. 288 (Nov. 6, 1903)- Republican. Also issued on microfilm from Ohio Historical Society and Microfilming Corp. of America. Subject and personal name index: 1929-1938. 10 v. Weekly ed.: Summit County beacon, 1903-1910. 162nd year, no. 139 (Aug. 31, 2000).",
    "published": null
  },
  {
    "title": "Timeline of Beacon Journal history",
    "url": "https://www.beaconjournal.com/story/lifestyle/2014/09/19/timeline-beacon-journal-history/10338934007/",
    "snippet": "1, 1922 — The first log of radio programs, including the programming of an Akron station, appears in the Beacon Journal. 1923 — John S. Knight’s influence begins to be felt as the Beacon Journal opens a full-time Washington Bureau. 1924 — The paper begins sending reporters and photographers throughout the state on stories. March 1925 — The Scripps-Howard League, which is owner of the Akron Press, buys the Akron Evening Times and merges the two into the Times-Press, giving the Beacon Journal stiff competition.",
    "published": "September 19, 2014"
  },
  {
    "title": "Akron Beacon Journal sold to GateHouse Media",
    "url": "https://www.dispatch.com/story/news/state/2018/04/11/akron-beacon-journal-sold-to/12712388007/",
    "snippet": "The Pulitzer Prize-winning Akron Beacon Journal and its Ohio.com website are joining the <strong>GateHouse Media</strong> family, which owns The Columbus Dispatch, The Canton Repository, and about 60 other Ohio publications and their websites – all among the ...",
    "published": "April 11, 2018"
  },
  {
    "title": "Akron Beacon Journal Subject Indexes (1841-1939)",
    "url": "https://www.akronlibrary.org/locations/main-library/special-collections/genealogy/akron-beacon-journal-subject-indexes",
    "snippet": "Text-only versions of articles 1984-present are available with an ASCPL library card through NewsBank. You may search the Akron Beacon Journal 1872-present through Newspapers.com, but you must have a private subscription to view articles.",
    "published": null
  }
]