[
  {
    "title": "Marc Grossman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marc_Grossman",
    "snippet": "Grossman was lured out of retirement ... to Afghanistan and Pakistan, Richard Holbrooke. He began his role on February 22, 2011 and <strong>concluded his tenure on December 14, 2012.</strong>...",
    "published": "August 4, 2025"
  },
  {
    "title": "Marc Grossman - Yale Jackson School of Global Affairs",
    "url": "https://jackson.yale.edu/person/marc-grossman/",
    "snippet": "Ambassador Marc Grossman served as a Senior Fellow at Jackson from <strong>2012 – 2014.</strong> Grossman served as the Under Secretary of State for Political Affairs, the State Department&#x27;s third ranking official, until his retirement in 2005 after 29 years ...",
    "published": "March 26, 2023"
  },
  {
    "title": "Marc Grossman | The Cohen Group",
    "url": "https://www.cohengroup.net/who-we-are/team/marc-grossman",
    "snippet": "Ambassador Grossman served as the Under Secretary of State for Political Affairs, the State Department&#x27;s third ranking official, <strong>until his retirement in 2005</strong>, after 29 years in the US Foreign Service.",
    "published": "January 29, 2025"
  },
  {
    "title": "Ambassador Marc Grossman | Leadership, Diplomacy and National Security Lab",
    "url": "https://ldns.asu.edu/about/ambassador-marc-grossman",
    "snippet": "Ambassador Marc Grossman served as the Under Secretary of State for Political Affairs, the State Department&#x27;s third ranking official, <strong>until his retirement in 2005</strong> after 29 years in the US Foreign Service. As Under Secretary, he helped marshal diplomatic support for the international response ...",
    "published": null
  },
  {
    "title": "Marc Grossman",
    "url": "https://grokipedia.com/page/Marc_Grossman",
    "snippet": "Marc Grossman was nominated by President Bill Clinton and confirmed by the Senate as <strong>Director General of the Foreign Service and Director of Human Resources</strong>, with his entry on duty occurring on June 19, 2000.[3][1] In this dual role at the U.S. ...",
    "published": null
  }
]