[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "Newsmax, Inc. (or Newsmax.com, previously styled NewsMax) is an American cable news, political opinion commentary, and digital media company founded by <strong>Christopher Ruddy in 1998</strong>. It has been variously described as conservative, right-wing, and far-right.",
    "published": "1 week ago"
  },
  {
    "title": "Newsmax – Breaking News | News Videos | Politics, Health, Finance",
    "url": "https://www.newsmax.com/",
    "snippet": "Newsmax.com reports today’s news headlines, live news stream, news videos from Americans and global readers seeking the latest in current events, politics, U.S., world news, health, finance, and more.",
    "published": null
  },
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "In January 2010, Britain&#x27;s Daily Telegraph ranked Ruddy as one of the &quot;100 Most Influential Conservatives&quot; in the U.S. The paper said: &quot;<strong>Chris Ruddy</strong> is an increasingly powerful and influential player in the conservative media and beyond.&quot; Ruddy has been both a &quot;Patron&quot; and a &quot;Sustaining Donor&quot; ...",
    "published": "5 days ago"
  },
  {
    "title": "Newsmax | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/business-and-management/newsmax",
    "snippet": "Newsmax is an American media outlet that encompasses both a website and a television network, catering primarily to a conservative audience. Founded in <strong>1998</strong> by Christopher Ruddy, a former investigative journalist, Newsmax initially gained traction ...",
    "published": null
  },
  {
    "title": "NewsMax.com - SourceWatch",
    "url": "https://www.sourcewatch.org/index.php/NewsMax.com",
    "snippet": "The company generates sales from politically-oriented merchandise (clothing, posters, books) showcasing stars of the Republican Party. It also partners with Random House to publish a series of co-branded books. Former New York Post reporter <strong>Christopher Ruddy</strong>, the company&#x27;s CEO, founded NewsMax ...",
    "published": null
  }
]