[
  {
    "title": "Taoiseach - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taoiseach",
    "snippet": "Although Éamon de Valera, who introduced the title in 1937, was a democratic politician who had in the past associated with paramilitaries, some have remarked that the meaning &#x27;leader&#x27; in 1937 made the title similar to the titles of fascist dictators of the time, such as Führer (for Adolf Hitler), Duce (for Benito Mussolini) and Caudillo (for Francisco Franco). Tánaiste, in turn, refers to the system of tanistry, the Gaelic system of succession whereby a leader would appoint an heir apparent while still living.",
    "published": "4 days ago"
  },
  {
    "title": "Leo Varadkar - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Leo_Varadkar",
    "snippet": "The coalition deal allowed for a government to be formed on 27 June, with Fianna Fáil leader <strong>Micheál Martin</strong> taking over as Taoiseach. He was appointed by President Michael D. Higgins on 27 June, marking the end of Varadkar&#x27;s first term. Varadkar was appointed as Tánaiste and Minister for ...",
    "published": "1 month ago"
  },
  {
    "title": "Jack Lynch | Irish Prime Minister, Sportsman & Politician | Britannica",
    "url": "https://www.britannica.com/biography/Jack-Lynch",
    "snippet": "When Seán Lemass succeeded de Valera as taoiseach in 1959, he made Lynch minister for industry and commerce and in 1965–66 minister for finance. Lemass’s retirement in 1966 caused an internal party conflict over the succession that led to Lynch’s selection as a compromise candidate, ...",
    "published": "October 16, 2025"
  },
  {
    "title": "Deputy or Heir? Origins of ‘An Tánaiste’",
    "url": "https://thebrehonlawyer.com/2021/01/13/tanaiste/",
    "snippet": "However, as at January 2021 the role now also embodies a concrete political expectation of succession to the Taoiseachship. One interpretation of the tánaise ríg in Early Ireland is that it simply denoted the ‘second in command’ or ‘second to [X]’. Symbolically, this seems similar to the modern constitutional ‘deputising’ Tánaiste. But the historical tánaise ríg may also (at least sometimes) have been more than that, i.e.",
    "published": "February 20, 2023"
  },
  {
    "title": "What is the order of succession for the Prime Minister of Ireland (Taoiseach)? - Quora",
    "url": "https://www.quora.com/What-is-the-order-of-succession-for-the-Prime-Minister-of-Ireland-Taoiseach",
    "snippet": "Answer: <strong>There is no order of succession</strong>. If the office of Taoiseach becomes vacant the lower house of parliament, Dail Eireann, elects one of its members to the office. There is a deputy prime minister, the Tainiste, who acts on the Taoiseach’s ...",
    "published": null
  }
]