[
  {
    "title": "Paris Saint-Germain FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris_Saint-Germain_FC",
    "snippet": "Paris Saint-Germain are the most popular football club in France, accounting for 22% of the country&#x27;s fan base. With an estimated 35 million fans, PSG are also one of the most followed teams in the world. The <strong>Parc des Princes</strong> has been its home ground since July 1974.",
    "published": "20 hours ago"
  },
  {
    "title": "Matches schedule & fixtures | Paris Saint-Germain",
    "url": "https://billetterie.psg.fr/en/schedule",
    "snippet": "Check the full programm here (time and date) of the Paris Saint-Germain matches, home and away, for the season.",
    "published": null
  },
  {
    "title": "Paris Saint-Germain exploring options for new stadium",
    "url": "https://www.sportsbusinessjournal.com/Articles/2025/12/12/paris-saint-germain-exploring-options-for-new-stadium/",
    "snippet": "Ligue 1 club Paris Saint-Germain said that it is more determined than ever to leave the <strong>Parc des Princes</strong>, which it feels it has outgrown, and it is exploring steps toward building a new stadium in the Paris area.",
    "published": "1 week ago"
  },
  {
    "title": "PSG's New Stadium Project: A €1 Billion Investment in Massy",
    "url": "https://psgpost.com/psg-s-new-stadium-project-a-1-billion-investment-in-massy-01jq6za3h7jp",
    "snippet": "PSG will now embark on a transformative journey with plans to build a new <strong>€1 billion, 90,000 seat stadium in Massy</strong>, a suburb approximately 15 kilometers south of central Paris. With the impossibility to gain ownership of the Parc des Princes, ...",
    "published": "March 25, 2025"
  },
  {
    "title": "Paris Saint Germain (PSG) Stadium - Parc des Princes | Football Ground Guide",
    "url": "https://footballgroundguide.com/leagues/europe-1/france/paris-saint-germain-stadium.html",
    "snippet": "With the recent success at home and in Europe, it has just become a little harder to watch the Parisians play at <strong>Parc des Princes</strong>. For starters, looking to attend the next match, below are the PSG ticket prices for the current season.",
    "published": "3 weeks ago"
  }
]