[
  {
    "title": "Versant - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Versant",
    "snippet": "Lazarus explained that <strong>Versant will be treated as a holding company and &quot;house of brands&quot;;</strong> a larger focus will be placed upon its individual properties rather than Versant being a public-facing brand, and decisions on digital operations (such as streaming) will be left to each network.",
    "published": "2 days ago"
  },
  {
    "title": "VERSANT Spin Transaction | Comcast Corporation",
    "url": "https://www.cmcsa.com/VERSANT-Spin-Transaction",
    "snippet": "The New Name of the Spin-off Was Revealed as VERSANT, Which Speaks to the Company’s Adaptability and Embraces the Opportunity to Shape a New, Modern Media Company",
    "published": null
  },
  {
    "title": "Comcast’s Board Approves Separation of Versant Media Group, Inc. | Comcast Corporation",
    "url": "https://www.cmcsa.com/news-releases/news-release-details/comcasts-board-approves-separation-versant-media-group-inc",
    "snippet": "<strong>Comcast Corporation</strong> (NASDAQ: CMCSA) today announced that its Board of Directors (the “Board”) has approved the previously announced separation of a strong portfolio of cable television networks and complementary digital platforms from its remaining businesses, and the creation of an ...",
    "published": null
  },
  {
    "title": "Comcast's cable spinoff to be named Versant, picked to emphasize corporate versatility",
    "url": "https://www.cnbc.com/2025/05/06/comcast-spinco-corporate-name-versant.html",
    "snippet": "Versant, which had been called SpinCo until a permanent name was chosen, will own <strong>cable networks including USA, CNBC, MSNBC, Oxygen, E!, SYFY and Golf Channel</strong>. It will also house digital assets Fandango, Rotten Tomatoes, GolfNow, GolfPass and ...",
    "published": "May 6, 2025"
  },
  {
    "title": "Versant Corporation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Versant_Corporation",
    "snippet": "In late 2012, after rejecting an offer by UNICOM Systems Inc., Versant Corporation announced it was being acquired by <strong>Actian Corporation</strong>, the commercial developer of Ingres and Vectorwise.",
    "published": "2 weeks ago"
  }
]