[
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Solomon was chosen by more than ... producer Matthieu Darras were elected deputy chairs, and <strong>the new two-year leadership term will begin on January 1, 2026</strong>....",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "In total, 74% of the board members is female and 42 % of the board members is a producer. In their new role, <strong>Solomon, Petit and Darras will continue to work closely with the Academy CEO, Matthijs Wouter Knol</strong>, who was appointed 1 January 2021.",
    "published": "2 weeks ago"
  },
  {
    "title": "Board membership restructuring for 2024 - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/european-film-academy-to-restructure-board-membership-for-2024/",
    "snippet": "The board of the European Film Academy consists of 19 members, including one Chair and two Deputy Chairs. The Chair and Deputy Chairs do not represent any region or population in their function. “These changes will make for a more diverse and more democratically representative board to serve the European Film Academy,” says the European Film Academy’s Chair of the board, Mike Downey.",
    "published": "August 15, 2023"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/european-film-academy-announces-new-board-appointments/",
    "snippet": "Ada Solomon reacted to her election: “Being part of the European Film Academy board for a decade now, I took the responsibility to promote excellence in filmmaking in all the diversity of the European cinematic voices, but also to put the spotlight on the less visible ones – the smaller territories, the underrepresented forms of cinema, the crews behind the camera. It is a time of change, and I am ready to take the challenge knowing that I am backed up by the great executive team of the Academy and the amazing people in the board of the European Film Academy, and especially the newly elected deputy chairs: Leontine Petit and Matthieu Darras.”",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy to restructure board membership for 2024 - Cineuropa",
    "url": "https://cineuropa.org/en/newsdetail/445613",
    "snippet": "The board of the European Film Academy consists of 19 members, including one Chair and two Deputy Chairs. The Chair and Deputy Chairs do not represent any region or population in their function. “These changes will make for a more diverse and more democratically representative board to serve the European Film Academy,” says the European Film Academy’s Chair of the board, Mike Downey.",
    "published": null
  }
]