[
  {
    "title": "Sara bint Mashour Al Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sara_bint_Mashour_Al_Saud",
    "snippet": "Sara bint Mashour Al Saud (Arabic: سارة بنت مشهور آل سعود) is <strong>a member of the Saudi royal family and wife of Saudi Crown Prince Mohammed bin Salman, who is her first cousin</strong>. She is a granddaughter of King Abdulaziz. Sara bint Mashour is the daughter of Prince Mashour bin Abdulaziz ...",
    "published": "1 week ago"
  },
  {
    "title": "Sara bint Mashoor bin Abdulaziz Al Saud - Biography - House of Saud",
    "url": "https://houseofsaud.com/sara-bint-mashoor-bin-abdulaziz-al-saud-biography/",
    "snippet": "It’s not just a lineage; it’s a legacy that she carries with her, a blend of history and responsibility. Love &amp; Marriage: <strong>Married to Crown Prince Mohammed bin Salman since 2008</strong>, Sara’s life ...",
    "published": null
  },
  {
    "title": "Sara bint Mashour Al Saud Age, Net Worth, Children, Husband, Wedding & Biography",
    "url": "https://hamariweb.com/profiles/sara-bint-mashour-al-saud_13767",
    "snippet": "Sara bint Mashour Al Saud is a Famous Member of the Saudi royal family in Saudi. Here, know more about Sara bint Mashour Al Saud&#x27;s career, age, family, pics, biography &amp; more.",
    "published": null
  },
  {
    "title": "Who is Sara bint Mashour Al Saud? Everything you need to know - Tuko.co.ke",
    "url": "https://www.tuko.co.ke/facts-lifehacks/celebrity-biographies/447794-who-sara-bint-mashour-al-saud-everything-know/",
    "snippet": "Sara bint Mashour Al Saud is known to the world as Barbie Princess. She is the <strong>wife of Mohammed bin Salman (MBS).</strong> Her husband is the de facto ruler of the Kingdom of Saudi Arabia. He formally served as Crown Prince and Prime Minister.",
    "published": "November 20, 2024"
  },
  {
    "title": "Who is Princess Sara bint Mashour bin Abdulaziz Al Saud, Wife of Crown Prince Mohammed bin Salman Al Saud of Saudi Arabia? 3 Facts You Need To Know",
    "url": "https://www.harpersbazaararabia.com/culture/royal-watch/princess-sara-bint-mashour-bin-abdulaziz-al-saud",
    "snippet": "On April 6, 2008 HRH Princess Sara bint Mashour bin Abdulaziz Al Saud married Crown Prince Mohammed bin Salman Al Saud.",
    "published": "October 23, 2023"
  }
]