[
  {
    "title": "List of heads of state of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Sudan",
    "snippet": "Al-Bashir served as head of state, ... 1996 as the leader of the National Congress Party). <strong>Al-Bashir was removed from power by the Sudanese Armed Forces on 11 April 2019,</strong> amid the Sudanese revolution after holding the office for ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Omar al-Bashir - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Omar_al-Bashir",
    "snippet": "<strong>Omar Hassan Ahmad al-Bashir</strong> (born 1 January 1944) is a Sudanese former military officer and politician who served as Sudan&#x27;s head of state under various titles from 1989 until 2019, when he was deposed in a coup d&#x27;état. He was subsequently imprisoned, tried and convicted on multiple corruption ...",
    "published": "3 days ago"
  },
  {
    "title": "Omar al-Bashir | Alive, Now, Overthrown, Trial, Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Omar-Hassan-Ahmad-al-Bashir",
    "snippet": "<strong>Omar al-Bashir</strong>, Sudanese military leader who led a revolt that overthrew the elected government of Sudan in 1989. He served as president from 1993 until he was overthrown in 2019.",
    "published": "December 9, 2008"
  },
  {
    "title": "List of heads of government of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_government_of_Sudan",
    "snippet": "The current prime minister is <strong>Kamil Idris</strong>. He was appointed by the Transitional Sovereignty Council on 31 May 2025. ... ^ Briefly interrupted following the 2021 coup d&#x27;état, when Abdel Fattah al-Burhan served as head of state and there was ...",
    "published": "October 23, 2025"
  },
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "Following the Sudanese Revolution in April 2019, he was handed control of the military junta, the Transitional Military Council, a day after it was formed, due to protesters&#x27; dissatisfaction with the establishment ties of initial leader Ahmed Awad Ibn Auf. He served as chairman of the TMC until a draft constitutional declaration signed with civilians went into effect on 17 August and a collective head of state Transitional Sovereignty Council was formed on 21 August, also to be initially headed by al-Burhan.",
    "published": "3 weeks ago"
  }
]