[
  {
    "title": "José Luis Rodríguez Zapatero - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/José_Luis_Rodríguez_Zapatero",
    "snippet": "Previously, on 8 January 2004, Zapatero had created a Committee of Notables composed of 10 highly qualified experts with considerable political weight. Its mission was to help him to become prime minister. Among its members: José Bono (his ex-rival for the Secretaryship of the party and later appointed Minister of Defence), Juan Carlos Rodríguez Ibarra (president of the regional government of Extremadura and one of the most important socialist leaders), Miguel Ángel Moratinos (his minister of foreign affairs 2004–2010), Gregorio Peces-Barba (later appointed by him High Commissioner for the Victims of Terrorism, although he has already made public his resignation), Carmen Calvo (later appointed minister of culture), etc.",
    "published": "November 12, 2025"
  },
  {
    "title": "José Luis Rodríguez Zapatero President of Spain",
    "url": "https://clubmadrid.org/who/members/rodriguez-zapatero-jose-luis/",
    "snippet": "Internationally, Zapatero worked for peace and poverty reduction, promoting the creation of the UN Alliance of Civilizations, the Water Fund in Latin America, and the Debt for Education debt swaps. After leaving the Presidency in 2011, José Luis Rodríguez Zapatero published “The Dilemma: 600 days of vertigo” in 2013, an account of his most difficult decisions between 2008 and 2011.",
    "published": "October 20, 2017"
  },
  {
    "title": "José Luis Rodríguez Zapatero | Spanish PM, Socialist Leader | Britannica",
    "url": "https://www.britannica.com/biography/Jose-Luis-Rodriguez-Zapatero",
    "snippet": "On March 11, 2004, however, Madrid suffered a series of terrorist attacks, and Prime Minister José María Aznar and his PP government drew criticism for their attempts to blame the Basque separatist group ETA even after members of the Islamist militant group al-Qaeda were arrested. Aided by the voter backlash, the PSOE won a surprise victory at the elections on March 14. Zapatero was sworn in as prime minister on April 17, 2004, and he subsequently appointed a cabinet that combined established and emerging figures, half of whom were women.",
    "published": "January 19, 2006"
  },
  {
    "title": "Jose Luis Rodriguez Zapatero | Historica Wiki | Fandom",
    "url": "https://historica.fandom.com/wiki/Jose_Luis_Rodriguez_Zapatero",
    "snippet": "Jose Luis Rodriguez Zapatero (born 4 August 1960) was Prime Minister of Spain from 16 April 2004 to 20 December 2011, succeeding <strong>Jsoe Maria Aznar</strong> and preceding Mariano Rajoy. Leader of the PSOE from 2000 to 2012, Rodriguez oversaw Spain&#x27;s withdrawal ...",
    "published": null
  },
  {
    "title": "José Luis Rodríguez Zapatero | World Leaders Forum",
    "url": "https://worldleaders.columbia.edu/directory/jose-luis-rodriguez-zapatero",
    "snippet": "José Luis Rodríguez Zapatero is president of the government of Spain. Born in 1960, he has a degree in law from the University of Léon. He has been a member of the Spanish Socialists’ Party (PSOE) since 1979. He is the secretary-general of the PSOE and since 2000.",
    "published": null
  }
]