[
  {
    "title": "Welcome to the new 538 website - ABC News",
    "url": "https://abcnews.go.com/538/introducing-538-abc-news/story?id=103218541",
    "snippet": "Old links to specific articles will still work, although www.fivethirtyeight.com will redirect to our new home at ABC News. You can also simply search online for the article you’re interested in or, if you are looking for articles by a specific writer, browse their contributor pages.",
    "published": "September 18, 2023"
  },
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "On September 18, 2023, the original website domain at fivethirtyeight.com was closed, with web traffic becoming redirected to ABC News pages, and its logo was replaced, with the name 538 used instead of FiveThirtyEight. <strong>On March 5, 2025, 538 was shut down by ABC News</strong> and its staff were laid off.",
    "published": "1 month ago"
  },
  {
    "title": "FiveThirtyEight joins ABC News - ABC News",
    "url": "https://abcnews.go.com/US/fivethirtyeight-joins-abc-news/story?id=54531745",
    "snippet": "<strong>ABC News announced today it has reached an agreement in principle to acquire the renowned data journalism organization FiveThirtyEight from ESPN</strong>.",
    "published": "April 17, 2018"
  },
  {
    "title": "Publishers Daily: ABC News Buys 'FiveThirtyEight'",
    "url": "https://www.mediapost.com/publications/article/317771/abc-news-buys-fivethirtyeight.html",
    "snippet": "<strong>ESPN has sold the FiveThirtyEight site to ABC News</strong>. FiveThirtyEight, which covers sports, politics and science, will continue to provide data-driven sports coverage to ESPN. The new ownership means FiveThirtyEight will expand its political coverage ...",
    "published": null
  },
  {
    "title": "ABC News Takes Over Nate Silver’s FiveThirtyEight",
    "url": "https://variety.com/2018/tv/news/abc-news-ffivethirtyeight-espn-nate-silver-1202755646/",
    "snippet": "ESPN will eighty-six FiveThirtyEight, the statistics-driven news-and-analysis site led by Nate Silver. But <strong>the news outlet will go back to square one at ABC News</strong>.",
    "published": "April 17, 2018"
  }
]