[
  {
    "title": "Greta Van Susteren - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Greta_Van_Susteren",
    "snippet": "In 2002, Van Susteren switched to the <strong>Fox News Channel</strong> after a highly publicized contract-bidding war. Before starting at Fox she also underwent cosmetic surgery that significantly changed her look. She hosted the current affairs show On the Record w/ Greta Van Susteren.",
    "published": "August 20, 2025"
  },
  {
    "title": "Greta Van Susteren – USC Center on Communication Leadership and Policy",
    "url": "https://communicationleadership.usc.edu/greta-van-susteren-3/",
    "snippet": "While working for <strong>Gray TV</strong>, Greta simultaneously anchored Voice of America’s weekly television program Plugged In which covered foreign policy, US domestic affairs, and broadcasted worldwide in 48 languages.",
    "published": null
  },
  {
    "title": "Greta Van Susteren says MSNBC was only network where bosses ‘tried to tell me what to do’",
    "url": "https://www.yahoo.com/entertainment/greta-van-susteren-says-msnbc-135647237.html",
    "snippet": "Van Susteren, the former CNN legal analyst, recalled her experiences working for MSNBC after departing <strong>Fox News</strong> in 2016.",
    "published": "March 21, 2025"
  },
  {
    "title": "Greta Van Susteren - Biography - IMDb",
    "url": "https://www.imdb.com/name/nm1336063/bio/",
    "snippet": "Greta Van Susteren. Actress: Notorious. Born in Appleton, Wisconsin, Greta Van Susteren was awarded a Bachelor&#x27;s degree with Distinction in Economics from the University of Wisconsin in 1976. In 1979, she was awarded a law degree and, in 1982, a master of laws in trial advocacy from Georgetown Law Center, serving as a civil and criminal attorney in Wisconsin for several years.",
    "published": null
  },
  {
    "title": "Greta van Susteren :: New Netherland Institute",
    "url": "https://www.newnetherlandinstitute.org/history-and-heritage/dutch_americans/greta-van-susteren",
    "snippet": "Greta Van Susteren is a journalist and well known television personality, currently on the Fox News Channel, and earlier, from 1991 to 2002, on the CNN Channel. Van Susteren started her journalistic career, on CNN, as a legal analyst, and first came into prominence with the <strong>William Kennedy</strong> ...",
    "published": null
  }
]