[
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "He has <strong>held several cabinet positions under three presidents, serving in these offices for a total of over nine years</strong>. He served as Minister of Production under Eduardo Duhalde, as Interior Minister under Néstor Kirchner, as Minister of Justice under Cristina Fernández de Kirchner, and as ...",
    "published": "November 15, 2025"
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Previously, he served in the National Senate as representative for the province of Buenos Aires. Fernández initiated his career as <strong>consultant to the Budget Committee for the Senators Chambers of the province of Buenos Aires in 1983</strong>.",
    "published": null
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "<strong>From 2021 to 2023, he served as Argentina&#x27;s Minister of Security under President Alberto Fernández</strong>. He has held many important government jobs under three different presidents. He worked in these roles for more than nine years in total.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/anibal-fernandez/profil/trainer/22238",
    "snippet": "This is the profile site of the manager Aníbal Fernández. The site lists all clubs he coached and all clubs he played for.",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Age, Family, Bio | Famous Birthdays",
    "url": "https://www.famousbirthdays.com/people/anibal-fernandez.html",
    "snippet": "He has served in several positions within the Argentinian government including <strong>Minister of Production, Minister of Justice, and Interior Minister</strong>. His career in politics began in public service when he started working for the municipalities ...",
    "published": null
  }
]