[
  {
    "title": "From Grexit to Eurogroup chief: Greece’s recovery story",
    "url": "https://www.politico.eu/article/grexit-eurogroup-greece-finance-minister-kyriakos-pierrakakis-economy/",
    "snippet": "Greece&#x27;s finance minister, Kyriakos Pierrakakis, on Thursday beat Belgian Deputy Prime Minister Vincent Van Peteghem in a two-horse race for the Eurogroup presidency. | Nicolas Tucat/Getty Images · December 11, 2025 5:25 pm CET · By Nektaria Stamouli · ATHENS — The country that almost got kicked out of the eurozone is now running the powerful EU body that rescued it from bankruptcy.",
    "published": "5 days ago"
  },
  {
    "title": "Eurogroup Elects Greece’s Kyriakos Pierrakakis as New President | GTP Headlines",
    "url": "https://news.gtp.gr/2025/12/11/eurogroup-elects-greeces-kyriakos-pierrakakis-as-new-president/",
    "snippet": "Greek Finance Minister <strong>Kyriakos Pierrakakis</strong> has been elected president of the Eurogroup for a two-and-a-half-year term, assuming the role from 12 December 2025.",
    "published": "4 days ago"
  },
  {
    "title": "2025 Greek presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Greek_presidential_election",
    "snippet": "A third round of voting was held on 6 February 2025, where no candidate reached the reduced required majority of 180. The fourth round was held on 12 February 2025, where <strong>Konstantinos Tasoulas</strong> was elected as President of Greece.",
    "published": "September 8, 2025"
  },
  {
    "title": "Stunning reversal for Greece: Greek finance minister elected as Eurogroup president | News, Sports, Jobs - Marietta Times",
    "url": "https://www.mariettatimes.com/news/2025/12/stunning-reversal-for-greece-greek-finance-minister-elected-as-eurogroup-president/",
    "snippet": "The words of the Eurogroup president are closely followed. “Today is a day of pride for the country, for the government and for all the citizens,” Greek Prime Minister Kyriakos Mitsotakis said in a statement congratulating Pierrakakis. His election, Mitsotakis said, was “the most emphatic recognition of our country’s positive course … exactly a decade since the country found itself on a cliff-edge, with closed banks and close to leaving the euro.” · Greece, “the former ‘black sheep’ of debt, now rises to the top of the financial council of the continent’s most developed countries.",
    "published": "6 days ago"
  },
  {
    "title": "What the Eurogroup Is and Piera­kakis’ Role as New President | in.gr",
    "url": "https://www.in.gr/2025/12/12/english-edition/eurogroup-piera%C2%ADkakis-role-new-president/",
    "snippet": "Greece endured, demonstrating the collective strength of its people and the solidarity of Europe in critical moments.” · Piera­kakis assumes office on December 12, 2025, and will immediately oversee the process for selecting a new vice president of the European Central Bank, following the ...",
    "published": "4 days ago"
  }
]