[
  {
    "title": "Regency Enterprises - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Regency_Enterprises",
    "snippet": "Therefore, Regency International Pictures became the holding company for all Milchan’s investments and was legally renamed as Regency Enterprises (doing business as Arnon Milchan Enterprises) and two new companies (both 100% held by Regency Enterprises) were established to produce movies: one to do business in the United States and legally named Regency Entertainment (USA), Inc., one to do business overseas and legally named Monarchy Enterprises S.á.r.l. and both known under the umbrella trade name of Regency or New Regency Productions.",
    "published": "4 days ago"
  },
  {
    "title": "New Regency Productions - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/New_Regency_Productions",
    "snippet": "New Regency produced 2013&#x27;s 12 ... Awards for Best Picture in a row, and three nominations. As a joint venture with <strong>20th Century Studios</strong>, the parent company Regency has an 80% stake in the company....",
    "published": "November 12, 2025"
  },
  {
    "title": "New Regency Productions 2025 Company Profile: Valuation, Funding & Investors | PitchBook",
    "url": "https://pitchbook.com/profiles/company/127467-28",
    "snippet": "Information on valuation, funding, cap tables, investors, and executives for New Regency Productions. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "New Regency Productions, Inc. Company Profile | Los Angeles, California | Competitors, Financials & Contacts - Dun & Bradstreet",
    "url": "https://www.dnb.com/business-directory/company-profiles.new_regency_productions_inc.57d68c3972303e410ee13f0a057a7e63.html",
    "snippet": "Company Description: Regency Enterprises lords over a kingdom of Hollywood movies. The company&#x27;s New Regency Production unit produces and distributes movies such as Mr. &amp;amp; Mrs. Smith , Fight Club, and JFK . <strong>News Corp.&#x27;s Fox Entertainment owns 20% of Regency</strong> and distributes the company&#x27;s ...",
    "published": null
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "<strong>Yariv Milchan</strong> (PRODUCER) is the Chairman and CEO of the Academy Award®-winning New Regency Productions where he oversees the day-to-day management, creative direction, and overall growth strategy of the company.",
    "published": null
  }
]