[
  {
    "title": "Odion Ighalo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Odion_Ighalo",
    "snippet": "On 31 January 2017, Ighalo joined Chinese Super League club <strong>Changchun Yatai</strong> for a reported £20 million. He ranked second in the scoring charts in his second season at 21, but his team suffered relegation. Ighalo transferred to Shanghai Shenhua on 14 February 2019.",
    "published": "2 weeks ago"
  },
  {
    "title": "Odion Ighalo - Nigeria | Player Profile | Sky Sports Football",
    "url": "https://www.skysports.com/odion-ighalo",
    "snippet": "Odion Ighalo, who was on loan at Manchester United for a year, has completed a permanent transfer to Saudi Arabian club <strong>Al-Shabab</strong>.",
    "published": null
  },
  {
    "title": "Odion Ighalo Riyadh ST XI Forward, Profile & Stats | Premier League",
    "url": "https://www.premierleague.com/players/10957/Odion-Ighalo/overview",
    "snippet": "View the player profile of <strong>Riyadh ST XI</strong> Forward Odion Ighalo, including statistics and photos, on the official website of the Premier League.",
    "published": null
  },
  {
    "title": "Odion Ighalo (Ighalo O.) Stats - Flashscore.com",
    "url": "https://www.flashscore.com/player/ighalo-odion/ITCY8iWq/",
    "snippet": "Help: You are on the player profile of Odion Ighalo, Ighalo O.. View Odion Ighalo stats in detail (appearances, goals, cards / leagues, cups, national team), transfer value, contract length, transfer history including transfer fees, injury updates or unique player ratings from previous matches.",
    "published": null
  },
  {
    "title": "Odion Ighalo Stats, Goals, Records, Assists, Cups and more | FBref.com",
    "url": "https://fbref.com/en/players/03622183/Odion-Ighalo",
    "snippet": "Check out the latest domestic and international stats, match logs, goals, height, weight and more for <strong>Watford FC</strong>, Manchester United FC and Al-Hilal Saudi FC playing for Odion Ighalo in the Saudi Pro League, Premier League and Chinese Super League",
    "published": null
  }
]