[
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "The party points out that Russia is part of European civilization, in which freedom, self-respect and human responsibility play an important role, and the need for the state to participate in various social relations, including the economy, culture or family, is gradually decreasing. Therefore, in the future and as it develops, according to the party, the Russian state will have to take on the role of an arbitrator, refusing to actively interfere in public relations, but making sure that no one violates the established rules.",
    "published": "September 30, 2025"
  },
  {
    "title": "Russian opposition party that wants Ukraine ceasefire vows to keep campaigning despite crackdown | Reuters",
    "url": "https://www.reuters.com/business/media-telecom/russian-opposition-party-that-wants-ukraine-ceasefire-vows-keep-campaigning-2025-12-15/",
    "snippet": "But <strong>two of the party&#x27;s deputy leaders, Maxim Kruglov and Lev Shlosberg, have been placed in pre-trial detention in recent months</strong> and accused of spreading lies about the Russian army, something they deny, and a third - Boris Vishnevsky - has ...",
    "published": "1 day ago"
  },
  {
    "title": "List of political parties in Russia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_political_parties_in_Russia",
    "snippet": "About 2,500 people participated in the survey, mostly aged 45+. The question was &quot;Is it necessary to dissolve the United Russia party with the inability of its members to participate in political life in the future?&quot; the answers were distributed as follows: 65% stated: &quot;I am for dissolution without permission to participate in political life in the future&quot;, 3% stated &quot;I am against dissolution&quot;, 6% stated &quot;I am for dissolution, but with permission to participate in political life in the future&quot;, and 26% stated &quot;I am for the dissolution of all bourgeois parties&quot;.",
    "published": "1 week ago"
  },
  {
    "title": "Russian Offensive Campaign Assessment, December 12, 2025",
    "url": "https://understandingwar.org/research/russia-ukraine/russian-offensive-campaign-assessment-december-12-2025/",
    "snippet": "Putin created Rosgvardia in 2016 with the official mission of ensuring public order and guarding against terrorist attacks, but Rosgvardia possesses extensive conventional military capabilities and has active combat experience consistent with a conventional military.[24] Rosgvardia demonstrated combined arms capabilities prior to the February 2022 full-scale invasion in exercises using rotary-wing aircraft, artillery, air defense systems, drone support, and electronic warfare (EW) and conducted operations in Syria and occupied Crimea.[25] Rosgvardia units participated in the initial full-scale",
    "published": "3 days ago"
  },
  {
    "title": "The political opposition in Russia - European Parliament",
    "url": "https://www.europarl.europa.eu/meetdocs/2014_2019/plmrep/COMMITTEES/AFET/DV/2020/11-27/Russian_opposition_background_note_2020_final_EN.pdf",
    "snippet": "Duma of the Federal Assembly seeking to amend the Federal Law on Political Parties, which · directly targets YABLOKO and would cause its dissolution. ... The Anti-Corruption Foundation (FBK). Russia of the Future.",
    "published": null
  }
]