[
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "In the Civil War, the head of government among the Nationalists was called Chief of the Government of the State and since January 1938 the office acquired the current name, President of the Government, but between that date and 1973 the office was held by <strong>Francisco Franco</strong> as dictator of Spain.",
    "published": "3 weeks ago"
  },
  {
    "title": "La Moncloa. Pedro Sánchez Pérez-Castejón [Biography]",
    "url": "https://www.lamoncloa.gob.es/lang/en/presidente/biografia/paginas/index.aspx",
    "snippet": "<strong>Pedro Sánchez</strong> has been President of the Government of Spain since June 2018. He holds a Doctorate in Economics and is General Secretary of the Spanish Socialist Workers&#x27; Party (Spanish acronym: PSOE), which he joined in 1993.",
    "published": null
  },
  {
    "title": "Pedro Sánchez - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pedro_S%C3%A1nchez",
    "snippet": "Sánchez was formally installed as Prime Minister of Spain by King Felipe VI on 2 June 2018. Outlining his priorities, Sánchez said he would form a short-term government that would increase unemployment benefit and propose a law guaranteeing equal pay between the sexes, before dissolving the ...",
    "published": "4 days ago"
  },
  {
    "title": "Spain: Government",
    "url": "https://globaledge.msu.edu/countries/spain/government",
    "snippet": "Spain · Government · Chief of State: King Felipe VI · Head of Government: President of the Government of Spain <strong>Pedro Sánchez Perez-Castejon</strong> · Government Name: Kingdom of Spain · Constitution: Adopted in 1978; focused on basic rights &amp; ...",
    "published": null
  },
  {
    "title": "Pedro Sánchez | prime minister of Spain | Britannica",
    "url": "https://www.britannica.com/biography/Pedro-Sanchez-politician",
    "snippet": "Other articles where <strong>Pedro Sánchez</strong> is discussed: Spain: Economic recovery and Catalonian independence: …the corruption charges, PSOE leader <strong>Pedro Sánchez</strong>, with the support of Catalan and Basque nationalist parties, challenged his government.",
    "published": null
  }
]