[
  {
    "title": "Com Hem - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Com_Hem",
    "snippet": "Founded in 1983 as <strong>Televerket Kabel-TV</strong> as part of the former state-owned Televerket, the company was successively named Svenska Kabel-TV AB and Telia InfoMedia TeleVision AB, before becoming &#x27;Com Hem&#x27; (a play on the Swedish phrase Kom hem, &quot;come home&quot;) in 1999.",
    "published": "June 6, 2025"
  },
  {
    "title": "Com Hem - Products, Competitors, Financials, Employees, Headquarters Locations",
    "url": "https://www.cbinsights.com/company/com-hem",
    "snippet": "In the fixed-line broadband segment, the number of DSL subscribers is falling steadily as customers continue to migrate to fibre networks. There is also competition from <strong>HFC infrastructure</strong>, with the main cableco Com Hem, now owned by Tele2, offering fibre-based broadband and investing in services ...",
    "published": null
  },
  {
    "title": "BC Partners to acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/bc-partners-acquire-com-hem",
    "snippet": "<strong>Carlyle and Providence</strong> acquired Com Hem from EQT in 2006 and, in the same year, they acquired UPC, which was integrated with Com Hem. Under the ownership of <strong>Carlyle and Providence</strong>, the company has invested nearly SEK 4 billion on developing the company, upgrading the network to the highest ...",
    "published": null
  },
  {
    "title": "The Carlyle Group and Providence Equity Partners to Acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/carlyle-group-and-providence-equity-partners-acquire-com-hem",
    "snippet": "London and Stockholm - <strong>The Carlyle Group and Providence Equity Partners</strong> today announced they have signed an agreement to acquire Swedish cable TV operator Com Hem from its current owner EQT. Financial details were not disclosed. Com Hem is the leading cable TV operator in Sweden.",
    "published": null
  },
  {
    "title": "About Com Hem Holding AB (COMH) - Investing.com",
    "url": "https://www.investing.com/equities/com-hem-holding-ab-company-profile",
    "snippet": "It serves approximately 1.5 million customers, including multi-dwelling unit buildings, single dwelling units, and small and medium sized enterprises. The company was formerly known as <strong>NorCell Sweden Holding 1 AB</strong>. Com Hem Holding AB (publ) was ...",
    "published": null
  }
]