[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She <strong>previously played for WSL clubs Manchester United, Bristol Academy, Birmingham City, Doncaster Belles, and Reading, and in the Bundesliga with VfL Wolfsburg</strong>. Earps has represented England at under-17, under-19, and under-23 levels, and won her first senior cap in 2017.",
    "published": "8 hours ago"
  },
  {
    "title": "Mary Earps: Career, Net Worth, Legacy & Retirement",
    "url": "https://madlydaily.co.uk/mary-earps-career-net-worth-legacy-retirement/",
    "snippet": "In 2024, Earps joined PSG as their first-choice goalkeeper, continuing her legacy on the European stage. Mary Earps <strong>earned her first England cap on June 10, 2017,</strong> becoming an integral part of the national team.",
    "published": "September 2, 2025"
  },
  {
    "title": "Mary Earps and the end of an England career that was a testament to willpower - The Athletic",
    "url": "https://www.nytimes.com/athletic/6385134/2025/05/27/mary-earps-england-retirement-profile/",
    "snippet": "The early years of her playing career were nomadic, eight different clubs — <strong>Leicester City, Nottingham Forest, Doncaster Belles, Coventry City, Birmingham City, Bristol Academy, Reading, Wolfsburg</strong> — across a decade as she hunted for a place ...",
    "published": "May 27, 2025"
  },
  {
    "title": "Mary Earps Retires: Net Worth, Love Life, Family, Side Jobs & That Famous Bus - myKhel",
    "url": "https://www.mykhel.com/football/mary-earps-retires-net-worth-love-life-family-side-jobs-that-famous-bus-364177.html",
    "snippet": "Mary Earps <strong>retires from international football at 32,</strong> and it’s hard not to feel a gut punch. Five weeks before England’s Euros title defence, Earps leaves behind a legacy defined by record-breaking saves, quiet discipline, a world-class ...",
    "published": "May 27, 2025"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "<strong>Before arriving at Manchester United, Earps spent time playing for hometown club Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg</strong>. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in ...",
    "published": null
  }
]