[
  {
    "title": "EBRD governance and leadership",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership.html",
    "snippet": "<strong>Odile Renaud-Basso</strong> is the current President of the Bank. The President manages the work of the Bank under the guidance of the Board of Directors. ... The EBRD is owned by 77 countries, the European Union and the European Investment Bank.",
    "published": null
  },
  {
    "title": "EBRD Board of Directors",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership/ebrd-board-of-directors.html",
    "snippet": "While retaining overall authority over the Bank, <strong>the Board of Governors</strong> delegates most powers to the Board of Directors, which is responsible for approving the EBRD&#x27;s country, sector and thematic strategies, policies and operations.",
    "published": null
  },
  {
    "title": "EBRD Senior Leadership Group",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership/ebrd-senior-leadership-group.html",
    "snippet": "Our senior leadership group covers every aspect of the EBRD&#x27;s business and advises the Executive Committee and President.",
    "published": null
  },
  {
    "title": "Christoph Denk",
    "url": "https://www.ebrd.com/home/who-we-are/our-organisation/ebrd-governance-leadership/ebrd-senior-leadership-group/christoph-denk.html",
    "snippet": "<strong>Christoph Denk</strong> is the Managing Director for Policy Strategy and Delivery at the European Bank for Reconstruction and Development (EBRD). He is responsible for the Bank’s political and economic country analysis, the coordination of all country ...",
    "published": null
  },
  {
    "title": "Directors of the EBRD",
    "url": "https://www.ebrd.com/directors-of-the-ebrd.html",
    "snippet": "He has overall responsibility for the effective delivery of EBRD investments and advisory activities in the Bank’s countries of operation, in addition to contributing to the delivery of EBRD policy engagement activities. Mr Patrone previously held the post of Managing Director, Eastern Europe and Caucasus. In that role, he was responsible for the Bank’s operations and policy engagement initiatives in Armenia, Azerbaijan, Georgia and Moldova and for spearheading the Bank&#x27;s crisis response to the war on Ukraine. His 30-year career includes senior management and leadership positions in merchant banking, private equity, management consulting and engineering.",
    "published": null
  }
]