[
  {
    "title": "Igor Tudor sacked by Juventus after seven months in charge - The Athletic",
    "url": "https://www.nytimes.com/athletic/6733046/2025/10/27/igor-tudor-juventus-sacked/",
    "snippet": "Igor Tudor has been dismissed as Juventus head coach after <strong>24 games in charge</strong>.",
    "published": "October 27, 2025"
  },
  {
    "title": "Igor Tudor - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Igor_Tudor",
    "snippet": "In his first Champions League match with Juventus, he oversaw a 4–4 home draw against Borussia Dortmund, managed by Niko Kovač, 25 years after a 4–4 draw between Juventus and Hamburg in which both had scored as players. Tudor was sacked by Juventus on <strong>27 October</strong>, a day after the team lost ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus sack coach Igor Tudor after seven months in charge - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/46743501/juventus-sack-head-coach-igor-tudor-seven-months-charge",
    "snippet": "His departure was announced on Monday with Juventus confirming Massimo Brambilla, coach of Juventus Next Gen in Serie C, will take temporary charge of the first team for their midweek meeting with Udinese. - WA government bullish Serie A game in Australia will proceed - Serie A boss reminds Adrien Rabiot: &#x27;Respect the money&#x27; - Bellingham ends goal drought to lead Madrid past Juventus · A club statement read: &quot;Juventus announces that it has today relieved Igor Tudor of his duties as head coach of the men&#x27;s first team, along with his staff consisting of Ivan Javorcic, Tomislav Rogic and Riccardo Ragnacci.",
    "published": "October 27, 2025"
  },
  {
    "title": "Juventus sack manager Igor Tudor after miserable eight-game winless run | Juventus | The Guardian",
    "url": "https://www.theguardian.com/football/2025/oct/27/juventus-sack-manager-igor-tudor-winless-run-serie-a",
    "snippet": "Juventus have dismissed Igor Tudor as manager after a run of eight matches without a win in all competitions",
    "published": "October 27, 2025"
  },
  {
    "title": "Juventus sack head coach Igor Tudor after eight-match winless run - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cpq1nypl884o",
    "snippet": "Juventus sack head coach Igor Tudor with the side <strong>eighth in Serie A</strong> after weekend defeat by Lazio.",
    "published": "October 27, 2025"
  }
]