[
  {
    "title": "Prime Minister of Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Canada",
    "snippet": "The prime minister also selects individuals for appointment as governor general, provincial lieutenant governors, territorial commissioners, as well as to the Senate of Canada, Supreme Court of Canada, other federal courts, and senior members of the military and public service. <strong>Mark Carney</strong> is the ...",
    "published": "July 31, 2001"
  },
  {
    "title": "Mark Carney - Prime Minister of Canada | Prime Minister of Canada",
    "url": "https://www.pm.gc.ca/en",
    "snippet": "Budget 2025: Canada Strong · The government’s plan for generational investments that will build, protect, and empower Canada. Published · Speech from the Throne · Read about the overall goals of the government and how it will accomplish them. Published · &lt;em&gt;One Canadian Economy Act&lt;/em&gt; The passing in the House of Commons of Bill C-5, One Canadian Economy Act.",
    "published": null
  },
  {
    "title": "Prime Minister of Canada - Premier ministre du Canada",
    "url": "https://www.pm.gc.ca/en/about",
    "snippet": "The Right Honourable <strong>Mark Carney</strong>, Prime Minister of Canada<strong>Mark Carney</strong> is Canada’s 24th Prime Minister. He was elected Leader of the Liberal Party of Canada and sworn in as Prime Minister in March 2025.",
    "published": null
  },
  {
    "title": "Canada’s Political System | Elections Canada's Civic Education",
    "url": "https://electionsanddemocracy.ca/parliament/canadas-political-system",
    "snippet": "Canada’s political system is based on that of the United Kingdom. It is a constitutional monarchy, which means that we recognize the Queen or King as the Head of State, while <strong>the Prime Minister</strong> is the Head of Government.",
    "published": null
  },
  {
    "title": "Ministry (Cabinet) as of Monday, December 1, 2025 - Members of Parliament - House of Commons of Canada",
    "url": "https://www.ourcommons.ca/members/en/ministries",
    "snippet": "Once appointed, <strong>the Prime Minister</strong> selects a number of confidential advisers, usually from among the members of the governing party, who are made members of the Privy Council and sworn in as ministers. Collectively, they are known as the “Ministry” or cabinet.",
    "published": null
  }
]