[
  {
    "title": "List of kings of Saudi Arabia | First Ruler, Saud Dynasty, Salman, History, Chronological Order, & Crown Prince | Britannica",
    "url": "https://www.britannica.com/topic/list-of-kings-of-Saudi-Arabia",
    "snippet": "<strong>Mohammed bin Salman</strong>, who at a young age has jockeyed himself to a senior position in the royal family, is expected to be the first of Ibn Saud’s grandsons to take the throne and bypass the remaining sons of Ibn Saud who are still alive.",
    "published": "June 24, 2024"
  },
  {
    "title": "Ibn Saud - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ibn_Saud",
    "snippet": "<strong>Abdulaziz bin Abdul Rahman Al Saud</strong> (Arabic: عبد العزيز بن عبد الرحمن آل سعود; 15 January 1876 – 9 November 1953), known in the Western world as Ibn Saud (Arabic: ابن سعود; Ibn Suʿūd), was a Najdi statesman and tribal leader who became the founder and first ...",
    "published": "2 days ago"
  },
  {
    "title": "King of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/King_of_Saudi_Arabia",
    "snippet": "<strong>King Abdulaziz Al Saud</strong>, known in the West as Ibn Saud, regained his patrimony, which is known as today&#x27;s Saudi Arabia, in 1902. Restoring his family as emirs of the Emirate of Riyadh, he then established the Sultanate of Nejd as his headquarters in 1922.",
    "published": "3 weeks ago"
  },
  {
    "title": "List of Kings of Saudi Arabia - Saudipedia",
    "url": "https://saudipedia.com/en/article/3863/royal-family/list-of-kings-of-saudi-arabia",
    "snippet": "Founding <strong>King Abdulaziz Bin Abdulrahman Al Saud</strong> The first king, founder, and unifier of the Kingdom of Saudi Arabia, he began the process of reclaiming and unifying the Kingdom in...",
    "published": "February 17, 2025"
  },
  {
    "title": "List of All Kings of Saudi Arabia",
    "url": "https://www.jagranjosh.com/general-knowledge/know-about-all-the-kings-of-saudi-arabia-1694493146-1",
    "snippet": "The list of all kings of Saudi Arabia includes the country&#x27;s founder, <strong>King Abdulaziz Al Saud</strong>, and his successors. The current king is Salman bin Abdulaziz Al Saud. The kings of Saudi Arabia have ruled the country since its founding in 1932.",
    "published": "September 12, 2023"
  }
]