[
  {
    "title": "German Research Foundation - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/German_Research_Foundation",
    "snippet": "The German Research Foundation is a member of Science Europe. The Heisenberg Programme of the DFG is aimed at young outstanding scientists who meet all the requirements for appointment to a permanent professorship. The programme was named after the German physicist Werner Heisenberg, who received the Nobel Prize in Physics at the age of 31. The funding programme aims to enable scientists to prepare for a scientific leadership position and to work on further research topics during this time.",
    "published": "October 2, 2025"
  },
  {
    "title": "DFG - German Research Foundation",
    "url": "https://www.dfg.de/en",
    "snippet": "DFG Welcomes EU Agreement on New Breeding Techniques · Call for swift implementation of the new legal framework",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - Information for Researchers | 2025",
    "url": "https://www.dfg.de/en/news/news-topics/announcements-proposals/2025",
    "snippet": "Information for Researchers, No. 81 | 6 October 2025 · New Edition of the French-German Call for Proposals in the Natural, Life and Engineering Sciences (ANR-DFG 2026 NLE)",
    "published": null
  },
  {
    "title": "Germany, German Research Foundation (DFG) - International Science Council",
    "url": "https://council.science/member/germany-deutsche-forschungsgemeinschaft-dfg/",
    "snippet": "The Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) is the central self-governing research funding organisation in Germany. The DFG serves the sciences and humanities and promotes research of the highest quality in all its forms and disciplines at universities and non-university research institutions.",
    "published": "August 13, 2024"
  },
  {
    "title": "German Research Foundation (DFG) | DWIH New York",
    "url": "https://www.dwih-newyork.org/en/supporter/german-research-foundation-dfg/",
    "snippet": "Have questions about the DWIH New York? Here you can learn more about what exactly the DWIH is, our mission, how to get in touch with us, and the people who make up our dedicated team · The German Center for Research and Innovation New York (DWIH) supports the exchange of ideas in areas of ...",
    "published": null
  }
]