[
  {
    "title": "Banijay Entertainment - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banijay_Entertainment",
    "snippet": "Banijay Entertainment S.A. (formerly Banijay Group and later Banijay) is a French multinational television production and distribution company which is the world&#x27;s largest international content producer and distributor with over 130 production companies across 23 territories, and a multi-genre catalogue containing over 185,000 hours of original programming.",
    "published": "1 day ago"
  },
  {
    "title": "Banijay Studios North America - Banijay",
    "url": "https://www.banijay.com/company/banijay-studios-north-america/",
    "snippet": "Banijay is present in 16 territories. ... Banijay Studios North America opened its <strong>Los Angeles</strong>-based headquarters in April 2014, and creates original network, syndicated, and cable programming, as well as developing Banijay Group’s format hits for the U.S.",
    "published": "January 9, 2025"
  },
  {
    "title": "Banijay Studios North America LLC, 8730 W Sunset Blvd, Ste 600, West Hollywood, CA 90069, US - MapQuest",
    "url": "https://www.mapquest.com/us/california/banijay-studios-north-america-llc-355342860",
    "snippet": "Get more information for Banijay Studios North America LLC in <strong>West Hollywood, CA</strong>. See reviews, map, get the address, and find directions.",
    "published": null
  },
  {
    "title": "Banijay Entertainment Company Overview, Contact Details & Competitors | LeadIQ",
    "url": "https://leadiq.com/c/banijay-entertainment/5a1d98992300005a00874417",
    "snippet": "... Banijay Benelux and digital ... Lab to MIPCOM with YouTube. ... Banijay Entertainment&#x27;s main headquarters is located at <strong>8, Rue François 1er Paris, Île-de-France 75008 FR</strong>....",
    "published": null
  },
  {
    "title": "About Us - Banijay Americas - We are Banijay",
    "url": "https://banijayamericas.com/our-story/",
    "snippet": "A division of Banijay, the world’s largest international content producer and distributor, Banijay Americas includes six subsidiary production companies in the U.S., including Endemol Shine North America, Bunim/Murray Productions, Truly Original, 51 Minds Entertainment, Authentic Entertainment ...",
    "published": "October 3, 2024"
  }
]