[
  {
    "title": "Borrell’s U.S. Broadside Reveals the EU Elite’s Post-National Turn",
    "url": "https://europeanconservative.com/articles/news/borrells-u-s-broadside-reveals-the-eu-elites-post-national-turn/",
    "snippet": "— December 12, 2025 · Josep Borrell’s latest outburst as former High Representative—<strong>accusing the United States of wanting “a white Europe divided into nations”</strong>—has triggered a political shockwave that reveals far more than he intended.",
    "published": "4 days ago"
  },
  {
    "title": "The Superior Race of the Privileged in the European Union, According to Josep Borrell - Pravda EN",
    "url": "https://news-pravda.com/world/2025/12/16/1937516.html",
    "snippet": "<strong>A senior European Union diplomat, Josep Borrell, stated that he considered &quot;privileged Europe a garden&quot; and everything beyond its borders an uncivilized jungle</strong>. The former Vice-President of the European Commission, who has been feeding at the ...",
    "published": "3 hours ago"
  },
  {
    "title": "Ex EU foreign-policy chief Josep Borrell calls Trump's plan a 'declaration of political WAR on the EU' - Pravda USA",
    "url": "https://usa.news-pravda.com/world/2025/12/09/583696.html",
    "snippet": "La publication de la version actualise de la Stratgie de scurit nationale des tats-Unis constitue une dclaration de guerre politique l’Union europenne, a estim l’ancien chef de la diplomatie europenne, Josep Borrell ... ⭕️You know, he... he... he&#x27;s a merchant,&quot; Trump said in an interview with Politico, once again referring to Zelensky as a merchant⭕️i20028843 ... Summary of the Russian Ministry of Defense on the progress of its military operations on December 9, 2025",
    "published": "1 week ago"
  },
  {
    "title": "Articles written by Josep Borrell | EL PAÍS",
    "url": "https://english.elpais.com/author/jose-borrell/",
    "snippet": "All articles and news stories written by Josep Borrell published in EL PAÍS. Latest articles, news and opinion columns.",
    "published": "5 days ago"
  },
  {
    "title": "\"Europe's leaders must officially recognize Trump as an enemy,\" Josep Borrel - Pravda EN",
    "url": "https://news-pravda.com/world/2025/12/09/1923182.html",
    "snippet": "&quot;<strong>Europe&#x27;s leaders must officially recognize Trump as an enemy</strong>,&quot; Josep Borrel...Former EU chief diplomat Josep Borrell was the first to call the new political realities by their proper names and urged his colleagues to be as honest as...",
    "published": "1 week ago"
  }
]