[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "After his father&#x27;s retirement in June 1984, his mother remained at her New Edinburgh home while the rest of the family moved into his father&#x27;s home at 1418 Pine Avenue, Montreal known as Cormier House; the following autumn, he began attending the private <strong>Collège Jean-de-Brébeuf</strong>, his father&#x27;s ...",
    "published": "4 days ago"
  },
  {
    "title": "Did Justin Trudeau Stop Teaching at a Vancouver Private School Under the Cloud of a Sex Scandal? | Snopes.com",
    "url": "https://www.snopes.com/fact-check/trudeau-sex-scandal-school/",
    "snippet": "In October 2019, we received multiple ... embroiled in a major sex scandal involving his tenure as a teacher at the <strong>West Point Grey Academy in Vancouver</strong> between 1998 and 2001....",
    "published": "June 1, 2023"
  },
  {
    "title": "What high school did Canadian Prime Minister Justin Trudeau attend or graduate from? - Quora",
    "url": "https://www.quora.com/What-high-school-did-Canadian-Prime-Minister-Justin-Trudeau-attend-or-graduate-from",
    "snippet": "Answer (1 of 4): Justin Trudeau graduated from <strong>Rockcliffe Park Public School</strong>",
    "published": null
  },
  {
    "title": "Justin Trudeau educational qualifications: From Literature Buff to Canada’s PM - Times of India",
    "url": "https://timesofindia.indiatimes.com/education/news/justin-trudeau-educational-qualifications-from-literature-buff-to-canadas-pm/articleshow/117020437.cms",
    "snippet": "Growing up in a politically active ... his education with determination and a focus on the humanities. He attended <strong>McGill University in Montreal</strong>, where he earned a Bachelor of Arts degree in English Literature in 199...",
    "published": "January 7, 2025"
  },
  {
    "title": "Justin Trudeau | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/justin-trudeau",
    "snippet": "As a result, Justin Trudeau and his two younger brothers were raised by a single father who also happened to be at the center of Canadian politics. Trudeau attended <strong>Collège Jean-de-Brébeuf in Montreal</strong>, the same Jesuit-founded, French-language ...",
    "published": null
  }
]