[
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "He was the Minister of Production, Interior Minister, and Minister of Justice. <strong>He also served as the President&#x27;s Cabinet Chief</strong>. ... Aníbal Fernández was born in Quilmes, a city in Buenos Aires Province, Argentina.",
    "published": null
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Chief of the Cabinet of Ministers and Candidate for Governor of the Province of Buenos Aires (Frente para la Victoria) Aníbal Fernández is a candidate for governor of the Province of Buenos Aires and currently chief of staff of the Minister’s Cabinet for the presidency.",
    "published": null
  },
  {
    "title": "Argentina’s President Alberto Fernandez reshuffles cabinet after political crisis",
    "url": "https://cawwn.com/news/argentinas-president-alberto-fernandez-reshuffles-cabinet-after-political-crisis/",
    "snippet": "Juan Manzur, governor of Tucuman ... over as chief of staff from Santiago Cafiero, one of Kirchner’s most controversial officials, the presidency announced. Cafiero instead became foreign minister, replacing Felipe Sola, who is in Mexico. The new ministers joining the cabinet, who will be sworn in on Monday, are Anibal Fernandez (Security), ...",
    "published": null
  },
  {
    "title": "Aníbal Fernández (Politician) - Age, Birthday, Bio, Facts, Family, Net Worth, Height & More | AllFamous.org",
    "url": "https://allfamous.org/people/anibal-fernandez-19570126.html",
    "snippet": "He served as Minister of Production under Eduardo Duhalde, Interior Minister under Néstor Kirchner, Justice Minister under Cristina Fernández de Kirchner and Chief of Staff for the President from 2009 to 2011 .. MTZ_MT ! The Interior Ministers of Argentina. TM_VZ! Chief Secretary to the Cabinet of Argentina. TM_VZ! Argentine Minister of Justice. TM_VZ! Kirchnerism. TM_VZ! Mayor of various places in Argentina. TM_VZ! Politicians of the Judicial Party · Politician Aníbal Fernández was born on January 26, 1957 in Argentina (He&#x27;s 68 years old now).",
    "published": "March 20, 2023"
  },
  {
    "title": "Fernández confirms reshuffle: Juan Manzur named Cabinet chief | Buenos Aires Times",
    "url": "https://www.batimes.com.ar/news/argentina/fernandez-names-manzur-cabinet-chief-cafiero-out-anibal-fernandez-returns.phtml",
    "snippet": "resident Fernández reshuffles Cabinet​​ in bid to overcome schism with Cristina Fernández de Kirchner; Juan Manzur in as Cabinet chief, Santiago Cafiero becomes foreign minister; <strong>Aníbal Fernández returns</strong>.",
    "published": "September 18, 2021"
  }
]