[
  {
    "title": "Marcy Kaptur - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcy_Kaptur",
    "snippet": "The reconfigured 9th was no less Democratic than its predecessor, and Kaptur had effectively clinched reelection by defeating Kucinich in the primary. Kaptur&#x27;s 2014 opponent was Richard May, a longtime Republican activist from west Cleveland, who beat Lakewood resident Robert C. Horrocks Jr. in the May 6 primary. Kaptur won 68–32%. Kaptur&#x27;s 2016 opponent was Donald Larson, who defeated Steven Kraus and Joel Lieske in the Republican primary on March ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Kaptur Votes No On USMCA | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/media-center/press-releases/kaptur-votes-no-usmca",
    "snippet": "I will vote against USMCA just as I voted against its predecessor NAFTA, whose disastrous consequences are legend across the American landscape.&quot; Rep. Kaptur submitted the following materials to the Congressional Record following her floor speech debating USMCA:",
    "published": "December 19, 2019"
  },
  {
    "title": "Marcy Kaptur - Ballotpedia",
    "url": "https://ballotpedia.org/Marcy_Kaptur",
    "snippet": "Ballotpedia did not identify endorsements for Kaptur in this election. See also: Ohio&#x27;s 9th Congressional District election, 2022 · Incumbent Marcy Kaptur defeated J.R. Majewski in the general election for U.S.",
    "published": null
  },
  {
    "title": "About Marcy | Congresswoman Marcy Kaptur",
    "url": "https://kaptur.house.gov/about",
    "snippet": "The idea came from <strong>Roger Durbin</strong>, a constituent who had fought in World War II. Congresswoman Kaptur worked together with Mr. Durbin to make his dream a reality. Despite many setbacks and detours, she never relented.",
    "published": "May 27, 2025"
  },
  {
    "title": "Marcy Kaptur | Congress.gov | Library of Congress",
    "url": "https://www.congress.gov/member/marcy-kaptur/K000009",
    "snippet": "Marcy Kaptur, the Representative from Ohio - in Congress from 1983 through Present",
    "published": null
  }
]