[
  {
    "title": "Fiat Chrysler Automobiles - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_Chrysler_Automobiles",
    "snippet": "Fiat Chrysler Automobiles N.V., commonly known by the acronym FCA, was an Italian-American multinational corporation primarily known as a manufacturer of automobiles, commercial vehicles, auto parts and production systems. The corporation was established by January 2012, when Fiat Group acquired a 58.5% stake of the Chrysler Group (which from 1998 to 2007 was part of DaimlerChrysler) and thus became, at that time, the 7th largest automaker (behind Toyota, General Motors, Volkswagen, Hyundai, Ford and Nissan). Its corporate headquarters were domiciled in Amsterdam and its financial headquarters were in London.",
    "published": "2 weeks ago"
  },
  {
    "title": "Chrysler - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chrysler",
    "snippet": "FCA US, LLC, doing business as Stellantis North America and known historically as Chrysler (/ˈkraɪslər/ KRY-slər), is one of the &quot;Big Three&quot; automobile manufacturers in the United States, headquartered in <strong>Auburn Hills, Michigan</strong>. It is the American subsidiary of the multinational automotive ...",
    "published": "1 week ago"
  },
  {
    "title": "FCA Fiat Chrysler Automobiles | LinkedIn",
    "url": "https://www.linkedin.com/company/fcagroup",
    "snippet": "FCA Group is now Stellantis, one of the world&#x27;s leading automakers and a mobility provider. Follow us here : https://www.linkedin.com/company/stellantis/ Website · https://www.fcagroup.com · External link for FCA Fiat Chrysler Automobiles · Industry · Motor Vehicle Manufacturing · Company size · 10,001+ employees · Headquarters ·",
    "published": null
  },
  {
    "title": "FCA US LLC Company Profile - Overview - GlobalData",
    "url": "https://www.globaldata.com/company-profile/fca-us-llc/",
    "snippet": "In addition to this, the company ... in the US, Canada, Mexico and in the Caribbean Islands. The company is a subsidiary of Fiat Chrysler Automobiles NV. FCA US is headquartered in <strong>Auburn Hills, Michigan</strong>, the US....",
    "published": null
  },
  {
    "title": "Stellantis Media - Chrysler Group LLC Announces New Company Name: FCA US LLC",
    "url": "https://media.stellantisnorthamerica.com/newsrelease.do?id=16257&mid=",
    "snippet": "The name change is effective ... name change to FCA US LLC does not affect the company’s headquarters location in <strong>Auburn Hills, Michigan</strong>, its holdings, management team, board or brands....",
    "published": null
  }
]