[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Alfa Romeo have been in a technical partnership with the Sauber F1 Team since 2018. In February 2019, Sauber announced that it would compete as Alfa Romeo Racing although the ownership, racing licence and management structure would remain unchanged.",
    "published": "5 days ago"
  },
  {
    "title": "Alfa Romeo History | in Schaumburg, IL | Zeigler Alfa Romeo",
    "url": "https://www.alfaromeousaofschaumburg.com/through-the-years-the-history-of-alfa-romeo/",
    "snippet": "This merger ensured consistent Alfa Romeo service and manufacturing. The company then purchased Maserati in 2005, followed by the Chrysler group in 2014. In 2018, <strong>Michael Manley</strong> took over as the chief executive officer at FCA.",
    "published": "September 22, 2020"
  },
  {
    "title": "Who Owns Alfa Romeo? | Who Makes Alfa Romeo? | Zeigler Alfa Romeo of Schaumburg",
    "url": "https://www.alfaromeousaofschaumburg.com/who-owns-alfa-romeo/",
    "snippet": "Since Fiat-Chrysler Automobiles is one the world’s biggest automotive manufacturers, their Alfa Romeo takeover expanded the lineup to include sleek, luxurious vehicles that are a thrilling drive around Barrington. ... When Cavalier <strong>Ugo Stella</strong> ...",
    "published": "July 13, 2019"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "It wasn’t until February of 2007 under the reorganization within Fiat that led to four new auto companies, one of which was now Alfa Romeo Automobiles S.p.A. As a subsidiary of Fiat-Chrysler Automobiles, FCA is who owns Alfa Romeo and continues to build up the brand’s historic roots.",
    "published": "April 26, 2021"
  },
  {
    "title": "Who Owns Alfa Romeo | Alfa Romeo FIAT of Santa Monica",
    "url": "https://www.alfaromeousaofsantamonica.com/the-ownership-history-of-alfa-romeo/",
    "snippet": "In early 2021, the PSA group (which owned Peugeot, Citroen, DS, Vauxhall, and Opel) merged with FCA (which owned Fiat, Chrysler, Dodge, RAM, Jeep, and Alfa Romeo) to form Stellantis, and that’s where things stand. Here at Alfa Romeo FIAT of Santa Monica, we’re very excited about what this means for the future of the brand! Regardless of ownership, the people in charge of Alfa Romeo have always dedicated themselves to ensuring these vehicles were fun to drive and impressive to look at.",
    "published": "January 11, 2025"
  }
]