[
  {
    "title": "R. Nicholas Burns - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/R._Nicholas_Burns",
    "snippet": "Robert Nicholas Burns (born January ... States ambassador to China from 2022 to 2025. He is now <strong>Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations at Harvard John F</strong>....",
    "published": "September 26, 2025"
  },
  {
    "title": "R. Nicholas Burns, U.S. Ambassador, Says China Is Aligned With ‘Agents of Disorder’ - The New York Times",
    "url": "https://www.nytimes.com/2025/01/10/business/nicholas-burns-ambassador-china.html",
    "snippet": "R. Nicholas Burns, the <strong>top U.S. diplomat in Beijing</strong>, says the Biden administration is making a final push to urge China to reconsider its tilt toward Russia, Iran and North Korea.",
    "published": "January 10, 2025"
  },
  {
    "title": "Ambassador Nicholas Burns to Rejoin The Cohen Group as a Vice Chair | The Cohen Group",
    "url": "https://cohengroup.net/ambassador-nicholas-burns-rejoin-cohen-group-vice-chair",
    "snippet": "Ambassador Burns will rejoin the firm as a <strong>Vice Chair</strong> on February 17, 2025. Prior to his work in China, Ambassador Burns was a Senior Counselor at The Cohen Group for 12 years following an extraordinary career in the US Foreign Service.",
    "published": "February 3, 2025"
  },
  {
    "title": "Ambassador to the People’s Republic of China - U.S. Embassy & Consulates in China",
    "url": "https://china.usembassy-china.org.cn/ambassador-nicholas-burns/",
    "snippet": "Nicholas Burns was Ambassador of the United States of America to the People’s Republic of China (PRC). Nominated by President Biden, he was confirmed by the U.S. Senate in December 2021. He served from March 2022 until January 2025.",
    "published": "May 15, 2025"
  },
  {
    "title": "Nicholas Burns | The Belfer Center for Science and International Affairs",
    "url": "https://www.belfercenter.org/person/nicholas-burns",
    "snippet": "3, 2025 · It’s a remarkable, historic success that 80 years after World War II, Japan and Germany have become vital U.S. allies.&amp;amp;nbsp;But as Beijing... Professor Nicholas Burns is the Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations at Harvard University’s Kennedy School of Government.",
    "published": null
  }
]