[
  {
    "title": "José Antonio Kast - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jos%C3%A9_Antonio_Kast",
    "snippet": "José Antonio Kast Rist (born 18 January 1966), also known by his initials JAK, is a Chilean lawyer and politician. He is the President-elect of Chile, after winning the 2025 Chilean general election.",
    "published": "1 day ago"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "Many believe Kast will be the most right-wing president since <strong>Augusto Pinochet</strong>, who oversaw a 17-year dictatorship in Chile from 1973.",
    "published": "2 days ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "Kast repeatedly presented migrants as the reason for rising insecurity. During the campaign, he gave the roughly 330,000 undocumented migrants – most of them Venezuelan – an ultimatum to leave before the next president takes office on 11 March or be expelled “with only the clothes on their backs”. In his victory speech, in which he repeatedly said Chileans were living in “fear”, the president-elect said his administration would show “great firmness in confronting all those who harm us”.",
    "published": "13 hours ago"
  },
  {
    "title": "Far-right candidate Jose Antonio Kast wins Chile’s presidential election | Elections News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/12/14/far-right-candidate-jose-antonio-kast-wins-chiles-presidential-election",
    "snippet": "Far-right candidate Jose Antonio Kast has won a run-off election to become Chile’s 38th president, ousting the centre-left government currently in power.",
    "published": "2 days ago"
  },
  {
    "title": "Far-right José Antonio Kast wins Chile's presidential vote | AP News",
    "url": "https://apnews.com/article/chile-elections-kast-jara-president-boric-trump-e9ef32b53359f3152ee80d62c106c5f6",
    "snippet": "Presidential candidate <strong>Jeannette Jara</strong>, of the ruling Unity for Chile coalition, addresses supporters after conceding to Jose Antonio Kast, of the opposition Republican Party, in the presidential runoff election in Santiago, Chile, Sunday, Dec.",
    "published": "2 days ago"
  }
]