[
  {
    "title": "Samy Bengio - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Samy_Bengio",
    "snippet": "Bengio is <strong>senior director of Artificial Intelligence and Machine Learning Research at Apple and an adjunct professor at École Polytechnique Fédérale de Lausanne</strong>. He was a longtime scientist at Google, where he led a large group of researchers working in machine learning, including adversarial ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Ex-Google AI Scientist Samy Bengio Finds Job at Apple",
    "url": "https://www.techtimes.com/articles/259852/20210504/ex-google-ai-scientist-samy-bengio-job-apple.htm",
    "snippet": "Before his controversial resignation, Bengio led a group of research scientists in the Google Brain research team, where he had authored around 250 research papers about neural networks and had been pivotal in advancing studies about ethical AI.",
    "published": "May 4, 2021"
  },
  {
    "title": "Samy Bengio - Apple | LinkedIn",
    "url": "https://www.linkedin.com/in/bengio",
    "snippet": "Experience: Apple · Location: Mountain View · 500+ connections on LinkedIn. View Samy Bengio’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": null
  },
  {
    "title": "Samy Bengio, Adjunct Professor",
    "url": "https://people.epfl.ch/samy.bengio?lang=en",
    "snippet": "Samy Bengio (PhD in computer science, University of Montreal, 1993) is a senior director of machine learning research at Apple since 2021. Before that, he was a distinguished scientist at Google Research since 2007 where he was heading part of the Google Brain team, and at IDIAP in the early 2000s where he co-wrote the well-known open-source Torch machine learning library.",
    "published": null
  },
  {
    "title": "r/MachineLearning on Reddit: [D] Samy Bengio resigns from Google",
    "url": "https://www.reddit.com/r/MachineLearning/comments/mloj16/d_samy_bengio_resigns_from_google/",
    "snippet": "Apple has hired Samy Bengio, a former AI scientist who resigned in protest of Google&#x27;s firing of two employees, to lead a new AI team under John Giannandrea.",
    "published": "April 7, 2021"
  }
]