[
  {
    "title": "Carlo Ancelotti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Carlo_Ancelotti",
    "snippet": "<strong>With his team&#x27;s 2–1 victory over Real Sociedad on 17 September 2023, Ancelotti got his 173rd Madrid win, overtaking Zinedine Zidane to become the coach with the second most wins in the club&#x27;s history</strong>. On 29 December, although he had previously been linked with the position of head coach for ...",
    "published": "1 week ago"
  },
  {
    "title": "Bio - Carlo Ancelotti",
    "url": "https://carloancelotti.it/en/bio/",
    "snippet": "Carlo Ancelotti is the only coach in history with <strong>five UEFA Champions League titles</strong>.",
    "published": "August 19, 2025"
  },
  {
    "title": "Carlo Ancelotti - Manager profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/carlo-ancelotti/profil/trainer/523",
    "snippet": "Avg. term as coach : 2.26 Years ... This is an overview of the career of a manager. ... Carlo Ancelotti is the father of Davide Ancelotti (Manager Botafogo de Futebol e Regatas).",
    "published": null
  },
  {
    "title": "Carlo Ancelotti Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/3864/Carlo-Ancelotti/overview",
    "snippet": "He has <strong>won 20 trophies during his career and is one of only three managers to win the European Cup or UEFA Champions League three times, doing so twice with AC Milan and once with Real Madrid</strong>. A versatile, creative midfielder in his playing days, Ancelotti won three Serie A titles and the European ...",
    "published": null
  },
  {
    "title": "Carlo Ancelotti becomes Real Madrid's most successful manager - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/43019983/carlo-ancelotti-becomes-real-madrid-most-successful-manager",
    "snippet": "Ancelotti <strong>first joined Madrid in June 2013, winning the Champions League in his first season, before being fired in May 2015 after a less successful second campaign</strong>. He made a surprise return to the club in June 2021 and has since won two LaLiga ...",
    "published": "December 18, 2024"
  }
]