[
  {
    "title": "Sundar Pichai - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sundar_Pichai",
    "snippet": "In April 2024, after 28 Google employees were fired for protesting against Project Nimbus, Pichai stated that the office is not a place &quot;to fight over disruptive issues or debate politics&quot;, and warned against using the company &quot;as a personal platform&quot;. Pichai was included in Time&#x27;s annual list of the 100 most influential people in 2016 and 2020. He was also included in the Time 100 AI list in 2024. He was awarded the 2021 ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Larry Page - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Larry_Page",
    "snippet": "Page was chief executive officer of Google from 1997 until August 2001 when he was succeeded by <strong>Eric Schmidt</strong>, and then again from April 2011 until July 2015 when he became CEO of its newly formed parent organization Alphabet Inc. He held that post until December 4, 2019, when he and Brin stepped ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Google - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Google",
    "snippet": "The lawsuit became known in March 2021 when a federal judge denied Google&#x27;s request to dismiss the case, ruling that they must face the group&#x27;s charges. Reuters reported that the lawsuit alleged that Google&#x27;s CEO <strong>Sundar Pichai</strong> sought to keep the users unaware of this issue.",
    "published": "3 days ago"
  },
  {
    "title": "Eric Schmidt - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eric_Schmidt",
    "snippet": "<strong>Eric Emerson Schmidt</strong> (born April 27, 1955) is an American businessman and former computer engineer who was the chief executive officer of Google from 2001 to 2011 and the company&#x27;s executive chairman from 2011 to 2015.",
    "published": "1 week ago"
  },
  {
    "title": "Sundar Pichai google CEO: Sundar Pichai's journey from Madras to Google CEO: All about his educational qualifications, personal life and more - The Economic Times",
    "url": "https://economictimes.indiatimes.com/news/international/global-trends/sundar-pichais-journey-from-madras-to-google-ceo-all-about-his-educational-qualifications-personal-life-and-more/articleshow/118786681.cms?from=mdr",
    "snippet": "In 2008, Pichai was appointed Vice President of Product Development. By 2012, he had advanced to Senior Vice President, and in 2014, he became the Product Chief. His dedication, perseverance, and strong work ethic led to his appointment as Google’s CEO in 2015, and in 2019, he also assumed the role of CEO at Alphabet Inc.",
    "published": "March 7, 2025"
  }
]