[
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Galthié became the coach of Stade Français in 2004 after head coach <strong>Nick Mallet</strong> departed the Paris club. Galthié was contacted by Max Guazzini to take up the coaching job. In the first season, Stade Français made it to the final of both the Top 14 and Heineken Cup finals, but were beaten ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Fabien Galthie: Ten things you should know about the France head coach",
    "url": "https://www.rugbyworld.com/countries/france-countries/fabien-galthie-ten-things-you-should-know-about-the-france-head-coach-134810",
    "snippet": "Find out more about former France scrum-half Fabien Galthie, who has sparked a turnaround in fortunes of the national team",
    "published": "January 12, 2024"
  },
  {
    "title": "Inside the journey which took France from global laughing stock to World Cup contenders",
    "url": "https://www.telegraph.co.uk/rugby-union/2023/09/08/france-rugby-world-cup-2023-fabien-galthie/",
    "snippet": "To mitigate for Brunel’s departure, the Fédération Française de Rugby (FFR) allowed the head coach’s successor, Fabien Galthié, to shadow the backroom staff at the tournament. As Brunel headed off into the sunset, Galthié could hit the ground running.",
    "published": "September 12, 2023"
  },
  {
    "title": "Fabien Galthié, the perfectionist masterminding France's Rugby World Cup tilt",
    "url": "https://www.france24.com/en/sport/20230921-fabien-galthi%C3%A9-the-perfectionist-masterminding-france-s-rugby-world-cup-tilt",
    "snippet": "In his three years at the helm, the former scrum-half and captain has turned Les Bleus into a ruthless winning machine, finding a worthy successor in skipper <strong>Antoine Dupont</strong>. ... Fabien Galthié has reached an impressive tally of 33 wins out ...",
    "published": "September 21, 2023"
  },
  {
    "title": "'It creates a bit of a sh*tstorm where people are getting abuse'",
    "url": "https://www.the42.ie/ireland-france-galthie-6648509-Mar2025/",
    "snippet": "Ireland interim head coach <strong>Simon Easterby</strong>.",
    "published": "March 13, 2025"
  }
]