[
  {
    "title": "International Astronomical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Astronomical_Union",
    "snippet": "Two subsidiaries of the IAU were also created at this assembly: the International Time Commission seated at the International Time Bureau in Paris, France, and the International Central Bureau of Astronomical Telegrams initially seated in Copenhagen, Denmark. The seven initial member states were Belgium, Canada, France, Great Britain, Greece, Japan, and the United States, soon to be followed by Italy and Mexico. The first executive committee consisted of Benjamin Baillaud (President, France), Alfred Fowler (General Secretary, UK), and four vice presidents: William Campbell (US), Frank Dyson (UK), Georges Lecointe (Belgium), and Annibale Riccò (Italy).",
    "published": "3 weeks ago"
  },
  {
    "title": "Vote in the 2025 AAS Election! | American Astronomical Society",
    "url": "https://aas.org/posts/news/2025/01/vote-2025-aas-election",
    "snippet": "Current President: <strong>Dara Norman</strong> (June 2024-June 2026); Past President: Kelsey Johnson (June 2024-June 2025).",
    "published": null
  },
  {
    "title": "International Astronomical Union | IAU",
    "url": "https://www.iau.org/administration/executive_bodies/past_committees/executive_committee/",
    "snippet": "Debra Meloy Elmegreen · Piero Benvenuti (Interim General Secretary) <strong>José Miguel Rodriguez Espinosa</strong>",
    "published": null
  },
  {
    "title": "IAU: WG Small Bodies Nomenclature (WGSBN)",
    "url": "https://www.wgsbn-iau.org/",
    "snippet": "The other four members, who are ... as the IAU President and General Secretary. The current members of the WGSBN are listed below: ... There are currently 25737 named minor planets. The WGSBN is a Working Group (WG) of the International Astronomical Union (IAU) and is responsible ...",
    "published": null
  },
  {
    "title": "Executive Committee",
    "url": "https://www.iau.org/Iau/Iau/About/Governance-Overview/Executive-Committee.aspx",
    "snippet": "The Executive Committee consists of the President of the Union, the President-Elect, six Vice-Presidents , the General Secretary, and the Assistant General Secretary elected by the General Assembly on the proposal of the Special Nominating Committee (SNC) .",
    "published": null
  }
]