[
  {
    "title": "Newsmax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Newsmax",
    "snippet": "On November 15, 2020, The Wall Street Journal reported that Hicks Equity Partners, a private equity firm with ties to a co-chair of the Republican National Committee, was exploring a buyout of Newsmax. The Hicks group identified a team of executives who would manage the network, and had been talking to former Fox News hosts including Megyn Kelly. Media analyst Michael Nathanson reported that if a competing network took 20% of Fox News&#x27; audience, it could sap about $200 million in annual profit from the company.",
    "published": "1 week ago"
  },
  {
    "title": "Newsmax – Breaking News | News Videos | Politics, Health, Finance",
    "url": "https://www.newsmax.com/",
    "snippet": "Top news headlines, videos and comments from Newsmax.com covering politics, the White House, Congress, Hollywood. U.S. news you can trust on health, personal finance, faith, freedom issues and more.",
    "published": null
  },
  {
    "title": "newsmax inc.",
    "url": "https://www.sec.gov/Archives/edgar/data/2026478/000121390025021989/ea0233655-253g1_newsmax.htm",
    "snippet": "Newsmax Media has <strong>six wholly-owned subsidiaries</strong>: Newsmax Broadcasting, LLC, a Florida limited liability company (“Newsmax Broadcasting”), Crown Atlantic Insurance, LLC, a Florida limited liability company (“Crown Atlantic”), Humanix Publishing, LLC, a Florida limited liability company ...",
    "published": null
  },
  {
    "title": "Christopher Ruddy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christopher_Ruddy",
    "snippet": "<strong>Christopher Ruddy</strong> (born January 28, 1965) is an American journalist and business executive. A political conservative, Ruddy is the CEO and majority owner of Newsmax Media.",
    "published": "5 days ago"
  },
  {
    "title": "Who Owns Newsmax: Top Shareholders – Brands Owned By",
    "url": "https://brandsownedby.com/who-owns-newsmax/",
    "snippet": "In its 2025 public listing, Newsmax introduced a dual-class share system, where <strong>Class A common stock carries 10 votes per share, and Class B common stock carries one vote per share</strong>.",
    "published": "October 6, 2025"
  }
]