[
  {
    "title": "Com Hem 2025 Company Profile: Valuation, Investors, Acquisition | PitchBook",
    "url": "https://pitchbook.com/profiles/company/10876-33",
    "snippet": "Com Hem Holding AB is a broadcast television company with services that include cable television, broadcast Internet, an ... PitchBook’s comparison feature gives you a side-by-side look at key metrics for similar companies. Personalize which data points you want to see and create visualizations instantly. Request a free trial · One of Com Hem’s 41 competitors is Virgin Media, a Corporate Backed or Acquired company based in Berkshire, United Kingdom.",
    "published": null
  },
  {
    "title": "Com Hem",
    "url": "https://eqtgroup.com/about/current-portfolio/com-hem",
    "snippet": "Q3 Announcement 2025 · Presentation · Webcast · Transcript · Divestment · <strong>EQT III</strong> acquired Com Hem AB, a Swedish cable TV operator, in 2003. Com Hem was one of the largest operators in Sweden, offering pay-TV and broadband internet access as the leading player in an attractive market.",
    "published": null
  },
  {
    "title": "Hem - 2025 Company Profile, Team, Funding & Competitors - Tracxn",
    "url": "https://tracxn.com/d/companies/hem/__RzsXUsLjn8V1NcFoMplSP3vCaJDKDiei-bGvoH9Lw_c",
    "snippet": "The company&#x27;s operation is limited to the US and Europe. It was created as a pivot out of the Fab.com, while carrying the funding, investors, and valuation of latter. ... Hem got acquired by <strong>Vitra</strong> on Feb 03, 2016.",
    "published": "September 15, 2025"
  },
  {
    "title": "HEM - 2025 Company Profile, Team, Competitors & Financials - Tracxn",
    "url": "https://tracxn.com/d/companies/hem/__5lpiMd7xHUpHWbqYnrcQAzMlL_c3jyt-tl3bj5wZjsI",
    "snippet": "They may have been blocked by your firewall, proxy or browser configuration. Press Ctrl+F5 or Ctrl+Shift+R to have your browser try again and if that doesn&#x27;t work, click here to retry or mail us at hi@tracxn.com ... HEM is an unfunded company based in Mumbai (India), founded in 2008.",
    "published": "July 20, 2025"
  },
  {
    "title": "Com Hem AB - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn",
    "url": "https://tracxn.com/d/companies/com-hem-ab/__C72ILG9J1X0WjTdDonjKDs7MlEgXfBRoW-3D_-KNVmk",
    "snippet": "Com Hem AB - Media group providing broadband, TV and telephony services. Acquired by <strong>Tele2.</strong> Raised funding over 3 rounds from 1 investor.",
    "published": "November 11, 2025"
  }
]