[
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Peter Norvig (born 14 December 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google. Norvig is the co-author with Stuart J.",
    "published": "3 weeks ago"
  },
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "Programmer, designer, author, and manager in high tech R&amp;D. Specialties: internet… · Experience: Stanford Institute for Human-Centered Artificial Intelligence (HAI) · Location: Palo Alto · 500+ connections on LinkedIn. View Peter Norvig’s profile on LinkedIn, a professional community ...",
    "published": "1 week ago"
  },
  {
    "title": "Peter Norvig Bio",
    "url": "https://norvig.com/bio.html",
    "snippet": "<strong>Google Research</strong>: As the Director of Research at Google (starting in 2005) I oversaw the birth and growth of world-leading teams in machine translation, speech recognition, and computer vision. More recently, as one of multiple research directors, I worked on education, democratization of AI, ...",
    "published": null
  },
  {
    "title": "Peter Norvig",
    "url": "https://norvig.com/",
    "snippet": "Distinguished Education Fellow at Stanford HAI, Research Director at Google. Co-author of Artificial Intelligence: A Modern Approach, the leading AI textbook used in 1,500+ universities worldwide. peter@norvig.com / resume / github / medium / photo gallery / legacy homepage",
    "published": null
  },
  {
    "title": "Peter Norvig | Speaker | TED",
    "url": "https://www.ted.com/speakers/peter_norvig",
    "snippet": "Currently the Director of Research at <strong>Google Inc.</strong>, Norvig was responsible for maintaining and improving the engine&#x27;s core web search algorithms from 2002 to 2005. Prior to his work at Google, Norvig was NASA&#x27;s chief computer scientist.",
    "published": null
  }
]