[
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/organisation/president/past-presidents",
    "snippet": "Sir Stanley Rous had already made ... becoming President of FIFA. As a top-class referee, he took charge of the FA Cup final in England and 36 international matches. Then, having becoming secretary of the English FA in 1934, he helped rewrite the Laws of the Game in 1938 while his patient diplomacy helped pave the way for the British nations rejoining FIFA in 1946. Rous was knighted in 1949 for his contribution to the London Olympics the previous year and to ...",
    "published": null
  },
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "Presidents <strong>Daniel Burley Woolfall, Rodolphe Seeldrayers, and Arthur Drewry</strong> died during their term in office. The current president is Swiss-Italian Gianni Infantino, elected on 26 February 2016 during ...",
    "published": "November 20, 2025"
  },
  {
    "title": "FIFA Presidents - My Football Facts",
    "url": "https://www.myfootballfacts.com/world-football/fifa/world-cup/fifa-all-time-world-cup/fifa-presidents/",
    "snippet": "Shortly after Blatter’s win, he was forced to resign and new elections took place on 26th February 2016 with Prince Ali, Jérôme Champagne, Tokyo Sexwale, Sheik Salman and Gianni Infantino vying to become FIFA’s 9th President. Sexwale withdrew before the election and Switzerland’s Gianni Infantino was victorious after a second ballot.",
    "published": "April 30, 2025"
  },
  {
    "title": "Sepp Blatter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sepp_Blatter",
    "snippet": "From a background in business, public relations, and sports administration, Blatter became general secretary of FIFA in 1981 and was then elected president at the 51st FIFA Congress on 8 June 1998, succeeding <strong>João Havelange</strong>, who had headed ...",
    "published": "February 28, 2002"
  },
  {
    "title": "List of presidents of FIFA facts for kids",
    "url": "https://kids.kiddle.co/List_of_presidents_of_FIFA",
    "snippet": "FIFA is the main organization that controls association football (soccer) around the world. Some presidents, like Daniel Burley Woolfall, Rodolphe Seeldrayers, and Arthur Drewry, passed away while they were still in office.",
    "published": null
  }
]