[
  {
    "title": "Minister of Health and Population (Nepal) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Minister_of_Health_and_Population_(Nepal)",
    "snippet": "Sudha Sharma Gautam is the current Minister of Health and Population, assuming office from 26 October 2025. Previously, Prime Minister <strong>Sushila Karki</strong>, who assumed office on 12 September 2025 oversees multiple ministries including the Ministry of Health and population under the interim government.",
    "published": "November 17, 2025"
  },
  {
    "title": "Ministry of Health and Population (Nepal) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health_and_Population_(Nepal)",
    "snippet": "<strong>Roshan Pokhrel</strong> formerly held the position of health secretary. The Department of Health Services serves under the ministry to facilitate and implement its work, mainly deliver health services and to maintain public hospitals. Furthermore, two other departments also work under and with the ministry:",
    "published": "November 10, 2025"
  },
  {
    "title": "Amid controversy, Karki expands Cabinet for third time",
    "url": "https://kathmandupost.com/national/2025/10/27/amid-controversy-karki-expands-cabinet-for-third-time",
    "snippet": "<strong>Gautam, who served as health secretary from 2008 to 2011</strong>, will lead the Ministry of Health and Population, and Gupta will head the Ministry of Youth and Sports.",
    "published": null
  },
  {
    "title": "Nepal President Ram Chandra Poudel Swears In Two New Ministers for Health and Youth Affairs | DD News On Air",
    "url": "https://www.newsonair.gov.in/nepal-president-ram-chandra-poudel-swears-in-two-new-ministers-for-health-and-youth-affairs/",
    "snippet": "Minister for Health and Population, <strong>Dr Sudha Sharma Gautam</strong> today visited those injured during Gen Z protest and are receiving treatment in hospitals. Dr. Gautam previously served as the Secretary at the Ministry of Health, while Bablu Gupta is recognized as a leader within the Gen-Z movement.",
    "published": null
  },
  {
    "title": "Ministry of Health and Population-Nepal | Kathmandu | Facebook",
    "url": "https://www.facebook.com/mohpnep/",
    "snippet": "Ministry of Health and Population-Nepal, Kathmandu. 773,936 likes · 11,999 talking about this · 1 was here. Official Facebook Page of Government of Nepal, Ministry of Health and Population.",
    "published": null
  }
]