[
  {
    "title": "List of Arsenal F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Arsenal_F.C._managers",
    "snippet": "On 29 November 2019, with Arsenal sitting in eighth place in the league, Emery was dismissed as manager and former player and assistant first team coach Freddie Ljungberg was appointed as interim head coach.",
    "published": "6 days ago"
  },
  {
    "title": "Mikel Arteta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikel_Arteta",
    "snippet": "In 2018, Arteta became strongly linked with the Arsenal manager&#x27;s vacancy, following the departure of his former manager <strong>Arsène Wenger</strong>, but Unai Emery was eventually hired. On 20 December 2019, Arteta was appointed head coach at his former club Arsenal, signing a deal until 2023.",
    "published": "9 hours ago"
  },
  {
    "title": "Arsenal Coaching Staff | Team Behind the Team",
    "url": "https://www.arsenalinsider.com/club/coaching-staff/",
    "snippet": "He initially replaced <strong>Unai Emery</strong> at the Emirates Stadium helm with the title of head coach. But the north London outfit awarded him the title of manager in 2020 after winning the FA Cup.",
    "published": "July 8, 2025"
  },
  {
    "title": "The Managers | History | News | Arsenal.com",
    "url": "https://www.arsenal.com/history/the-managers",
    "snippet": "Emery led us to the Europa League final in his first season with us, only to be beaten by Chelsea, and left the following November. ... <strong>Mikel Arteta</strong> (December 2019 to present) <strong>Mikel Arteta</strong> was named as our head coach in December 2019, having ...",
    "published": null
  },
  {
    "title": "Arsenal Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=142&teamTabs=managers",
    "snippet": "From Allardyce to Zola, our massive manager database, with histories and win ratios, is sure to get your vote of confidence ... Card-happy control freak? Astute arbiter?",
    "published": null
  }
]