[
  {
    "title": "Left Party (France) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Left_Party_(France)",
    "snippet": "The PG was co-chaired from 2010 by <strong>Jean-Luc Mélenchon</strong> and Martine Billard. In 2016, the Left Party had 8,000 members. At the end of 2014, <strong>Jean-Luc Mélenchon</strong> and Martine Billard resigned, and the party leadership was then collectively ensured by the national secretariat.",
    "published": "3 weeks ago"
  },
  {
    "title": "Parti de gauche (France) — Wikipédia",
    "url": "https://fr.wikipedia.org/wiki/Parti_de_gauche_(France)",
    "snippet": "Pour la République sociale (PRS), association fondée en mai 2004 par Jean-Luc Mélenchon en dehors du PS et Forces militantes, rejoints par le syndicaliste Claude Debons et le parti MARS - Gauche républicaine, présidé par <strong>Éric Coquerel</strong>, s&#x27;investissent pleinement dans la fondation du nouveau ...",
    "published": "November 18, 2025"
  },
  {
    "title": "Parti de gauche - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q922707",
    "snippet": "https://www.liberation.fr/france/2012/12/18/jean-luc-melenchon-a-rendu-le-parti-de-gauche-inaudible_868595/",
    "published": null
  },
  {
    "title": "Le Parti de Gauche – Le Parti de Gauche (PG) : Pour une République Écosocialiste",
    "url": "https://www.lepartidegauche.fr/",
    "snippet": "Avec nos meilleures salutations militantes et écosocialistes, <strong>Isabelle-Hélène Lerner-Sultana</strong>, co-coordinatrice nationale Jean-Christophe Sellin, co-coordinateur national · Des cookies peuvent être utilisés pour vous offrir la meilleure expérience sur notre site.",
    "published": null
  },
  {
    "title": "parti de Gauche - LAROUSSE",
    "url": "https://www.larousse.fr/encyclopedie/divers/parti_de_Gauche/185946",
    "snippet": "Cette tendance est encore plus patente lors des cantonales de mars 2011 : à près de 9 % au premier tour et 5 % au second, le Front de gauche permet au PCF de remporter 116 sièges, soit 8 de plus que précédemment, et de faire entrer dans les conseils généraux 5 représentants du parti de Gauche. Le co-président de ce dernier, J.-L. Mélenchon, ne fait pas mystère de son intention de renouveler ce partenariat pour la présidentielle de 2012 : dès janvier 2011, il officialise sa candidature puis obtient, en juin, le ralliement derrière sa personne de l’appareil communiste, moyennant un accord très généreux pour les législatives qui s’ensuivront.",
    "published": null
  }
]