[
  {
    "title": "Pradeep Yadav (Nepalese politician) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Pradeep_Yadav_(Nepalese_politician)",
    "snippet": "He is currently serving as the Minister of Water Supply of Nepal. Yadav, who is the deputy secretary general of People&#x27;s Socialist Party, has also served as Minister of Health &amp; Population from <strong>May 13, 2024, to July 8, 2024</strong>, and as Minister of Forests &amp; Environment from July 4, 2022, to October ...",
    "published": "February 28, 2025"
  },
  {
    "title": "Janata Samajbadi Party recommends names for ministers",
    "url": "https://kathmandupost.com/national/2024/05/13/janata-samajbadi-party-recommends-names-for-ministers",
    "snippet": "<strong>The newly-formed Janata Samajbadi Party on Monday forwarded the name of Pradip Yadav, deputy general secretary of the party</strong>, for his appointment as the minister for health and population.",
    "published": null
  },
  {
    "title": "Janata Samajbadi Party joins government",
    "url": "https://kathmandupost.com/national/2024/05/13/janata-samajbadi-party-joins-government-1715609716",
    "snippet": "<strong>Pradip Yadav sworn in as minister for health and population</strong> and Hasina Khan as state minister.",
    "published": null
  },
  {
    "title": "Pradeep Yadav takes oath as Nepal’s Minister for Health and Population",
    "url": "https://english.khabarhub.com/2024/13/355484/",
    "snippet": "KATHMANDU: In a significant development, <strong>Pradeep Yadav from the Janata Samajbadi Party (JSP) has assumed the role of Minister for Health and Population</strong>. In a ceremony held on Monday, President Ram Chandra Poudel administered the oath of office and secrecy to Yadav.",
    "published": null
  },
  {
    "title": "Govt set to appoint Pradeep Yadav as Health Minister and Nawal Kishwor Sah as Forest Minister from JSP « Khabarhub",
    "url": "https://english.khabarhub.com/2024/13/355458/",
    "snippet": "Meanwhile, Yadav-led JSP Nepal has withdrawn from Prime Minister Pushpa Kamal Dahal’s government and Yadav himself has resigned from his position as the Minister for Health and Population.",
    "published": null
  }
]