[
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "Scholz left office in October 2001, after the defeat of his party at the 2001 Hamburg state election and the election of Ole von Beust as First Mayor. His successor was <strong>Ronald Schill</strong>, who had won on a Law and order platform, with an emphasis on harsh penalties for drug dealers.",
    "published": "1 week ago"
  },
  {
    "title": "Can a New Chancellor Fix Germany? | Carnegie Endowment for International Peace",
    "url": "https://carnegieendowment.org/europe/strategic-europe/2025/01/can-a-new-chancellor-fix-germany?lang=en",
    "snippet": "Faced with a recession and rising unemployment, Scholz’s Social Democrat predecessor <strong>Gerhard Schröder</strong> implemented a shake-up of the social welfare system so as to encourage people to enter the work force.",
    "published": null
  },
  {
    "title": "Olaf Scholz is now Germany's Chancellor-Elect and Angela Merkel's Successor",
    "url": "https://www.thequint.com/news/world/olaf-scholz-germany-chancellor-elect-merkel-successor",
    "snippet": "Olaf Scholz is now officially the chancellor-elect of Germany and the successor to <strong>Angela Merkel</strong>, who ruled Germany for 16 years, BBC reported on Wednesday, 24 November.",
    "published": "November 25, 2021"
  },
  {
    "title": "Chancellor Olaf Scholz? Change Without Disruption | Institut Montaigne",
    "url": "https://www.institutmontaigne.org/en/expressions/chancellor-olaf-scholz-change-without-disruption",
    "snippet": "As the embodiment of the SPD’s more moderate wing, Olaf Scholz has been viewed as the natural successor to the outgoing Chancellor. So much so that he used the signature Merkel-Raute, the trademark hand gesture known as the Merkel Diamond, on the cover of the Süddeutsche Zeitung.",
    "published": null
  },
  {
    "title": "Olaf Scholz | Facts, Biography, Cabinet, & Chancellor of Germany | Britannica",
    "url": "https://www.britannica.com/biography/Olaf-Scholz",
    "snippet": "A longtime member of Germany’s center-left Social Democratic Party (SPD), Scholz served as finance minister and vice chancellor (2018–21) in the ‘grand coalition’ government of <strong>Angela Merkel</strong> before succeeding her as chancellor.",
    "published": "March 31, 2022"
  }
]