[
  {
    "title": "Federal Reserve Bank of Minneapolis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Federal_Reserve_Bank_of_Minneapolis",
    "snippet": "The first building for the Minneapolis Federal Reserve bank is located at <strong>510 Marquette Avenue, at the corner of Marquette Avenue and 5th Street South in Minneapolis</strong>, right next to the Nicollet Mall station of the METRO Blue and Green light rail lines, and across from the Soo Line Building.",
    "published": "November 21, 2025"
  },
  {
    "title": "Contact Us | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/banking/contact-us",
    "snippet": "Box 291 Minneapolis, MN 55480-0291 · Physical Address Federal Reserve Bank of Minneapolis <strong>90 Hennepin Avenue Minneapolis, MN 55401</strong>",
    "published": null
  },
  {
    "title": "Federal Reserve Board - Federal Reserve Bank of Minneapolis Contacts",
    "url": "https://www.federalreserve.gov/supervisionreg/afi/res_cont_minn.htm",
    "snippet": "FedEZFile and FedEZFile FluentFedEZFile ... StagesBanking Market InformationCRA and the Applications Process · <strong>90 Hennepin Avenue P.O. Box 291 Minneapolis, MN 55480-0291</strong> For questions concerning the submission of applications to the Federal ...",
    "published": null
  },
  {
    "title": "Visiting the Bank: Policies, Directions, and Parking | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/connect/directions-and-parking",
    "snippet": "<strong>90 Hennepin Avenue Minneapolis, MN 55401 (612) 204-5000 ... Everyone entering the building must present a picture ID. The Fed is accessible via several Metro Transit bus routes, and is located approximately five blocks north of the Warehouse District light rail station. The Federal Reserve Bank is located at 90 Hennepin, on the corner of Hennepin Ave and N 1st St</strong>...",
    "published": null
  },
  {
    "title": "Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/",
    "snippet": "The Federal Reserve Bank of Minneapolis is pursuing an economy that works for all of us. Serving Montana, North and South Dakota, Minnesota, Wisconsin and the Upper Peninsula of Michigan.",
    "published": null
  }
]