[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "Brunel, who has spent most of his career in France, <strong>formally coached his former team Auch, as well as Bordeaux Bègles, Colomiers, Pau and Perpignan</strong>. Jacques Brunel, born in Courrensan, played club rugby for his local side at age grade level, and joined the academy side at Auch in 1967 at the ...",
    "published": "January 1, 2025"
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "With the otherworldly talents of Antoine Dupont, Damien Penaud, Romain Ntamack and Gregory Alldritt at his fingertips, the 55-year-old took his team to a 2022 Six Nations Grand Slam and four runners-up finishes. Coaching his side to the quarterfinals of their home Rugby World Cup a year ago, there is a sense that there is more to come from France as this talented group of players continues to mature. This could no more be seen than when France beat New Zealand 30-29 to register their third-straight win over the All Blacks in enthralling fashion. ... France’s head coach Jacques Brunel (L) before the Japan 2019 Rugby World Cup quarter-final match against Wales.",
    "published": "May 30, 2025"
  },
  {
    "title": "Jacques Brunel | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/12984",
    "snippet": "<strong>After Guy Noves sacking December 2017 Brunel was named as the France national coach</strong>. In round 4 of the 2018 Six Nations under Brunel, France defeated England for the first time since 2015, running out 22–16 victors, and had it not been because ...",
    "published": null
  },
  {
    "title": "Jacques Brunel named new coach of France's national rugby team",
    "url": "https://www.france24.com/en/20171227-rugby-jacques-brunel-named-new-coach-france-national-team",
    "snippet": "<strong>Brunel was once ex France boss Laporte&#x27;s right-hand man as forwards coach from 2000-2007</strong>. He took Perpignan to the French league title in 2009 and spent five years in charge of Italy between 2011 and 2016 before switching to Bordeaux in 2016.",
    "published": "December 27, 2017"
  },
  {
    "title": "France national rugby union team - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/France_national_rugby_union_team",
    "snippet": "Novès was dismissed in December 2017, becoming the first France head coach ever to be fired before the end of his contract, and was replaced by former Italy head coach Jacques Brunel, who <strong>arrived from the same position with Bordeaux Bègles</strong>.",
    "published": "1 week ago"
  }
]