[
  {
    "title": "Christine Lagarde - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Christine_Lagarde",
    "snippet": "According to a press report from June 2013, Lagarde was described by Stéphane Richard, the CEO of France Telecom (a former aide to Lagarde when she was finance minister), who was himself put under formal investigation in the case, as having been fully briefed before approving the arbitration process which benefitted Bernard Tapie. In 2013, the press revealed an undated hand-written letter seized by investigators during a search of Christine Lagarde&#x27;s Paris home, in which she appears to express her full allegiance to then-President Nicolas Sarkozy: &quot;Use me for as long as it suits you and suits your action and your casting.",
    "published": "2 weeks ago"
  },
  {
    "title": "Christine Lagarde",
    "url": "https://www.theceo.in/women/christine-lagarde",
    "snippet": "Apart from her personal life, Lagarde maintains a strong commitment to her health, practising a vegetarian lifestyle. Her hobbies include frequent visits to the gym, cycling, and swimming. Christine Lagarde&#x27;s journey from a modest upbringing to becoming a global financial and political leader is a testament to her unwavering dedication, exceptional leadership skills, and commitment to fostering economic stability.",
    "published": "October 31, 2023"
  },
  {
    "title": "Christine Lagarde | Biography, IMF, ECB, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Christine-Lagarde",
    "snippet": "Christine Lagarde, <strong>French lawyer and politician</strong> who was the first woman to serve as France’s finance minister (2007–11), as the managing director of the International Monetary Fund (2011–19), and as president of the European Central Bank ...",
    "published": "January 30, 2009"
  },
  {
    "title": "Christine Lagarde Biography for Kids",
    "url": "https://www.lottie.com/blogs/strong-women/christine-lagarde",
    "snippet": "She was <strong>married to Wilfried Lagarde from 1982 to1992 and bore two kids Thomas and Pierre-Henri, and then divorced later married to Eachran Gilmour and divorced</strong>. Christine was appointed the first female to head the Ministry of Finance, Economy ...",
    "published": null
  },
  {
    "title": "Christine Lagarde - Biographical Information",
    "url": "https://www.imf.org/en/about/senior-officials/archive/christine-lagarde",
    "snippet": "Christine Lagarde <strong>joined the French government in June 2005 as Minister for Foreign Trade</strong>. After a brief stint as Minister for Agriculture and Fisheries, in June 2007 she became the first woman to hold the post of Finance and Economy Minister ...",
    "published": null
  }
]