[
  {
    "title": "2025 Chilean general election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Chilean_general_election",
    "snippet": "<strong>Michelle Bachelet</strong> (Socialist Party), former president of Chile (2006–2010, 2014–2018), announced on 5 March 2025 that she would not run for a third term, stating that &quot;good politics demands renewal.&quot; Her decision ended months of speculation within the ruling coalition.",
    "published": "2 days ago"
  },
  {
    "title": "Ultra-conservative José Antonio Kast elected Chile’s next president | Chile | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
    "snippet": "Sun 14 Dec 2025 18.40 ESTLast modified on Tue 16 Dec 2025 00.08 EST · Share · The ultra-conservative former congressman <strong>José Antonio Kast</strong> has been elected as Chile’s next president.",
    "published": "1 week ago"
  },
  {
    "title": "Gabriel Boric - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gabriel_Boric",
    "snippet": "Boric, however, refrained from issuing a personal apology, stating that no individual in Chile would face persecution or intimidation for their beliefs unless they contravened the law. In January 2025, President <strong>Gabriel Boric</strong> became the first head of state to visit the South Pole and the third ...",
    "published": "13 hours ago"
  },
  {
    "title": "Chile shifts sharply right as José Antonio Kast wins the presidency",
    "url": "https://www.npr.org/2025/12/14/nx-s1-5644074/chile-kast-right",
    "snippet": "Presidential candidate <strong>Jose Antonio Kast</strong>, of the Republican Party, waves after winning the presidential runoff election in Santiago, Chile, Sunday, Dec. 14, 2025.",
    "published": "1 week ago"
  },
  {
    "title": "Chile elects far-right José Antonio Kast as next president",
    "url": "https://www.bbc.com/news/articles/c0kde07lvvro",
    "snippet": "Pinochet was an army general who ... disappearances and free-market economic policies. ... Chile&#x27;s current left-wing President <strong>Gabriel Boric</strong>, who could not run again, had suffered from low approval ratings....",
    "published": "1 week ago"
  }
]