[
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "<strong>Aníbal Fernández es candidato a gobernador de la Provincia de Buenos Aires</strong> y actualmente jefe de Gabinete de Ministros de la presidencia de la República Argentina. Previamente se desempeñó en el Senado Nacional como representante de la ...",
    "published": null
  },
  {
    "title": "LIST: Who’s running for governor, vice governor in Philippine provinces for 2025 elections",
    "url": "https://www.rappler.com/philippines/elections/list-candidates-who-is-running-governor-vice-provinces-2025/",
    "snippet": "Here is the Commission on Elections’ final list of candidates for governors and vice governors for the 2025 elections.",
    "published": "May 3, 2025"
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "He praised the president, describing ... run for governor of the Buenos Aires Province instead, defeating Julián Domínguez in the primary elections. He lost the main elections to María Eugenia Vidal, of Republican Proposal, and announced that he may leave politics. In 2021, he was appointed as Minister of Security in replacement of Sabina Frederic, as part of a cabinet reshuffle following the government&#x27;s poor showings in the 2021 legislative primary elections. In 2006, Anibal Fernández, who was serving ...",
    "published": "November 15, 2025"
  },
  {
    "title": "2025 Philippine gubernatorial elections - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Philippine_gubernatorial_elections",
    "snippet": "Governor <strong>Hermogenes Ebdane</strong> is supposed ... January 2025. Incumbent Hermilando Mandanas is term-limited and will be running for Vice Governor. Incumbent Athena Tolentino assumed office on October 8 after incumbent Jonvic Remulla was appointed ...",
    "published": "September 28, 2025"
  },
  {
    "title": "2025 Laguna local elections - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Laguna_local_elections",
    "snippet": "Candidates for the gubernatorial election include <strong>Sol Aragones, incumbent Vice Governor Katherine Agapay, incumbent Representative Dan Fernandez, and incumbent Representative Ruth Hernandez</strong>, wife of Governor Hernandez.",
    "published": "November 9, 2025"
  }
]