[
  {
    "title": "Who Owns Alfa Romeo: Top Shareholders – Brands Owned By",
    "url": "https://brandsownedby.com/who-owns-alfa-romeo/",
    "snippet": "<strong>Santo Ficili</strong> is the Chief Executive Officer of Alfa Romeo as of 2025. He leads the brand under Stellantis N.V. and is responsible for shaping Alfa Romeo’s strategy, operational direction, and brand identity worldwide.",
    "published": "2 weeks ago"
  },
  {
    "title": "Who Makes Alfa Romeo? | Ron Lewis Alfa Romeo",
    "url": "https://www.ronlewisalfaromeo.com/who-makes-alfa-romeo/",
    "snippet": "Who Makes Alfa Romeo: Stellantis currently oversees the production and development of Alfa Romeo vehicles. This multinational corporation was established in 2021 through the merger of <strong>Fiat Chrysler Automobiles (FCA) and PSA Group</strong>.",
    "published": "October 31, 2025"
  },
  {
    "title": "Who Makes Alfa Romeo? | Alfa Romeo of Omaha",
    "url": "https://www.alfaromeoomaha.com/alfaromeo-research/who-owns-alfa-romeo/",
    "snippet": "Who owns Alfa Romeo, exactly? Alfa Romeo is currently owned by the <strong>Stellantis automotive company</strong>. Despite this, the origin of Italian precision shines through the top Alfa Romeo models like the Stelvio and Giulia models.",
    "published": "January 13, 2024"
  },
  {
    "title": "Who Owns Alfa Romeo? | Where is Alfa Romeo Made?",
    "url": "https://www.aristocratmotorsalfaromeo.com/manufacturer-research/who-owns-alfa-romeo/",
    "snippet": "<strong>Fiat-Chrysler Automobiles (FCA)</strong> has owned Alfa Romeo since 2007. Even though FCA has owned the luxury brand for more than 10 years, you’re still seeing the Italian design represented throughout their model lineup, such as the 4C Spider and Giulia.",
    "published": "July 25, 2025"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "Alfa Romeo is an iconic Italian vehicle with a tradition of sleek performance and luxurious design. Learn more about who owns Alfa Romeo and the history behind the brand with Genesis Alfa Romeo.",
    "published": "April 26, 2021"
  }
]