[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "She <strong>previously played for WSL clubs Manchester United, Bristol Academy, Birmingham City, Doncaster Belles, and Reading, and in the Bundesliga with VfL Wolfsburg</strong>. Earps has represented England at under-17, under-19, and under-23 levels, and won her first senior cap in 2017.",
    "published": "1 month ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "<strong>Before arriving at Manchester United, Earps spent time playing for hometown club Nottingham Forest, Bristol City, Birmingham City, Doncaster Rovers Belles, Reading and German giants Wolfsburg</strong>. After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in ...",
    "published": null
  },
  {
    "title": "Mary Earps: Age, Net Worth, Family & Career Highlights - Mabumbe",
    "url": "https://mabumbe.com/people/mary-earps-age-net-worth-family-career-highlights/",
    "snippet": "Earps’ professional career <strong>commenced at Leicester City, but it was at Doncaster Rovers Belles where she gained significant experience</strong>. She further honed her skills at clubs like Birmingham City, Bristol Academy, and Reading before making a ...",
    "published": "May 27, 2025"
  },
  {
    "title": "Mary Earps: England goalkeeper retires before Euro 2025 - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cdj9ryd8mgro",
    "snippet": "Earps has enjoyed a trophy-laden career since <strong>moving into senior football with Leicester City in 2009-2010</strong>.",
    "published": "May 27, 2025"
  },
  {
    "title": "Mary Earps and the end of an England career that was a testament to willpower - The Athletic",
    "url": "https://www.nytimes.com/athletic/6385134/2025/05/27/mary-earps-england-retirement-profile/",
    "snippet": "<strong>The early years of her playing career were nomadic, eight different clubs — Leicester City, Nottingham Forest, Doncaster Belles, Coventry City, Birmingham City, Bristol Academy, Reading, Wolfsburg</strong> — across a decade as she hunted for a place ...",
    "published": "May 27, 2025"
  }
]