[
  {
    "title": "'Il Pd scelga tra Minniti e Bartolo'. Chi è Elly Schlein, la 'coraggiosa' che ha preso più voti dei big",
    "url": "https://notizie.tiscali.it/politica/articoli/schlein-coraggiosa-vittoria/",
    "snippet": "Si chiama Elly Schlein, nativa di Lugano ma di cittadinanza italiana, <strong>eurodeputata uscente del Pd poi passata a Possibile</strong>: è lei la più votata in Emilia Romagna, con i suoi oltre 22 mila voti, a ben vedere, più di quelli portati a casa dai ...",
    "published": null
  },
  {
    "title": "Elezioni Emilia-Romagna, \"coraggiosa\" Elly Schlein la più votata dagli emiliani - la Repubblica",
    "url": "https://bologna.repubblica.it/cronaca/2020/01/27/news/elezioni_emilia-romagna_coraggiosa_elly_schlein_la_piu_votata_dagli_emiliani-246930085/",
    "snippet": "Elly Schlein, 35 anni, <strong>capolista della lista &quot;coraggiosa&quot;,</strong> nata con la benedizione di Vasco Errani e Pierluigi Bersani per &quot;ridare una casa&quot; a sinistra a chi in questi anni l&#x27;ha persa, totalizza oltre 22mila preferenze, tra la sua corsa nel ...",
    "published": "January 28, 2020"
  },
  {
    "title": "L'ascesa della 'coraggiosa' Elly Schlein",
    "url": "https://www.agi.it/politica/news/2022-09-28/ascesa-pd-schlein-18245612/",
    "snippet": "Elly ha deciso: balla da sola. <strong>Si presenta così con la lista &quot;Coraggiosa&quot; - di cui era capolista - alla elezioni regionali dell&#x27;Emilia Romagna del 2020.</strong> Un voto che tenne con il fiato sospeso gran parte della politica italiana perchè l&#x27;allora ...",
    "published": "September 28, 2022"
  },
  {
    "title": "Quello che sappiamo su Elly Schlein, la candidata Coraggiosa oggi vicepresidente dell’Emilia Romagna",
    "url": "https://www.elle.com/it/magazine/storie-di-donne/a30684739/elly-schlein-elezioni-emilia-romagna/",
    "snippet": "Dal 2014 al 2019 è europarlamentare ... resta fino all&#x27;anno scorso. <strong>Oggi è Coraggiosa (e da oggi ha il palcoscenico giusto per mostrarlo) che non a caso è il termine più caro alla Ocasio-Cortez</strong>....",
    "published": "February 12, 2020"
  },
  {
    "title": "Visione - Emilia-Romagna Coraggiosa",
    "url": "https://www.coraggiosa.it/visione/",
    "snippet": "Il progetto è sostenuto dall’ex europarlamentare bolognese Elly Schlein, da alcuni consiglieri regionali uscenti e da partiti come Articolo 1, Sinistra Italiana, È Viva-Primavera europea, così come da molte realtà civiche, associative e sociali, che hanno scelto di mettere in comune le loro competenze ed esperienze in un percorso nuovo che individui e sostenga in tutti i territori le persone più credibili per rappresentarlo.",
    "published": "December 3, 2019"
  }
]