[
  {
    "title": "FC Metz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FC_Metz",
    "snippet": "Metz plays its home matches at <strong>Stade Saint-Symphorien</strong>, which has a capacity of 25,636. Thus, it is the largest venue dedicated to football in Lorraine.",
    "published": "November 17, 2025"
  },
  {
    "title": "Stade Saint-Symphorien - FC Metz - Metz - The Stadium Guide",
    "url": "https://www.stadiumguide.com/stade-saint-symphorien/",
    "snippet": "Club: FC Metz | Opening: 1923 | Capacity: 26,600 seats | Description: <strong>Stade Saint-Symphorien</strong> opened in 1923 and became the home ground of FC Metz in 1932 following the foundation of the club.",
    "published": "April 29, 2020"
  },
  {
    "title": "FC Metz venue revamp work gets a jumpstart - Coliseum",
    "url": "https://www.coliseum-online.com/fc-metz-venue-revamp-work-gets-a-jumpstart/",
    "snippet": "Metz plays its home matches at the <strong>Stade Saint-Symphorien</strong> located within the City. Since 2018, FC Metz has been the sole owner of <strong>Stade Saint-Symphorien</strong>. The club has thus joined Olympique Lyonnais in becoming one of just two major sides in ...",
    "published": "October 9, 2020"
  },
  {
    "title": "Stade Saint-Symphorien",
    "url": "https://grokipedia.com/page/Stade_Saint-Symphorien",
    "snippet": "<strong>Stade Saint-Symphorien</strong> is a multi-purpose stadium located on Boulevard Saint-Symphorien in Longeville-lès-Metz, a suburb adjacent to Metz in northeastern France, serving primarily as the home venue for the professional football club FC Metz ...",
    "published": null
  },
  {
    "title": "FC Metz Tickets 2025/2026 - Compare & Buy Tickets with SeatPick",
    "url": "https://seatpick.com/fc-metz-tickets",
    "snippet": "FC Metz&#x27;s home matches are held at <strong>Stade Saint Symphorien</strong>, located in Metz, France. At full capacity, the venue can accommodate 25,636 supporters.",
    "published": null
  }
]