[
  {
    "title": "Government at a Glance 2025: Greece",
    "url": "https://www.oecd.org/en/publications/government-at-a-glance-2025-country-notes_da3361e1-en/greece_3bee4427-en.html",
    "snippet": "These country-specific factsheets are based on the data from Government at a Glance 2025, on a wide array of public governance and public administration issues, ranging from trust in government, satisfaction with services, digital government, regulation, and procurement, to public employment ...",
    "published": "June 18, 2025"
  },
  {
    "title": "Next Greek parliamentary election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Next_Greek_parliamentary_election",
    "snippet": "Immediately following the European ... coercing PASOK – KINAL President Nikos Androulakis to call for early leadership elections for October of the same year, bypassing the planned ones for late 2025....",
    "published": "6 days ago"
  },
  {
    "title": "Greece - September 2025 | The Global State of Democracy",
    "url": "https://www.idea.int/democracytracker/report/greece/september-2025",
    "snippet": "On 5 September, <strong>President Katerina Sakellaropoulou</strong> signed a migration law that imposes stricter penalties on rejected asylum seekers. Under the new legislation, rejected asylum seekers must leave Greece within 14 days, down from the previous 7-30 days. Failure to comply now carries criminal ...",
    "published": null
  },
  {
    "title": "Prime Minister Kyriakos Mitsotakis’ statement on the election of Minister of National Economy and Finance Kyriakos Pierrakakis as President of the Eurogroup | Prime Minister of the Hellenic Republic",
    "url": "https://www.primeminister.gr/en/2025/12/11/37593",
    "snippet": "Because a Greek Minister of Finance, <strong>Kyriakos Pierrakakis</strong>, has been elected President of the Eurogroup by the member states of the eurozone. This is a great honor for him, and I warmly congratulate him.",
    "published": "1 week ago"
  },
  {
    "title": "2025 Greek presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2025_Greek_presidential_election",
    "snippet": "A third round of voting was held on 6 February 2025, where no candidate reached the reduced required majority of 180. The fourth round was held on 12 February 2025, where <strong>Konstantinos Tasoulas</strong> was elected as President of Greece.",
    "published": "September 8, 2025"
  }
]