[
  {
    "title": "2024–2025 French political crisis - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024–2025_French_political_crisis",
    "snippet": "On 13 December, Macron appointed Democratic Movement leader <strong>François Bayrou</strong> as prime minister. According to Le Monde, the appointment of Bayrou was decided on at the last minute, with Macron originally telling Bayrou that he would not be named Prime Minister, only to be forced to appoint Bayrou ...",
    "published": "2 days ago"
  },
  {
    "title": "France rushes emergency budget law to avert shutdown after talks collapse | Reuters",
    "url": "https://www.reuters.com/world/french-pm-races-pass-stopgap-budget-law-avoid-shutdown-2025-12-22/",
    "snippet": "Item 1 of 2 French Prime Minister <strong>Sebastien Lecornu</strong> leaves the Elysee Palace, after a cabinet meeting with President Emmanuel Macron on a special law to allow spending and borrowing into the new year, after budget talks failed, in Paris, France, ...",
    "published": "7 hours ago"
  },
  {
    "title": "Opinion | France Needs a New France - The New York Times",
    "url": "https://www.nytimes.com/2025/12/22/opinion/france-macron-sixth-republic.html",
    "snippet": "But he is not out of the woods yet. Without a clear majority in the National Assembly, the government remains vulnerable to a motion of no confidence. That could force Mr. Macron to name yet another prime minister — the sixth of his second term — or call snap legislative elections.",
    "published": "20 hours ago"
  },
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "If so, the president may serve ... between the legislature and the executive. The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 and resigned on 6 October 2025, but was re-appointed ...",
    "published": "1 week ago"
  },
  {
    "title": "French PM names new government, hoping to avoid another no-confidence vote | France | The Guardian",
    "url": "https://www.theguardian.com/world/2024/dec/23/french-pm-names-new-government-hoping-to-avoid-another-no-confidence-vote",
    "snippet": "One of the government’s first tasks will be to draw up a 2025 budget bill and reduce France’s budget deficit, which is expected to reach 6% of gross domestic product by the end of the year, well above the 3% of GDP the European Union requires of member states. Barnier pushed through a budget bill at the beginning of December using the controversial constitutional clause called the 49.3, but the legislation was dropped after his government lost the no confidence vote.",
    "published": "December 26, 2024"
  }
]