[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "In 2021, Pochettino joined Paris Saint-Germain, where he won the Ligue 1 title and Coupe de France but left one year later. <strong>He took over as the manager of Chelsea for the 2023–24 season, mutually agreeing to part ways with the club after just one season</strong>. The same year he was appointed as ...",
    "published": "5 days ago"
  },
  {
    "title": "Mauricio Pochettino to become Chelsea head coach | News | Official Site | Chelsea Football Club",
    "url": "https://www.chelseafc.com/en/news/article/mauricio-pochettino-to-become-chelsea-head-coach",
    "snippet": "The 51-year-old has <strong>several seasons of Premier League experience in addition to coaching in Spain and France</strong>. He was most recently in charge at Paris Saint-Germain and guided the club to a Ligue 1 title and the Coupe de France.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/4632/Mauricio-Pochettino/overview",
    "snippet": "Under Pochettino, in the second ... and Chelsea. The following campaign proved even more successful as Pochettino led Saints to eighth, matching their highest Premier League finish. Pochettino was chosen by Tottenham Hotspur to replace Tim Sherwood as head coach for the 2014/15 ...",
    "published": null
  },
  {
    "title": "Mauricio Pochettino leaves Chelsea after one year as manager of the Premier League club | AP News",
    "url": "https://apnews.com/article/mauricio-pochettino-chelsea-manager-36f9f445d312598f9963484ee52de493",
    "snippet": "U.S. Supreme Court ... FILE - Newly appointed Chelsea manager <strong>Mauricio Pochettino</strong> addresses the media during a press conference at Stamford Bridge Stadium in London, Friday, July 7, 2023. (AP Photo/Kirsty Wigglesworth, File) Read More ...",
    "published": "May 21, 2024"
  },
  {
    "title": "Pochettino leaves Chelsea by mutual consent",
    "url": "https://www.premierleague.com/en/news/4025501",
    "snippet": "Head coach departs Stamford Bridge after one season in which he guided Blues to sixth place",
    "published": null
  }
]