[
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "In December 2024, Zelenskyy resisted pressure from the Biden administration to lower the conscription age to 18 to replace Ukraine&#x27;s battlefield losses. In February 2025, he said that Ukraine would introduce special military contracts for volunteers aged 18 to 24. On 4 September 2024, most of the Shmyhal Government cabinet tendered their resignations while Zelenskyy considered his reshuffle. In February 2025, Zelenskyy met with U.S. President Trump at the White House to discuss a proposed agreement which would give the United States the right to extract rare minerals from Ukrainian soil.",
    "published": "1 day ago"
  },
  {
    "title": "Volodymyr Zelensky’s biography — Official web site of the ...",
    "url": "https://www.president.gov.ua/en/president",
    "snippet": "14 December 2025 - 17:45 Go to all galleries · Home · President · Volodymyr Zelenskyy was elected President of Ukraine on April 21, 2019 · On 20 May, 2019 sworn in as the <strong>6th President of Ukraine</strong> · January 25, 1978 - Born in Kryvyi Rih, ...",
    "published": "13 hours ago"
  },
  {
    "title": "Politics 2024 Election",
    "url": "https://www.globalsecurity.org/military/world/ukraine/election-2025.htm",
    "snippet": "Ukrainian President Volodymyr Zelenskyy declared his readiness to hold elections within three months if the United States and Kyivs other allies can ensure the security of the voting process. <strong>Zelenskyy made this statement on 09 December 2025</strong> in response to US President Donald Trump, who suggested ...",
    "published": null
  },
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "In his address marking Ukrainian Armed Forces Day, <strong>President of Ukraine</strong> Volodymyr Zelenskyy spoke about Ukrainian warriors honored through murals in Ukraine and around the world. ... The parties covered multiple aspects and went through key ...",
    "published": "1 week ago"
  },
  {
    "title": "Zelenskyy reaffirms his refusal to cede land to Russia as he rallies European support",
    "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-trump-putin-cf17d925e21e6d6329fadff7e3efbb90",
    "snippet": "Ukraine’s President Volodymyr Zelenskyy, left, is received at Chigi Palace by Italian Premier Giorgia Meloni, Tuesday, Dec. 9, 2025.",
    "published": "1 week ago"
  }
]