[
  {
    "title": "Taoiseach - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Taoiseach",
    "snippet": "John Thomas Koch (2006), Celtic Culture: a Historical Encyclopedia, ABC-CLIO, p. 1062, ISBN · 1851094407, An early word meaning &#x27;leader&#x27; appears on a 5th- or 6th-century inscribed stone as both ogam Irish and British genitive TOVISACI: tywysog now means &#x27;prince&#x27; in Welsh, the regular descriptive title used for Prince Charles, for example; while in Ireland, the corresponding Taoiseach is now the correct title, in both Irish and English, for the Prime Minister of the Irish Republic (Éire).",
    "published": "4 days ago"
  },
  {
    "title": "Taoiseach | Meaning, Pronunciation, & List of Heads of Government of Ireland | Britannica",
    "url": "https://www.britannica.com/topic/taoiseach",
    "snippet": "The office of taoiseach (prime minister) was <strong>created by the Irish constitution of December 29, 1937</strong>. Executive power in the Irish government is vested in the taoiseach, who heads the cabinet and presides over its meetings.",
    "published": "April 5, 2024"
  },
  {
    "title": "Records of Irish heads of government since 1922 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Records_of_Irish_heads_of_government_since_1922",
    "snippet": "The Taoiseach (plural: Taoisigh) ... referred to as the President of the Executive Council. This office was <strong>first held by W. T. Cosgrave from 1922 to 1932, and then by Éamon de Valera from 1932 to 1937</strong>....",
    "published": "November 19, 2025"
  },
  {
    "title": "Former Taoisigh - Gov.ie",
    "url": "https://www.gov.ie/en/publication/9feb2a-former-taoisigh/",
    "snippet": "We cannot provide a description for this page right now",
    "published": null
  },
  {
    "title": "taoiseach - Wiktionary, the free dictionary",
    "url": "https://en.wiktionary.org/wiki/taoiseach",
    "snippet": "Unlike the English in their own country and in Ireland, who passed on land and political authority associated with it to the eldest male heir, the Irish elected their chiefs (taoiseachs) among the leading male members of each clan, and successors (tanistes) were chosen before the deaths of chiefs.",
    "published": null
  }
]