[
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "He would later attend the Gaza Peace Summit in Sharm El Sheikh as the sole representative from Southeast Asia, witnessing the signings of the accords and offering Indonesia&#x27;s support for Gaza&#x27;s reconstruction while advocating for the two-state solution. Prabowo was invited by Prime Minister Narendra Modi&#x27;s government as chief guest of the Republic Day celebration in 2025.",
    "published": "3 days ago"
  },
  {
    "title": "ASIA/INDONESIA - President Prabowo Subianto takes office as Head of State - Agenzia Fides",
    "url": "https://www.fides.org/en/news/75554-ASIA_INDONESIA_President_Prabowo_Subianto_takes_office_as_Head_of_State",
    "snippet": "2025-10-08 Indonesian priest: &quot;the government should listen to the expectations of young people&quot; Jakarta (Agenzia Fides) - The new Indonesian Head of State, <strong>Prabowo Subianto</strong>, has officially taken office as the eighth President of the country, after the handover from outgoing President Joko Widodo.",
    "published": null
  },
  {
    "title": "President of Indonesia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Indonesia",
    "snippet": "The president of the Republic of Indonesia (Indonesian: Presiden Republik Indonesia) is the head of state and head of government of the Republic of Indonesia. The president is the leader of the executive branch of the Indonesian government and the commander-in-chief of the Indonesian National Armed Forces and the Indonesian National Police.",
    "published": "4 weeks ago"
  },
  {
    "title": "List of presidents of Indonesia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Indonesia",
    "snippet": "^ As of 14 December 2025 · ^ a b Acting president · ^ President of the State of the Republic of Indonesia after Dutch–Indonesian Round Table Conference, while Sukarno became president of United States of Indonesia. ^ President of emergency government during Indonesian National Revolution, after both Sukarno and Hatta were captured by the Dutch authorities after the second police action.",
    "published": "November 7, 2025"
  },
  {
    "title": "Prabowo Subianto | Biography, Career, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Prabowo-Subianto",
    "snippet": "<strong>Prabowo Subianto</strong> is a former general and businessman who is now president of Indonesia (2024– ).",
    "published": "December 9, 2024"
  }
]