[
  {
    "title": "Francesco Farioli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Francesco_Farioli",
    "snippet": "Francesco Farioli (Italian pronunciation: [faˈrjɔːli]; born 10 April 1989) is an Italian football manager. He is currently the head coach of Primeira Liga club Porto. Farioli started his coaching career in Turkey with spells at <strong>Fatih Karagümrük</strong> and Alanyaspor. He then had one season in ...",
    "published": "20 hours ago"
  },
  {
    "title": "Foreign coaches in Mokum | All of Farioli's predecessors",
    "url": "https://english.ajax.nl/articles/foreign-coaches-in-mokum-all-of-fariolis-predecessors",
    "snippet": "The last foreign coach for Ajax was the <strong>Dane Olsen</strong>, who held the reins during the 1997-1998 season. Under his leadership, Ajax won both the national championship and the Dutch Cup.",
    "published": null
  },
  {
    "title": "Liverpool assistant manager John Heitinga appointed Ajax head coach - The Athletic",
    "url": "https://www.nytimes.com/athletic/6386426/2025/05/31/liverpool-heitinga-ajax-manager/",
    "snippet": "Heitinga is replacing Francesco Farioli at the Amsterdam club, who narrowly missed out on this season’s Eredivisie title to <strong>PSV Eindhoven</strong>.",
    "published": "May 31, 2025"
  },
  {
    "title": "Francesco Farioli new Ajax head coach",
    "url": "https://english.ajax.nl/articles/francesco-farioli-new-ajax-head-coach/",
    "snippet": "The Italian studied philosophy before entering the world of football. He began his career as a goalkeeping coach under <strong>Roberto De Zerbi</strong> and took his first steps as a head coach in Turkey at the age of thirty.",
    "published": null
  },
  {
    "title": "Ajax: Francesco Farioli leaves club after title miss agony - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cg4v1e5zk52o",
    "snippet": "Ajax technical director <strong>Alex Kroes</strong> said, despite missing out on the title, the club had achieved its aim of qualifying for the Champions League under Farioli and found his departure &quot;incredibly disappointing&quot;.",
    "published": "May 19, 2025"
  }
]