[
  {
    "title": "Lamine Diack - 'A Wonderful Olympic Games' | News | Paris 24 | Olympic Games",
    "url": "https://worldathletics.org/competitions/olympic-games/paris24/news/article/lamine-diack-a-wonderful-olympic-games",
    "snippet": "These are remarkable statistics and prove that our sport is continuing to develop at great speed in every corner of the world. With all this competition, winning a medal in athletics is a real achievement.",
    "published": null
  },
  {
    "title": "Lamine Diack becomes first president of the International Association of Athletics Federations | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/lamine-diack-becomes-first-president-of-the-i",
    "snippet": "1 August 2001 – Edmonton, Canada – An overwhelming majority of IAAF Congress delegates has elected Lamine Diack President of the International Association of Athletics Federations. 168 delegates voted for with just 1 delegate against.",
    "published": null
  },
  {
    "title": "World Athletics | President",
    "url": "https://worldathletics.org/about-iaaf/structure/president",
    "snippet": "Born in Dakar on 7 June 1933, Lamine Diack was a talented long jumper and <strong>won the 1958 French title</strong>. The following year he achieved his personal best of 7.72m when winning at the 1959 French Universities Championships but then suffered a knee ...",
    "published": null
  },
  {
    "title": "Lamine Diack pays tribute to Robert Pariente | NEWS | World Athletics",
    "url": "https://worldathletics.org/news/news/lamine-diack-pays-tribute-to-robert-pariente",
    "snippet": "<strong>In 1972, he published, along with the former athlete Guy Lagorce, “The Fabulous History of the Olympic Games”</strong> and this was followed by a masterful work on the history of our sport: “The Fabulous History of Athletics”.",
    "published": null
  },
  {
    "title": "Lamine Diack - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Lamine_Diack",
    "snippet": "Diack was a champion long jumper in the late 1950s, <strong>winning the event at the 1958 French Athletics Championships and holding the French/West African record from 1957 to 1960</strong>.",
    "published": "October 18, 2025"
  }
]