[
  {
    "title": "Tiger Aspect - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Tiger_Aspect",
    "snippet": "In June 2006, Tiger Aspect and Tigress Productions were purchased by <strong>IMG Media</strong>, an international talent and rights group, but were then sold to Endemol UK in November 2009.",
    "published": "1 week ago"
  },
  {
    "title": "Tiger Aspect Productions - Audiovisual Identity Database",
    "url": "https://www.avid.wiki/Tiger_Aspect_Productions",
    "snippet": "Tiger Aspect Productions is a British film and television production company of Peter Bennett-Jones, founded in 1993 from the merger between Tiger Television and Aspect Film &amp; Television. In June 2006, the company was purchased by <strong>IMG Media</strong>, but ...",
    "published": "November 12, 2025"
  },
  {
    "title": "Tiger Aspect Productions Ltd. | Encyclopedia.com",
    "url": "https://www.encyclopedia.com/books/politics-and-business-magazines/tiger-aspect-productions-ltd",
    "snippet": "Private Company Incorporated: 1988 as Tiger Productions Employees: 79 Sales: $59.7 million (2003) NAIC: 512110 Motion Picture, Video Tape Production · Tiger Aspect Productions Ltd. is one of the United Kingdom&#x27;s most successful independent television and film production houses.",
    "published": null
  },
  {
    "title": "History of Tiger Aspect Productions Ltd. – FundingUniverse",
    "url": "https://www.fundinguniverse.com/company-histories/tiger-aspect-productions-ltd-history/",
    "snippet": "Tiger Aspect&#x27;s operations include a dedicated film-making unit, Tiger Pictures, created in 1999, which, in addition to Billy Elliot has produced British film hits such as Kevin &amp; Perry Go Large and Dog Eat Dog. The company&#x27;s Tigress Productions unit is a producer of nature, wildlife, scientific, and adventure documentaries, including the hit celebrity vehicle In the Wild and the Africa series produced in conjunction with National Geographic and PBS.",
    "published": null
  },
  {
    "title": "Tiger Aspect Productions - BlackBook Companies - BCG Pro",
    "url": "https://www.comedy.co.uk/pro/blackbook/companies/tiger_aspect_productions/",
    "snippet": "Originally known as Tiger Television, Tiger Aspect is one of the UK&#x27;s most successful production companies, prolific across a broad range of programme genres. Originally an independent company, Tiger Aspect was bought by <strong>IMG Media</strong> in 2006 and ...",
    "published": null
  }
]