[
  {
    "title": "DFG, German Research Foundation - Professor Dr. Katja Becker - President of the DFG",
    "url": "https://www.dfg.de/en/about-us/statutory-bodies/executive-committee/members/becker",
    "snippet": "President of the DFG, Professor Dr. Katja Becker",
    "published": null
  },
  {
    "title": "DFG - Deutsche Forschungsgemeinschaft - Jahresversammlung 2025",
    "url": "https://www.dfg.de/de/service/presse/jahresversammlung-2025",
    "snippet": "Speech by the DFG President Prof. Dr. Katja Becker at the festive event held(Download) Press Release: “Science and the Humanities in the Crosshairs” – DFG Annual Meeting Focuses on the Growing Global Threat to Freedom of Research(interner Link) Ankündigungspressemitteilung: DFG-Jahresversammlung 2025(interner Link)",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - DFG President Katja Becker Meets with Japanese Ambassador",
    "url": "https://www.dfg.de/en/about-us/international-cooperation/dfg-abroad/japan/reports/2025/250409-meeting-shino-becker",
    "snippet": "DFG President Professor Dr. Katja Becker and H.E.",
    "published": null
  },
  {
    "title": "Katja Becker - Deutsche Forschungsgemeinschaft (DFG) - German Research Foundation | LinkedIn",
    "url": "https://www.linkedin.com/in/katja-becker-6b78ab76/",
    "snippet": "Deutsche Forschungsgemeinschaft (DFG) - German Research Foundation · Ruprecht-Karls-Universität Heidelberg · Report this profile · Katja Becker, <strong>President of the German Research Foundation (DFG) since 2020</strong>, studied…",
    "published": null
  },
  {
    "title": "DFG, German Research Foundation - Announcement and Date Notification: DFG Annual Meeting to Take Place from 30 June to 2 July 2025 in Hamburg",
    "url": "https://www.dfg.de/en/service/press/press-releases/2025/press-release-no-14",
    "snippet": "For the formal ceremony on Tuesday, 1 July, starting at 6 pm at Altonaer Fischauktionshalle, guests include Federal Research Minister Dorothee Bär and Hamburg’s Senator for Science, Maryam Blumenthal. In her speech, DFG President Katja Becker will also take the opportunity to address the growing global threat to the freedom of research.",
    "published": null
  }
]