[
  {
    "title": "Alexander Van der Bellen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexander_Van_der_Bellen",
    "snippet": "Alexander &quot;Sascha&quot; Van der Bellen (German: [alɛkˈsandɐ fan deːɐ̯ ˈbɛlən]; born 18 January 1944), also referred to by the abbreviation VdB, is an Austrian politician serving as the president of Austria since 2017. He previously served as a professor of economics at the University of Vienna, and after joining politics, as the spokesman of the Austrian Green Party.",
    "published": "6 days ago"
  },
  {
    "title": "President of Austria - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Austria",
    "snippet": "Since the institution of the popular ... incumbent Alexander Van der Bellen won it in 2017. The most notable presidential power is the appointment of the chancellor, the vice chancellor and the ministers, which collectively form the Cabinet of Austria....",
    "published": "1 week ago"
  },
  {
    "title": "Austrian Federal President Alexander Van der Bellen",
    "url": "https://www.bundespraesident.at/en/index",
    "snippet": "Nowadays, the facade is the only part left from <strong>Leopold I</strong>’s era – the interior was decorated in a Rococo style under Empress Maria Theresa, but only the first floor, also known as “bel étage”, now home to the offices and state rooms used by the Federal President for official functions.",
    "published": null
  },
  {
    "title": "The Federal President of the Republic of Austria — Austria in USA",
    "url": "https://www.austria.org/the-federal-president",
    "snippet": "Dr. Alexander Van der Bellen was inaugurated as the Federal President of the Republic of Austria on January 26, 2017, and re-elected in October 2022 for a second six-year term. As a member of the Green Party, he served as Federal Spokesperson from 1997 to 2008, as well as the Chairman of the ...",
    "published": null
  },
  {
    "title": "Van der Bellen re-elected Austrian president in first round | Euractiv",
    "url": "https://www.euractiv.com/section/all/short_news/van-der-bellen-re-elected-austrian-president-in-first-round/",
    "snippet": "While in the last presidential elections six years ago, the run-off between the right-wing <strong>Norbert Hofer</strong> and the independent Alexander Van der Bellen was close and could have shifted European power dynamics to the right, international and national ...",
    "published": "September 29, 2024"
  }
]