[
  {
    "title": "Mark Aguiar | Federal Reserve Bank of Minneapolis",
    "url": "https://www.minneapolisfed.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is a <strong>consultant at the Federal Reserve Bank of Minneapolis and the Walker Professor of Economics and International Finance at Princeton University</strong>. Previously, he was a professor of economics at the University of Rochester and a ...",
    "published": null
  },
  {
    "title": "Mark Aguiar: When Sovereign Debt Breaks its Promise",
    "url": "https://www.imf.org/en/news/podcasts/all-podcasts/2024/08/08/mark-aguiar-on-debt",
    "snippet": "Aguiar is the <strong>Director of the International Economics Section at Princeton University</strong>, and his research suggests that sovereign borrowing to stabilize the economy may have the opposite effect.",
    "published": null
  },
  {
    "title": "Mark Aguiar - Clark Center Forum",
    "url": "https://kentclarkcenter.org/panelists/mark-aguiar/",
    "snippet": "<strong>Walker Professor of Economics and International Finance</strong> Co-Director, National Bureau of Economic Research Program in International Finance and Macroeconomics Co-editor, American Economic Review, (2014—2017)",
    "published": "February 8, 2024"
  },
  {
    "title": "Mark A. Aguiar",
    "url": "https://jrc.princeton.edu/people/mark-aguiar",
    "snippet": "Mark A. Aguiar is the <strong>Walker Professor of Economics and International Finance at Princeton University</strong>. His research focuses on models of consumption and savings with applications in both open- and closed-economy macroeconomics.",
    "published": null
  },
  {
    "title": "Mark Aguiar | International Growth Centre",
    "url": "https://www.theigc.org/people/mark-aguiar",
    "snippet": "Mark Aguiar is currently <strong>Professor of Economics at Princeton University</strong>. His research focuses on models of consumption and savings with applications in both open- and closed-economy macroeconomics.",
    "published": null
  }
]