[
  {
    "title": "Nate Silver - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Nate_Silver",
    "snippet": "I am excited to talk to Nate when he finishes his book tour about ways to expand that kind of reporting.&quot; On July 22, 2013, ESPN (a subsidiary of the Walt Disney Company) announced that it had acquired ownership of the FiveThirtyEight website and brand, and that &quot;Silver will serve as editor-in-chief of the site and will build a team of journalists, editors, analysts and contributors in the coming months.&quot;",
    "published": "1 week ago"
  },
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "In August 2010, the blog became a licensed feature of The New York Times online and was renamed FiveThirtyEight: Nate Silver&#x27;s Political Calculus. In July 2013, ESPN acquired FiveThirtyEight, hiring Silver as <strong>editor-in-chief and a contributor for ESPN.com</strong>; the new publication launched on March ...",
    "published": "November 19, 2025"
  },
  {
    "title": "A few words about FiveThirtyEight - by Nate Silver",
    "url": "https://www.natesilver.net/p/a-few-words-about-fivethirtyeight",
    "snippet": "The FiveThirtyEight.com homepage as of its relaunch under ESPN/Disney on March 17, 2014. It also doesn’t quite feel like the end, exactly. “Data journalism” may have been a dumb name for what we were doing — that one’s on me — and Fivey Fox aside, the FiveThirtyEight brand was never warm and cuddly. But it always found a huge audience, and coverage of polls and political data is now much smarter. Compare the extremely analytical polling deep dives that Nate ...",
    "published": "March 5, 2025"
  },
  {
    "title": "Nate Silver Bio - Detroit Regional Chamber",
    "url": "https://www.detroitchamber.com/bios/nate-silver/",
    "snippet": "A diehard baseball fan, Silver is also credited with developing PECOTA (Player Empirical Comparison and Optimization Test Algorithm), a statistical formula for predicting a player’s performance. In addition to serving as editor-in-chief of FiveThirtyEight.com and an <strong>on-air commentator</strong> for ESPN, ...",
    "published": "July 12, 2022"
  },
  {
    "title": "Nate Silver - Podcast Host - Pushkin Industries",
    "url": "https://www.pushkin.fm/hosts/nate-silver",
    "snippet": "Nate Silver, co-host of the Risky Business podcast, is the <strong>founder and former editor-in-chief (2008-2023)</strong> of FiveThirtyEight, which was published by The New York Times, ESPN, and ABC News.",
    "published": "May 2, 2024"
  }
]