[
  {
    "title": "Leadership | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/about/leadership",
    "snippet": "Ileana Cruz-Marden, MPA *19 Director of Partnerships Tent Partnerships for Refugees Julieta Cuéllar, MPA *19 Director of Strategic Initiatives and Implementation Division of Family and Medical Leave Insurance, Maryland Department of Labor Robert Doar ‘83 President American Enterprise Institute Amber Greene, MPP *12 Chief Equity Officer &amp; Director of Civil Rights City of Baltimore Anna Grzymala-Busse ’92 Michelle and Kevin Douglas Professor of International Studies Stanford University Larry Handerhan, MPA *12 Former Biden-Harris Administration Official, Administration for Children and Fami",
    "published": null
  },
  {
    "title": "Leadership Lessons: Training Tomorrow’s Policymakers | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/news/leadership-lessons-training-tomorrows-policymakers",
    "snippet": "The significant depth and breadth of these experiences form the foundation of a pair of leadership classes the three are teaching to Princeton School of Public and International Affairs graduate students.",
    "published": null
  },
  {
    "title": "Dean's Leadership Series | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/graduate-programs/beyond-classroom/deans-leadership-series",
    "snippet": "The Dean&#x27;s Leadership Series offers students unparalleled opportunities to engage with some of the world&#x27;s most influential leaders. Through multiday campus visits, the School hosts public lectures and exclusive student discussions with renowned alumni, acclaimed authors, trailblazing innovators, thought leaders, distinguished policymakers, and global changemakers.",
    "published": null
  },
  {
    "title": "Public Policy (Princeton School of Public and International Affairs) | Princeton University",
    "url": "https://www.princeton.edu/academics/area-of-study/public-policy-princeton-school-public-and-international-affairs",
    "snippet": "The Princeton School of Public and International Affairs <strong>offers a multidisciplinary liberal arts major for undergraduates who desire to be engaged in public service and become leaders in the world of public and international affairs</strong>.",
    "published": null
  },
  {
    "title": "Home | Princeton School of Public and International Affairs",
    "url": "https://spia.princeton.edu/",
    "snippet": "For the Princeton School of Public and International Affairs, 2025 was a year that required meeting an extraordinary moment.Shortly after President…",
    "published": null
  }
]