[
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "His political career has spanned more than 75 years, from joining protests opposing citizenship policies for non-Malays in the Malayan Union in the 1940s to forming the <strong>Gerakan Tanah Air coalition</strong> in 2022. During his premiership, Mahathir was granted the title &quot;Father of Modernisation&quot; (Malay: ...",
    "published": "1 day ago"
  },
  {
    "title": "Gerakan Tanah Air",
    "url": "https://grokipedia.com/page/Gerakan_Tanah_Air",
    "snippet": "Gerakan Tanah Air (GTA), translated as Homeland Movement, was a Malaysian political coalition primarily comprising <strong>Malay-centric parties, non-governmental organizations, professionals, and individuals</strong>, established in August 2022 by former Prime ...",
    "published": null
  },
  {
    "title": "Mahathir leads new 'Malay movement' to fight in next Malaysian national polls | The Straits Times",
    "url": "https://www.straitstimes.com/asia/se-asia/dr-mahathir-leads-new-malay-movement-to-fight-in-next-malaysian-national-polls",
    "snippet": "Mahathir earlier on Thursday announced the setting up of the Gerakan Tanah Air movement which he said would ensure the rights of the Malays are taken care of. MalaysiaMahathir MohamadPoliticiansElectionsGerakan Tanah Air ... Need help? Reach us here. ... MDDI (P) 046/10/2025.",
    "published": "September 22, 2022"
  },
  {
    "title": "Dr M to invite Umno members to join new Malay unity alliance | FMT",
    "url": "https://www.freemalaysiatoday.com/category/nation/2025/06/04/dr-m-to-invite-umno-members-to-join-new-malay-unity-alliance",
    "snippet": "The new alliance is not Mahathir’s first attempt at uniting the Malays. In August 2022, he announced the formation of a coalition called Gerakan Tanah Air (GTA) comprising Malay-based parties, NGOs, academics and professionals.",
    "published": "June 5, 2025"
  },
  {
    "title": "Malaysia ex-PM Mahathir launches new Malay movement, eyes 120 seats in next general election - CNA",
    "url": "https://www.channelnewsasia.com/asia/malaysia-mahathir-mohamad-malay-movement-gerakan-tanah-air-2858626",
    "snippet": "PUTRAJAYA: Dr Mahathir Mohamad on Thursday (Aug 4) launched a new Malay movement which aims to take on the United Malays National Organisation (UMNO) in the coming elections. The former prime minister of Malaysia said that Gerakan Tanah Air (Movement of the People) is planning to contest in 120 seats in Peninsula Malaysia.",
    "published": "August 4, 2022"
  }
]