[
  {
    "title": "Prabowo Subianto: Latest News and Updates | South China Morning Post",
    "url": "https://www.scmp.com/topics/prabowo-subianto",
    "snippet": "Prabowo Subianto Djojohadikusumo is Indonesia’s eighth president, representing the Gerindra Party. He took office in October 2024. A former military general previously accused of human rights abuses during the presidency of his father-in-law Suharto, Prabowo served as defence minister under former president Joko Widodo, who defeated him in two prior elections.",
    "published": null
  },
  {
    "title": "Prabowo Subianto - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prabowo_Subianto",
    "snippet": "On 31 December 2024, Prabowo and Minister of Finance Sri Mulyani announced that the raise to 12% will only be applied to luxurious goods and services such as yachts, private jets and luxurious housing while there will be no tax raise for other goods and services that is not considered as luxury. During a cabinet meeting on 22 January 2025, Prabowo remarked that he is the first president to oversee a budget that is &quot;up to the ninth unit&quot; and announced that he will cut non-essential spending in his government, from cutting budget for official trips by the ministry to banning ceremonial events that is considered as waste of budget.",
    "published": "1 day ago"
  },
  {
    "title": "Prabowo Subianto, the new President of Indonesia - Diplomat magazine",
    "url": "https://diplomatmagazine.eu/2024/11/03/prabowo-subianto-the-new-president-of-indonesia/",
    "snippet": "Carlos Caceres - January 2, 2025 · 2023 · Diplomat Magazine - January 25, 2024 · Podcast · New Ambassadors · Donate · Archive · Diplomatic Spouses · New Generation · Diplomatic Pouch · By Diplomat Magazine · November 3, 2024 · 0 · 9007 · Share · Facebook · Twitter · Pinterest · WhatsApp · Prabowo Subianto · December 11, 2025 ·",
    "published": "November 12, 2024"
  },
  {
    "title": "Prabowo Subianto: The tainted ex-military chief who will be Indonesia's new leader",
    "url": "https://www.bbc.com/news/world-asia-68237141",
    "snippet": "During this period he also moved into Suharto&#x27;s inner sanctum, marrying in 1983 one of the former dictator&#x27;s daughters, Siti Hediati Hariyadi. Their marriage lasted 15 years, ending around the same time of the regime&#x27;s collapse. Prabowo at this time was commander of a special forces unit accused of the activists&#x27; abductions.",
    "published": "February 15, 2024"
  },
  {
    "title": "Crowd Roars as Prabowo Welcomes Former Wife Titiek Soeharto during Final Rally",
    "url": "https://jakartaglobe.id/news/crowd-roars-as-prabowo-welcomes-former-wife-titiek-soeharto-during-final-rally",
    "snippet": "Presidential candidate Prabowo Subianto paused for a moment, allowing the crowd to roar as he welcomed his former wife, <strong>Siti Hediati Hariyadi</strong>, more popularly known as Titiek Soeharto, during the final campaign rally at Bung Karno Stadium in ...",
    "published": "February 10, 2024"
  }
]