[
  {
    "title": "List of presidents of FIFA - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_FIFA",
    "snippet": "^ Following the provisional exclusion on Sepp Blatter, <strong>Issa Hayatou</strong> assumed the Office of FIFA President on an interim basis in accordance with article 32(6) of the FIFA Statutes because Hayatou was the longest-serving vice-president on FIFA&#x27;s ...",
    "published": "1 month ago"
  },
  {
    "title": "Gianni Infantino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Gianni_Infantino",
    "snippet": "Following his initial election to the FIFA presidency on 26 February 2016, he was re-elected on 5 June 2019 and again on 16 March 2023. His election to IOC membership took place on 10 January 2020. As president of FIFA, he oversaw the 2018 FIFA World Cup in Russia, for which he accepted the Order of Friendship medal given to him by Vladimir Putin.",
    "published": "1 day ago"
  },
  {
    "title": "Inside FIFA",
    "url": "https://inside.fifa.com/organisation/president/past-presidents",
    "snippet": "<strong>Arthur Drewry</strong> served as interim head of FIFA for six months following the death of Rodolphe William Seeldrayers and then became President in his own right in June 1956. Together with Stanley Rous, he had keenly supported Jules Rimet&#x27;s efforts ...",
    "published": null
  },
  {
    "title": "A list of all the FIFA presidents listed: Past to present FIFA presidents",
    "url": "https://sportsbrief.com/football/50855-a-list-fifa-presidents-listed-present-fifa-presidents/",
    "snippet": "Rodolphe Seeldrayers was only the second FIFA president to die in office. Photo courtesy: Twitter Source: Twitter · The second Englishman on the list so far, Arthur was initially acting president before being elected full president. He died in office in 1961. David Wiseman (left), Chairman of the Cup committee and Arthur Drewry, Chairman of the FA Council, conducting the draw for the next round of the competition.",
    "published": "October 19, 2023"
  },
  {
    "title": "Sepp Blatter | Biography, FIFA, & Facts | Britannica Money",
    "url": "https://www.britannica.com/money/Sepp-Blatter",
    "snippet": "<strong>Sepp Blatter</strong> (born March 10, 1936, Visp, Switzerland) is a Swiss sports executive who served as the president (1998–2015) of FIFA (Fédération Internationale de Football Association), the governing body of international football (soccer) ...",
    "published": null
  }
]