[
  {
    "title": "Issa Hayatou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Issa_Hayatou",
    "snippet": "Issa Hayatou (9 August 1946 – 8 August 2024) was a Cameroonian sports executive, athlete, and football administrator best known for serving as the president of the Confederation of African Football (CAF) between 1988 and 2017. He served as the acting FIFA president <strong>until 26 February 2016</strong> ...",
    "published": "October 20, 2025"
  },
  {
    "title": "Who We Are - News - Information regarding Acting FIFA President Issa Hayatou - FIFA.com",
    "url": "https://www.fifa.com/about-fifa/who-we-are/news/information-regarding-acting-fifa-president-issa-hayatou-2732634",
    "snippet": "Issa Hayatou has never hidden the ... football’s governing bodies, without interruption. <strong>He will continue to fulfil his role as Acting FIFA President as intended</strong>....",
    "published": null
  },
  {
    "title": "FIFA President pays tribute to Issa Hayatou: “An ambassador for football in the world”",
    "url": "https://inside.fifa.com/about-fifa/president/news/issa-hayatou-funeral-fifa-president-gianni-infantino-tribute",
    "snippet": "FIFA President Gianni Infantino ... funeral in Garoua, Cameroon. Mr Hayatou was acting FIFA President for <strong>just over four months between October 2015</strong> and Mr Infantino’s election in February 2016....",
    "published": null
  },
  {
    "title": "About FIFA: Organisation - FIFA.com",
    "url": "https://web.archive.org/web/20151010023004/http:/www.fifa.com/about-fifa/acting-president/index.html",
    "snippet": "On <strong>8 October 2015,</strong> given the decision of the Adjudicatory Chamber of the Independent Ethics Committee to provisionally ban Joseph S. Blatter from all football activities on a national and international level, Issa Hayatou assumed the Office ...",
    "published": null
  },
  {
    "title": "Issa Hayatou",
    "url": "https://grokipedia.com/page/Issa_Hayatou",
    "snippet": "Issa Hayatou (9 August 1946 – 8 August 2024) was a Cameroonian football administrator and former track athlete who presided over the Confederation of African Football (CAF) from 1988 to 2017 and <strong>briefly acted as interim president of FIFA in 2015.</strong>",
    "published": null
  }
]