[
  {
    "title": "Issa Hayatou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Issa_Hayatou",
    "snippet": "Issa Hayatou (9 August 1946 – 8 August 2024) was a Cameroonian sports executive, athlete, and football administrator best known for serving as the president of the Confederation of African Football (CAF) between 1988 and 2017. He served as the acting FIFA president <strong>until 26 February 2016</strong> ...",
    "published": "October 20, 2025"
  },
  {
    "title": "Who We Are - News - Information regarding Acting FIFA President Issa Hayatou - FIFA.com",
    "url": "https://www.fifa.com/about-fifa/who-we-are/news/information-regarding-acting-fifa-president-issa-hayatou-2732634",
    "snippet": "“I am very pleased to have been given an encouraging report by the medical staff,&quot; said FIFA’s Acting Secretary General, Markus Kattner. &quot;On behalf of FIFA and myself, I wish our Acting FIFA President Issa Hayatou a swift recovery.",
    "published": null
  },
  {
    "title": "About FIFA: Organisation - FIFA.com",
    "url": "https://web.archive.org/web/20151010023004/http:/www.fifa.com/about-fifa/acting-president/index.html",
    "snippet": "The Cameroonian has also been a member of the IOC (International Olympic Committee) since 2001 and <strong>has been serving as a FIFA vice-president since 1992</strong>. On 8 October 2015, given the decision of the Adjudicatory Chamber of the Independent Ethics ...",
    "published": null
  },
  {
    "title": "FIFA President pays tribute to Issa Hayatou: “An ambassador for football in the world”",
    "url": "https://inside.fifa.com/about-fifa/president/news/issa-hayatou-funeral-fifa-president-gianni-infantino-tribute",
    "snippet": "FIFA President Gianni Infantino ... funeral in Garoua, Cameroon. Mr Hayatou was acting FIFA President for <strong>just over four months between October 2015</strong> and Mr Infantino’s election in February 2016....",
    "published": null
  },
  {
    "title": "Issa Hayatou",
    "url": "https://grokipedia.com/page/Issa_Hayatou",
    "snippet": "Issa Hayatou (9 August 1946 – 8 August 2024) was a Cameroonian football administrator and former track athlete who presided over the Confederation of African Football (CAF) from 1988 to 2017 and <strong>briefly acted as interim president of FIFA in 2015.</strong>",
    "published": null
  }
]