[
  {
    "title": "Who owns Stanford University? - Quora",
    "url": "https://www.quora.com/Who-owns-Stanford-University",
    "snippet": "Answer: The short answer, from the University Governance documents: Stanford University is <strong>a trust with corporate powers under the laws of the State of California</strong>. The university is a tax-exempt entity under section 501(c)3 of the Internal Revenue ...",
    "published": null
  },
  {
    "title": "Stanford University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stanford_University",
    "snippet": "Leland Stanford Junior University, ... States. It was founded in 1885 by railroad magnate <strong>Leland Stanford (the eighth governor of and then-incumbent United States senator representing California) and his wife, Jane</strong>, in memory of their only child, Leland Jr....",
    "published": "2 weeks ago"
  },
  {
    "title": "Who Owns Stanford University – CanvasBusinessModel.com",
    "url": "https://canvasbusinessmodel.com/blogs/owners/stanford-university-who-owns",
    "snippet": "While the Board of Trustees plays ... structure is unique. Unlike for-profit companies, <strong>Stanford University does not have shareholders who own equity in the institution</strong>....",
    "published": "October 2, 2024"
  },
  {
    "title": "University Administration - Stanford Facts",
    "url": "https://facts.stanford.edu/administration/",
    "snippet": "The university is governed by <strong>a Board of Trustees, President, Provost, Academic Council and a number of other academic and administrative officers</strong>. Under the provisions of the Founding Grant, the Board of Trustees is custodian of the endowment and all the properties of Stanford University.",
    "published": null
  },
  {
    "title": "A History of Stanford – Stanford University",
    "url": "https://www.stanford.edu/about/history/",
    "snippet": "<strong>Leland Stanford and his wife, Jane Lathrop Stanford</strong>, lost their only child, Leland, Jr., to typhoid in 1884, they decided to build a university as the most fitting memorial, and deeded to it a large fortune that included the 8,180-acre Palo ...",
    "published": null
  }
]