[
  {
    "title": "MSNBC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/MSNBC",
    "snippet": "Microsoft divested its stake in the TV channel in 2005, followed by the website in 2012; the website was subsequently rebranded as NBCNews.com, and MSNBC.com was later taken over by <strong>the cable channel&#x27;s editorial staff</strong>.",
    "published": "5 days ago"
  },
  {
    "title": "Why MS NOW? What the MSNBC name change means for viewers - Los Angeles Times",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2025-11-14/msnbcs-name-will-change-but-its-political-leanings-will-not",
    "snippet": "While no programming changes are planned, the rebranding will be a test in an age when brand awareness is difficult to achieve as the media marketplace is highly fractured. MSNBC kept its name for 29 years even after its founding partner Microsoft gave up its stake in the network.",
    "published": "November 14, 2025"
  },
  {
    "title": "MSNBC to rebrand as Ms Now under Versant ownership - IMDb",
    "url": "https://www.imdb.com/news/ni65434005/",
    "snippet": "The logo of Ms Now, the cable channel formerly known as MSNBC. (Courtesy image) MSNBC will divorce itself from the NBC branding and rename itself “Ms Now” when the channel is spun out by Comcast and relaunched under Versant’s ownership, the company announced on Monday.",
    "published": null
  },
  {
    "title": "MSNBC to MS NOW: What's behind the network's branding makeover?",
    "url": "https://www.foxnews.com/media/msnbc-ms-now-whats-behind-networks-branding-makeover",
    "snippet": "MSNBC will complete its transformation and rebrand as MS NOW as part of its corporate separation from NBC News following Comcast&#x27;s decision to spin off its cable networks.",
    "published": "November 14, 2025"
  },
  {
    "title": "What will happen to CNBC and MSNBC when they no longer have a corporate connection to NBC News? | AP News",
    "url": "https://apnews.com/article/networks-cnbc-msnbc-comcast-new-company-00bf676f225f1c89026ef15bf8915ec9",
    "snippet": "Lazarus, chairman of the <strong>NBC Universal Media Group</strong>, is becoming CEO of the newly-formed company of cable networks, temporarily dubbed “SpinCo.” Cesar Conde, who as NBC Universal News Group chairman had oversight of CNBC and MSNBC, will lose ...",
    "published": "November 21, 2024"
  }
]