[
  {
    "title": "Who Is & Was the Education Minister of India? (1947-2025)",
    "url": "https://www.oasisintschool.net/who-is-was-the-education-minister-of-india-1947-2025/",
    "snippet": "Each Education Minister, from the days of independence to the present, has left a distinct mark on the country’s academic fabric. As of 2025, <strong>Shri Dharmendra Pradhan</strong> serves as India’s Education Minister.",
    "published": "May 24, 2025"
  },
  {
    "title": "Profile | President of India",
    "url": "https://www.presidentofindia.gov.in/Profile",
    "snippet": "From 1979 to 1983, Smt. Murmu served as a Junior Assistant in the Irrigation and Power Department, Government of Odisha. Her passion for education and learning led her also to serve as an honorary teacher at Sri Aurobindo Integral Education &amp; Research Centre, Rairangpur, from 1994 to 1997.",
    "published": null
  },
  {
    "title": "Ministry of Education (India) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Education_(India)",
    "snippet": "In 1985, the <strong>Rajiv Gandhi</strong> government changed its name to the Ministry of Human Resource Development (MHRD), and with the newly drafted &quot;National Education Policy 2020&quot; by the Narendra Modi government, the Ministry of Human Resource Development was renamed back to the Ministry of Education.",
    "published": "2 weeks ago"
  },
  {
    "title": "Education Ministers of India: Terms, Parties, and Prime Ministers",
    "url": "https://www.bankbazaar.com/voter-id/education-ministers-of-india.html",
    "snippet": "The first Education Minister of India was <strong>Abul Kalam Azad</strong>.",
    "published": null
  },
  {
    "title": "List of Education Ministers of India 1947 to 2025 and Tenure",
    "url": "https://www.studyiq.com/articles/education-ministers-of-india/",
    "snippet": "From <strong>Maulana Abul Kalam Azad</strong> to Dharmendra Pradhan, there wasn’t a single Education Minister who settled for mediocre human capital but took important strides in extending literacy, higher education, digital learning and educational policy reform.",
    "published": "June 4, 2025"
  }
]