[
  {
    "title": "James L. Dolan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/James_L._Dolan",
    "snippet": "In 1994, Paramount Communications, the owner of Madison Square Garden, was acquired by Viacom, who in turn sold the MSG properties to Cablevision and ITT Corporation, which had 50% ownership each. ITT sold its share to Cablevision three years later. In 1999, Dolan was given an increased role in managing Cablevision&#x27;s sports properties and is now the primary manager of these assets. The teams under his domain include most notably the National Basketball Association&#x27;s New York Knicks, the National Hockey League&#x27;s New York Rangers, and the American Hockey League&#x27;s Hartford Wolf Pack.",
    "published": "3 weeks ago"
  },
  {
    "title": "Who is James Dolan? Knicks owner makes waves after decision to fire Tom Thibodeau",
    "url": "https://www.usatoday.com/story/sports/nba/knicks/2025/06/03/knicks-owner-everything-to-know-james-dolan/84015908007/",
    "snippet": "<strong>He is the owner of both the New York Knicks and the NHL&#x27;s New York Rangers</strong>. He formerly owned the WNBA&#x27;s New York Liberty, although he sold the team to Joseph Tsai and Clara Wu Tsai in 2019.",
    "published": "June 3, 2025"
  },
  {
    "title": "James Dolan | Madison Square Garden Sports Executive Chairman and CEO",
    "url": "https://www.msgsports.com/leadership/james-l-dolan/",
    "snippet": "James L. Dolan is Executive Chairman of <strong>Madison Square Garden Sports Corp.</strong>, which features New York Knicks and New York Rangers franchises.",
    "published": "June 21, 2024"
  },
  {
    "title": "James Dolan Addresses Future Ownership of Knicks",
    "url": "https://www.si.com/nba/knicks/onsi/news/james-dolan-future-ownership-new-york-knicks",
    "snippet": "The New York Knicks have made plenty of trades on the road back to relevancy, but don&#x27;t expect any shift in the top spot. Current Knicks owner James Dolan addressed the future of owner during his appearance on the &quot;Roommates Show&quot; podcast, telling franchise face Jalen Brunson that he intends to keep both the Knicks and the NHL&#x27;s New York Rangers within the family.",
    "published": "March 16, 2025"
  },
  {
    "title": "James Dolan vs. the NBA: Why the Knicks owner is at odds with the league - The Athletic",
    "url": "https://www.nytimes.com/athletic/6226872/2025/03/25/james-dolan-adam-silver-owner-commissioner-nba/",
    "snippet": "The quote is as much a reflection of how Dolan operates as the man himself. Dolan is one of the most famous owners in professional sports, the longtime operator of the NBA’s New York Knicks and NHL’s Rangers and of Madison Square Garden.",
    "published": "March 27, 2025"
  }
]