[
  {
    "title": "Welcome, Coach Thiago Motta! - Juventus",
    "url": "https://www.juventus.com/en/news/articles/welcome-coach-thiago-motta",
    "snippet": "Welcome, Coach Thiago Motta! <strong>Juventus Football Club is delighted to announce Thiago Motta as the new First Team head coach</strong>.",
    "published": null
  },
  {
    "title": "Thiago Motta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Thiago_Motta",
    "snippet": "On <strong>12 June 2024</strong>, Motta was appointed as head coach of Serie A club Juventus, signing a three-year contract.",
    "published": "2 weeks ago"
  },
  {
    "title": "Juventus Parts Ways with Thiago Motta and Announces New Head Coach | beIN SPORTS",
    "url": "https://www.beinsports.com/en-us/soccer/serie-a/articles-video/juventus-parts-ways-with-thiago-motta-and-announces-new-head-coach-2025-03-23",
    "snippet": "<strong>Juventus has officially parted ways with Thiago Motta as head coach</strong> and announced the appointment of Croatian manager Igor Tudor, who will take over from this Sunday until the end of the season.",
    "published": null
  },
  {
    "title": "Thiago Motta appointed new Juventus head coach after Massimiliano Allegri’s departure - The Athletic",
    "url": "https://www.nytimes.com/athletic/5514755/2024/06/12/juventus-thiago-motta-appoint/",
    "snippet": "<strong>Thiago Motta has been appointed Juventus head coach on a three-year contract through to 2027</strong>. The 41-year-old replaces former manager Massimiliano Allegri, who was sacked in May despite winning the Coppa Italia.",
    "published": "June 12, 2024"
  },
  {
    "title": "Thiago Motta no longer First Team coach, Igor Tudor takes over - Juventus",
    "url": "https://www.juventus.com/en/news/articles/thiago-motta-no-longer-first-team-coach-igor-tudor-takes-over-as-first-team-coach",
    "snippet": "Juventus FC announce that Thiago Motta has been relieved of his duties as Men’s First Team coach. The club would like to thank Thiago Motta and...",
    "published": null
  }
]