[
  {
    "title": "World Report 2025: Indonesia | Human Rights Watch",
    "url": "https://www.hrw.org/world-report/2025/country-chapters/indonesia",
    "snippet": "<strong>The fighting between pro-independence Papuan insurgents and the Indonesian security forces contributed to the deteriorating human rights situation in West Papua</strong>. The insurgents are implicated in the killings of migrants and foreign workers.",
    "published": "January 16, 2025"
  },
  {
    "title": "Full article: Contextualising the 2025 Indonesian Protests: Authoritarian Statism, Militarisation, and the Crisis of Social Reproduction",
    "url": "https://www.tandfonline.com/doi/full/10.1080/00472336.2025.2564143",
    "snippet": "This situation is a feature of authoritarian statism as discussed by Poulantzas: the development of a parallel power network. This network undermines the formal organisation of the state and commands substantial influence in the state’s various politico-economic activities (Poulantzas Citation1978, 236–237). In March 2025, Indonesia’s parliament passed an amendment to its National Armed Forces Law, which allows military personnel to occupy civilian positions in government institutions, including in state-owned companies.",
    "published": null
  },
  {
    "title": "Joint Statement on the Visit of H.E. Prabowo Subianto, President of the Republic of Indonesia, to Pakistan (8-9 December 2025)",
    "url": "https://mofa.gov.pk/press-releases/visit-of-he-prabowo-subianto-president-of-the-republic-of-indonesia-to-pakistan-8-9-december-2025-joint-statement",
    "snippet": "Muhammad Shehbaz Sharif, Prime Minister of the Islamic Republic of Pakistan, H.E. Mr. Prabowo Subianto, President of the Republic of Indonesia, paid an official visit to Pakistan on 8-9 December 2025. During the visit, President Prabowo Subianto held delegation level talks with Prime Minister Shehbaz Sharif and met with H.E.",
    "published": null
  },
  {
    "title": "People Versus Power in Indonesia | Carnegie Endowment for International Peace",
    "url": "https://carnegieendowment.org/posts/2025/09/people-versus-power-in-indonesia?lang=en",
    "snippet": "Mass protests amid an economic slowdown have brought a reckoning for Indonesia’s collusive elite. Politics as usual is over. Stability is no longer possible without accountability.",
    "published": null
  },
  {
    "title": "Indonesia protests: Call for restraint and dialogue | OHCHR",
    "url": "https://www.ohchr.org/en/press-releases/2025/09/indonesia-protests-call-restraint-and-dialogue",
    "snippet": "We are following closely the spate of violence in Indonesia in the context of nationwide protests over parliamentary allowances, austerity measures, and alleged use of unnecessary or disproportionate force by security forces. We stress the importance of dialogue to address the public’s concerns.",
    "published": null
  }
]