[
  {
    "title": "Strategic Direction One: Strengthen Governance, Leadership and Administration – Ministry of Health",
    "url": "https://www.health.gov.sc/national-health-strategic-plan-2022-2026-2/strategic-direction-one-strengthen-governance-leadership-and-administration/",
    "snippet": "Governance structure Since the ... with their own governing boards, while <strong>the MoH Secretariat, headed by the Minister, is responsible for political leadership, sector stewardship, accountability and performance monitoring</strong>....",
    "published": null
  },
  {
    "title": "Ministry of Health, Population and Hospital Reform - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Health,_Population_and_Hospital_Reform",
    "snippet": "At the Provincial level, there are 48 Directorates of Health and Population (one per province). The current minister is <strong>Abdelhak Saihi</strong> (since 9 September 2022). Former ministers include: fr:Abderrahmane Benbouzid (January 4, 2020–September 8, 2022) ... In 2020, there were according to the ...",
    "published": "April 15, 2025"
  },
  {
    "title": "Leadership in the Ministry of Health - PMC",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4267023/",
    "snippet": "Incoordination within different sectors and lack of action-oriented heads of departments can happen due to the enormity and complexity of the Ministry. It is important to have capable leadership at every level to drive their organisations to higher achievements.",
    "published": null
  },
  {
    "title": "Governance Roles and Capacities of Ministries of Health: A Multidimensional Framework - PMC",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9056184/",
    "snippet": "21 The steering role of the Ministry was defined as “<strong>the political capacity to guide and lead the social production of health</strong>,” and the Ministry reorganized to achieve its functions in leadership and management, health surveillance, regulation and research and technological development.",
    "published": null
  },
  {
    "title": "Division of Powers - Algeria Public health",
    "url": "https://portal.cor.europa.eu/divisionpowers/Pages/Algeria-Public-health.aspx",
    "snippet": "Ministry of Health, Population and Hospital Reforms (FR)",
    "published": null
  }
]