[
  {
    "title": "Josep Borrell begins his term as President of CIDOB | CIDOB",
    "url": "https://www.cidob.org/en/news/josep-borrell-begins-his-term-president-cidob",
    "snippet": "Following his appointment by the institution’s Board on 13 December, the former head of European diplomacy has begun his agenda as President of CIDOB, <strong>a leading think tank in international relations based in Barcelona</strong>. In his first hours as President of the institution, Josep Borrell has ...",
    "published": null
  },
  {
    "title": "Josep Borrell | CIDOB",
    "url": "https://www.cidob.org/en/expertos/josep-borrell",
    "snippet": "<strong>President of CIDOB (Barcelona Centre for International Affairs).</strong> From 2019 to 2024 he served as the High Representative of the Union for Foreign Affairs an",
    "published": null
  },
  {
    "title": "The Board of CIDOB proposes Josep Borrell for the presidency of the institution | CIDOB",
    "url": "https://www.cidob.org/en/news/board-cidob-proposes-josep-borrell-presidency-institution",
    "snippet": "The Board of CIDOB, meeting in an ordinary session this morning, has proposed <strong>Josep Borrell Fontelles, High Representative of the European Union for Foreign Affairs and Security Policy and Vice-President of the Commission (2019-2024),</strong> to assume the presidency of CIDOB, once the term of office ...",
    "published": null
  },
  {
    "title": "Josep Borrell",
    "url": "https://www.realinstitutoelcano.org/en/biographies/josep-borrell/",
    "snippet": "Josep Borrell is <strong>Senior Distinguished Fellow at the Elcano Royal Institute, and president of CIDOB (Barcelona Centre for International Affairs).</strong>",
    "published": "April 10, 2025"
  },
  {
    "title": "Borrell debuts as President of the CIDOB think tank",
    "url": "https://thediplomatinspain.com/en/2025/04/04/borrell-debuts-as-president-of-the-cidob-think-tank/",
    "snippet": "<strong>Josep Borrell took office this Wednesday as president of CIDOB</strong>, the think tank specializing in international relations.",
    "published": "April 2, 2025"
  }
]