[
  {
    "title": "Jerry Richardson - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jerry_Richardson",
    "snippet": "Richardson and businessman <strong>Hugh McColl purchased the naming rights to the University of North Carolina at Charlotte&#x27;s football field in 2011.</strong> The stadium was named Jerry Richardson Stadium in 2013 after an additional $10 million donation.",
    "published": "August 10, 2025"
  },
  {
    "title": "A controversial history: Timeline of Jerry Richardson’s life, career and team ownership",
    "url": "https://www.charlotteobserver.com/sports/nfl/carolina-panthers/article272670415.html",
    "snippet": "I do not believe there is a culture to discriminate against anyone,” Richardson said in a 1994 Charlotte Observer story. Sept. 3, 1995: The Carolina Panthers play their first game, losing to the Atlanta Falcons 23-20 in overtime. Oct. 15, 1995: The Panthers win their first game in franchise history, a 26-15 victory over the New York Jets. They finish 7-9 in their first season. 3/02/96 4G Panthers coach Dom Capers (from left), Panthers owner Jerry Richardson and his son, Jon, director of stadium operations, salute one of their own, Panthers quarterback Kerry Collins, at a fund-raiser for the Juvenile Diabetes Association.",
    "published": "March 6, 2023"
  },
  {
    "title": "Jerry Richardson Net Worth, Carolina Panthers & Business Ventures",
    "url": "https://www.888sport.com/blog/jerry-richardson-net-worth",
    "snippet": "David Tepper won a competitive period of bidding to purchase the Panthers from Richardson for a then-record $2.2 million in May 2018. Richardson was fined around £2 million for workplace misconduct in June of the same year. After promising to bring a Super Bowl to Carolina, Richardson was never able to deliver, despite the Panthers featuring in betting for the Big Game on two occasions. The Carolina Panthers’ minority ownership parties gifted a statue to Jerry Richardson for his 80th birthday in 2016.",
    "published": "August 29, 2024"
  },
  {
    "title": "ESPN.com - Jerry Jones laments exit of Jerry Richardson from ownership ranks",
    "url": "https://www.espn.com/espn/print?id=21801332",
    "snippet": "Jerry Jones was <strong>four years</strong> into his ownership tenure of the Dallas Cowboys when Jerry Richardson was awarded an expansion franchise by the NFL in 1993.",
    "published": null
  },
  {
    "title": "Panthers founder Jerry Richardson remembered by complicated legacy",
    "url": "https://www.sportsbusinessjournal.com/Daily/Issues/2023/03/03/People-and-Pop-Culture/jerry-richardson-legacy.aspx",
    "snippet": "The Carolina Panthers began playing in 1995 and Jerry Richardson owned them <strong>until 2018,</strong> when he sold the team under pressure to current owner David Tepper.",
    "published": null
  }
]