[
  {
    "title": "Kevin Volland - Soccer News, Rumors, & Updates | FOX Sports",
    "url": "https://www.foxsports.com/soccer/kevin-volland-player",
    "snippet": "Impact <strong>Volland made his way back into team training during Friday&#x27;s session</strong>. The forward will be asked to lead the line in a big role in the back half of the season following the departure of Kevin Behrens to Wolfsburg.",
    "published": null
  },
  {
    "title": "Nach Verletzung in Ingolstadt: Haugen bereits operiert",
    "url": "https://sechzger.de/nach-verletzung-in-ingolstadt-haugen-bereits-operiert/",
    "snippet": "<strong>Auch er musste in Ingolstadt verletzt das Feld verlassen</strong>. Aufgrund der parallel gezeigten gelb-roten Karte, die Babak Rafati bei liga3-online.de als Fehlentscheidung bewertete, muss Kevin am letzten Spieltag ohnehin gesperrt passen.",
    "published": "20 hours ago"
  },
  {
    "title": "Kevin Volland | MLSsoccer.com",
    "url": "https://www.mlssoccer.com/players/kevin-volland/",
    "snippet": "News · Video · Player Details · Kevin Volland · 5&#x27; 10&quot; 181 lbs · 7.30.1992 (33) Marktoberdorf, Germany · Midfielder · Latest News · Latest News · Latest Video · Latest Video · Career Summary · CURRENT CLUB: Hoffenheim (Germany) Kevin Volland is a young right winger scored 11 goals and assisted on 9 others in the Bundesliga this season.",
    "published": null
  },
  {
    "title": "Kevin Volland Soccer Stats & News",
    "url": "https://www.rotowire.com/soccer/player/kevin-volland-17246",
    "snippet": "<strong>Volland will leave Union Berlin in the summer to rejoin his former club TSV 1860 Munich in the German third division</strong>, the club announced. &quot;Kevin has made an important contribution to the Union - his experience was particularly valuable during a difficult sporting period.",
    "published": null
  },
  {
    "title": "Kevin Volland - Attack | Bayer 04",
    "url": "https://www.bayer04.de/en-us/player/werkself/legends/kevin-volland",
    "snippet": "After four years at Bayer 04, <strong>Kevin Volland is joining top French club AS Monaco</strong> with immediate effect. The club, that only hired coach Niko Kovac last month, have bought out the 28-year-old Volland from his contract that was due to run to 30 ...",
    "published": null
  }
]