[
  {
    "title": "Curtis Samuel: \"Lead By Example\"",
    "url": "https://www.buffalobills.com/video/curtis-samuel-lead-by-example",
    "snippet": "Buffalo Bills Wide Receiver Curtis Samuel meets with the media at training camp. Topics Include: Working with Joe Brady in the training camp setting after being with him in Carolina, the different skill sets in the receiver room, and his leadership style. ... Bills Left Tackle Dion Dawkins addressed the media after practice on December 11th, 2025...",
    "published": "July 26, 2024"
  },
  {
    "title": "Curtis Samuel - Buffalo Bills Wide Receiver - ESPN",
    "url": "https://www.espn.com/nfl/player/_/id/3121427/curtis-samuel",
    "snippet": "View the profile of Buffalo Bills Wide Receiver Curtis Samuel on ESPN. Get the latest news, live stats and game highlights.",
    "published": null
  },
  {
    "title": "Buffalo Bills place WR Curtis Samuel on Injured Reserve in Week 13 | Buffalo Rumblings",
    "url": "https://www.buffalorumblings.com/buffalo-bills-news/123509/buffalo-bills-place-wr-curtis-samuel-on-injured-reserve-in-week-13",
    "snippet": "<strong>Curtis Samuel has now been placed on Injured Reserve (IR),</strong> while wide receiver Gabe Davis has been signed to the active 53-man roster off of Buffalo’s practice squad. Samuel is set to miss at least the team’s next four games, which would ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Does Curtis Samuel fit in Buffalo Bills' 2025 offense?",
    "url": "https://buffalonews.com/sports/professional/nfl/bills/article_023f3a54-e6d3-4185-9fcc-a81b56236e0a.html",
    "snippet": "Ahead of the Bills’ second preseason game in Chicago, coach Sean McDermott called Samuel an “important piece,” but the team needed to see how he fits in their offense for 2025. Though Samuel participated in team drills for just three padded practices, he was on the initial 53-man roster announced Tuesday. “I know what I’m capable of doing when I’m out there,” Samuel told The Buffalo News recently.",
    "published": "August 28, 2025"
  },
  {
    "title": "Buffalo Bills' WR faces injury concerns after Week 15 win over New England Patriots",
    "url": "https://www.si.com/nfl/bills/onsi/buffalo-bills-wr-faces-injury-concerns-after-week-15-win-over-new-england-patriots",
    "snippet": "Buffalo also has Mecole Hardman eligible to return from Injured Reserve in Week 16, giving it another option on the outside if needed. Additionally, <strong>Curtis Samuel remains on IR, eligibile to return in Week 17.</strong>",
    "published": "1 day ago"
  }
]