[
  {
    "title": "Warner Bros. Discovery - Discovery Communications Agrees to Take Full Control of Eurosport",
    "url": "https://ir.corporate.discovery.com/news-and-events/financial-news/financial-news-details/2015/Discovery-Communications-Agrees-to-Take-Full-Control-of-Eurosport/default.aspx",
    "snippet": "– <strong>Discovery Communications (Nasdaq: DISCA, DISCB, DISCK) today announced an agreement to acquire full ownership of Eurosport, the leading sports channels group across Europe and Asia, for €491 million from TF1 Group</strong>, which has announced it will exercise a put option on its 49% ownership ...",
    "published": null
  },
  {
    "title": "Warner Bros. Discovery - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Warner_Bros._Discovery",
    "snippet": "The American division manages the ... in 2023, while <strong>the European division handles international sports operations, including Eurosport and TNT Sports UK</strong>, and Warner Bros. Discovery Sports Latin America which owns the sports channel TNT Sports LATAM which replaces Esporte ...",
    "published": "11 hours ago"
  },
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "On 5 January 2021, Discovery began ... company formed after the merger of Discovery with WarnerMedia—<strong>announced an agreement to contribute Eurosport&#x27;s United Kingdom operations into a joint venture with BT Group</strong>....",
    "published": "5 days ago"
  },
  {
    "title": "AT&T and Discovery Close WarnerMedia Transaction",
    "url": "https://about.att.com/story/2022/close-warnermedia-transaction.html",
    "snippet": "The new company combines WarnerMedia’s premium entertainment, sports and news assets with Discovery’s leading non-fiction and international entertainment and sports businesses, including Discovery Channel, discovery+, Warner Bros. Entertainment, CNN, CNN+, DC, Eurosport, HBO, HBO Max, HGTV, Food Network, Investigation Discovery, TLC, TNT, TBS, truTV, Travel Channel, MotorTrend, Animal Planet, Science Channel, New Line Cinema, Cartoon Network, Adult Swim, Turner Classic Movies and others.",
    "published": null
  },
  {
    "title": "Warner Bros. Discovery International - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Warner_Bros._Discovery_International",
    "snippet": "<strong>On 21 January 2014, Discovery acquired an additional 51% share to gain controlling interest, and subsequently acquired the remainder for €491 million in July 2015 to receive sole ownership</strong>.",
    "published": "6 days ago"
  }
]