[
  {
    "title": "VfL Wolfsburg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/VfL_Wolfsburg",
    "snippet": "Professional football is run by the spin-off organization VfL Wolfsburg-Fußball GmbH, a wholly owned subsidiary of the Volkswagen Group. Since 2002, Wolfsburg&#x27;s stadium is the <strong>Volkswagen Arena</strong>. The city of Wolfsburg was established on 1 July 1938 under the name Stadt des KdF-Wagens bei ...",
    "published": "1 day ago"
  },
  {
    "title": "Volkswagen Arena - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volkswagen_Arena",
    "snippet": "<strong>Volkswagen Arena</strong> (German pronunciation: [ˈfɔlksvaːɡn̩ ʔaˌʁeːnaː]; also known as the VfL Wolfsburg Arena due to UEFA sponsorship regulations) is a football stadium in the German city of Wolfsburg, Lower Saxony. It was opened in 2002 and named after the automotive group Volkswagen AG.",
    "published": "1 month ago"
  },
  {
    "title": "Stadium | Volkswagen Arena and AOK Stadion | VfL Wolfsburg",
    "url": "https://www.vfl-wolfsburg.de/en/stadium",
    "snippet": "The stadium also includes non-smoking and family areas in order to provide a safe environment for children and to make a visit to the <strong>Volkswagen Arena</strong> an enjoyable experience for all ages. Due to its central location, the <strong>Volkswagen Arena</strong> and adjacent AOK Stadion - home to the VfL Ladies as ...",
    "published": null
  },
  {
    "title": "Volkswagen Arena: a modern stadium in the heart of Wolfsburg",
    "url": "https://www.sergeferrari.com/volkswagen-arena-modern-stadium-heart-wolfsburg",
    "snippet": "The <strong>Volkswagen Arena</strong> in Wolfsburg has been the home stadium of VfL Wolfsburg since 2002. The Arena, located in the Allerpark, has a capacity of 35,000 spectators. In addition to soccer matches, the <strong>Volkswagen Arena</strong> is also a venue for concerts and other events.",
    "published": null
  },
  {
    "title": "Volkswagen Arena - Wolfsburg - The Stadium Guide",
    "url": "https://www.stadiumguide.com/volkswagenarena/",
    "snippet": "The <strong>Volkswagen Arena</strong> is located just north-east of Wolburg’s main railway station and city centre. The walk to the stadium, during which you cross the railroad tracks and a canal, will take about 15 to 20 minutes.",
    "published": "April 27, 2017"
  }
]