[
  {
    "title": "Politics of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Kyrgyzstan",
    "snippet": "<strong>In 2017, he endorsed Prime minister Sooronbay Jeenbekov for president</strong>, who won that year&#x27;s presidential contest. After Atambayev retired from presidency, he began criticizing Jeenbekov and their relations worsened over time. Soon Atambayev was accused of corruption by the Jeenbekov administration.",
    "published": "3 weeks ago"
  },
  {
    "title": "BTI 2024 Kyrgyzstan Country Report: BTI 2024",
    "url": "https://bti-project.org/en/reports/country-report/KGZ",
    "snippet": "While a constitutional law governing the institution is still being drafted, the first congressional meeting was convened in November 2022 by presidential decree. However, the meeting resulted in no notable political outcome. ... Kyrgyzstan’s key democratic institutions have seen their legitimacy eroded since late 2020.",
    "published": null
  },
  {
    "title": "Kyrgyzstan - Politics, Society, Culture | Britannica",
    "url": "https://www.britannica.com/place/Kyrgyzstan/Government-and-society",
    "snippet": "<strong>After Bakiyev was ousted in 2010, the Social Democratic Party of Kyrgystan (SDPK), formed in 1993, began to dominate the political realm</strong>. By the end of the 2010s, however, political infighting had fractured the party into multiple factions.",
    "published": "July 26, 1999"
  },
  {
    "title": "Kyrgyzstan - 2022 World Factbook Archive",
    "url": "https://www.cia.gov/the-world-factbook/about/archives/2022/countries/kyrgyzstan",
    "snippet": "<strong>Former prime minister and ruling Social-Democratic Party of Kyrgyzstan member, Sooronbay JEENBEKOV, replaced him after winning the 2017 presidential election</strong>, which was the most competitive in the country’s history, although international ...",
    "published": null
  },
  {
    "title": "Another revolution in Kyrgyzstan? - European Parliament",
    "url": "https://www.europarl.europa.eu/RegData/etudes/ATAG/2020/659300/EPRS_ATA(2020)659300_EN.pdf",
    "snippet": "Kyrgyzstan is plagued by periodic instability. <strong>Since becoming independent from the Soviet Union in 1991, it has been through two revolutions (in 2005 and 2010) and ethnic clashes (in 2010).</strong> The political landscape · remains highly volatile, with no fewer than 14 prime ministers since 2010, ...",
    "published": null
  }
]