[
  {
    "title": "Scott Morrison - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Scott_Morrison",
    "snippet": "Morrison&#x27;s government passed the stage three tax cuts and responded to the COVID-19 pandemic in Australia. Under his leadership, the National Cabinet was established, and Australia received praise during 2020 for being one of the few Western countries to successfully suppress the virus, though the slow initial pace of the COVID-19 vaccination rollout was criticised.",
    "published": "1 week ago"
  },
  {
    "title": "Scott Morrison | Biography, Education, & Previous Offices | Britannica",
    "url": "https://www.britannica.com/biography/Scott-Morrison",
    "snippet": "Scott Morrison (born May 13, 1968, Bronte, New South Wales, Australia) is an Australian conservative politician who served as <strong>leader of the Liberal Party and prime minister of Australia (2018–22)</strong>.",
    "published": "August 30, 2018"
  },
  {
    "title": "Scott Morrison: Rise and fall of Australia's divisive pandemic leader",
    "url": "https://www.bbc.com/news/world-australia-45292331",
    "snippet": "Former Australian Prime Minister Scott Morrison says he will quit parliament, drawing the curtain on a 17-year political career defined by pragmatism, conservatism and numerous controversies.",
    "published": "January 23, 2024"
  },
  {
    "title": "Scott Morrison | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/politics-and-government/scott-morrison",
    "snippet": "Significance: Scott Morrison, a ... 2018 following a leadership vote. His experience included <strong>housing and local government, immigration, and treasury portfolios</strong>....",
    "published": null
  },
  {
    "title": "Scott Morrison - Students | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/students/article/Scott-Morrison/631533",
    "snippet": "Scott Morrison was the <strong>prime minister of Australia from 2018 to 2022. He also served as leader of the Liberal Party</strong>. Morrison began his political career as a moderate but…",
    "published": null
  }
]