[
  {
    "title": "Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mahathir_Mohamad",
    "snippet": "Mahathir bin Mohamad (Jawi: محاضر بن محمد; IPA: [mahaðɪ(r) bɪn mohamad]; born 10 July 1925) is a Malaysian politician, author and doctor who served as the fourth and seventh prime minister of Malaysia from 1981 to 2003 and again from 2018 to 2020.",
    "published": "3 days ago"
  },
  {
    "title": "Mahathir bin Mohamad | Facts & Biography | Britannica",
    "url": "https://www.britannica.com/biography/Mahathir-bin-Mohamad",
    "snippet": "Last updated Dec. 3, 2025 •History ... Mahathir bin Mohamad (born July 10, 1925, Alor Setar, Kedah [Malaysia]) is a Malaysian politician who served as prime minister of Malaysia (1981–2003; 2018–20), overseeing the country’s transition to an industrialized nation.",
    "published": "July 20, 1998"
  },
  {
    "title": "Mahathir Mohamad’s Legacy: Triumph Over Health Battles and Political Turbulence (2025 Update) – THAI.NEWS – Thailand Breaking News",
    "url": "https://thai.news/news/thailand/mahathir-mohamads-legacy-triumph-over-health-battles-and-political-turbulence-2025-update",
    "snippet": "Mahathir Mohamad really is an icon. His ability to lead at his age is commendable, but isn’t it time to pass the baton to the younger generation? ... Younger leaders may not have the experience or gravitas he has. Experience counts for a lot in politics.",
    "published": null
  },
  {
    "title": "Political positions of Mahathir Mohamad - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Political_positions_of_Mahathir_Mohamad",
    "snippet": "In 2020, Mahathir expressed support for Joe Biden in the 2020 United States presidential election, saying that the re-election of Donald Trump would be a &quot;disaster&quot;. In a July 2025 interview with Al Jazeera, Mahathir said that Israel&#x27;s killing of the Palestinian people during the Gaza war would be remembered for &quot;centuries&quot;, and described it as a genocide that paralleled the Holocaust and the killing of Muslims during the Bosnian War.",
    "published": "October 5, 2025"
  },
  {
    "title": "Mahathir Mohamad at 100: Monumental Achievements, Mixed Legacies | FULCRUM",
    "url": "https://fulcrum.sg/mahathir-mohamad-at-100-monumental-achievements-mixed-legacies/",
    "snippet": "Following a brief period in the political wilderness due to his disagreements with Malaysia’s first prime minister (PM), Tunku Abdul Rahman, Mahathir rejoined UMNO in the wake of the May 1969 racial unrest.",
    "published": "July 10, 2025"
  }
]