[
  {
    "title": "Josep Borrell - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Josep_Borrell",
    "snippet": "On 15 May 2024, Borrell called ... needed to stop. In May 2025, after his retirement as an EU diplomat, <strong>Borrell spoke out against Israel&#x27;s actions, accusing Israel of committing genocide in Gaza</strong>....",
    "published": "3 weeks ago"
  },
  {
    "title": "Borrell’s U.S. Broadside Reveals the EU Elite’s Post-National Turn",
    "url": "https://europeanconservative.com/articles/news/borrells-u-s-broadside-reveals-the-eu-elites-post-national-turn/",
    "snippet": "1. Vance ya dejó claro en Munich su menosprecio a Europa, ahora elevado por Trump al rango de Estrategia de Seguridad Nacional. Es una declaración de guerra política a la UE. Quiere una Europa blanca dividida en naciones, sometida a sus exigencias y que vote a quien él quiere. pic.twitter.com/kcUVOg3FLg— Josep Borrell Fontelles (@JosepBorrellF) December 9, 2025",
    "published": "4 days ago"
  },
  {
    "title": "EEAS: High Representative Josep Borrell announces senior nominations | EEAS",
    "url": "https://www.eeas.europa.eu/eeas/eeas-high-representative-josep-borrell-announces-senior-nominations-5_en",
    "snippet": "Josep Borrell, <strong>High Representative of the Union for Foreign Affairs and Security Policy/Vice-President of the European Commission</strong> also announces the nomination of two Heads of Delegation of the European Union.",
    "published": null
  },
  {
    "title": "Josep Borrell begins his term as President of CIDOB | CIDOB",
    "url": "https://www.cidob.org/en/news/josep-borrell-begins-his-term-president-cidob",
    "snippet": "Following his appointment by the institution’s Board on 13 December, the former head of European diplomacy has begun his agenda as <strong>President of CIDOB</strong>, a leading think tank in international relations based in Barcelona. In his first hours as President of the institution, Josep Borrell has ...",
    "published": null
  },
  {
    "title": "High Representative Josep Borrell announces senior EEAS nominations – INSIGHT EU MONITORING",
    "url": "https://ieu-monitoring.com/editorial/high-representative-josep-borrell-announces-senior-eeas-nominations/441963",
    "snippet": "He is currently serving as the <strong>Deputy Managing Director for Global Issues</strong>, and before that as Head of Cabinet of former European Commissioner Pierre Moscovici, responsible for Economy, Financial matters, Taxation and Customs. Mr. BAILLY will take up his duties on 1 January 2025.",
    "published": null
  }
]