[
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "UC Santa Cruz Chancellor Cynthia Larive is <strong>set to undergo an overdue five-year performance review</strong>, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  },
  {
    "title": "Cynthia Larive to become 11th chancellor of UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2019/05/chancellor-designate/",
    "snippet": "<strong>The University of California Board of Regents approved Dr. Cynthia K. Larive as the eleventh chancellor of UC Santa Cruz</strong>. Currently the provost and executive vice chancellor at UC Riverside, Larive has served the UC community for nearly a decade ...",
    "published": "May 13, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Under Chancellor Larive’s leadership, <strong>UC Santa Cruz has cemented its place as preeminent research university, with research support now surpassing $200 million annually</strong>. She advanced regional economic development by establishing the Innovation and Business Engagement Hub to connect industry ...",
    "published": null
  },
  {
    "title": "Office of the Chancellor – The Office of the Chancellor at UC Santa Cruz.",
    "url": "https://chancellor.ucsc.edu/",
    "snippet": "Chancellor Cynthia Larive · Campus notification procedures for immigration enforcement (SB 98)December 4, 2025 · Announcing Inspiring Change: The Campaign for UC Santa CruzNovember 16, 2025 · Campus Provost and Executive Vice Chancellor recruitment underwayNovember 7, 2025 ·",
    "published": null
  },
  {
    "title": "Leadership – UC Santa Cruz",
    "url": "https://www.ucsc.edu/about/leadership/",
    "snippet": "As the <strong>11th chancellor of UC Santa Cruz</strong>, Cynthia Larive leads an institution known worldwide for its interdisciplinary approach to research for the public good, for seeking solutions and giving voice to the challenges of our time, and for its commitment to social and environmental justice.",
    "published": null
  }
]