[
  {
    "title": "Mike Downey, Sports columnist who enlightened Times readers for 15 years, dies at 72",
    "url": "https://www.latimes.com/sports/story/2024-06-14/mike-downey-sports-columnist-dies-obit",
    "snippet": "Downey was <strong>single into his late 40s before meeting and marrying the love of his life, Gail Martin Downey, daughter of Dean Martin</strong>.",
    "published": "June 14, 2024"
  },
  {
    "title": "Michael 'Mike' John Downey",
    "url": "https://www.charlescitypress.com/obituaries/2025/04/03/michael-mike-john-downey/",
    "snippet": "Mike is <strong>survived by his partner in life, ministry, and wife of 46 years, Colleen, their five children, three children-in-law, and three grandsons</strong>. Justus (Amy), Simon and Calvin of Greenville, SC, Austin of Columbia, SC, Luke of Chesapeake, ...",
    "published": "April 3, 2025"
  },
  {
    "title": "Mike Downey | Producer, Executive",
    "url": "https://www.imdb.com/name/nm1707603/",
    "snippet": "Mike Downey was born in 1966 in Philadelphia, Pennsylvania, USA. He was a producer and executive, known for 12 and Holding (2005) and Roadie (2011). He was <strong>married to Christen</strong>. He died on 18 March 2024 in Norwood, New Jersey, USA.",
    "published": null
  },
  {
    "title": "Mike Downey, Free Press sports columnist during '84 World Series, dies",
    "url": "https://www.freep.com/story/sports/2024/06/13/mike-downey-free-press-sports-columnist-during-84-world-series-dies/74084710007/",
    "snippet": "His wife, Gail Martin Downey, is a daughter of Dean Martin. They met when she mentioned to a mutual friend how much she enjoyed his writing in the Times, and he revealed their wedding to readers in yet another memorable column. He misspoke only in predicting how the marriage would end. &quot;Some partnerships do break up. Some don’t,&quot; he said. &quot;It is taken on faith that Gail Martin last weekend made a marriage that will last the remainder of her life, when, for reasons only she can explain, she took as her lawfully wedded husband a talent-free and tone-deaf newspaper columnist from the Los Angeles Times.&quot;",
    "published": "June 14, 2024"
  },
  {
    "title": "Mike Downey (columnist) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mike_Downey_(columnist)",
    "snippet": "Mike Downey (August 9, 1951 – June 12, 2024) was an <strong>American newspaper columnist</strong>. He was known for his columns in the Chicago area, such as writing pieces for the Chicago Tribune, the Chicago Sun-Times and Chicago Daily News. In his later years, he began writing for the Los Angeles Times and CNN.",
    "published": "2 weeks ago"
  }
]