[
  {
    "title": "List of Arsenal F.C. managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Arsenal_F.C._managers",
    "snippet": "<strong>On 29 November 2019,</strong> with Arsenal sitting in eighth place in the league, Emery was dismissed as manager and former player and assistant first team coach Freddie Ljungberg was appointed as interim head coach.",
    "published": "6 days ago"
  },
  {
    "title": "Arsenal F.C. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Arsenal_F.C.",
    "snippet": "On 29 November 2019, Emery was dismissed as manager and former player and assistant first team coach Freddie Ljungberg was appointed as interim head coach. On <strong>20 December 2019, Arsenal appointed former club captain Mikel Arteta as the new head coach</strong>. Arsenal finished the 2019–20 season in ...",
    "published": "5 days ago"
  },
  {
    "title": "Mikel Arteta - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mikel_Arteta",
    "snippet": "Interim head coach Freddie Ljungberg remained as assistant coach, and goalkeeping coach Sal Bibbo stayed to work with Caña. On 26 December 2019, Arteta took charge for the first time as an Arsenal manager for their Premier League match against Bournemouth which ended in a 1–1 draw, thanks to a second half equaliser from Pierre-Emerick Aubameyang.",
    "published": "9 hours ago"
  },
  {
    "title": "Arsenal Coaching Staff | Team Behind the Team",
    "url": "https://www.arsenalinsider.com/club/coaching-staff/",
    "snippet": "... The Gunners appointed Mikel Arteta as the latest manager of Arsenal in <strong>December 2019.</strong> He initially replaced Unai Emery at the Emirates Stadium helm with the title of head coach.",
    "published": "July 8, 2025"
  },
  {
    "title": "Arsenal Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=142&teamTabs=managers",
    "snippet": "Arsenal Football Club Managers, full history, past and present. Provided courtesy of Soccerbase.com, the Football Betting Site.",
    "published": null
  }
]