[
  {
    "title": "2025 Labor & Employment Law Developments Tracker | Practical Law",
    "url": "https://content.next.westlaw.com/practical-law/document/I4c182700c77f11ef989cc1f7e8600ddb/2025-Labor-Employment-Law-Developments-Tracker?viewType=FullText&transitionType=Default&contextData=(sc.Default)",
    "snippet": "A Practice Note tracking key US labor and employment law developments, including federal and state court decisions, laws, regulations, and administrative agency guidance decided, enacted, or issued in 2025. The developments tracked here relate to all areas of employment law, excluding traditional labor law and immigration law, which are tracked in separate resources.",
    "published": null
  },
  {
    "title": "Employment Situation Summary - 2025 M11 Results",
    "url": "https://www.bls.gov/news.release/empsit.nr0.htm",
    "snippet": "_________________________________________________________________________________________________ | | | Household Survey Estimates and the Federal Government Shutdown | | | | <strong>There are no household survey estimates for October 2025</strong>...",
    "published": null
  },
  {
    "title": "Employment Situation - 2025 M09 Results",
    "url": "https://www.bls.gov/news.release/empsit.toc.htm",
    "snippet": "Table A-2. Employment status of the civilian population by race, sex, and age",
    "published": null
  },
  {
    "title": "Employment Situation News Release - 2025 M03 Results",
    "url": "https://www.bls.gov/news.release/archives/empsit_04042025.htm",
    "snippet": "Technical Note This news release presents statistics from two major surveys, the Current Population Survey (CPS; household survey) and the Current Employment Statistics survey (CES; establishment survey). The household survey provides information on the labor force, employment, and unemployment that appears in the &quot;A&quot; tables, marked HOUSEHOLD DATA.",
    "published": null
  },
  {
    "title": "Mark A. Aguiar - Princeton University",
    "url": "https://collaborate.princeton.edu/en/persons/mark-a-aguiar/",
    "snippet": "Dive into the research topics where Mark A. Aguiar is active. These topic labels come from the works of this person. Together they form a unique fingerprint. ... Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list · Select a country/territory to view shared publications and projects Close ... Aguiar, M., Mar 2025, In: IMF Economic Review.",
    "published": null
  }
]