[
  {
    "title": "Friedrich Merz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Friedrich_Merz",
    "snippet": "Their son, born in 1981, holds a doctorate in philosophy, their elder daughter is a physician, and their younger daughter is a lawyer. Merz has seven grandchildren. In 2005, Merz and his wife established the Friedrich und <strong>Charlotte Merz</strong> Stiftung, a foundation supporting projects in the education ...",
    "published": "1 week ago"
  },
  {
    "title": "549 Charlotte Friedrich Merz Stock Photos, High-Res Pictures, and Images - Getty Images",
    "url": "https://www.gettyimages.com/photos/charlotte-friedrich-merz",
    "snippet": "Friedrich Merz, leader of the German Christian Democrats , and his wife <strong>Charlotte Merz</strong> celebrate with members of the CDU constituency in his... Local CDU Constituency Confirms Friedrich Merz As Chancellor Candidate",
    "published": null
  },
  {
    "title": "Germany's Friedrich Merz: The risk-taker who flirted with far right - Kahawatungu",
    "url": "https://kahawatungu.com/germanys-friedrich-merz-the-risk-taker-who-flirted-with-far-right/",
    "snippet": "Merz was born in the west German town of Brilon in 1955 into a prominent conservative, Catholic family. His father served as a local judge, as does Friedrich Merz’s wife Charlotte to this day.",
    "published": "February 23, 2025"
  },
  {
    "title": "Charlotte Merz: Age, Net Worth, Family & Career Highlights - Mabumbe",
    "url": "https://mabumbe.com/people/charlotte-merz-age-net-worth-family-career-highlights/",
    "snippet": "<strong>Charlotte Merz (née Gass),</strong> born in 1961 in Saarland, Germany, is a distinguished German judge and the wife of Friedrich Merz, the leader of the Christian Democratic Union (CDU) and Germany’s Chancellor as of May 2025.",
    "published": "May 6, 2025"
  },
  {
    "title": "Charlotte Merz - IMDb",
    "url": "https://www.imdb.com/name/nm13128780/",
    "snippet": "<strong>Charlotte Merz</strong>. Self: Inside CDU. <strong>Charlotte Merz</strong> was born in 1961 in Saarland, Germany. She has been married to Friedrich Merz since June 1981. They have three children.",
    "published": null
  }
]