[
  {
    "title": "Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alfa_Romeo",
    "snippet": "Through the 1920s, Alfa Romeo produced several successful road and race cars, and was well represented in prominent European motorsport events, notably winning the inaugural AIACR World Manufacturers&#x27; Championship at the 1925 Grand Prix season. Nevertheless, the company soon faced financial troubles, leading to Romeo&#x27;s contentious departure in 1928 and Italian government ownership in 1933.",
    "published": "3 weeks ago"
  },
  {
    "title": "Who owns Alfa Romeo? | Alfa Romeo History | Genesis Alfa Romeo",
    "url": "https://www.genesisalfaromeo.com/alfa-romeo-research/who-owns-alfa-romeo/",
    "snippet": "When <strong>Cavalier Ugo Stella purchased the shares of an italian automotive plant in Milan</strong>, the company’s legacy of sport-oriented vehicles began. The name Alfa is actually an acronym for, “Anonima Lombarda Fabbrica Automobili” – A.L.F.A.",
    "published": "April 26, 2021"
  },
  {
    "title": "History of Alfa Romeo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Alfa_Romeo",
    "snippet": "In 1918 the company changed its name to &quot;Alfa Romeo&quot; following the acquisition of control of the company by Nicola Romeo. <strong>In 1933 ownership of Alfa Romeo passed, through IRI, to the Italian state</strong> because of the heavy debt the company had incurred with banks since the previous decade.",
    "published": "October 20, 2025"
  },
  {
    "title": "Who Owns Alfa Romeo | Alfa Romeo FIAT of Santa Monica",
    "url": "https://www.alfaromeousaofsantamonica.com/the-ownership-history-of-alfa-romeo/",
    "snippet": "While Alfa Romeo is a long-respected ... “Who owns Alfa Romeo now?” <strong>Fiat-Chrysler Automobiles (FCA) purchased the automaker in 2007 and then later merged with the PSA group to form Stellantis</strong>....",
    "published": "January 11, 2025"
  },
  {
    "title": "The History of Alfa Romeo - Jeff D'Ambrosio Alfa Romeo Blog",
    "url": "https://www.alfaromeousaofdowningtown.com/blogs/5783/the-history-of-alfa-romeo",
    "snippet": "<strong>In the 1990s, Alfa Romeo faced financial difficulties and was acquired by the Fiat Group</strong>. This change in ownership marked a new direction for the brand. Under Fiat’s management, Alfa Romeo underwent a revitalization, with a focus on design, ...",
    "published": "June 7, 2024"
  }
]