[
  {
    "title": "Politics of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Sudan",
    "snippet": "<strong>In 1993, Sudan transformed into an Islamic totalitarian one-party state</strong> as al-Bashir abolished the Revolutionary Command Council and created the National Islamic Front (NIF) with a new parliament and government obtained solely by members of the NIF, and proclaimed himself President of Sudan.",
    "published": "3 weeks ago"
  },
  {
    "title": "History of Sudan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_Sudan",
    "snippet": "From 1948, 13 delegates, nominated by the British authorities, represented the south on the Sudan Legislative Assembly. Many southerners felt betrayed by the British, because they were largely excluded from the new government. The language of the new government was Arabic, but the bureaucrats and politicians from southern Sudan had, for the most part, been trained in English.",
    "published": "2 weeks ago"
  },
  {
    "title": "Sudan - Politics, Governance, Conflict | Britannica",
    "url": "https://www.britannica.com/place/Sudan/Political-process",
    "snippet": "Sudan - Politics, Governance, Conflict: <strong>Multiparty politics, banned after the 1989 coup, was reintroduced in 1999</strong>. The National Congress Party (formerly the Islamic National Front; NIF), long the only legal party, continued to dominate the political ...",
    "published": "July 26, 1999"
  },
  {
    "title": "69. Republic of the Sudan (1956-present)",
    "url": "https://uca.edu/politicalscience/home/research-projects/dadm-project/sub-saharan-africa-region/70-republic-of-sudan-1956-present/",
    "snippet": "The five-member Supreme Council of the Armed Forces (SCAF) headed by Lt. <strong>General Ibrahim Ibboud took control of the government and proclaimed Sudan a “democratic republic” on November 18, 1958</strong>.",
    "published": null
  },
  {
    "title": "Sudan country profile - BBC News",
    "url": "https://www.bbc.com/news/world-africa-14094995",
    "snippet": "<strong>1955-1972 - First Sudanese Civil War, between north and south over demands for more regional autonomy by southern Sudan region</strong>. Some 500,000 are estimated to have been killed. A 1972 peace agreement fails to satisfactorily dispel tensions.",
    "published": "September 13, 2023"
  }
]