[
  {
    "title": "FiveThirtyEight - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FiveThirtyEight",
    "snippet": "<strong>In April 2018,</strong> it was announced that FiveThirtyEight would be transferred to ABC News from ESPN, Inc., majority owned by The Walt Disney Company. ABC News Live streaming channel was launched on Roku in May 2019.",
    "published": "1 month ago"
  },
  {
    "title": "FiveThirtyEight moves to ABC News, continuing ESPN transition away from politics and personality-focused sites",
    "url": "https://awfulannouncing.com/espn/fivethirtyeight-moves-to-abc-news-continuing-espn-transition-away-from-politics.html",
    "snippet": "<strong>This comes after reports ESPN was looking to sell the site or spin it off; instead, they&#x27;re moving it internally within Disney</strong>. This makes sense as part of ESPN&#x27;s larger shifts away from politics and personality-focused sites.",
    "published": "April 17, 2018"
  },
  {
    "title": "FiveThirtyEight joins ABC News - ABC News",
    "url": "https://abcnews.go.com/US/fivethirtyeight-joins-abc-news/story?id=54531745",
    "snippet": "<strong>Nate Silver and team move from ESPN to ABC</strong>. ... Today ABC News announced it has reached an agreement in principle to acquire the renowned data journalism organization FiveThirtyEight from ESPN.",
    "published": "April 17, 2018"
  },
  {
    "title": "Welcome to the new 538 website - ABC News",
    "url": "https://abcnews.go.com/538/introducing-538-abc-news/story?id=103218541",
    "snippet": "But fans of the old site shouldn’t worry — all of the articles published prior to today will remain online. Old links to specific articles will still work, although www.fivethirtyeight.com will redirect to our new home at ABC News.",
    "published": "September 18, 2023"
  },
  {
    "title": "FiveThirtyEight is shutting down as part of broader cuts at ABC and Disney | Nieman Journalism Lab",
    "url": "https://www.niemanlab.org/2025/03/fivethirtyeight-is-shutting-down-as-part-of-broader-cuts-at-abc-and-disney/",
    "snippet": "In 2013, Silver left The New York Times (Sullivan wrote about that, too) and took FiveThirtyEight to ESPN. Under parent company Disney, <strong>it was transferred from ESPN to ABC News in 2018</strong> as ESPN sought to distance itself from political commentary, ...",
    "published": null
  }
]