[
  {
    "title": "Kevin Volland | MLSsoccer.com",
    "url": "https://www.mlssoccer.com/players/kevin-volland/",
    "snippet": "Kevin Volland is a young right winger scored 11 goals and assisted on 9 others in the Bundesliga this season. He is the captain of the Under-21 German national team. ... Volland made his senior international debut against Poland on May 13th. ... Volland started his career with <strong>1860 Munich</strong> in the ...",
    "published": null
  },
  {
    "title": "Kevin Volland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kevin_Volland",
    "snippet": "After starting his football career with <strong>FC Thalhofen</strong>, Volland transferred to FC Memmingen&#x27;s C-Youth squad, playing in the Bavarian League, the top amateur division at that time. After relegation in 2006, he moved on to TSG Thannhausen, in order to remain in the higher division.",
    "published": "3 weeks ago"
  },
  {
    "title": "Kevin Volland Soccer Stats & News",
    "url": "https://www.rotowire.com/soccer/player/kevin-volland-17246",
    "snippet": "ANALYSIS Volland will leave Union Berlin after two years at the club and four goals scored across all competitions. He will return to his former club <strong>TSV 1860 Munich</strong> where his professional career began before moving on to Hoffenheim and Leverkusen and later spending time abroad with Monaco ...",
    "published": null
  },
  {
    "title": "Kevin Volland stats and ratings | Sofascore",
    "url": "https://www.sofascore.com/football/player/kevin-volland/117373",
    "snippet": "Last player match was <strong>TSV 1860 München</strong> - 1. FC Schweinfurt 05 (3 - 1) and Kevin Volland received 7.4 Sofascore rating. <strong>TSV 1860 München</strong> is playing their next match on Dec 13, 2025, 1:00:00 PM UTC against FC Ingolstadt 04 - <strong>TSV 1860 München</strong> in 3. Liga. If Kevin Volland is going to be in TSV ...",
    "published": null
  },
  {
    "title": "Kevin Volland's Ultimate Team History | FUTWIZ",
    "url": "https://www.futwiz.com/player/history/200610",
    "snippet": "In total, Kevin Volland has played for 5 different clubs in Ultimate Team.",
    "published": null
  }
]