[
  {
    "title": "Jesse Ventura - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
    "snippet": "He had a lengthy tenure in the ... acting career, appearing in films such as Predator and The Running Man. Ventura <strong>entered politics in 1991 when he was elected mayor of Brooklyn Park, Minnesota</strong>, a position he held until 1995....",
    "published": "3 days ago"
  },
  {
    "title": "Jesse Ventura - Ballotpedia",
    "url": "https://ballotpedia.org/Jesse_Ventura",
    "snippet": "Jesse Ventura was the <strong>Governor of Minnesota</strong>. Ventura assumed office on January 8, 1999. Ventura left office on January 6, 2003. Ventura (Green Party of Alaska, Unaffiliated) ran for election for President of the United States. Ventura (Green Party of Alaska) lost in the general election on ...",
    "published": null
  },
  {
    "title": "Jesse Ventura | The Institute of Politics at Harvard University",
    "url": "https://iop.harvard.edu/fellows/jesse-ventura",
    "snippet": "JESSE VENTURA was elected the 38th Governor of Minnesota on November 3, 1998 defeating Attorney General Hubert H. (Skip) Humphrey III and St. Paul Mayor Norm Coleman. He served as Governor for one term. Shocking the political establishment, Ventura became the only Reform Party candidate to ...",
    "published": null
  },
  {
    "title": "Jesse Ventura | Biography & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Jesse-Ventura",
    "snippet": "His first foray into politics was as <strong>mayor of Brooklyn Park (1991–95)</strong>. In the late 1990s he worked as a radio shock jock. ... In 1998 Ventura ran for governor of Minnesota as the Reform Party candidate.",
    "published": "January 14, 2009"
  },
  {
    "title": "Jesse Ventura | Research Starters | EBSCO Research",
    "url": "https://www.ebsco.com/research-starters/biography/jesse-ventura",
    "snippet": "Ventura&#x27;s political career began in 1990, when he <strong>ran for mayor of Brooklyn Park</strong>, a suburb of Minneapolis. He ran as an independent, hoping to break what he saw as the &quot;good old boy&quot; methods of the incumbent mayor and city council.",
    "published": null
  }
]