[
  {
    "title": "Googleplex - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Googleplex",
    "snippet": "The Googleplex is the corporate headquarters complex of Google and its parent company, Alphabet Inc. It is located at <strong>1600 Amphitheatre Parkway in Mountain View, California</strong>.",
    "published": "3 weeks ago"
  },
  {
    "title": "Where is Google's Headquarters? Main Office Location and Global Offices | Clay",
    "url": "https://www.clay.com/dossier/google-headquarters-office-locations",
    "snippet": "Google&#x27;s main headquarters is located at <strong>1600 Amphitheatre Parkway in Mountain View, California, 94043</strong>. This address places the company&#x27;s primary office in the center of Silicon Valley, a region recognized globally as a hub for technology and innovation.",
    "published": null
  },
  {
    "title": "Google Headquarters and Office Locations | Global Business Footprint",
    "url": "https://websets.exa.ai/websets/directory/google-offices",
    "snippet": "The company&#x27;s international expansion ... — Mountain View, California, United States Google&#x27;s primary headquarters is located at <strong>1600 Amphitheatre Parkway, Mountain View, CA 94043</strong>....",
    "published": null
  },
  {
    "title": "Browse a list of Google’s office locations - About Google",
    "url": "https://about.google/company-info/locations/",
    "snippet": "Each one of our offices is designed to inspire big ideas and build community. Explore our locations around the world. ... Google NYC - St.",
    "published": null
  },
  {
    "title": "Google Headquarters in Mountain View, California, United States | Tripomatic",
    "url": "https://tripomatic.com/en/poi/google-headquarters-poi:35852",
    "snippet": "The Googleplex is the corporate headquarters complex of Google and its parent company, Alphabet Inc. It is located at <strong>1600 Amphitheatre Parkway in Mountain View, California</strong>. The original complex, with 2 million square feet of office space, is ...",
    "published": null
  }
]