[
  {
    "title": "Who Currently Owns Alphabet? A Deep Dive Investigation",
    "url": "https://surgegraph.io/business/who-currently-owns-alphabet",
    "snippet": "Alphabet Inc., the parent company of Google, operates under a <strong>three-class share structure</strong> that heavily informs its ownership and voting power dynamics. This unusual structure has Class A, Class B, and Class C shares.",
    "published": null
  },
  {
    "title": "Alphabet Inc. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
    "snippet": "Before it became a subsidiary of Alphabet, Google Inc. was first structured as the owner of Alphabet. The roles were reversed after a placeholder subsidiary was created for the ownership of Alphabet, at which point the newly formed subsidiary was merged with Google.",
    "published": "1 week ago"
  },
  {
    "title": "Who owns Alphabet in 2025? GOOGL shareholders explained | Capital.com",
    "url": "https://capital.com/en-int/analysis/alphabet-shareholder-who-owns-most-googl",
    "snippet": "Alphabet Inc., the parent company of Google, has <strong>a broad investor base spanning institutions, funds and individual shareholders</strong>. As of November 2025, mutual funds, ETFs and other institutions owned around two-thirds of Alphabet’s stock, reflecting ...",
    "published": null
  },
  {
    "title": "Who Really Owns Google (Alphabet) and Who Controls It - KAMIL FRANEK Business Analytics",
    "url": "https://www.kamilfranek.com/who-owns-google-alphabet/",
    "snippet": "It simply does not make sense to come years later, crying that it is not fair. It was no secret, and Alphabet is quite clear about that in their annual reports. “Our certificate of incorporation provides for a <strong>tri-class capital stock structure</strong>.",
    "published": "March 1, 2023"
  },
  {
    "title": "Alphabet Investor Relations - Home",
    "url": "https://abc.xyz/",
    "snippet": "As Sergey and I wrote in the original founders letter 11 years ago, “Google is not a conventional company. We do not intend to become one” · As part of that, we also said that you could expect us to make “smaller bets in areas that might seem very speculative or even strange when compared ...",
    "published": null
  }
]