[
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The last milestone was the General ... commissions were elected. In 1952 the IMU was also readmitted to the ICSU. The past president of the Union is <strong>Carlos Kenig</strong> (2019–2022)....",
    "published": "February 24, 2025"
  },
  {
    "title": "IMU Executive Committee | International Mathematical Union Leadership 2023-2026",
    "url": "https://www.mathunion.org/organization/imu-executive-committee",
    "snippet": "Carlos E. Kenig (Past President) ... Four former IMU Presidents at the Abel Banquet, on the occasion of the Abel Prize Ceremonies in Oslo, Norway, in May 2007. The picture shows from left to right: L. Lovász, L. Carleson, L. Faddeev, and J.",
    "published": null
  },
  {
    "title": "IMU Leadership 2023 – 2026 | International Mathematical Union",
    "url": "https://www.mathunion.org/organization/imu-leadership-2023-2026",
    "snippet": "ICMI EC Ex-officio Member (Immediate Past President of ICMI) SAR, China · Hiraku Nakajima · ICMI EC Ex-officio Member (IMU President) Japan · Christoph Sorger · ICMI EC Ex-officio Member (IMU Secretary General) France · *CoP was formerly known as the Committee on Electronic Information and Communication (CEIC). Terms of membership are staggered. Ilka Agricola · CoP Chair 2023 – 2026 ·",
    "published": null
  },
  {
    "title": "IMU Leadership 2011-2014 | International Mathematical Union Executive Committee",
    "url": "https://www.mathunion.org/organization/imu-representatives/imu-leadership-2011-2014",
    "snippet": "ICMI EC Ex-officio Member (Past President) New Zealand · Ingrid Daubechies · ICMI EC Ex-officio Member (IMU President) USA · Martin Grötschel · ICMI EC Ex-officio Member (IMU Secretary) Germany · * CEIC terms of membership are staggered. Peter Olver · CEIC Chair ·",
    "published": null
  },
  {
    "title": "IMU - Past and Present: History and Archives of the International Mathematical Union",
    "url": "https://www.mathunion.org/organization/imu-history/imu-past-and-present",
    "snippet": "The first General Assembly of the IMU was held in Strasbourg in 1920, simultaneously with the first post-war International Congress of Mathematicians (ICM). Delegates from eleven countries, all Allied Powers, were present. It was decided to invite neutral countries to join the Union. In contrast, ex-enemies Germany, Austria, Hungary and Bulgaria were explicitly barred from membership. Professor Ch. de la Vallé Poussin from Belgium was elected President for four years and Professor G.",
    "published": null
  }
]