[
  {
    "title": "Chancellor Larive assumes position as new Board Chair for Monterey Bay Economic Partnership - News",
    "url": "https://news.ucsc.edu/2022/04/chancellor-larive-mbep/",
    "snippet": "“MBEP’s goals — equitable ... Campus News · Share on Facebook · Share on LinkedIn · Share on Reddit · Print this Page · Campus News · <strong>October 10, 2025</strong> ·...",
    "published": "March 18, 2025"
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "<strong>UC Santa Cruz Chancellor Cynthia Larive is set to undergo an overdue five-year performance review</strong>, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  },
  {
    "title": "Announcing Inspiring Change: The Campaign for UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2025/11/announcing-inspiring-change-the-campaign-for-uc-santa-cruz/",
    "snippet": "I am deeply grateful to everyone — faculty, staff, students, families, alumni, donors and friends — whose dedication makes UC Santa Cruz the extraordinary place it is. Together, with the help of our closest friends and supporters, we will Inspire Change for the benefit of all. With deep appreciation, Cindy Cynthia Larive Chancellor",
    "published": "November 16, 2025"
  },
  {
    "title": "With expertise in finance, tech, ag, and more, new leaders elected to join UC Santa Cruz Foundation Board of Trustees - News",
    "url": "https://news.ucsc.edu/2025/10/with-expertise-in-finance-tech-ag-and-more-new-leaders-elected-to-join-uc-santa-cruz-foundation-board-of-trustees/",
    "snippet": "“It’s an honor to welcome such talented leaders to the foundation board,” Chancellor Cynthia Larive said. “Their ideas, insights and perspectives will help to advance our work in serving extraordinary students and conducting high-impact research that helps to keep the U.S.",
    "published": "October 13, 2025"
  },
  {
    "title": "Letter from Chancellor Cynthia Larive – UC Santa Cruz",
    "url": "https://www.ucsc.edu/annual-report/letter-from-chancellor-cynthia-larive-2025/",
    "snippet": "Cynthia Larive Chancellor · Last modified: Nov 05, 2025",
    "published": null
  }
]