[
  {
    "title": "Abdel Fattah al-Burhan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdel_Fattah_al-Burhan",
    "snippet": "On 10 November 2023, al-Burhan condemned Israel&#x27;s actions in the Gaza Strip during the Gaza war, saying that &quot;We declare our full solidarity with the Palestinian people and their right to establish their legitimate state on the 1967 borders.&quot; On 16 January 2025, the U.S.",
    "published": "3 weeks ago"
  },
  {
    "title": "Sudan's Burhan rejects any peace plan that leaves RSF intact - Sudan Tribune",
    "url": "https://sudantribune.com/article/307664",
    "snippet": "December 1, 2025 (PORT SUDAN) – ... told various foreign envoys that <strong>any peace proposal that leaves the paramilitary Rapid Support Forces (RSF) intact and armed is “totally unacceptable.”</strong> Speaking at a memorial for Sudan ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Sudan's al-Burhan, Saudi crown prince discuss crisis in Riyadh - Sudan Tribune",
    "url": "https://sudantribune.com/article/308208",
    "snippet": "December 15, 2025 (RIYADH) – Abdel Fattah al-Burhan, the <strong>Chairman of the Sudanese Sovereign Council</strong>, held talks with Saudi Crown Prince Mohammed bin Salman in Riyadh on Monday to discuss the crisis in Sudan and the ongoing efforts to achieve ...",
    "published": "17 hours ago"
  },
  {
    "title": "Treasury Sanctions Leader of Sudanese Armed Forces and Weapons Supplier | U.S. Department of the Treasury",
    "url": "https://home.treasury.gov/news/press-releases/jy2789",
    "snippet": "WASHINGTON — Today, the Department of the Treasury’s Office of Foreign Assets Control (OFAC) is sanctioning Abdel Fattah Al-Burhan (Burhan), the leader of the Sudanese Armed Forces (SAF), under Executive Order (E.O.) 14098, “Imposing Sanctions on Certain Persons Destabilizing Sudan and Undermining the Goal of a Democratic Transition.” This action follows the designation of the leader of the Rapid Support Forces (RSF), Mohammad Hamdan Daglo Mousa (Hemedti), on January 7, 2025.",
    "published": "January 16, 2025"
  },
  {
    "title": "Sudan’s Al-Burhan meets Saudi Crown Prince in Riyadh | Al Bawaba",
    "url": "https://www.albawaba.com/news/sudan%E2%80%99s-al-burhan-meets-saudi-crown-1618794",
    "snippet": "شكرًا أخي الكريم، ابن الأكرمين، سمو الأمير محمد بن سلمان. pic.twitter.com/W1WlFMJGCz— A.fatah Alburhan (@aftaburhan) December 15, 2025 · Saudi Arabia committed to mobilizing international support, notably from the United States, for al-Burhan’s roadmap that reinforces SAF authority while sidelining the UAE-backed Rapid Support Forces (RSF), particularly in Darfur, where Abu Dhabi faces accusations of supplying arms via Chad, fueling ethnic violence. The Riyadh summit comes a few days after Egyptian President Abdel Fattah el-Sisi met UAE-aligned Libyan General Khalifa Haftar in Cairo, signaling a coordinated stance against UAE proxy interventions.",
    "published": "17 hours ago"
  }
]