[
  {
    "title": "Viktor Yanukovych - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Viktor_Yanukovych",
    "snippet": "There were no votes against. Of the remaining deputies, 115 were absent and 6 did not vote. Under the 2004 constitution, <strong>parliament chairman Turchynov</strong> became acting president. The vote came an hour after Yanukovych said in a televised address that he would not resign.",
    "published": "1 day ago"
  },
  {
    "title": "Ukraine After Yanukovych | YaleGlobal Online",
    "url": "https://archive-yaleglobal.yale.edu/content/ukraine-after-yanukovych",
    "snippet": "Months of protests led to a week of violence and culminated in Yanukovych’s removal from office. The parliament moved swiftly to reorganize: demobilizing the police, firing most of the government ministers, and electing <strong>Oleksandr Turchynov</strong> as acting president.",
    "published": null
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "After Yanukovych was removed from power in early 2014 as a result of the 2014 Revolution of Dignity, the chairperson of parliament <strong>Oleksandr Turchynov</strong> was appointed to the role of acting president by the Verkhovna Rada in accordance with article 112 of the Constitution of Ukraine.",
    "published": "November 10, 2025"
  },
  {
    "title": "List of presidents of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Ukraine",
    "snippet": "^ &quot;In the event of the pre-term termination of authority of the President of Ukraine in accordance with Articles 108, 109, 110 and 111 of this Constitution, the execution of duties of the President of Ukraine, for the period pending the elections and the assumption of office of the new President of Ukraine, shall be vested in the Chairperson of the Verkhovna Rada of Ukraine.&quot; —Constitution of Ukraine, Article 112. ^ a b Turchynov was appointed acting president after Yanukovych&#x27;s removal from office by parliamentary vote.",
    "published": "October 25, 2025"
  },
  {
    "title": "Oleksandr Turchynov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Oleksandr_Turchynov",
    "snippet": "A day earlier were also scheduled early presidential elections on 25 May, for which <strong>Oleksandr Turchynov</strong> did not register. On 27 February, Arseniy Yatsenyuk was appointed the new prime minister under acting president Turchynov.",
    "published": "2 weeks ago"
  }
]