[
  {
    "title": "Romanian producer Ada Solomon elected chair of the European Film Academy board | Romania Insider",
    "url": "https://www.romania-insider.com/ada-solomon-chair-european-film-academy-board-2025",
    "snippet": "Founded in 1989 by Ingmar Bergman and a group of leading European filmmakers, the European Film Academy promotes the interests of the continent’s film industry. Its leadership has included Wim Wenders, Agnieszka Holland, and, since 2024, Juliette Binoche. ... Producer Ada Solomon has been elected chair of the board of the European Film Academy, marking the highest level of representation the Romanian film industry has achieved within the institution.",
    "published": "3 weeks ago"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "The European Film Academy membership has concluded its voting procedures for the 2026 intake, and as well as re-electing 10 members the election results bring three new members of the board for the next two years. Romanian producer Ada Solomon has been elected chair of the institution’s board.",
    "published": "3 weeks ago"
  },
  {
    "title": "Producer Ada Solomon elected European Film Academy board chair - AGERPRES",
    "url": "https://agerpres.ro/english/2025/12/04/producer-ada-solomon-elected-european-film-academy-board-chair--1508684",
    "snippet": "Ada Solomon has served for six years as deputy chair, working alongside the outgoing board chair, Mike Downey, and had previously been a full board member. She has been a member of the European Film Academy since 2011 and is the first <strong>Romanian</strong> woman to hold a position on its board.",
    "published": null
  },
  {
    "title": "Romania’s Ada Solomon elected chair of European Film Academy board | News | Screen",
    "url": "https://www.screendaily.com/news/romanias-ada-solomon-elected-chair-of-european-film-academy-board/5211635.article",
    "snippet": "<strong>Romanian</strong> producer Ada Solomon has been elected chair of the European Film Academy (EFA) board.",
    "published": "3 weeks ago"
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "The European Film Academy has announced three new board appointments, with Ada Solomon to become chair of the EFA.",
    "published": "3 weeks ago"
  }
]