[
  {
    "title": "Patricia de Lille - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Patricia_de_Lille",
    "snippet": "<strong>Following the May 2019 general elections, De Lille was sworn in as a Member of the National Assembly of South Africa, and was appointed Minister of Public Works and Infrastructure by President Cyril Ramaphosa</strong>. During a cabinet reshuffle in March 2023, she was appointed as Minister of Tourism ...",
    "published": "October 23, 2025"
  },
  {
    "title": "Patricia de Lille - Kids | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/kids/article/Patricia-de-Lille/601990",
    "snippet": "De Lille <strong>entered politics when she was in her 30s</strong>. In 1988 she was elected vice president of the National Council of Trade Unions. The council is one of South Africa’s largest labor groups.",
    "published": null
  },
  {
    "title": "Patricia de Lille - Students | Britannica Kids | Homework Help",
    "url": "https://kids.britannica.com/students/article/Patricia-de-Lille/607278",
    "snippet": "De Lille led the PAC’s delegation to the Convention for a Democratic South Africa, at which South Africa’s post-apartheid constitution was planned. In 1994 de Lille became a member of South Africa’s parliament, the National Assembly.",
    "published": null
  },
  {
    "title": "Patricia De Lille | South African History Online",
    "url": "https://sahistory.org.za/people/patricia-de-lille",
    "snippet": "During this period de Lille <strong>served as the Minister for Social Development of the Western Cape from 2010-2011 and come 2011</strong>, de Lille would succeed fellow DA Member Dan Plato as the Mayor of the City of Cape Town, a position she holds as of February ...",
    "published": null
  },
  {
    "title": "Patricia de Lille | New Climate Economy | Commission on the Economy and Climate",
    "url": "https://newclimateeconomy.net/content/patricia-de-lille",
    "snippet": "From <strong>1994 to 2010</strong> she was a member of the South African Parliament where she served on many portfolio committees including as the Chairperson of the Portfolio Committee on Transport. In 2003, she went on to become the first female Member of Parliament to form her own political party in a democratic ...",
    "published": null
  }
]