[
  {
    "title": "Inside Real Madrid: Is Xabi Alonso still facing the sack? - The Athletic",
    "url": "https://www.nytimes.com/athletic/6881259/2025/12/11/real-madrid-alonso-sack-news-analysis/",
    "snippet": "Despite the loss against City, Alonsos dismissal was not seriously considered last night.",
    "published": "5 days ago"
  },
  {
    "title": "Inside Real Madrid: Have Vinicius Jr and Rodrygo saved Xabi Alonso from the sack? - The Athletic",
    "url": "https://www.nytimes.com/athletic/6890596/2025/12/15/real-madrid-xabi-alonso-job-vinicius-jr-rodrygo/",
    "snippet": "It was the latest example of Alonsos efforts to be closer to Vinicius Jr, who went over to the manager to celebrate Rodrygos winner and hugged him when he was substituted in the 89th minute. When asked about the improvement in their relationship, those closest to the Brazilian pointed out how, since the Olympiacos game on November 26, the coach has been substituting Vinicius Jr less, and later on in games when he has done it. LA CELEBRACIN DE XABI ALONSO Y VINICIUS JR EN EL 1-2 ю#LALIGAenDAZN 斤 pic.twitter.com/95e63rTUcL",
    "published": "1 day ago"
  },
  {
    "title": "Xabi Alonso: \"Eleven Real Madrid players will take the field tomorrow to give their all\"",
    "url": "https://www.realmadrid.com/en-US/news/football/first-team/press-conference/xabi-alonso-rueda-de-prensa-13-12-2025",
    "snippet": "NEWS.13/12/2025Alberto NavarroPhotographer: Antonio Villalba 路 Xabi Alonso appeared in the press room at Real Madrid City on the day before the match against Alav茅s at Mendizorroza, corresponding to the 16th LaLiga matchday: (Sunday, 9:00 pm CET): &quot;We have enough strength and squad despite the unavailable players.",
    "published": "3 days ago"
  },
  {
    "title": "Xabi Alonso: Real Madrid boss granted stay of execution after loss - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cly1ggjlp81o",
    "snippet": "Alonso&#x27;s Real Madrid future uncertain after Man City defeat - analysis 路 ByShamoon Hafez, Football reporter at the Bernabeu and Guillem Balague, BBC Sport Columnist 路 Published 路 11 December 2025 路 727 Comments 路 The deafening jeers that greeted former Barcelona boss Pep Guardiola before kick-off turned into away-fan cheers after Manchester City picked up a magnificent Champions League victory at Real Madrid that leaves Xabi Alonso clinging on to his job.",
    "published": "6 days ago"
  },
  {
    "title": "Real Madrid boss Xabi Alonso backed by Jude Bellingham but facing uncertain future after Man City defeat | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11095/13482040/real-madrid-boss-xabi-alonso-backed-by-jude-bellingham-but-facing-uncertain-future-after-man-city-defeat",
    "snippet": "<strong>Real Madrid were beaten 2-1 by Man City at the Bernabeu in the Champions League as they suffered back-to-back home defeats to raise the pressure on Xabi Alonso</strong>, whose side have won just twice in their last eight games, but Jude Bellingham says ...",
    "published": "5 days ago"
  }
]