[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "In the 1980s, the government of Canada under Prime Minister Brian Mulroney privatized DHC and in 1986 sold the aircraft company to then Seattle-based Boeing. <strong>DHC was eventually acquired by Montreal-based Bombardier Aerospace in 1992</strong> after cumulative losses of US$636 million over five years ...",
    "published": "1 month ago"
  },
  {
    "title": "de Havilland Canada (1928–1986) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada_(1928–1986)",
    "snippet": "Bombardier also had the option to buy the Government of Ontario&#x27;s stake after 4 years. Legally, the original company was retained by Boeing and was eventually succeeded by Boeing Canada in 2005. <strong>In 1997, Bombardier acquired the 49% stake owned by the Government of Ontario</strong>, and in 1998, the ...",
    "published": "November 1, 2025"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "(In the years leading up to the sale, the government had invested hundreds of millions of dollars in de Havilland.) <strong>In 1992, Montreal-based Bombardier and the Ontario government bought de Havilland from Boeing</strong>.",
    "published": null
  },
  {
    "title": "De Havilland Aircraft of Canada Limited",
    "url": "https://www.baesystems.com/en-ca/heritage/de-havilland-canada",
    "snippet": "In 1980, the Canadian Government forced the privatisation of De Havilland Aircraft of Canada and in 1986 it sold the company to Boeing. <strong>The company and name is now in the ownership of Bombardier Aerospace</strong>.",
    "published": null
  },
  {
    "title": "COMPANY NEWS; Bombardier Agrees to Buy De Havilland From Boeing - The New York Times",
    "url": "https://www.nytimes.com/1992/01/23/business/company-news-bombardier-agrees-to-buy-de-havilland-from-boeing.html",
    "snippet": "Since the mid-1980&#x27;s, Bombardier has picked up three other aircraft companies -- Canadair in Quebec, the Learjet Corporation in Kansas and Short Brothers P.L.C. in Northern Ireland. While their total cost was $250 million, they produced sales of $1.5 billion in 1990 alone. 64 Years, Many Owners · The de Havilland company, which has changed hands several times in its 64 years, bears one of the legendary names in Canadian aviation.",
    "published": "January 23, 1992"
  }
]