[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Left_(Germany)",
    "snippet": "Through the PDS, the party is the direct descendant of the Marxist–Leninist ruling party of former East Germany, the Socialist Unity Party of Germany (SED). Since October 2024, Die Linke&#x27;s co-chairpersons have been <strong>Ines Schwerdtner and Jan van Aken</strong>. The party holds 64 seats out of 630 in ...",
    "published": "January 7, 2007"
  },
  {
    "title": "The t-online Interview with the Co-Leader of die Linke in Parliament (Translation) – Baroque",
    "url": "https://baroquecoms.com/2025/09/20/the-t-online-interview-with-the-co-leader-of-die-linke-in-parliament-translation/",
    "snippet": "In this entry, I&#x27;ll translate an interview of t-online where they talked with <strong>Heidi Reichinnek</strong>. She&#x27;s the current leader of die Linke faction in the federal parliament and played a crucial role in the rebound of the party in the 2025 federal ...",
    "published": "September 20, 2025"
  },
  {
    "title": "How Die Linke Turned the Tide - Rosa-Luxemburg-Stiftung",
    "url": "https://www.rosalux.de/en/news?tx_news_pi1%5Baction%5D=detail&tx_news_pi1%5Bcontroller%5D=News&tx_news_pi1%5Bnews%5D=53139&tx_news_pi1%5Bnews_uid%5D=0&cHash=5321afaeb05ad03e08a5bdb33f835544",
    "snippet": "<strong>Ines Schwerdtner and Jan van Aken</strong> have served as co-chairs of Die Linke since October 2024 and were both elected to parliament in the 2025 federal election.",
    "published": "February 25, 2025"
  },
  {
    "title": "The Improbable Resurgence of Die Linke",
    "url": "https://jacobin.com/2025/02/die-linke-germany-renewal-strategy/",
    "snippet": "<strong>Jan van Aken</strong> (L), federal chairman of Die Linke, and member of the Bundestag Gregor Gysi speak at a press conference in Berlin on February 10, 2025.",
    "published": null
  },
  {
    "title": "The Surprising Reincarnation of the German Left Party – AGI",
    "url": "https://americangerman.institute/2025/02/the-surprising-reincarnation-of-the-german-left-party/",
    "snippet": "<strong>Sahra Wagenknecht</strong>, a prominent but highly idiosyncratic Left Party politician, was at the center of many of the conflicts on issues ranging from Ukraine to migration and gender politics.",
    "published": null
  }
]