[
  {
    "title": "Josep Borrell - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Josep_Borrell",
    "snippet": "In July 2019, Borrell was announced as the European Council&#x27;s nominee to be appointed High Representative of the Union for Foreign Affairs and Security Policy. He took office in December 2019. Josep (or José) Borrell Fontelles was born on 24 April 1947 in the Catalan village of La Pobla de Segur, province of Lleida, near the Pyrenees, son of Joan Borrell (father) and Luisa Fontelles Doll (mother).",
    "published": "1 month ago"
  },
  {
    "title": "Josep Borrell - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q312901",
    "snippet": "Real Decreto 38/2000, de 14 de enero, por el que se concede la Gran Cruz de la Orden de Isabel la Católica a don Josep Borrell Fontelles (Spanish)",
    "published": null
  },
  {
    "title": "He achieved ‘nothing’: EU top diplomat Kallas hits back at predecessor Borrell over Gaza",
    "url": "https://www.politico.eu/article/eu-diplomat-kaja-kallas-hits-back-predecessor-josep-borrell-gaza-israel-criticism/",
    "snippet": "The EU’s top diplomat has lost patience with her predecessor’s backseat driving. For months, Kaja Kallas has endured harsh criticism from Josep Borrell, who has publicly lambasted the European Commission for being tepid in its dealings with Israel and failing to address the crisis in Gaza.",
    "published": "September 11, 2025"
  },
  {
    "title": "Josep Borrell - Project Syndicate",
    "url": "https://www.project-syndicate.org/columnist/josep-borrell",
    "snippet": "Josep Borrell is a former high representative of the European Union for foreign affairs and security policy, a former vice-president of the European Commission, a former president of the European Parliament, and a former foreign minister of Spain.",
    "published": null
  },
  {
    "title": "BORRELL FONTELLES (Josep) - BORRELL FONTELLES (Josep) - CVCE Website",
    "url": "https://www.cvce.eu/en/histoire-orale/unit-content/-/unit/5005a4c3-d1a8-44f4-91c8-a235e2a103f9",
    "snippet": "Interview with Josep Borrell Fontelles, Spanish Minister for Public Works (1991–1996), Member of the European Parliament (1996–2004), Member of the Convention on the Future of Europe (2002–2003) and President of the European Parliament (2004–2007), carried out by the Centre Virtuel de la Connaissance sur l’Europe (CVCE) on 13 July 2011 in San Domenico di Fiesole (Florence).",
    "published": null
  }
]