[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "<strong>On 27 May 2025, after making 53 senior England appearances across eight years, Earps announced her retirement from international football</strong>, saying: &quot;This is the right time for me to step aside and give the younger generation an opportunity to thrive.&quot; Shortly before Earps&#x27; announcement, Wiegman ...",
    "published": "1 month ago"
  },
  {
    "title": "Mary Earps has announced her decision to retire from international football",
    "url": "https://www.englandfootball.com/articles/2025/May/27/mary-earps-retires-from-international-football-20252705",
    "snippet": "Mary Earps has today announced her decision to <strong>retire from international football with immediate effect</strong>. The decision marks the end of a memorable eight-year international career and comes as the Lionesses prepare for the culmination of their ...",
    "published": null
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "In early 2021, she even considered her future in the sport, with her Manchester United contract coming towards an end, an England return seeming unlikely, and having several interests away from football, with a degree in information management and business studies from Loughborough University to her name. However, a contract extension at United was signed and the arrival of Sarina Wiegman as England’s head coach reignited her international career. Earps would go on to start the first seven of Wiegman’s games in charge and became an established member of the squad heading towards EURO 2022.",
    "published": null
  },
  {
    "title": "Mary Earps stuns England teammates by retiring from international football | Mary Earps | The Guardian",
    "url": "https://www.theguardian.com/football/2025/may/27/england-goalkeeper-mary-earps-retires-from-international-football-before-euro-2025",
    "snippet": "Mary Earps has shocked her England teammates by <strong>retiring from international football</strong> with immediate effect, saying it is the right time “to step aside and give the younger generation an opportunity to thrive”. Her decision comes only 36 ...",
    "published": "June 5, 2025"
  },
  {
    "title": "Mary Earps - Football Goalkeeper - News, Stats, Bio and more - The Athletic",
    "url": "https://www.nytimes.com/athletic/football/player/mary-earps-3ff2MU2jsagdj9qM/",
    "snippet": "Football · GK · Player Bio · HT/WT · 1.73 m, 68 kg · Age · 32 · Born · 1993-03-07 · Nationality · ENG · England manager Sarina Wiegman&#x27;s &#x27;honest conversations&#x27; come with mixed results · Charlotte Harpur15 · Inside Mary Earps&#x27; shock England retirement: Anger from Wiegman, mixed feelings from team-mates · Charlotte Harpur56 · Mary Earps and the end of an England career that was a testament to willpower ·",
    "published": null
  }
]