[
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an Italian politician who has been serving as the secretary of the Democratic Party (PD) since 12 March 2023. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and a member of the European Parliament.",
    "published": "1 week ago"
  },
  {
    "title": "8th parliamentary term | Elly SCHLEIN | MEPs | European Parliament",
    "url": "https://www.europarl.europa.eu/meps/en/124804/ELLY_SCHLEIN/history/8",
    "snippet": "Profile page - Elly SCHLEIN - Profile page of a current Member of the European Parliament - History of parliamentary service during the 8th legislative term including memberships in political groups, national parties, parliamentary committees and delegations as well as parliamentary activities ...",
    "published": null
  },
  {
    "title": "Elly Schlein – POLITICO",
    "url": "https://www.politico.eu/person/elly-schlein/",
    "snippet": "Schlein, secretary of the center-left <strong>Democratic Party</strong>, has railed against the prime minister for her politics. ... Fading Italian firebrand pins his election chances on a 3km crossing that’s been mooted since Roman times.",
    "published": null
  },
  {
    "title": "Elly Schlein - Sostieni il PD con il tuo 2x1000, SCRIVI M20",
    "url": "https://www.ellyschlein.it/en",
    "snippet": "Il <strong>2 x 1000 al Partito Democratico</strong> non ti costa nulla. Firma e scrivi M20 sulla tua dichiarazione dei redditi",
    "published": "July 18, 2024"
  },
  {
    "title": "Schlein enlarges the majority to Bonaccini and armours herself in the PD. The unknown Conte - Il Sole 24 ORE",
    "url": "https://en.ilsole24ore.com/art/schlein-enlarges-bonaccini-majority-and-armours-pd-the-unknown-count-AIpZvSP",
    "snippet": "Well, it is up to us to prove it: the PD can stand as the party of growth and redistribution&#x27;. In any case, the choice of abstention instead of voting against or not voting, as was the case in the past, is a sign of openness even from the pugnacious group of reformist docs who broke away from Bonaccini&#x27;s Popular Energy at the end of October. And Schlein can bring home an unusual result in the PD, not foreseeable only a few weeks ago: a party that has never been so united and a majority that has never been so large (in addition to Bonaccini&#x27;s area, the former lettiani di Crea, namely Marco Meloni, Anna Ascani and others, as well as the other former competitor at the last congress Gianni Cuperlo, have joined the majority) that supports her as the candidate for the premier and leader of the wide field in view of the 2027 policies.",
    "published": "2 days ago"
  }
]