[
  {
    "title": "The Staff - Paris Saint-Germain Academy Pro Residency Greater Geneva",
    "url": "https://grandgeneve.psgacademypro.com/the-staff/",
    "snippet": "After retiring, he has dedicated over 15 years to the French school system as an educator, ensuring student-athletes not only achieve academic success but also playing an instrumental role in securing college placements for high school graduates. ... With a UEFA A License and over 20 years of experience in youth coaching and development, Elvis has held key roles such as Head Coach and Head of Development for French clubs, as well as Instructor for the Ligue de Football des Pays de la Loire.",
    "published": "July 8, 2020"
  },
  {
    "title": "Paris Saint-Germain - Staff | Transfermarkt",
    "url": "https://www.transfermarkt.us/paris-saint-germain/mitarbeiter/verein/583",
    "snippet": "Trainer, Manager und Co.: Diese Statistik listet alle Mitarbeiter, gegliedert nach ihrer Funktion, von dem Verein PSG auf, die aktuell für den Verein arbeiten.",
    "published": null
  },
  {
    "title": "Paris Saint-Germain Men's Team Coaching Staff",
    "url": "https://www.psg.fr/en/mens-football/staff",
    "snippet": "<strong>Luis Enrique</strong> is the Head coach of the Paris Saint-Germain Men’s football team.View profile · Technical staffTeam managersPerformance StaffMedical StaffVideo AnalystsEquipment staff · Assistant Coach · Assistant Coach · Psychologist · ...",
    "published": null
  },
  {
    "title": "Paris Saint-Germain - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/paris-saint-germain/mitarbeiterhistorie/verein/583",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  },
  {
    "title": "List of Paris Saint-Germain FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Paris_Saint-Germain_FC_managers",
    "snippet": "Under Pochettino, the club achieved its tenth league title. Halilhodžić and Kombouaré each won one Coupe de France, while Le Guen claimed a Coupe de la Ligue. As of 10 December 2025. As of 2025 UEFA Super Cup. ^ On November 4, 1978, Paris Saint-Germain visited Monaco for a league match of ...",
    "published": "4 days ago"
  }
]