[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "In the 1980s, the government of Canada under Prime Minister Brian Mulroney privatized DHC and in 1986 sold the aircraft company to then Seattle-based Boeing. <strong>DHC was eventually acquired by Montreal-based Bombardier Aerospace in 1992</strong> after cumulative losses of US$636 million over five years ...",
    "published": "1 month ago"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "(In the years leading up to the sale, the government had invested hundreds of millions of dollars in de Havilland.) <strong>In 1992, Montreal-based Bombardier and the Ontario government bought de Havilland from Boeing</strong>.",
    "published": null
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "<strong>In 1992, it was acquired by Bombardier Aerospace</strong> after Boeing declared losses of $636 million over five years. In later years, various aircraft programs and type certificates were acquired by other companies.",
    "published": "February 21, 2024"
  },
  {
    "title": "1/31/1986: Boeing Finalizes Purchase of De Havilland Canada",
    "url": "https://www.airwaysmag.com/legacy-posts/boeing-purchase-de-havilland",
    "snippet": "DALLAS — Today, <strong>in 1986, the Boeing Company completed the purchase of Canadian aircraft manufacturer De Havilland Canada (DHC).</strong> The Canadian manufacturer was established in 1928 as a subsidiary of the then-eight-year-old British manufacturer ...",
    "published": null
  },
  {
    "title": "de Havilland Canada (1928–1986) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada_(1928–1986)",
    "snippet": "In the 1980s, the Government of ... the end of DHC as an independent aircraft manufacturer. <strong>The company was put up for sale in 1988 and was eventually acquired by Montreal-based Bombardier Aerospace in 1992</strong>, where it continued to exist as the newly formed de Havilland ...",
    "published": "November 1, 2025"
  }
]