[
  {
    "title": "President of Georgia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Georgia",
    "snippet": "<strong>Salome Zourabichvili</strong> stated on 29 December and during the following weeks that she remained the president of Georgia. Protests against the ruling party have continued since the election, with hundreds of protesters arrested, beaten or tortured by the police and the ruling-party affiliated violent ...",
    "published": "4 weeks ago"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "… This presidential residence was a symbol as long as there was a president here who was legitimate. I bring legitimacy with me,” Zourabichvili told a crowd of supporters outside the palace. She called Kavelashvili’s inauguration a “parody.” · Kavelashvili, 53, who was the only candidate on the ballot, easily won the vote earlier in December given the Georgian Dream party’s control of a 300-seat electoral college that replaced direct presidential elections in 2017.",
    "published": "December 29, 2024"
  },
  {
    "title": "2024 Georgian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2024_Georgian_presidential_election",
    "snippet": "Kazakhstan: President Kassym-Jomart Tokayev sent a letter to Kavelashvili, extending New Year greetings and expressing his &quot;best wishes for a joyous and prosperous 2025&quot;. Hungary: President Tamás Sulyok congratulated Kavelashvili on his election as president. Sulyok emphasized that &quot;Hungary firmly supports the territorial integrity and sovereignty of Georgia and the country&#x27;s European integration efforts&quot;.",
    "published": "November 14, 2025"
  },
  {
    "title": "The Bitter Standoff Over Georgia's Next President",
    "url": "https://www.rferl.org/a/georgia-president-election-mikheil-kavelashvili-salome-zurabishvili-protests/33237724.html",
    "snippet": "<strong>Mikheil Kavelashvili</strong>, a former soccer player, is expected to be elected as the country&#x27;s next president. ... TBILISI -- Georgian President Salome Zurabishvili recently posted a photo of New Year&#x27;s decorations at the presidential residence in Tbilisi.",
    "published": "December 13, 2024"
  },
  {
    "title": "Georgia: Ex-footballer Mikheil Kavelashvili named president",
    "url": "https://www.bbc.com/news/articles/c5ygejxej28o",
    "snippet": "A former Manchester City footballer has been appointed president by Georgia&#x27;s disputed parliament, after 17 days of pro-EU protests that have swept this country&#x27;s towns and cities.",
    "published": "December 14, 2024"
  }
]