[
  {
    "title": "Chancellor of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chancellor_of_Germany",
    "snippet": "On 30 April 1945, when Hitler committed suicide, he was briefly succeeded as Chancellor by <strong>Joseph Goebbels</strong> and as President of Germany by Grand Admiral Karl Dönitz. When Goebbels also committed suicide, Dönitz did not appoint a successor as Chancellor, instead appointing Count Schwerin von ...",
    "published": "2 weeks ago"
  },
  {
    "title": "President of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Germany",
    "snippet": "In Germany the new head of state was called the Reichspräsident. <strong>Friedrich Ebert</strong> served as Germany&#x27;s first president, followed by Paul von Hindenburg. The office effectively came to an end upon Hindenburg&#x27;s death in 1934 when its powers were merged with those of the chancellor.",
    "published": "1 day ago"
  },
  {
    "title": "Germany - Federal Foreign Office",
    "url": "https://www.auswaertiges-amt.de/en/aussenpolitik/germany-230318",
    "snippet": "Name: Federal Republic of Germany · System of government: Democratic parliamentary federal state · Head of State: Federal President <strong>Frank-Walter Steinmeier</strong>, since March 2017 · Representative of the Head of State: President of the Bundesrat, ...",
    "published": null
  },
  {
    "title": "Olaf Scholz | Facts, Biography, Cabinet, & Chancellor of Germany | Britannica",
    "url": "https://www.britannica.com/biography/Olaf-Scholz",
    "snippet": "<strong>Olaf Scholz</strong> (born June 14, 1958, Osnabrück, West Germany [now in Germany]) is a German politician who served as chancellor of Germany from 2021 to 2025. A longtime member of Germany’s center-left Social Democratic Party (SPD), Scholz served ...",
    "published": "March 31, 2022"
  },
  {
    "title": "List of chancellors of Germany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_chancellors_of_Germany",
    "snippet": "The Präsidium (the Prussian king), which now had also the title Emperor, named the chancellor. ... On 9 November 1918, Chancellor Max von Baden handed over his office to <strong>Friedrich Ebert</strong>.",
    "published": "1 week ago"
  }
]