[
  {
    "title": "Socialist Party (France) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Socialist_Party_(France)",
    "snippet": "The PS was for decades the largest party of the &quot;French Left&quot; and <strong>used to be one of the two major political parties under the Fifth Republic</strong>, along with the Rally for the Republic in the late 20th century, and with the Union for a Popular Movement in the early 2000s.",
    "published": "4 weeks ago"
  },
  {
    "title": "Socialist Party (PS) | Britannica",
    "url": "https://www.britannica.com/topic/Socialist-Party-France",
    "snippet": "... Socialist Party (PS), major French political party formally established in 1905. The Socialist Party <strong>traces its roots to the French Revolution</strong>. Its predecessor parties, formed in the 19th century, drew inspiration from political and social ...",
    "published": "July 20, 1998"
  },
  {
    "title": "Socialist Party, France - Oxford Reference",
    "url": "https://www.oxfordreference.com/display/10.1093/oi/authority.20110803100515255",
    "snippet": "<strong>Formed in 1905</strong>, the SFIO (Section Française de l&#x27;Internationale Ouvrière, French Section of the Socialist International) united the hitherto fragmented socialist groups. These included the Marxists under J. Guesde, the revolutionary socialists, ...",
    "published": null
  },
  {
    "title": "Socialist Party of France (1902) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Socialist_Party_of_France_(1902)",
    "snippet": "The Socialist Party of France (Parti socialiste de France) was a socialist political party. The party was <strong>founded in 1902 during a congress in Commentry by the merger of the Marxist French Workers&#x27; Party led by Jules Guesde and the Blanquist Socialist Revolutionary Party of Édouard Vaillant</strong>.",
    "published": "September 21, 2025"
  },
  {
    "title": "French Socialist Party",
    "url": "https://spartacus-educational.com/FRsocialist.htm",
    "snippet": "<strong>The first socialist party formed in France was the Workers Party in 1880</strong>. Its first leader was Paul Lafargue, the son-in-law of Karl Marx. The party suffered from internal divisions and by 1895 had split into five different parties.",
    "published": null
  }
]