[
  {
    "title": "Mediocredito Centrale 2025 Company Profile: Valuation, Funding & Investors | PitchBook",
    "url": "https://pitchbook.com/profiles/company/62465-14",
    "snippet": "Information on valuation, funding, acquisitions, investors, and executives for Mediocredito Centrale. Use the PitchBook Platform to explore the full profile.",
    "published": null
  },
  {
    "title": "Banca del Mezzogiorno – MedioCredito Centrale - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Banca_del_Mezzogiorno_–_MedioCredito_Centrale",
    "snippet": "Banca del Mezzogiorno – MedioCredito Centrale (BdM-MCC) is an Italian bank based in Rome, Lazio region. The bank is <strong>entirely controlled by Invitalia S.p.A., which in turn is owned by the Ministry of Economy</strong>. The bank was specialized in medium-term loan to companies, which developed into corporate ...",
    "published": "April 5, 2025"
  },
  {
    "title": "Mediocredito Centrale Company Overview, Contact Details & Competitors | LeadIQ",
    "url": "https://leadiq.com/c/mediocredito-centrale/6010f38f881cc9057f4bc493",
    "snippet": "Mediocredito Centrale, <strong>controllata da Invitalia</strong>, da impulso alla crescita del Paese sostenendo le Persone e le Imprese, puntando sui settori strategici per lo sviluppo e l’occupazione, impegnandosi nel rilancio delle aree del Mezzogiorno. Nel 2021 siamo diventati un Gruppo bancario a seguito ...",
    "published": null
  },
  {
    "title": "Mediocredito Centrale - Banca del Mezzogiorno S.p.A.",
    "url": "https://dbrs.morningstar.com/issuers/26620/mediocredito-centrale-banca-del-mezzogiorno-spa",
    "snippet": "Morningstar DBRS is the world&#x27;s fourth largest credit ratings agency and a market leader in Canada, the U.S. and Europe in multiple asset classes.",
    "published": null
  },
  {
    "title": "Updates on Banca del Mezzogiorno - MEF Department of Treasury",
    "url": "https://www.dt.mef.gov.it/en/doc_hp/aggiornam_bancamezzog.html",
    "snippet": "Within the context of the project, on 13 September 2010, <strong>ICCREA Holding Spa (the industrial company of the System of Banks of Cooperative Credit – BCC) and Poste Italiane announced that together they have begun to explore the possible acquisition of Mediocredito Centrale (MCC) from Unicredit group</strong>...",
    "published": null
  }
]