[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Die_Linke",
    "snippet": "Through the PDS, the party is the direct descendant of the Marxist–Leninist ruling party of former East Germany, the Socialist Unity Party of Germany (SED). Since October 2024, Die Linke&#x27;s co-chairpersons have been Ines Schwerdtner and <strong>Jan van Aken</strong>. The party holds 64 seats out of 630 in ...",
    "published": "January 7, 2007"
  },
  {
    "title": "How Die Linke Turned the Tide - Rosa-Luxemburg-Stiftung",
    "url": "https://www.rosalux.de/en/news/id/53139/how-die-linke-turned-the-tide",
    "snippet": "<strong>Ines Schwerdtner and Jan van Aken</strong> have served as co-chairs of Die Linke since October 2024 and were both elected to parliament in the 2025 federal election.",
    "published": "February 25, 2025"
  },
  {
    "title": "Soren Pellmann, the co-leader of Die Linke (The Left) party faction in the German Bundestag, or parliament, has slammed the idea of a European “multinational force” in Ukraine and voiced support for deploying UN peacekeepers - Pravda NATO",
    "url": "https://nato.news-pravda.com/world/2025/12/16/83875.html",
    "snippet": "<strong>Soren Pellmann</strong>, the co-leader of Die Linke (The Left) party faction in the German Bundestag, or parliament, has slammed the idea of a European “multinational force” in Ukraine and voiced support for deploying UN peacekeepers · 16.12.2025, ...",
    "published": "1 week ago"
  },
  {
    "title": "The Improbable Resurgence of Die Linke",
    "url": "https://jacobin.com/2025/02/die-linke-germany-renewal-strategy/",
    "snippet": "<strong>Jan van Aken</strong> (L), federal chairman of Die Linke, and member of the Bundestag Gregor Gysi speak at a press conference in Berlin on February 10, 2025.",
    "published": null
  },
  {
    "title": "How Germany's Left Party made its big election comeback – DW – 02/25/2025",
    "url": "https://www.dw.com/en/germany-left-party-election-comeback-heidi-reichinnek-v1/a-71338903",
    "snippet": "... &quot;The left lives!&quot; shouted Left Party co-leader <strong>Jan van Aken</strong> to the cheering crowd at the election party in Berlin as the projected election results rolled in. The party won 8.8% of the national vote share — a massive jump from the 3% it ...",
    "published": "February 26, 2025"
  }
]