[
  {
    "title": "Odion Ighalo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Odion_Ighalo",
    "snippet": "Odion Jude Ighalo (born 16 June 1989) is a Nigerian professional footballer who plays as a forward. After starting his career at Nigerian clubs <strong>Prime and Julius Berger</strong>, Ighalo moved to Norwegian club Lyn in 2007. A year later, he was signed by Italian club Udinese, spending most of his tenure ...",
    "published": "1 week ago"
  },
  {
    "title": "Odion Ighalo facts for kids",
    "url": "https://kids.kiddle.co/Odion_Ighalo",
    "snippet": "After that, he moved to Saudi Arabia, playing for Al Shabab and Al-Hilal before joining Al-Wehda. He also played for the Nigerian national team. He represented Nigeria at the 2018 World Cup. He was the top goal scorer in the qualifiers for the 2019 Africa Cup of Nations. Nigeria finished third in that tournament, and Ighalo was the top scorer there too. ... Odion ...",
    "published": null
  },
  {
    "title": "ESPN.com - Odion Ighalo reflects on 'dream' spell at Man United, would love Premier League return",
    "url": "https://www.espn.com/espn/print?id=37625574",
    "snippet": "Nigeria and former Manchester United striker Odion Ighalo says he would grab a chance to return to the Premier League &#x27;with both hands&#x27;, and told ESPN that he would support the <strong>Red Devils</strong> &#x27;till death&#x27;. Ighalo, now with Saudi Arabian giants Al Hilal, was the first Nigerian to play for United ...",
    "published": null
  },
  {
    "title": "Odion Ighalo - Nigeria | Player Profile | Sky Sports Football",
    "url": "https://www.skysports.com/odion-ighalo",
    "snippet": "Odion Ighalo, who was on loan at <strong>Manchester United</strong> for a year, has completed a permanent transfer to Saudi Arabian club Al-Shabab.",
    "published": null
  },
  {
    "title": "Odion Ighalo | Football Wiki | Fandom",
    "url": "https://football.fandom.com/wiki/Odion_Ighalo",
    "snippet": "Odion Jude Ighalo (born 16 June 1989) is a Nigerian professional footballer who plays as a striker for Saudi club Al-Wehda and the Nigeria national team. After starting his career at Prime and Julius Berger, he moved to Norway&#x27;s Lyn in 2007. A year later he was signed by Udinese, spending most of his tenure loaned out, notably at Granada, before signing for Watford in 2014.",
    "published": null
  }
]