[
  {
    "title": "Abdullah of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdullah_of_Saudi_Arabia",
    "snippet": "In 2002, he <strong>developed the Arab Peace Initiative</strong>, commonly referred to as the &quot;Abdullah plan&quot;, to achieve a mutually agreed-on resolution of the Arab–Israeli conflict.",
    "published": "October 12, 2025"
  },
  {
    "title": "Abdullah II of Jordan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Abdullah_II_of_Jordan",
    "snippet": "Abdullah&#x27;s efforts have <strong>made Jordan the freest Arab economy and the ninth-freest economy in the world</strong>, according to a 2014 study by the Friedrich Naumann Foundation for Liberty. The king launched a number of initiatives to provide housing for Jordanian citizens, including teachers and those ...",
    "published": "2 weeks ago"
  },
  {
    "title": "King Abdullah’s achievements — Future generations to benefit from reforms - Saudi Gazette",
    "url": "https://saudigazette.com.sa/article/110644",
    "snippet": "Economic boom Saudi Arabia witnessed an unprecedented economic boom and robust growth under King Abdullah. Within a short span, the King <strong>led the nation to become one of the major global economic powers with a membership in G20 and other blocs</strong>.",
    "published": "January 23, 2015"
  },
  {
    "title": "Abdullah II bin al-Hussein | World Leaders Forum",
    "url": "https://worldleaders.columbia.edu/directory/abdullah-ii-bin-al-hussein",
    "snippet": "King Abdullah has been the voice of Jordan’s progressive policies to expand global justice and cooperation. Taking up the historical role of the Hashemite family, he has championed the rights, achievements, and values of Muslims worldwide. In 2004, he worked with leading Islamic scholars to release the Amman Message, reaching a global audience with Islam’s guiding principles of peace, tolerance, and dialogue among faiths.",
    "published": null
  },
  {
    "title": "King Abdullah bin Abdulaziz Biography Center |",
    "url": "https://kingabdullah.sa/?lang=en",
    "snippet": "Abdullah bin Abdulaziz bin Abdulrahman Al Saud: The 6th King of Saudi Arabia and the 10th son of King Abdulaziz, was born and educated in Riyadh, he was appointed head of the National Guard in 1963, and improved it from traditional units to a major military institution. King Khalid appointed him as the second deputy, then crown prince under King Fahd reign. In 2005, he became the king of the country, and his reign witnessed achievements ...",
    "published": "July 6, 2020"
  }
]