[
  {
    "title": "Revolution of Dignity - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Revolution_of_Dignity",
    "snippet": "<strong>Petro Poroshenko became president after winning the 2014 presidential election</strong>. The new government began a removal of civil servants associated with the overthrown regime. There was also widespread decommunization and de-Sovietization of the country. Successive Ukrainian governments in the ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Petro Poroshenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Petro_Poroshenko",
    "snippet": "Poroshenko later claimed: &quot;When ... Yanukovych from the office of President of Ukraine, new presidential elections were scheduled to take place on <strong>25 May 2014.</strong>...",
    "published": "2 days ago"
  },
  {
    "title": "2014 Ukrainian presidential election - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/2014_Ukrainian_presidential_election",
    "snippet": "<strong>Oleksandr Turchynov</strong>, deputy chairman of Batkivshchyna, who had been appointed as Chairman of the Verkhovna Rada earlier that day, was named acting prime minister, and, due to Yanukovych&#x27;s deposition, acting president, until new elections could be held.",
    "published": "3 weeks ago"
  },
  {
    "title": "Poroshenko just like Yanukovych? Yes and no - Euromaidan Press",
    "url": "https://euromaidanpress.com/2017/06/07/reasons-why-poroshenko-is-just-like-yanukovych-and-reasons-why-he-isnt/",
    "snippet": "Three years have passed since Petro Poroshenko was inaugurated as President of Ukraine. Only two years of his presidential term are left. The closer to the end, the more talk there is that Poroshenko is following the path of the runaway dictator, Viktor Yanukovych.",
    "published": "June 7, 2017"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "Viktor Yushchenko, Petro Poroshenko, and Viktor Yanukovych served one term, with the latter being replaced by acting president Oleksandr Turchynov, who then also served as Chairman of the Ukrainian Parliament, on <strong>21 February 2014.</strong>",
    "published": "November 10, 2025"
  }
]