[
  {
    "title": "Olaf Scholz - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Olaf_Scholz",
    "snippet": "Olaf Scholz (born 14 June 1958) is a German politician who served as the Chancellor of Germany from 2021 to <strong>2025</strong>. A member of the Social Democratic Party (SPD), he previously served as Vice Chancellor in the fourth Merkel cabinet and as Federal Minister of Finance from 2018 to 2021.",
    "published": "2 weeks ago"
  },
  {
    "title": "Olaf Scholz | Facts, Biography, Cabinet, & Chancellor of Germany | Britannica",
    "url": "https://www.britannica.com/biography/Olaf-Scholz",
    "snippet": "Olaf Scholz served as chancellor of Germany from 2021 to <strong>2025</strong>.",
    "published": "March 31, 2022"
  },
  {
    "title": "Olaf Scholz to run for German chancellor again in 2025 – POLITICO",
    "url": "https://www.politico.eu/article/olaf-scholz-run-german-chancellor-again-2025/",
    "snippet": "Weakened leader hopes to persuade voters through renewed activity ahead of <strong>September 2025</strong> ballot.",
    "published": "July 24, 2024"
  },
  {
    "title": "German chancellor, gov't dismissed by president - Global Times",
    "url": "https://www.globaltimes.cn/page/202503/1330894.shtml",
    "snippet": "Olaf Scholz (C) attends the first gathering of the 21st Bundestag in Berlin, Germany, on <strong>March 25, 2025</strong>. German Chancellor Olaf Scholz and his cabinet were officially dismissed by President Frank-Walter Steinmeier on Tuesday afternoon.",
    "published": null
  },
  {
    "title": "Why Olaf Scholz Failed",
    "url": "https://foreignpolicy.com/2025/02/22/olaf-scholz-spd-germany-election/",
    "snippet": "Since Scholz has said that he won’t play second fiddle after serving as chancellor himself, his political career—at least in electoral politics—will most probably come to an end next week, with a whimper rather than a bang. In a nationally televised debate on Feb. 9, German Chancellor Olaf Scholz of the Social Democratic Party (SPD) displayed pluck and conviction.",
    "published": "February 25, 2025"
  }
]