[
  {
    "title": "FC Bayern Munich - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FC_Bayern_Munich",
    "snippet": "... Bayern has had 20 coaches since its promotion to the Bundesliga in 1965. <strong>Udo Lattek, Giovanni Trapattoni and Ottmar Hitzfeld served two terms as head coach</strong>. Franz Beckenbauer served one term as head coach and one as caretaker, while Jupp Heynckes had four separate spells as coach, including ...",
    "published": "2 days ago"
  },
  {
    "title": "Bayern head coaches in the Bundesliga",
    "url": "https://fcbayern.com/en/club/history/coaches",
    "snippet": "The head coaches <strong>from promotion in 1965 until today</strong>.",
    "published": "June 11, 2024"
  },
  {
    "title": "Contract until 2027 | Vincent Kompany named new FC Bayern head coach",
    "url": "https://fcbayern.com/en/news/2024/05/contract-until-2027-vincent-kompany-to-be-new-fc-bayern-head-coach",
    "snippet": "FC Bayern have confirmed Vincent Kompany as their new head coach. The 38-year-old has signed for the record champions <strong>through to 30 June 2027</strong>.",
    "published": "May 29, 2024"
  },
  {
    "title": "Vincent Kompany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Vincent_Kompany",
    "snippet": "On <strong>29 May 2024</strong>, Kompany was appointed as the new head coach of Bundesliga club Bayern Munich, signing a three-year deal. Burnley received a reported £10.2 million in compensation for the remainder of his contract, which made Kompany one of ...",
    "published": "2 days ago"
  },
  {
    "title": "List of FC Bayern Munich records and statistics - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_FC_Bayern_Munich_records_and_statistics",
    "snippet": "This list has details on FC Bayern Munich records and statistics. Information on the club&#x27;s coaches before the Bundesliga era is hard to come by. The information as given in the following table is from the club&#x27;s website. In contrast to the pre-Bundesliga era, a list of coaches since the inception ...",
    "published": "1 week ago"
  }
]