[
  {
    "title": "'We know it's bad, but we have to believe' - Al Wehda win finally to boost RSL hopes",
    "url": "https://www.spl.com.sa/en/news/521287/we-know-its-bad-but-we-have-to-believe-al-wehda-win-finally-to-boost-rsl-hopes",
    "snippet": "Exciting Saudi forward has generational link to Mecca club",
    "published": null
  },
  {
    "title": "Odion Ighalo stats and transfer history - AiScore",
    "url": "https://www.aiscore.com/player-odion-ighalo/oj7x9ir36wug7g3",
    "snippet": "Odion Ighalo Transfer History and Transfer Fee <strong>2025/06/30 UTC, from Al Wehda Mecca to Free player, - transfer fee</strong>. 2023/08/14 UTC, from Al Hilal to Al Wehda Mecca, - transfer fee. 2022/01/28 UTC, from Al-Shabab FC to Al Hilal, € 2.9M transfer fee. 2021/02/03 UTC, from Shanghai Shenhua FC ...",
    "published": null
  },
  {
    "title": "Old Derby: Al Wehda look to RSL stalwart Ighalo to lead fight for survival",
    "url": "https://www.spl.com.sa/en/news/518750/old-derby-al-wehda-look-to-rsl-stalwart-ighalo-to-lead-fight-for-survival",
    "snippet": "Al Wehda&#x27;s Odion Ighalo performs trademark celebration v Al Orobah · Defence is the most glaring area in need of improvement, with the Mecca club having conceded the most goals of any team this season, at 46.",
    "published": null
  },
  {
    "title": "Odion Ighalo (Al-Wahda Mecca) - biography, photo, video, goals, news, statistics - Soccer365",
    "url": "https://soccer365.net/players/7298/",
    "snippet": "Odion Jude Ighalo is a <strong>Nigerian professional footballer who plays as a forward for Saudi Pro League club Al-Wehda</strong>. After starting his career at Nigerian clubs Prime and Julius Berger, Ighalo moved to Norwegian club Lyn in 2007. A year later, he was signed by Italian club Udinese, spending most ...",
    "published": null
  },
  {
    "title": "Ighalo joins Saudi's Al-Wehda | TheCable",
    "url": "https://www.thecable.ng/ighalo-joins-saudis-al-wehda/",
    "snippet": "Al Wehda of Saudi Arabia have signed Odion Ighalo, former Super Eagles striker. The deal was announced on the club’s Twitter account on Tuesday. <strong>The 32-year-old is joining the Mecca-based club for an undisclosed fee</strong>.",
    "published": "August 16, 2023"
  }
]