[
  {
    "title": "Debra Elmegreen - Poughkeepsie, New York, United States | Professional Profile | LinkedIn",
    "url": "https://www.linkedin.com/in/debra-elmegreen-9ab1552a/",
    "snippet": "<strong>Associate Professor at Dartmouth College and Amazon</strong> Visiting Academic at AWS. Researcher and educator in quantum information science.",
    "published": null
  },
  {
    "title": "Debra Elmegreen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Debra_Elmegreen",
    "snippet": "Elmegreen was born in South Bend, Indiana in 1952. She became interested in astronomy at a young age. She received her <strong>bachelor&#x27;s degree in astrophysics from the Princeton University in 1975</strong>, where she was the first woman to graduate with an astrophysics major.",
    "published": "December 25, 2024"
  },
  {
    "title": "Debra Elmegreen - 1400 Degrees",
    "url": "https://1400degrees.org/scientist/debra-elmegreen/",
    "snippet": "She was the first woman to <strong>graduate with an undergraduate degree in Astrophysical Sciences from Princeton University</strong>. She received her PhD in Astronomy from Harvard University, and was the first woman to hold a Carnegie Postdoctoral Fellowship.",
    "published": "April 12, 2022"
  },
  {
    "title": "Debra M. Elmegreen | Vassar College",
    "url": "https://www.vassar.edu/faculty/elmegreen",
    "snippet": "Vassar’s first professor, astronomer Maria Mitchell and Debra Elmegreen, Professor of Astronomy on the Maria Mitchell Chair and Department Chair, were the subjects of a Chronicle of Higher Education story.",
    "published": null
  },
  {
    "title": "In the Footsteps of Maria Mitchell - Professor Debra M. Elmegreen ...",
    "url": "https://stories.vassar.edu/2019/190422-professor-debra-m-elmegreen-elected-to-american-academy-of-arts-and-sciences.html",
    "snippet": "Elmegreen has been on the Vassar faculty since 1985, teaching astronomy at all levels. She received her <strong>undergraduate degree in astrophysics from Princeton University (the first woman to do so) and her MA and PhD in Astronomy from Harvard University</strong>.",
    "published": null
  }
]