[
  {
    "title": "President's wife news — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/news/wife",
    "snippet": "This was announced by the First Lady of Ukraine, <strong>Olena Zelenska</strong>. 4 December 2025 - 22:06 · The <strong>Olena Zelenska</strong> Foundation focuses on initiatives that provide children with safety, education, care, and opportunities for recovery.",
    "published": "1 day ago"
  },
  {
    "title": "Volodymyr Zelenskyy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Volodymyr_Zelenskyy",
    "snippet": "Zelenskyy has described the extensive environmental damage from the war as &quot;an environmental bomb of mass destruction&quot; and &quot;an ecocide&quot; (a crime in Ukraine) and has met with prominent European politicians and others to discuss the environmental damage. In September 2025, Zelenskyy argued that China had the leverage to force Russia to end the invasion—&quot;without China, Putin’s Russia is nothing&quot;—but that China had too often remained silent instead of acting for peace. During the 2019 presidential campaign, Zelenskyy promised bills to fight corruption, including removal of immunity from the president, members of the Verkhovna Rada (Ukraine&#x27;s national parliament) and judges, a law about impeachment, reform of election laws, and providing efficient trial by jury.",
    "published": "4 days ago"
  },
  {
    "title": "4,804 Olena Zelenska Photos & High Res Pictures - Getty Images",
    "url": "https://www.gettyimages.com/photos/olena-zelenska",
    "snippet": "Ukrainian President Volodymyr Zelenskiy and his wife, the First Lady of Ukraine <strong>Olena Zelenska</strong> participate in a family photo before a dinner hosted... ... The First Lady of Ukraine, <strong>Olena Zelenska</strong>, attends the 5th Summit of First Ladies and ...",
    "published": null
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "However, during the Yushchenko Presidency, his marriage to <strong>Kateryna Yushchenko</strong> and their private life drew a lot of attention from the media. Apart from <strong>Kateryna Yushchenko</strong>, little else is known about the other presidential spouses.",
    "published": "November 10, 2025"
  },
  {
    "title": "Who Is Olena Zelenska? Meet President, Volodymyr Zelenskyy's Wife Who Is The First Lady Of Ukraine",
    "url": "https://www.bollywoodshaadis.com/articles/volodymyr-zelenskyy-wife-olena-zelenska-love-story-high-school-best-friends-husband-wife-61299",
    "snippet": "In an interview with Vogue Ukraine, <strong>Olena Zelenska</strong> shared that she was not happy when she learned about his husband running for the Prime Minister through a post on social media. Revealing the reason behind her reaction, the doting wife shared ...",
    "published": "March 1, 2025"
  }
]