[
  {
    "title": "Joe Lacob - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Joe_Lacob",
    "snippet": "<strong>Joseph Steven Lacob</strong> (born January 10, 1956) is an American business executive who was a partner at Kleiner Perkins and is the principal owner of the Golden State Warriors of the National Basketball Association (NBA) and the Golden State Valkyries of the Women&#x27;s National Basketball Association ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Joe Lacob | Golden State Warriors",
    "url": "https://www.nba.com/warriors/staff/joe-lacob",
    "snippet": "In his role as co-executive chairman &amp; CEO, <strong>Joe Lacob</strong> is the managing member of the Golden State Warriors’ ownership group.",
    "published": null
  },
  {
    "title": "Golden State Warriors - The Official Website of Peter Guber",
    "url": "https://www.peterguber.com/companies/golden-state-warriors/",
    "snippet": "In December of 2019, The Golden State Warriors were named ‘Franchise of the Decade’ across all professional sports teams by the Sports Business Journal/Daily. As part of the astonishing transformation for the franchise over the last 10 years, SBJ highlighted numerous accomplishments including three NBA Championships, Chase Center Completion, and leading the league and all professional sports in a variety of business categories. In 2014, our new ownership group proposed to build a new state-of-the-art privately financed sports and entertainment venue in San Francisco and entered into an agreement with salesforce.com to purchase private land in San Francisco’s Mission Bay neighborhood.",
    "published": "May 19, 2020"
  },
  {
    "title": "Joe Lacob | Golden State Community Foundation",
    "url": "https://community.warriors.com/profile/joe-lacob/",
    "snippet": "In his role as Co-Executive Chairman and CEO, <strong>Joe Lacob</strong> is the managing member of the Golden State Warriors’ ownership group. Currently in his ninth year in the role, he",
    "published": null
  },
  {
    "title": "Golden State Warriors - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Golden_State_Warriors",
    "snippet": "The Golden State Warriors are an American professional basketball team based in San Francisco. The Warriors compete in the National Basketball Association (NBA) as a member of the Pacific Division of the Western Conference. Founded in 1946 in Philadelphia, the Warriors moved to the San Francisco Bay Area in 1962 and took the city&#x27;s name before changing its geographic moniker to Golden State in 1971.",
    "published": "3 days ago"
  }
]