[
  {
    "title": "President of Georgia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Georgia",
    "snippet": "<strong>Salome Zourabichvili</strong> stated on 29 December and during the following weeks that she remained the president of Georgia. Protests against the ruling party have continued since the election, with hundreds of protesters arrested, beaten or tortured by the police and the ruling-party affiliated violent ...",
    "published": "4 weeks ago"
  },
  {
    "title": "Salomé Zourabichvili - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salom%C3%A9_Zourabichvili",
    "snippet": "On 9 January 2025, <strong>Zourabichvili</strong> held a press briefing at her new office on Chovelidze street, stating that she would continue to work to solve the crisis, meeting people around Georgia and internationally. She stated that she would attend the inauguration of Donald Trump and hold high-level ...",
    "published": "5 days ago"
  },
  {
    "title": "Georgia Democrat Eric Gisler flips a state House seat in district Trump won by double digits | CNN Politics",
    "url": "https://www.cnn.com/2025/12/09/politics/georgia-democrat-eric-gisler",
    "snippet": "<strong>Eric Gisler</strong>, a Democrat who owns a local olive oil store, will defeat Republican Mack “Dutch” Guest in the 121st House District, in the northeastern part of the state, near the college town of Athens.",
    "published": "6 days ago"
  },
  {
    "title": "Georgia's new president is inaugurated, complicating country's path to joining EU",
    "url": "https://www.pbs.org/newshour/world/georgias-new-president-is-inaugurated-complicating-countrys-path-to-joining-eu",
    "snippet": "Former soccer player <strong>Mikheil Kavelashvili</strong> was formally inaugurated as president of Georgia on Sunday, cementing the ruling party&#x27;s grip in what the opposition calls a blow to the country’s EU aspirations and a victory for former imperial ruler ...",
    "published": "December 29, 2024"
  },
  {
    "title": "Georgia: Government",
    "url": "https://globaledge.msu.edu/countries/georgia/government",
    "snippet": "Georgia · Government · Chief of State: President Salome Zourabichvili · Head of Government: <strong>Prime Minister Irakli Kobakhidze</strong> · Government Name: Georgia ·",
    "published": null
  }
]