[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "Mélenchon has been labelled a populist by numerous diverse people, with the <strong>Socialist Party</strong> senator Luc Carvounas saying he goes to &quot;the summits of demagoguery and populism&quot;, and the magazine Slate stating that Mélenchon&#x27;s rhetoric is &quot;shocking&quot; and implying his entire political life is based ...",
    "published": "2 days ago"
  },
  {
    "title": "The Crisis Engulfing the French Left | The Nation",
    "url": "https://www.thenation.com/article/world/french-left-split-new-popular-front-melonchon-socialists/",
    "snippet": "“No single party is the owner of the New Popular Front,” she says. Indeed, to truly understand the tensions roiling the New Popular Front, one must also consider the dynamics within <strong>La France Insoumise</strong>.",
    "published": "March 7, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon - World news, culture and opinion",
    "url": "https://www.lemonde.fr/en/jean-luc-melenchon/",
    "snippet": "The <strong>Parti Socialiste</strong>, which has broken free of radical-left leader Jean-Luc Mélenchon, is not done with its battles. It will, by 2027, need to win back moderate voters who have shunned it for the past seven years, at a time when PM François ...",
    "published": null
  },
  {
    "title": "Jean-Luc Mélenchon Casts a Long Shadow Over the Stagnant French Left",
    "url": "https://foreignpolicy.com/2025/04/25/melenchon-french-left-politics-progressive-coalition-2027-election/",
    "snippet": "David Broder, Verso, 320 pp., $29.95, April 2025 · Jean-Luc Mélenchon, the founder and leader of left-populist party <strong>La France Insoumise (LFI),</strong> is no stranger to the world of publishing.",
    "published": "May 13, 2025"
  },
  {
    "title": "Jean-Luc Mélenchon Explains How His Party Took Down a Right-Wing Government | The Nation",
    "url": "https://www.thenation.com/article/world/jean-luc-melenchon-interview/",
    "snippet": "Jean-Luc Mélenchon, founder of the left-wing party <strong>La France Insoumise</strong>, speaks during the meeting “From France to New York: fighting the right, building the left” hosted by the Democratic Socialists of America in Brooklyn, New York, on ...",
    "published": "May 21, 2025"
  }
]