[
  {
    "title": "BC Partners to acquire Com Hem | Carlyle",
    "url": "https://www.carlyle.com/media-room/news-release-archive/bc-partners-acquire-com-hem",
    "snippet": "London – BC Partners, a leading international private equity firm, today announces that <strong>it has signed an agreement to acquire Com Hem</strong>, Sweden’s leading TV, broadband and telephony company, from The Carlyle Group (“Carlyle”) and Providence Equity Partners (“Providence”). Financial ...",
    "published": null
  },
  {
    "title": "BC Partners - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/BC_Partners",
    "snippet": "The acquisition became an issue of the media and legal dispute with the company&#x27;s previous owner, Empreno Ventures, which asked BC Partners to wait until judicial resolution. On November 7, BC Partners was added to a lawsuit by Empreno seeking to ban the sale of Vivacom. In early 2021, the firm entered into talks with Inter Milan owner Suning about potentially buying the football club. In August 2025...",
    "published": "October 22, 2025"
  },
  {
    "title": "BC Partners - 2025 Investor Profile, Portfolio, Team & Exits - Tracxn",
    "url": "https://tracxn.com/d/private-equity/bc-partners/__Qik_uYeUiUViOWrvdusErwMyiuQ6_f5AqPg9eQMI41k",
    "snippet": "It is primarily based in London, United Kingdom. As of Dec 2025, BC Partners has a portfolio of 146 companies, comprising 82 funding rounds and <strong>68 acquisitions</strong>. In the last 12 months, it has participated in 2 acquisitions.",
    "published": "6 days ago"
  },
  {
    "title": "Exclusive: BC Partners to buy Com Hem in $2.6 billion deal | Reuters",
    "url": "https://www.reuters.com/article/business/media-telecom/exclusive-bc-partners-to-buy-com-hem-in-26-billion-deal-idUSTRE76K1YV/",
    "snippet": "<strong>Private equity firm BC Partners is set to buy Swedish cable company Com Hem, in a deal that will value the firm at about 17 billion crowns ($2.6 billion),</strong> one of the largest buyouts in Europe this year, people familiar with the situation said.",
    "published": "July 21, 2011"
  },
  {
    "title": "News & Insights — BC Partners",
    "url": "https://www.bcpartners.com/news-insights/",
    "snippet": "We are delighted to share the annual BC Partners Sustainability Report for 2025.",
    "published": "March 24, 2025"
  }
]