[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "During his political career, Mélenchon crossed various tendencies of the French left, from Trotskyism in his youth to more moderate socialism, as <strong>he was in the Socialist Party for almost thirty years, occupying a place on the left wing of the party</strong>, before he began a companionship with the ...",
    "published": "2 days ago"
  },
  {
    "title": "La France Insoumise - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/La_France_Insoumise",
    "snippet": "&#x27;<strong>France Unbowed</strong>&#x27; or &#x27;France in Revolt&#x27;) is a left-wing political party in France. It was launched in 2016 by Jean-Luc Mélenchon, then a Member of the European Parliament (MEP) and former co-president of the Left Party (PG). It aims to implement the eco-socialist and democratic socialist programme ...",
    "published": "2 days ago"
  },
  {
    "title": "The Crisis Engulfing the French Left | The Nation",
    "url": "https://www.thenation.com/article/world/french-left-split-new-popular-front-melonchon-socialists/",
    "snippet": "<strong>La France Insoumise</strong> (LFI) party leader Jean-Luc Melenchon (L) and French Socialist Party (PS) First Secretary Olivier Faure address supporters during a campaign meeting in Caen, France, on June 8, 2022.(Sameer Al-Doumy / AFP via Getty Images)",
    "published": "March 7, 2025"
  },
  {
    "title": "France’s Jean-luc Mélenchon announces a “New popular union” with the capitalist Socialist Party - World Socialist Web Site",
    "url": "https://www.wsws.org/en/articles/2022/05/12/hyoh-m12.html",
    "snippet": "By forming an alliance with the PS, a <strong>bourgeois party</strong>, Mélenchon is turning his back on the promises he made to his voters.",
    "published": null
  },
  {
    "title": "Jean-Luc Mélenchon facts for kids",
    "url": "https://kids.kiddle.co/Jean-Luc_M%C3%A9lenchon",
    "snippet": "<strong>In 1976, Mélenchon joined the Socialist Party</strong>. He quickly became involved in local politics. He was elected as a town councillor in Massy in 1983. In 1986, he was elected to the Senate, the upper house of the French parliament.",
    "published": null
  }
]