[
  {
    "title": "Nadia Calviño",
    "url": "https://www.eib.org/en/about/governance-and-structure/statutory-bodies/management-committee/members/nadia-calvino",
    "snippet": "Nadia Calviño is the President of the European Investment Bank. She was <strong>appointed on 1 January 2024</strong>. Follow the President on",
    "published": "3 weeks ago"
  },
  {
    "title": "Nadia Calviño - President of the European Investment Bank | LinkedIn",
    "url": "https://lu.linkedin.com/in/nadiacalvino/en",
    "snippet": "On this International Women’s Day 2025, we celebrate the great progress achieved in women’s financial independence as… ... We are living in a time where many things we have taken for granted are called into question. A technological… ... This article was first published by Süddeutsche Zeitung. Nadia Calviño is President of the European Investment Bank…",
    "published": "2 weeks ago"
  },
  {
    "title": "La Moncloa. 08/05/2019. Nadia Calviño to become chair of European Bank of Reconstruction and Development's board of governors [Government/News]",
    "url": "https://www.lamoncloa.gob.es/lang/en/gobierno/news/Paginas/2019/20190508chair-ebrd.aspx",
    "snippet": "<strong>She replaces the Vice-President of the European Commission, Jyrki Katainen</strong>, in this rotating position. The board of governors is made up of representatives of the countries and institutions that form part of the EBRD, who combine this function ...",
    "published": null
  },
  {
    "title": "'Europe's unity is our strength,' European Investment Bank chief Calviño tells Euronews",
    "url": "https://www.euronews.com/my-europe/2025/12/12/europes-unity-our-strength-european-investment-bank-chief-calvino-tells-euronews",
    "snippet": "<strong>European Investment Bank President Nadia Calviño told Euronews&#x27; morning show Europe Today that the EU should stick together after the US administration claimed the bloc was weak and in decline</strong>.",
    "published": "4 days ago"
  },
  {
    "title": "Nadia Calviño named EIB chief – POLITICO",
    "url": "https://www.politico.eu/article/spain-nadia-calvino-named-european-investment-bank-chief/",
    "snippet": "BRUSSELS – <strong>Spain&#x27;s Finance Minister Nadia Calviño will become the next head of the European Investment Bank</strong> after EU countries agreed on Friday morning to her appointment.",
    "published": "December 8, 2023"
  }
]