[
  {
    "title": "Sadyr Japarov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sadyr_Japarov",
    "snippet": "Japarov also <strong>became acting president of Kyrgyzstan after Jeenbekov&#x27;s resignation, but resigned himself on 14 November 2020 to run for the 2021 presidential election</strong>, in which he was elected to succeed the acting president, Talant Mamytov. Japarov began his political career as a deputy in 2005 ...",
    "published": "3 weeks ago"
  },
  {
    "title": "Kyrgyzstan Under Japarov: The Country’s Decline Into Dictatorship - Human Rights Foundation",
    "url": "https://hrf.org/latest/kyrgyzstan-under-japarov-the-countrys-decline-into-dictatorship/",
    "snippet": "And so began the Third Kyrgyz ... and hold new elections. <strong>The main beneficiary of this revolution was Sadyr Japarov, the main rival of President Jeenbekov, who was released from prison by protesters</strong>....",
    "published": "February 26, 2025"
  },
  {
    "title": "Sooronbay Jeenbekov - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sooronbay_Jeenbekov",
    "snippet": "In spite of that, Kyrgyzstan under ... election results. <strong>He was succeeded by Sadyr Japarov who would go on to serve as an acting president and prime minister for short period of time before being officially elected in the 2021 presidential elections</strong>....",
    "published": "October 3, 2025"
  },
  {
    "title": "The Fall of Kyrgyzstan’s Parliamentary Experiment and the Rise of Sadyr Japarov",
    "url": "https://www.cacianalyst.org/publications/analytical-articles/item/13657-the-fall-of-kyrgyzstan%E2%80%99s-parliamentary-experiment-and-the-rise-of-sadyr-japarov.html",
    "snippet": "In Kyrgyzstan, no party has advocated the nationalistic agenda more consistently than the Ata Jurt (Fatherland) party and its successor party Mekenchil (Patriots), which Japarov is closely associated with. The political programs of Ata Jurt/Mekenchil have consistently emphasized an aversion against parliamentarism and advocated a return to a strong presidential system, with a subordinated parliament and a formalized role for the traditional Kyrgyz form of assembly – the Kurultai.",
    "published": null
  },
  {
    "title": "Kyrgyzstan’s Media Crackdown Sign of Deepening Authoritarianism - Jamestown",
    "url": "https://jamestown.org/kyrgyzstans-media-crackdown-sign-of-deepening-authoritarianism/",
    "snippet": "In 2005 and 2020, Akayev and Jeenbekov were ousted following widespread anger over fraudulent parliamentary elections (Current Times, October 2, 2020; Asia-Plus, October 14, 2020). Recognizing parliament’s ability to mobilize both elites and the public to challenge the presidency, one of Japarov’s first moves upon coming to power was to amend Kyrgyzstan...",
    "published": "November 19, 2025"
  }
]