[
  {
    "title": "Cabinet Profile: Marcelo Ebrard, Secretary of the Economy | Mexico News Report",
    "url": "https://mexiconewsreport.com/index.php/2025/02/19/cabinet-profile-marcelo-ebrard-secretary-of-the-economy/",
    "snippet": "<strong>Ebrard ran again for president, this time as part of the MORENA party, but was defeated in the party by Claudia Sheinbaum</strong>. But all was not lost for Marcelo.",
    "published": null
  },
  {
    "title": "Marcelo Ebrard - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Ebrard",
    "snippet": "On 20 June 2024, president-elect Sheinbaum announced Ebrard&#x27;s appointment to serve as Secretary of the Economy in her cabinet as of 1 October 2024. <strong>Considered a moderate member of MORENA</strong>, his appointment as Secretary of the Economy led the peso to rise as high as 0.9% against the United States ...",
    "published": "November 14, 2025"
  },
  {
    "title": "Marcelo Ebrard _ AcademiaLab",
    "url": "https://academia-lab.com/encyclopedia/marcelo-ebrard/",
    "snippet": "Marcelo Luis Ebrard Casaubón (Mexico City, October 10, 1959) is a Mexican politician and internationalist. <strong>He is a member of the Morena party</strong>.",
    "published": null
  },
  {
    "title": "Ebrard announces possible split with Mexico’s ruling Morena party | Courthouse News Service",
    "url": "https://www.courthousenews.com/ebrard-announces-possible-split-with-mexicos-ruling-morena-party/",
    "snippet": "MEXICO CITY (CN) — Mexican presidential hopeful Marcelo Ebrard started the week off by contesting his own party’s decision to put another candidate on the ballot in 2024 and threatening to leave to form his own movement. His comments came on the heels of the ruling Morena party’s announcement that former Mexico City Mayor Claudia Sheinbaum had won an internal poll, declaring her its official candidate in the coming presidential elections.",
    "published": null
  },
  {
    "title": "Mexico is Transforming for the Good | Dissident VoiceDissident Voice",
    "url": "https://dissidentvoice.org/2025/12/mexico-is-transforming-for-the-good/",
    "snippet": "Despite predictions that her gender and background would be detrimental, she and Morena candidates won the election by an even greater majority. Sheinbaum won 61% of the popular vote compared to 28% and 11% for the next competitors. Morena now has a supermajority in the Congress and Senate. Marcelo Ebrard is the Economics Minister.",
    "published": "5 days ago"
  }
]