[
  {
    "title": "Eurosport - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport",
    "snippet": "<strong>In 2012, Discovery Communications began to take an ownership in Eurosport, eventually leading to a full buyout in 2015.</strong> Eurosport is the main rights holder of the Olympic Games in most of Europe, as well as, with some exceptions, the tennis Grand Slam tournaments.",
    "published": "2 weeks ago"
  },
  {
    "title": "Eurosport 1 - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Eurosport_1",
    "snippet": "Discovery. <strong>Discovery took a 20% minority interest share in December 2012, and became majority shareholder in the Eurosport venture with TF1 in January 2014</strong>, taking a 51% share of the company, On 22 July 2015 Discovery agreed to acquire TF1&#x27;s remaining 49% stake in the venture.",
    "published": "1 week ago"
  },
  {
    "title": "Eurosport",
    "url": "https://www.pentagram.com/work/eurosport/story",
    "snippet": "Since 1989, Eurosport has established itself as a household name in live sports, broadcasting some of the world’s leading sporting events, from Tennis Grand Slams to the cycling Grand Tours. Under the new ownership of Discovery, the sports destination has been supercharged, acquiring more ...",
    "published": null
  },
  {
    "title": "Eurosport | Warner Bros. Entertainment Wiki | Fandom",
    "url": "https://warnerbros.fandom.com/wiki/Eurosport",
    "snippet": "<strong>In 2012, Discovery Communications began to take an ownership in Eurosport, eventually leading to a full buyout in 2015.</strong> Eurosport is the main rights holder of the Olympic Games in most of Europe, as well as (with some exceptions) the tennis ...",
    "published": null
  },
  {
    "title": "Discovery Takes Full Ownership of Sports TV Network Eurosport",
    "url": "https://variety.com/2015/tv/global/discovery-takes-full-ownership-of-sports-tv-network-eurosport-1201545640/",
    "snippet": "In June, Discovery/Eurosport won the TV and multiplatform rights for the Olympic Games from 2018 to 2024. Today’s agreement also includes a provision for TF1 to buy back Discovery’s 20% interest in TV Breizh, Histoire, and Ushuaïa TV for €15 million. Both transactions are expected to close at the beginning of the fourth quarter.",
    "published": "July 22, 2015"
  }
]