[
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "Russia of the Future (Russian: ... Partiya Progressa), is a <strong>banned opposition political party in Russia founded on 15 December 2012 by Leonid Volkov and later refounded on 19 May 2018 by Alexei Navalny</strong>, who was also the founder of the non-profit organisation ...",
    "published": "September 30, 2025"
  },
  {
    "title": "Russia of the Future",
    "url": "https://grokipedia.com/page/Russia_of_the_Future",
    "snippet": "This approach, which reportedly reduced United Russia&#x27;s vote share by 10–15% in targeted races per opposition analyses, encouraged tactical coordination among fragmented liberal and nationalist factions, though its efficacy waned after 2021 due to intensified electoral manipulations.[1][93] Following the party&#x27;s effective dissolution amid 2021 designations of associated entities as &quot;extremist&quot; and Navalny&#x27;s imprisonment, its alumni bolstered exiled opposition platforms, such as the 2025 launch of the &quot;Russia&#x27;s Future&quot; satellite TV channel by Reporters Without Borders and Navalny&#x27;s foundation, which broadcasts uncensored content to circumvent domestic blocks and sustain activist networks.",
    "published": null
  },
  {
    "title": "Kremlin Foe Navalny Launches New Political Party",
    "url": "https://www.rferl.org/a/russia-navalny-new-political-party/29237240.html",
    "snippet": "Russian opposition leader Aleksei ... Vladimir Putin. The new party, called Russia Of The Future, was <strong>created at a May 19 founding convention in Moscow</strong>, Lybov Sobol, a senior associate of the Kremlin critic, said on ...",
    "published": "May 19, 2018"
  },
  {
    "title": "After Navalny | The New Journal",
    "url": "https://thenewjournalatyale.com/2025/02/after-navalny/",
    "snippet": "“We don’t have a silver bullet that will end it tomorrow,” Volkov, former Chairman of the FBK and director of political operations for the Russia of the Future party, says. The opposition’s focus, he explains, is to force Putin to expose the contradictions and inefficiencies of the political system. “We don’t know when it will collapse, how it will collapse, or how much time it will take, but shedding light on its flaws makes it more likely to collapse sooner.” · Since Navalny’s death, the danger has only escalated. As of February 2025, Volkov faces eleven politically motivated criminal cases initiated by Putin’s regime.",
    "published": "February 19, 2025"
  },
  {
    "title": "Russia’s Opposition, Past and Future: A Conversation With Jan Matti Dollbaum - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2025/01/06/russias-opposition-past-and-future-a-conversation-with-jan-matti-dollbaum-a87418",
    "snippet": "<strong>24, 2025 ... The channel, called Future of Russia, will be broadcast via a free-to-air satellite platform run by Reporters Without Borders</strong>. ... I expected the discussions to be detached from reality.",
    "published": "January 6, 2025"
  }
]