[
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "The president of Portugal, officially the president of the Portuguese Republic (Portuguese: Presidente da República Portuguesa, pronounced [pɾɨziˈðẽtɨ ðɐ ʁɛˈpuβlikɐ puɾtuˈɣezɐ]), is the head of state and highest office of Portugal.",
    "published": "3 days ago"
  },
  {
    "title": "The President - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-president/",
    "snippet": "<strong>Marcelo Rebelo de Sousa</strong> was born in Lisbon, on 12 December 1948. He is a Catholic and has 2 children and 5 grandchildren. A Law Graduate, he received a Doctorate in Legal and Political Science in 1984.",
    "published": null
  },
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "On 1 December 2025, <strong>Marcelo Rebelo de Sousa</strong> was admitted to University Hospital of São João, in Porto, for urgent surgery due to an incarcerated hernia, after feeling unwell.",
    "published": "1 week ago"
  },
  {
    "title": "The Portuguese Government in 2025: What Expats Should Know",
    "url": "https://www.portugalresidencyadvisors.com/the-political-system-in-portugal-an-expat-guide/",
    "snippet": "The current President of Portugal is <strong>Marcelo Rebelo de Sousa</strong>. The President primarily serves as the head of state, with responsibilities such as appointing the Prime Minister, dissolving Parliament, and overseeing the Constitution’s implementation.",
    "published": "September 29, 2025"
  },
  {
    "title": "List of presidents of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Portugal",
    "snippet": "<strong>Teófilo Braga</strong> served as the first and sole president of the Provisional Government, and therefore is not considered to be the first president, although he would serve again as head of state and be the second president after the resignation ...",
    "published": "1 week ago"
  }
]