[
  {
    "title": "Joachim Sauer - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Joachim_Sauer",
    "snippet": "<strong>Joachim Sauer</strong> ForMemRS (German pronunciation: [ˈjoːaxɪm ˈzaʊɐ]; born 19 April 1949) is a German quantum chemist and professor emeritus of physical and theoretical chemistry at the Humboldt University of Berlin. He is the husband of the former chancellor of Germany, Angela Merkel.",
    "published": "April 7, 2025"
  },
  {
    "title": "Angela Merkel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Angela_Merkel",
    "snippet": "In 1977, at the age of 23, Merkel, then Angela Kasner, married physics student Ulrich Merkel (born 1953) and took his surname. The couple divorced in 1982. Her second and current husband is quantum chemist and professor <strong>Joachim Sauer</strong>, who has largely avoided media attention during and after ...",
    "published": "1 week ago"
  },
  {
    "title": "2,735 Merkel Joachim Sauer Photos & High Res Pictures - Getty Images",
    "url": "https://www.gettyimages.com/photos/merkel-joachim-sauer",
    "snippet": "Former German chancellor Angela Merkel arrives with husband <strong>Joachim Sauer</strong> for the opening of the annual Bayreuth Festival featuring the music of...",
    "published": null
  },
  {
    "title": "Special Report: Don't call him Mr. Merkel | Reuters",
    "url": "https://www.reuters.com/article/world/special-report-dont-call-him-mr-merkel-idUSBRE84F07F/",
    "snippet": "<strong>Sauer</strong> is the husband of German Chancellor Angela Merkel, arguably the world&#x27;s most powerful woman. He never speaks to the media and only rarely appears in public with his wife. He skipped her inauguration in 2005, drawing media wrath for watching ...",
    "published": "May 16, 2012"
  },
  {
    "title": "Angela Merkel - Husband Joachim Sauer",
    "url": "https://www.picture-alliance.com/en/webseries/angela-merkel-husband-joachim-sauer-w184806",
    "snippet": "Angela Merkel has been married to chemistry professor <strong>Joachim Sauer</strong> since 1998. The collection shows Sauer at official occasions, at the partner program of the political summits and privately with his wife on vacation.",
    "published": null
  }
]