[
  {
    "title": "ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ESPN",
    "snippet": "<strong>Bill Rasmussen</strong> came up with the concept of ESPN in May 1978, after he was fired from his job with the World Hockey Association&#x27;s New England Whalers. Rasmussen and his ESPN co-founder Ed Eagan, joined by Rasmussen&#x27;s son Scott (who had also been let go by the Whalers), first rented office space ...",
    "published": "4 days ago"
  },
  {
    "title": "History of ESPN - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/History_of_ESPN",
    "snippet": "ESPN was founded by <strong>Bill Rasmussen, his son Scott Rasmussen, and 43 year old eye doctor and Aetna insurance agent Ed Eagan</strong>. Bill, who had an affinity with sports for much of his life, was fired from his position as the communications manager for the New England Whalers in 1978.",
    "published": "November 11, 2025"
  },
  {
    "title": "ESPN History: Founding, Timeline, and Milestones - Zippia",
    "url": "https://www.zippia.com/espn-careers-22765/history/",
    "snippet": "Share your experience · Founded · 1979 · Headquarters · Bristol, CT · Founders · <strong>Bill Rasmussen,Scott Rasmussen,Ed Eagan</strong> · Get updates for jobs and news · Rate how well ESPN lives up to its initial vision.",
    "published": "July 21, 2023"
  },
  {
    "title": "ESPN founder Rasmussen: I have Parkinson's - ESPN",
    "url": "https://www.espn.com/espn/story/_/id/27196132/espn-founder-rasmussen-parkinsons",
    "snippet": "<strong>Bill Rasmussen</strong>, who founded ESPN in 1979, announced Monday he is battling Parkinson&#x27;s disease.",
    "published": "July 15, 2019"
  },
  {
    "title": "ESPN Founder",
    "url": "https://www.espnfounder.com/",
    "snippet": "A life-long entrepreneur and sports fan, <strong>Bill Rasmussen</strong>’s innovations in advertising, sports and broadcasting are numerous, including the creation of ESPN, the world’s first 24-hour, 7-days-a-week sports television network; the network’s signature program SportsCenter; wall-to-wall coverage ...",
    "published": null
  }
]