[
  {
    "title": "Jonathan Kodjia Stats, Goals, Records, Assists, Cups and more | FBref.com",
    "url": "https://fbref.com/en/players/ecf44e09/Jonathan-Kodjia",
    "snippet": "Check out the latest domestic and international stats, match logs, goals, height, weight and more for Côte d&#x27;Ivoire men&#x27;s national team, <strong>Aston Villa FC and Bristol City FC</strong> playing for Jonathan Kodjia in the Africa Cup of Nations, Premier League ...",
    "published": null
  },
  {
    "title": "Jonathan Kodjia - Player profile | Transfermarkt",
    "url": "https://www.transfermarkt.us/jonathan-kodjia/profil/spieler/88971",
    "snippet": "Without Club Last club: FC Versailles Most games for: <strong>Aston Villa</strong> Without Club since: Jul 1, 2025 ... Name in home country: Jonathan Adjo Kodjia Date of birth/Age: Oct 22, 1989 (36) Place of birth: Saint-Denis Height: 1,89 m Citizenship: Cote ...",
    "published": null
  },
  {
    "title": "Jonathan Kodjia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jonathan_Kodjia",
    "snippet": "Jonathan Adjo Kodjia (born 22 October 1989) is a professional footballer who plays as a forward for Championnat National club Versailles. Born in France, he represents the Ivory Coast national team. Kodjia started his career at Reims and gained experience in the Championnat National (French ...",
    "published": "October 3, 2025"
  },
  {
    "title": "Jonathan Kodjia: Profile, news and stats | Kings League France",
    "url": "https://kingsleague.pro/en/players/80107-jonathan-kodjia",
    "snippet": "Access to the official Jonathan Kodjia website: News, statistics, results, goals and more information about the Kings League player",
    "published": null
  },
  {
    "title": "Jonathan Kodjia Transfer News, History, Market Value (ETV) & Career Stats",
    "url": "https://www.footballtransfers.com/en/players/jonathan-kodjia",
    "snippet": "Click here to see the latest Jonathan Kodjia transfer news, career stats, transfer history, similar players and favourite player roles.",
    "published": null
  }
]