[
  {
    "title": "Josep Borrell begins his term as President of CIDOB | CIDOB",
    "url": "https://www.cidob.org/en/news/josep-borrell-begins-his-term-president-cidob",
    "snippet": "Following his appointment by the institution’s Board on 13 December, <strong>the former head of European diplomacy has begun his agenda as President of CIDOB</strong>, a leading think tank in international relations based in Barcelona. In his first hours as President of the institution, Josep Borrell has ...",
    "published": null
  },
  {
    "title": "The Board of CIDOB proposes Josep Borrell for the presidency of the institution | CIDOB",
    "url": "https://www.cidob.org/en/news/board-cidob-proposes-josep-borrell-presidency-institution",
    "snippet": "<strong>Josep Borrell will take office soon, once the necessary administrative formalities have been completed</strong>.",
    "published": null
  },
  {
    "title": "Josep Borrell será el nuevo presidente del CIDOB | CIDOB,",
    "url": "https://www.cidob.org/cidob-en-medios/josep-borrell-sera-el-nuevo-presidente-del-cidob",
    "snippet": "<strong>El veterano político Josep Borrell se pondrá al frente del CIDOB, el &#x27;think tank&#x27; con sede en Barcelona dedicado a la investigación en el ámbito de las relaciones internacionales</strong>, tras haber dejado hace solo unos días su cargo de Alto Representante para la Política Exterior de la UE.",
    "published": null
  },
  {
    "title": "Josep Borrell, new president of the Barcelona Centre for International Affairs (CIDOB)",
    "url": "https://thediplomatinspain.com/en/2024/12/14/josep-borrell-new-president-of-the-barcelona-centre-for-international-affairs-cidob/",
    "snippet": "This was announced by the think tank, announcing that <strong>Borrell will assume the presidency of CIDOB once the mandate of historian Antoni Segura has concluded</strong>. The inauguration will take place after the completion of the corresponding administrative ...",
    "published": "December 13, 2024"
  },
  {
    "title": "Josep Borrell presidirá el CIDOB tras caducar su cargo como jefe de la diplomacia europea",
    "url": "https://www.elespanol.com/mundo/europa/20241213/josep-borrell-presidira-cidob-caducar-cargo-jefe-diplomacia-europea/908409425_0.html",
    "snippet": "Ha sido el patronato de la institución, formado por la Generalitat, el Ayuntamiento, la diputación de Barcelona, el Área Metropolitana y el Ministerio de Asuntos Exteriores el que ha propuesto a Borrell como nuevo presidente tras reunirse esta mañana del viernes. El patronato prevé que tome posesión &quot;próximamente, una vez se hayan cubierto los trámites administrativos necesarios&quot;, según el comunicado enviado por el CIDOB.",
    "published": "December 13, 2024"
  }
]