[
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the <strong>chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "As the <strong>11th chancellor of the University of California at Santa Cruz</strong>, Cynthia Larive leads an institution known worldwide for its high-impact research, for seeking interdisciplinary solutions to the world’s greatest challenges, and for its commitment to social and environmental justice.",
    "published": null
  },
  {
    "title": "Chancellor Larive assumes position as new Board Chair for Monterey Bay Economic Partnership - News",
    "url": "https://news.ucsc.edu/2022/04/chancellor-larive-mbep/",
    "snippet": "University of California, Santa Cruz Chancellor Cynthia K. Larive will assume the role of <strong>incoming board chair for the Monterey Bay Economic Partnership</strong>.",
    "published": "March 18, 2025"
  },
  {
    "title": "Cynthia LARIVE | Faculty Member | University of California, Santa Cruz, Santa Cruz | UCSC | Department of Chemistry & Biochemistry | Research profile",
    "url": "https://www.researchgate.net/profile/Cynthia-Larive-2",
    "snippet": "Current position · <strong>Faculty Member</strong> · Publications (5) Contributions of Ted Kuwana to Analytical Sciences Education · Article · Jun 2021 · Thomas J. Wenzel · Richard S. Kelly · Cynthia Larive · Erin M. Gross · We did not write an abstract ...",
    "published": null
  },
  {
    "title": "Provost Cynthia K. Larive | Inside UCR",
    "url": "https://insideucr.ucr.edu/tag/provost-cynthia-k-larive",
    "snippet": "Larive has been appointed as <strong>UC Santa Cruz chancellor</strong> effective July 1. At the reception, Larive was honored for her history with UC Riverside that began as a... ... UC Riverside Provost and Executive Vice Chancellor Cynthia K.",
    "published": null
  }
]