[
  {
    "title": "About Cynthia Larive – Office of the Chancellor",
    "url": "https://chancellor.ucsc.edu/about/",
    "snippet": "Under Chancellor Larive’s leadership, UC Santa Cruz has cemented its place as preeminent research university, with research support now surpassing $200 million annually. She advanced regional economic development by establishing the Innovation and Business Engagement Hub to connect industry with the campus innovation ecosystem.",
    "published": null
  },
  {
    "title": "Cynthia Larive - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Cynthia_Larive",
    "snippet": "Cynthia Larive is an American scientist and academic administrator serving as the <strong>chancellor of University of California, Santa Cruz</strong>. Larive&#x27;s research focuses on nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry. She was previously a professor of chemistry and provost and ...",
    "published": "July 15, 2025"
  },
  {
    "title": "Leadership – UC Santa Cruz",
    "url": "https://www.ucsc.edu/about/leadership/",
    "snippet": "As the <strong>11th chancellor</strong> of UC Santa Cruz, Cynthia Larive leads an institution known worldwide for its interdisciplinary approach to research for the public good, for seeking solutions and giving voice to the challenges of our time, and for its commitment to social and environmental justice.",
    "published": null
  },
  {
    "title": "Cynthia Larive to become 11th chancellor of UC Santa Cruz - News",
    "url": "https://news.ucsc.edu/2019/05/chancellor-designate/",
    "snippet": "Cynthia K. Larive as the <strong>eleventh chancellor of UC Santa Cruz</strong>. Currently the provost and executive vice chancellor at UC Riverside, Larive has served the UC community for nearly a decade and a half as a faculty member, administrator ...",
    "published": "May 13, 2025"
  },
  {
    "title": "UCSC Chancellor Cynthia Larive up for regular five-year review - Lookout Santa Cruz",
    "url": "https://lookout.co/ucsc-chancellor-cynthia-larive-up-for-regular-five-year-review/story",
    "snippet": "<strong>UC Santa Cruz Chancellor</strong> Cynthia Larive is set to undergo an overdue five-year performance review, part of a standard UC systemwide process led by President James Milliken and faculty leaders.",
    "published": "August 22, 2025"
  }
]