[
  {
    "title": "Prime Minister of France - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_France",
    "snippet": "The current prime minister of France is <strong>Sébastien Lecornu</strong> who was appointed on 9 September 2025 and resigned on 6 October 2025, but was re-appointed on 10 October.",
    "published": "1 day ago"
  },
  {
    "title": "French Politics - World news, culture and opinion",
    "url": "https://www.lemonde.fr/en/politics/",
    "snippet": "Prime Minister <strong>Sébastien Lecornu</strong> is banking on Socialist support to pass the social-security budget – a make-or-break moment for his strategy of compromise and negotiation. Published on December 2, 2025, at 2:54 pm (Paris) Solenn de Royer ...",
    "published": null
  },
  {
    "title": "France's New PM: Macron's Top Contenders to Replace Bayrou - Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-09-09/here-are-the-leading-contenders-to-be-france-s-new-premier",
    "snippet": "September 9, 2025 at 8:30 AM UTC · Save · French President <strong>Emmanuel Macron</strong> is seeking a fifth prime minister in less than two years to tackle the country’s debt problems. Here are some of the leading contenders, categorized by the general ...",
    "published": "September 9, 2025"
  },
  {
    "title": "Sébastien Lecornu - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/S%C3%A9bastien_Lecornu",
    "snippet": "He resigned on 6 October 2025 after just 26 days in office, making his tenure as prime minister the shortest in the history of the French Fifth Republic.",
    "published": "1 day ago"
  },
  {
    "title": "Blue Star Strategies | France Political Update: What next for France’s new Prime Minister?",
    "url": "https://bluestarstrategies.com/france-political-update-what-next-for-frances-new-prime-minister/",
    "snippet": "Nevertheless, the Prime Minister must present the 2025 finance bill by early October and secure parliamentary approval by December 31, 2024, in a political environment where his government doesn’t have a majority. With just weeks to draft the text and convince parliamentarians to back it, he will need to negotiate deftly across party lines.",
    "published": null
  }
]