[
  {
    "title": "Website of the Federal Government | Bundesregierung",
    "url": "https://www.bundesregierung.de/breg-en",
    "snippet": "No one should have any doubt: our support will not falter. Bundeskanzler Friedrich Merz/Federal Chancellor of Germany @Bundeskanzler ... Federal Chancellor Friedrich Merz met with the heads of the Federal State governments to discuss current topics of significance.",
    "published": null
  },
  {
    "title": "German politics – DW",
    "url": "https://www.dw.com/en/german-politics/t-63813230",
    "snippet": "What&#x27;s making news in Germany? From Bundestag debates to political controversy and pressing social issues, we bring you the stories and the people behind the headlines.",
    "published": null
  },
  {
    "title": "Meet Germany's new government",
    "url": "https://www.dw.com/en/meet-germanys-new-government/g-72377502",
    "snippet": "<strong>Germany&#x27;s new government is in place</strong>. Cabinet ministers include loyal allies of CDU Chancellor Friedrich Merz and SPD leader Lars Klingbeil. However, some of the appointments are surprising.",
    "published": null
  },
  {
    "title": "Germany: Newsroom",
    "url": "https://www.deutschland.de/en/news",
    "snippet": "In Jerusalem, Chancellor Friedrich Merz stresses solidarity with Israel but also addresses problems. ... <strong>From 1 January 2026, young men will be required by law to complete a questionnaire and undergo a medical exam</strong>. Military service itself will remain voluntary.",
    "published": null
  },
  {
    "title": "Germany’s Strategic Reckoning: Finally Ready to Assume Leadership | German Marshall Fund of the United States",
    "url": "https://www.gmfus.org/news/germanys-strategic-reckoning-finally-ready-assume-leadership",
    "snippet": "American leadership enabled German reintegration into the international system, guaranteed its security, underpinned its economic rise and supported European integration to embed Germany. To now see that relationship unravelling, or at least becoming conditional, did not only lead to a conceptual rethink but had an emotional impact in Berlin’s foreign policy circles. Moreover, it is remarkable how quickly the now governing Conservatives in particular have come to question their once-strong transatlantic compass.",
    "published": null
  }
]