[
  {
    "title": "Televerket (Sweden) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Televerket_(Sweden)",
    "snippet": "Televerket was a Swedish State authority acting as a state-owned corporation (public enterprise), responsible for telecommunications in Sweden from 1853 until 1993. Originally it was named Kongl. Elektriska Telegraf-Werket (literally: Royal Electric Telegraph Agency), which was founded in 1853.",
    "published": "June 4, 2025"
  },
  {
    "title": "Televerket (Sweden) - Alchetron, The Free Social Encyclopedia",
    "url": "https://alchetron.com/Televerket-(Sweden)",
    "snippet": "Televerket, was a Swedish State authority acting as a state-owned corporation (public enterprise), responsible for telecommunications in Sweden between 1853-1993. Originally it was named Kongl. Elektriska Telegraf-Werket (literally: Royal Electric Telegraph Agency), which was founded in 1853.",
    "published": "December 30, 2024"
  },
  {
    "title": "About: Televerket (Sweden)",
    "url": "https://dbpedia.org/page/Televerket_(Sweden)",
    "snippet": "Elektriska Telegraf-Werket (literally: Royal Electric Telegraph Agency), which was founded in 1853. Its name changed to Kongl. Telegrafverket in 1871, Kungl. Telegrafverket in 1903, the prefix Kungl. (English: Royal) was dropped in 1946 and the name was further modernised to Televerket in 1953.",
    "published": null
  },
  {
    "title": "The Swedish Newspaper of America",
    "url": "https://nordstjernan.com/news/sweden/5206/",
    "snippet": "The Swedish end was Kongl. Telegrafverket (founded in 1853 as Konglige Elektriska Telegraf-Werket - literally: Royal Electric Telegraph Agency), later changed to Kungl. Telegrafverket in 1903. The Kungliga (Royal) was dropped in 1946 and the name was further modernized to Televerket in 1953.",
    "published": null
  },
  {
    "title": "Telegrafverket, Televerket, TeliaSonera, Telia :: organisation",
    "url": "https://samlingar.goteborgsstadsmuseum.se/carlotta/web/object/311469;jsessionid=u6ydFxptMaL9ksrmG3NrhCOP",
    "snippet": "År 1925 fick <strong>Telia</strong> det tekniska ansvaret för landets rundradioverksamhet och 1956 också för televisionssändningarna. År 1953 antogs namnet Televerket och 1993 antogs <strong>Telia</strong> då en ny svensk telelag avskaffade <strong>Telia</strong>s faktiska om än ej formella monopolställning.",
    "published": null
  }
]