[
  {
    "title": "Sudanese transition to democracy (2019–2021) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudanese_transition_to_democracy_(2019–2021)",
    "snippet": "<strong>Omar al-Bashir</strong> overthrew the democratically elected government of Sadiq al-Mahdi in 1989 and was himself overthrown in the 2019 Sudanese coup d&#x27;état, in which he was replaced by the Transitional Military Council (TMC) after months of sustained street protests.",
    "published": "2 weeks ago"
  },
  {
    "title": "The Military Has Taken Power in Sudan and Dissolved Its Transitional Government | Carnegie Endowment for International Peace",
    "url": "https://carnegieendowment.org/middle-east/diwan/2021/10/the-military-has-taken-power-in-sudan-and-dissolved-its-transitional-government?lang=en",
    "snippet": "Until Monday, Burhan also headed the Sovereignty Council, which was established in 2019 to assume the powers of former dictator Omar al-Bashir, in agreement with Sudanese opposition parties and associations. But Burhan’s suspension of key articles of the 2019 Interim Constitutional Declaration effectively dissolved the council along with the transitional government, and nullified the entire political agreement on which the declaration was based.",
    "published": null
  },
  {
    "title": "Sudan war: A simple guide to what is happening",
    "url": "https://www.bbc.com/news/articles/cjel2nn22z9o",
    "snippet": "Here is what you need to know. <strong>It is the latest episode in bouts of tension that followed the 2019 ousting of long-serving President Omar al-Bashir</strong>, who came to power in a coup in 1989.",
    "published": "October 25, 2021"
  },
  {
    "title": "Sudan: Political Process to Form a Transitional Civilian Government and the Shift in Disorder Trends, Situation Update - April 2023 - Sudan | ReliefWeb",
    "url": "https://reliefweb.int/report/sudan/sudan-political-process-form-transitional-civilian-government-and-shift-disorder-trends-situation-update-april-2023",
    "snippet": "Since the ouster of former President Omar al-Bashir in April 2019, Sudan has experienced a turbulent political transition.",
    "published": null
  },
  {
    "title": "Transitional Sovereignty Council - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Transitional_Sovereignty_Council",
    "snippet": "Following more than half a year ... d&#x27;état, <strong>the TMC and the Forces of Freedom and Change alliance (FFC) made a July 2019 Political Agreement and completed it by the August 2019 Draft Constitutional Declaration</strong>....",
    "published": "November 11, 2025"
  }
]