[
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "The nominations will, as before be decided on by a panel of experts, new <strong>honorary president of the panel is EFA Chairman</strong> Mike Downey. These nominations, usually five (in its first edition, due to Covid-19, only three) will be announced as part ...",
    "published": null
  },
  {
    "title": "Mike Downey elected new EFA chairman - Cineuropa",
    "url": "https://cineuropa.org/en/newsdetail/382667",
    "snippet": "The members of the European Film Academy (EFA) have elected Mike Downey, Irish producer and CEO of Film and Music Entertainment (F&amp;ME), as <strong>new chairman of the EFA board</strong>.",
    "published": "November 12, 2019"
  },
  {
    "title": "Mike Downey (producer) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mike_Downey_(producer)",
    "snippet": "Michael Downey OBE is an Irish-British film producer. He is the co-founder and CEO of Film and Music Entertainment and <strong>as of 2020 the Chairman of the European Film Academy</strong>. Downey was born in Devon, England, the son of Brigid Downey (née Flood) and Thomas Downey, who were economic migrants ...",
    "published": "July 19, 2025"
  },
  {
    "title": "Board Members - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/board/board-members/",
    "snippet": "Mike Downey produced Agnieszka Holland’s CHARLATAN (2020) which was in the Berlinale competition. He joined the EFA Board in 2004, was elected deputy chairman in 2014, and chairman in 2020. In 2021, Queen Elizabeth II appointed Mike Downey as an <strong>Officer of the Order of the British Empire</strong> for his ...",
    "published": "June 20, 2025"
  },
  {
    "title": "Mike Downey • Producer and chairman of the European Film Academy - Cineuropa",
    "url": "https://cineuropa.org/en/interview/440528/",
    "snippet": "31/03/2023 - After receiving an honorary award at Stockfish, the “old friend of Iceland” broke down his career and the role of the International Coalition for Filmmakers at Risk",
    "published": null
  }
]