[
  {
    "title": "Salman of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Salman_of_Saudi_Arabia",
    "snippet": "His seventh son, <strong>Crown Prince Mohammed bin Salman</strong>, is considered the de facto ruler of Saudi Arabia due to the King&#x27;s poor health and Mohammed&#x27;s own political maneuvering. Mohammed replaced his father as prime minister in 2022, making Salman the first king since Saud in 1964 not to serve as ...",
    "published": "November 3, 2025"
  },
  {
    "title": "King of Saudi Arabia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/King_of_Saudi_Arabia",
    "snippet": "<strong>The king of Saudi Arabia</strong>, officially the king of the Kingdom of Saudi Arabia (Arabic: ملك المملكة العربية السعودية, romanized: Malik al-Mamlakat al-ʿArabiyat as-Suʿūdiyya), is head of state of the Kingdom of Saudi Arabia, who holds absolute power.",
    "published": "3 weeks ago"
  },
  {
    "title": "Mohammed bin Salman - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mohammed_bin_Salman",
    "snippet": "Mohammed, then deputy crown prince, was subsequently invited to the White House and given the treatment typically afforded to foreign heads of state by diplomatic protocol. He subsequently defended the Trump administration&#x27;s travel ban for nationals of 7 Muslim-majority countries, stating that &quot;Saudi Arabia does not believe that this measure is targeting Muslim countries or the religion of Islam&quot;.",
    "published": "1 day ago"
  },
  {
    "title": "Saudi Arabia - Heads of Government Listing - HOG",
    "url": "https://www.info.dfat.gov.au/info/hog/hog.nsf/ListSpecific?OpenForm=&ExpandView=&RestrictToCategory=Saudi+Arabia",
    "snippet": "The Heads of Government listing is a database that contains information on the names and titles of heads of state, heads of government, foreign ministers and in some cases, ministers responsible for development assistance.",
    "published": null
  },
  {
    "title": "Mohammed bin Salman | Biography, Saudi Arabia, Father, & Mother | Britannica",
    "url": "https://www.britannica.com/biography/Mohammed-bin-Salman",
    "snippet": "<strong>Mohammed bin Salman</strong> is the de facto ruler of Saudi Arabia, known for his aggressive foreign policy, ambitious economic vision, and controversial social reforms. He formally serves as crown prince and prime minister and is the son of King Salman.",
    "published": "July 17, 2019"
  }
]