[
  {
    "title": "Curtis Samuel - NFL News, Rumors, & Updates | FOX Sports",
    "url": "https://www.foxsports.com/nfl/curtis-samuel-player",
    "snippet": "He missed almost three weeks of practice due to a <strong>hamstring injury</strong> before returning to the field as a limited participant as of Aug. 15. Considering the Bills would incur a $8.635 million dead cap hit if he&#x27;s cut this coming week, Samuel appears certain to included among the Bills&#x27; initial ...",
    "published": null
  },
  {
    "title": "Buffalo Bills injury report has Mecole Hardman, Curtis Samuel listed",
    "url": "https://www.democratandchronicle.com/story/sports/football/nfl/bills/2025/11/18/buffalo-bills-injury-report-mecole-hardman-curtis-samuel/87338234007/",
    "snippet": "Bringing Codrington back is a tell-tale sign that the Bills will not have new kick returner Mecole Hardman, or wide receiver/returner Curtis Samuel, available for the game. Both Samuel (elbow and neck) and Hardman (calf) were hurt in last Sunday’s victory over Tampa Bay. Hardman, who was just signed as a free agent last week which led to the release of Codrington from the 53-man roster, ripped off a 61-yard kickoff return on his first play with the team, but then later lost a fumble on a punt return and suffered the injury.",
    "published": "November 18, 2025"
  },
  {
    "title": "Curtis Samuel Injury - Updates, Status, History and News | FOX Sports",
    "url": "https://www.foxsports.com/nfl/curtis-samuel-player-injuries",
    "snippet": "Learn about Curtis Samuel&#x27;s injury status at FOX Sports.",
    "published": null
  },
  {
    "title": "Curtis Samuel: Player News - NBC Sports - NBC Sports",
    "url": "https://www.nbcsports.com/nfl/curtis-samuel/5323/news",
    "snippet": "Get all the most recent Curtis Samuel player news, headlines, injury updates, transactions, and more on NBC Sports.",
    "published": null
  },
  {
    "title": "Curtis Samuel Latest Injury Status and Updates (2025)",
    "url": "https://fantasyfootballcalculator.com/players/curtis-samuel/injury",
    "snippet": "Curtis Samuel&#x27;s latest injury status and more. Check his recent injuries in 2025 and historical injury statuses from previous years, and more.",
    "published": null
  }
]