[
  {
    "title": "ETH Zurich - Homepage | ETH Zurich",
    "url": "https://ethz.ch/en.html",
    "snippet": "Konrad Schindler, Professor of Photogrammetry and Remote Sensing at <strong>ETH Zurich</strong>, has been named Fellow of the Institute of Electrical and Electronics Engineers (IEEE), effective 1 January 2026. The honour recognises his contributions to computer vision and artificial intelligence in photogrammetry ...",
    "published": null
  },
  {
    "title": "ETH Zurich - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/ETH_Zurich",
    "snippet": "ETH Zurich (German: Eidgenössische Technische Hochschule Zürich; English: Federal Institute of Technology Zurich) is <strong>a public university in Zurich, Switzerland</strong>. Founded in 1854, the university primarily teaches and conducts research in science, technology, engineering, and mathematics (STEM).",
    "published": "19 hours ago"
  },
  {
    "title": "ETH Zurich : Rankings, Fees & Courses Details | TopUniversities",
    "url": "https://www.topuniversities.com/universities/eth-zurich",
    "snippet": "The university, officially called the <strong>Swiss Federal Institute of Technology Zurich</strong> in English, has 16 departments that offer academic education and conduct scientific research in subjects ranging from engineering and architecture to chemistry ...",
    "published": null
  },
  {
    "title": "ETH Zürich | LinkedIn",
    "url": "https://www.linkedin.com/school/eth-zurich/",
    "snippet": "ETH Zurich – Where the future begins Freedom and individual responsibility, entrepreneurial spirit and open-mindedness: ETH Zurich stands on a bedrock of true Swiss values. Our <strong>university for science and technology</strong> dates back to the year 1855, ...",
    "published": null
  },
  {
    "title": "ETH Zurich in Switzerland invites applications for vacant (13) PhD",
    "url": "https://scholaridea.com/2025/06/12/eth-zurich-in-switzerland-invites-applications-for-vacant-13-phd-scholarships/",
    "snippet": "<strong>ETH Zurich</strong> in Switzerland invites application for vacant PhD Scholarships, one of the leading universities for technology and the natural sciences in Switzerland. PhD Position - 3D Cell-Based Tissue Simulation Framework100%, Basel, fixed-term11.06.2025 | D-BSSE, CoBi",
    "published": "2 days ago"
  }
]