[
  {
    "title": "High Representative of the Union for Foreign Affairs and Security Policy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/High_Representative_of_the_Union_for_Foreign_Affairs_and_Security_Policy",
    "snippet": "The High Representative of the Union for Foreign Affairs and Security Policy/Vice-President of the European Commission (HR/VP) is the chief co-ordinator and representative of the Common Foreign and Security Policy (CFSP) within the European Union (EU). The position is currently held by <strong>Kaja Kallas</strong>.",
    "published": "October 20, 2025"
  },
  {
    "title": "EU High Representative for Foreign Affairs and Security Policy - Consilium",
    "url": "https://www.consilium.europa.eu/en/council-eu/high-representative-foreign-affairs-security-policy/",
    "snippet": "The EU High Representative for ... and coherence of the EU’s external action. ... The current High Representative is <strong>Kaja Kallas</strong>, who was appointed for a 5-year period from December 2024....",
    "published": null
  },
  {
    "title": "High Representative of the Union for Foreign Affairs and Security Policy (EU) | Practical Law",
    "url": "https://uk.practicallaw.thomsonreuters.com/w-014-6457?transitionType=Default&contextData=(sc.Default)",
    "snippet": "The High Representative is appointed by the European Council acting by a qualified majority, with the agreement of the President of the Commission for a mandate of five years.",
    "published": null
  },
  {
    "title": "High Representative / Vice President | EEAS - European Union",
    "url": "https://www.eeas.europa.eu/eeas/high-representative-vice-president_en",
    "snippet": "High Representative of the Union for Foreign Affairs &amp; Security Policy/Vice-President of the European Commission. Spain&#x27;s <strong>Josep Borell</strong> was the third HR/VP.",
    "published": null
  },
  {
    "title": "High Representative of the Union for Foreign Affairs and Security Policy - EUR-Lex",
    "url": "https://eur-lex.europa.eu/EN/legal-content/glossary/high-representative-of-the-union-for-foreign-affairs-and-security-policy.html",
    "snippet": "The post of HR was originally created in 1997 under the Amsterdam Treaty and the first holder of the post was Javier Solana, Secretary-General of the Council of the European Union. The Lisbon Treaty, which entered into force in December 2009, maintained the function of the HR, albeit with a broader treaty-based mandate, including the presidency of the Foreign Affairs Council and the role of vice-president of the Commission.",
    "published": null
  }
]