[
  {
    "title": "List of presidents of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_presidents_of_Portugal",
    "snippet": "This list includes not only those persons who were sworn into office as President of Portugal but also those who de facto served as head of state since 1910. This is the case of Teófilo Braga who served as President of the Provisional Government after the republican coup d&#x27;état.",
    "published": "2 weeks ago"
  },
  {
    "title": "President of Portugal - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Portugal",
    "snippet": "The Portuguese Third Republic is a semi-presidential system. Despite being a rather ceremonial figure, unlike most European presidents, who are at large ceremonial figures, the Portuguese President is vested with more extensive powers.",
    "published": "1 week ago"
  },
  {
    "title": "Marcelo Rebelo de Sousa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Marcelo_Rebelo_de_Sousa",
    "snippet": "In December 2020, <strong>Marcelo Rebelo de Sousa</strong> announced his intention to run for office again in the 2021 Portuguese presidential election. Marcelo was re-elected president in January 2021, with 60.7% of the votes, the third highest vote margin ever in presidential elections in Portugal since the ...",
    "published": "6 days ago"
  },
  {
    "title": "Previous Presidents - President of The Republic - Official Information Site of the Presidency of the Portuguese Republic",
    "url": "https://www.presidencia.pt/en/president-of-the-republic/the-presidency/previous-presidents/",
    "snippet": "This tool also allows you to translate all the contents of this website into English and 17 other languages, including the News area, which is only available in Portuguese.",
    "published": null
  },
  {
    "title": "Presidential Election 2021 Portugal",
    "url": "https://www.robert-schuman.eu/en/monitor/1876",
    "snippet": "&gt; The European Elections Monitor &gt; <strong>Marcelo Rebelo de Sousa</strong> is re-elected President of the Republic of Portugal in the first round",
    "published": null
  }
]