[
  {
    "title": "Mary Earps News, Stats and Updates | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/sport/mary-earps/index.html",
    "snippet": "Sunday, Dec 14th 2025 4AM 3°C 7AM 3°C 5-Day Forecast · Advertisement · Lionesses&#x27; bloody-nosed hero: <strong>Hampton forced Earps into retirement</strong> · Revealed: How Mary Earps has split the Lionesses dressing room · Page · Prev · 1 · 2 · 3 · ...",
    "published": null
  },
  {
    "title": "How private Sarina Wiegman handled the very public Mary Earps fallout - The Athletic",
    "url": "https://www.nytimes.com/athletic/6858959/2025/12/05/sarina-wiegman-mary-earps-hannah-hampton-analysis/",
    "snippet": "Former England No 1 Mary Earps wrote in her autobiography All In that <strong>she believed goalkeeper Hannah Hampton had been “rewarded for bad behaviour”,</strong> a controversial extract in the book that sparked headlines and debate.",
    "published": "2 weeks ago"
  },
  {
    "title": "Mary Earps’ Manchester United return: Jeers, cheers, selfies and a painful defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6802703/2025/11/13/mary-earps-manchester-united-psg/",
    "snippet": "United, in contrast, are one of three sides (along with Barcelona and Lyon, who have won nine of the past 10 Champions Leagues between them) with a maximum nine points at the halfway point in the league phase ahead of tough fixtures away to Wolfsburg next Wednesday and home against Lyon on December 10. At the full-time whistle, as “Glory, glory Man United” blared out, Earps took a swig from her water bottle, picked up her towel and shook hands with United head coach Marc Skinner.",
    "published": "November 13, 2025"
  },
  {
    "title": "Mary Earps and the end of an England career that was a testament to willpower - The Athletic",
    "url": "https://www.nytimes.com/athletic/6385134/2025/05/27/mary-earps-england-retirement-profile/",
    "snippet": "But Earps has always worn her heart on her sleeve. Her inconsolable tears after the dramatic 3-2 win against the Netherlands in a December 2023 Nations League match were a reminder of her vulnerability, the almost-impossible standards she holds herself to.",
    "published": "May 27, 2025"
  },
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "Some controversy was sparked due to comments Earps made about former teammate Hannah Hampton and England manager Sarina Wiegman in the book. <strong>On 31 October 2025, Earps disclosed that she is in a same-sex relationship</strong>.",
    "published": "1 month ago"
  }
]