[
  {
    "title": "Galway United » David Hurley",
    "url": "https://galwayunitedfc.ie/player/david-hurley/",
    "snippet": "Cork-born attacking midfielder David Hurley joined Galway United in 2020 and has been a key figure ever since. Hurley signed from Cobh Ramblers in November 2020. He was United’s top scorer in 2023 with 21 league goals, helping secure the First Division title.",
    "published": null
  },
  {
    "title": "David Hurley - Professional Football Player - Galway United Football Club | LinkedIn",
    "url": "https://www.linkedin.com/in/david-hurley-787b37267/",
    "snippet": "I am absolutely thrilled to sign a 3-year deal with Galway United (4th year optional depending on performance!).The negotiations with John and Ollie… · Despite 2023 throwing up some challenges, it quickly became a successful year for me personally. I am extremely grateful to every staff member… · Nice to speak about my role and time at Columbus Crew so far.",
    "published": null
  },
  {
    "title": "David Hurley - Player profile 2025 | Transfermarkt",
    "url": "https://www.transfermarkt.co.uk/david-hurley/profil/spieler/535632",
    "snippet": "David Hurley, 26, from Ireland ➤ Galway United FC, since 2020 ➤ <strong>Central Midfield</strong> ➤ Market value: €100k ➤ * 21/10/1998 in Cork, Ireland",
    "published": null
  },
  {
    "title": "David Hurley (@davidhurley98) / X",
    "url": "https://twitter.com/davidhurley98",
    "snippet": "JavaScript is not available · We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center · Help Center · Terms of Service Privacy Policy ...",
    "published": null
  },
  {
    "title": "Galway United retain services of David Hurley - The Home of Irish Football - Extratime.com",
    "url": "https://www.extratime.com/articles/32293/galway-united-retain-services-of-david-hurley/",
    "snippet": "Hurley’s re-signing was unveiled this evening after the 25-year-old had a stellar year in 2023. The Corkman won the Galway United Men&#x27;s Player of the Year and scored 24 goals throughout the season for the Tribesmen. And that helped them win the league convincingly and earn promotion back to the Premier Division. Galway United are delighted to announce that our Player Of The Year, David Hurley has signed back for 2024 READ MORE https://t.co/t9vyAHGzXu SEASON TICKETS https://t.co/MhgHXIswwb#ItsATribalThingpic.twitter.com/jQ3150m1qC — Gaillimh Aontaithe (@GalwayUnitedFC) November 30, 2023",
    "published": null
  }
]