[
  {
    "title": "Angela Merkel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Angela_Merkel",
    "snippet": "In the wake of this defeat on the federal level, Merkel oversaw a string of CDU election victories in six out of seven state elections in 1999, breaking the long-standing SPD-Green hold on the Bundesrat. Following a party funding scandal that compromised many leading figures of the CDU – including Kohl himself and his successor as CDU Leader, Wolfgang Schäuble – Merkel criticised her former mentor publicly and advocated a fresh start for the party without him.",
    "published": "2 days ago"
  },
  {
    "title": "Scholz replaces Merkel as German chancellor, opening new era | AP News",
    "url": "https://apnews.com/article/climate-elections-europe-angela-merkel-european-union-675ee26e99ce6e7f57d0f61989b05a16",
    "snippet": "The new chancellor then returned to parliament to be sworn in. Scholz, who has no religious affiliation, omitted the optional phrase “so help me God” from his oath of office, as did Merkel’s predecessor, <strong>Gerhard Schroeder</strong>.",
    "published": "December 8, 2021"
  },
  {
    "title": "Angela Merkel’s successor | Germany’s candidates for chancellor",
    "url": "https://www.deutschland.de/en/topic/politics/angela-merkels-successor-germanys-candidates-for-chancellor",
    "snippet": "59-year-old Laschet is considered to be a politician who seeks reconciliation and balance. His father was a miner and later a teacher, his mother a housewife. He is married to Susanna Laschet, a bookseller. They have three children. His political agenda is the same as that represented by Angela Merkel, with a strong focus on the European Union.",
    "published": "September 24, 2021"
  },
  {
    "title": "Scholz takes the helm as German chancellor as Merkel era ends | PBS News",
    "url": "https://www.pbs.org/newshour/world/scholz-takes-the-helm-as-german-chancellor-as-merkel-era-ends",
    "snippet": "The new chancellor then returned to parliament to be sworn in. Scholz, who has no religious affiliation, omitted the optional phrase “so help me God” from his oath of office, as did Merkel’s predecessor, <strong>Gerhard Schroeder</strong>.",
    "published": "December 8, 2021"
  },
  {
    "title": "Germany's Olaf Scholz takes over from Merkel as chancellor",
    "url": "https://www.bbc.com/news/world-europe-59575773",
    "snippet": "In turn, he spoke of the crises that had brought them together and of the &quot;deeply trusting collaboration&quot; they had developed. First elected in December 1990, Angela Merkel was immediately given a ministerial job by then Chancellor <strong>Helmut Kohl</strong>.",
    "published": "December 8, 2021"
  }
]