[
  {
    "title": "President of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Kyrgyzstan",
    "snippet": "<strong>Askar Akayev was forced from office by the Tulip Revolution of 2005 and Kurmanbek Bakiyev was forced from office by the Kyrgyz Revolution of 2010.</strong> Almazbek Atambayev was peacefully succeeded by Sooronbay Jeenbekov in 2017. However, Jeenbekov resigned from office due to the 2020 Kyrgyzstani ...",
    "published": "November 11, 2025"
  },
  {
    "title": "Kyrgyzstan profile - Timeline - BBC News",
    "url": "https://www.bbc.com/news/world-asia-16185772",
    "snippet": "<strong>2010 July - Interim leader Roza Otunbayeva sworn in as caretaker president to prepare for new elections in October 2011.</strong> 2010 September - Uzbek rights activist Azimjon Askarov sentenced to life in prison.",
    "published": "January 11, 2021"
  },
  {
    "title": "List of leaders of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_leaders_of_Kyrgyzstan",
    "snippet": "With the Soviet Union came electricity, water, irrigation, industrialization and literacy to Kyrgyzstan, and the other Soviet Central Asian countries. Scholars such as Alec Nove and J.A. Newth have argued that most development indicators suggests that the Soviet Muslim countries far-exceeded those Muslim countries outside the Soviet sphere of influence. The administrative, political and economic system was revolutionary by Kyrgiz standards, however, numerical indicators of development only partially supports this view, with one claiming that 63.2% of Kyrgyzstan&#x27;s population still lived in rural areas.",
    "published": "October 3, 2025"
  },
  {
    "title": "Politics of Kyrgyzstan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Kyrgyzstan",
    "snippet": "By June 2003, the lower house of Parliament announced that President Akayev and two other leaders of Kyrgyzstan, from the Soviet era, would be given lifetime immunity from prosecution, raising the prospect of Akayev finally stepping down. In 2005, following disputed results of the 2005 parliamentary elections, Kyrgyzstan was thrown into a state of political turmoil, with different parties claiming that they were the legitimate government.",
    "published": "3 weeks ago"
  },
  {
    "title": "Kyrgyzstan (10/08)",
    "url": "https://2001-2009.state.gov/r/pa/ei/bgn/5755.htm",
    "snippet": "Facts about the land, people, history, government, political conditions, economy, foreign relations of Kyrgyzstan.",
    "published": null
  }
]