[
  {
    "title": "Current Shareholding - Juventus Football Club",
    "url": "https://www.juventus.com/en/club/investor-relations/shareholding-title/current-shareholding",
    "snippet": "As of 7 November 2025 the shareholding structure of Juventus Football Club S.p.A.",
    "published": null
  },
  {
    "title": "Juventus FC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Juventus_FC",
    "snippet": "On 7 October 2025, Juventus announced that its chief executive officer, Maurizio Scanavino, would step down from his position on 7 November 2025, concluding a three-year tenure that began in late 2022 following the resignation of the club’s previous board of directors.",
    "published": "1 week ago"
  },
  {
    "title": "Tuttosport claims Andrea Agnelli wants to return to Juventus as majority owner | Black & White & Read All Over",
    "url": "https://www.blackwhitereadallover.com/2025/3/13/24383859/juventus-andrea-agnelli-john-elkann-jurgen-klopp-2025-serie-a-ownership-agnelli-family",
    "snippet": "The report states that current Juventus president <strong>Gianluca Ferrero</strong>, who took over as president in 2023 following Agnelli’s departure, has been “managing” a potential deal for months.",
    "published": "March 13, 2025"
  },
  {
    "title": "Juventus Owners: Past & Present Ownership Details",
    "url": "https://www.sportsdunia.com/football-teams/juventus-owners",
    "snippet": "Currently, <strong>Exor N.V.</strong> is the main owner of Juventus. However, the Agnelli Family is the owner of <strong>Exor N.V.</strong>, as most family members of the Agnelli Family are the stakeholders in Exor, and the company was founded by Giovanni Agnelli.",
    "published": "June 27, 2025"
  },
  {
    "title": "Andrea Agnelli - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Andrea_Agnelli",
    "snippet": "Since becoming chairman, Juventus won nine scudetti in a row, a record in Serie A, including five Coppa Italia titles, of which four in a row since the 2014–15 Coppa Italia, five Supercoppa Italiana titles, and reached two UEFA Champions League finals. Agnelli became the second third-generation member of the Fiat-owner family to be involved with the Italian football club Juventus.",
    "published": "3 weeks ago"
  }
]