[
  {
    "title": "AFC Ajax - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/AFC_Ajax",
    "snippet": "They hired <strong>Francesco Farioli</strong> as new head coach, the first foreign coach since 1998. Under his leadership, Ajax reached the league phase of the Europa League, where it finished eleventh. On 9 February 2025, Ajax finished the weekend on the first place for the first time since November 2022.",
    "published": "2 weeks ago"
  },
  {
    "title": "John Heitinga appointed head coach of Ajax",
    "url": "https://english.ajax.nl/articles/john-heitinga-appointed-head-coach-of-ajax",
    "snippet": "Date: 31.05.2025 · Photographer: AFC Ajax · #Heitinga · Heitinga (Alphen aan den Rijn, November 15, 1983) has spent the past two seasons working in the English Premier League as an assistant coach at West Ham United and Liverpool. Before his move to England in the summer of 2023, the former Ajax player served as interim head coach of Ajax 1 for several months.",
    "published": null
  },
  {
    "title": "John Heitinga - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/John_Heitinga",
    "snippet": "On 17 July 2024, Heitinga was appointed as the new assistant coach at Liverpool. He took charge of Liverpool for the first time in a 2–0 win over Newcastle United on 26 February 2025, whilst manager Arne Slot and assistant manager Sipke Hulshoff were suspended. That season, Liverpool, under Slot’s leadership, won the Premier League title. On 31 May 2025, Heitinga agreed to return to his former club Ajax as head coach, signing a two-year contract set to begin with the 2025–26 season.",
    "published": "2 weeks ago"
  },
  {
    "title": "Ajax to sack manager John Heitinga less than six months after Liverpool exit - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cn7e1k2pp31o",
    "snippet": "According to local media, Ajax are interested in hiring their former manager <strong>Erik ten Hag</strong>, who was sacked by Manchester United in October 2024 and lasted just two Bundesliga games in charge at Bayer Leverkusen before being dismissed in September ...",
    "published": "November 6, 2025"
  },
  {
    "title": "r/soccer on Reddit: [VI] Fred Grim will be Ajax first team head coach until at least the winter break",
    "url": "https://www.reddit.com/r/soccer/comments/1p2uetc/vi_fred_grim_will_be_ajax_first_team_head_coach/",
    "snippet": "Ajax coach <strong>John Heitinga</strong>: &quot;Galatasaray is a strong team. They have very fast players. You must not give this team too much space. We need to play very tightly. We must not lose the ball.",
    "published": "4 weeks ago"
  }
]