[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Alexei Anatolyevich Navalny (Russian: Алексей Анатольевич Навальный, IPA: [ɐlʲɪkˈsʲej ɐnɐˈtolʲjɪvʲɪtɕ nɐˈvalʲnɨj]; 4 June 1976 – 16 February 2024) was a Russian opposition leader, anti-corruption activist and political prisoner.",
    "published": "1 day ago"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. In 2000, while he was still a student, Navalny joined <strong>Yabloko</strong>, ...",
    "published": "March 7, 2023"
  },
  {
    "title": "5 things to know about Russian opposition leader Alexei Navalny – POLITICO",
    "url": "https://www.politico.eu/article/5-things-you-need-to-know-about-alexei-navalny/",
    "snippet": "Although Navalny is widely viewed as a leading Russian opposition figure, he has — unlike Nemtsov — never held public office. He got his start in politics as a member of the <strong>liberal Yabloko opposition party</strong> in 2000, but was expelled from ...",
    "published": "August 21, 2020"
  },
  {
    "title": "Russia of the Future - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Russia_of_the_Future",
    "snippet": "On 22 February 2018, the former deputy coordinator of the Moscow headquarters of the presidential campaign of Alexei Navalny, Vitaly Serukanov, stated on his Facebook page that documents had been submitted to the Ministry of Justice to rename the party Civic Position to Party of Progress. Navalny said that the political strategist Andrei Bogdanov was trying to steal the name of the party from him, as was the case in 2013 with the name “People&#x27;s Alliance”. On 19 March 2018, the Ministry of Justice registered the renaming of Bogdanov&#x27;s Civic Position to the Party of Progress.",
    "published": "September 30, 2025"
  },
  {
    "title": "The Two Layers of Alexei Navalny | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/two-layers-alexei-navalny",
    "snippet": "One of its founders, Grigory Yavlinsky, had been a young reformist voice in the early 1990s but, by the 2000s, had become a fixture of Moscow’s political establishment. He relied on traditional methods, such as behind-closed-doors deals with the Kremlin and curated appearances on Kremlin-controlled television. Navalny, then in his late twenties, broke away from this model, pioneering grassroots campaigns and harnessing social media for voter mobilization on a scale previously unseen in Russian or even European politics.",
    "published": null
  }
]