[
  {
    "title": "Kybunpark - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Kybunpark",
    "snippet": "<strong>The Kybunpark, formerly known as AFG Arena</strong>, is a multi-use stadium in St. Gallen, Switzerland, completed in 2008. It is used mostly for football matches and hosts the home matches of FC St. Gallen of the Swiss Super League. It replaces the Espenmoos stadium. The stadium has a capacity of 20,000 ...",
    "published": "July 13, 2025"
  },
  {
    "title": "FC St. Gallen - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/FC_St._Gallen",
    "snippet": "FC St. Gallen play their home games at <strong>the Kybunpark</strong>. The stadium has a capacity of 19,694 and it is on the west side of town.",
    "published": "November 21, 2025"
  },
  {
    "title": "Kybunpark - AFG Arena - St. Gallen - The Stadium Guide",
    "url": "https://www.stadiumguide.com/afgarena/",
    "snippet": "Gallen | Opening: 2008 | Capacity: 19,568 (est. 4,500 standing) <strong>Kybunpark, previously known as AFG Arena</strong>, replaced St. Gallen’s old Espenmoos Stadion, which lacked the facilities of modern era stadiums.",
    "published": "April 25, 2017"
  },
  {
    "title": "Stadium Guide: Kybunpark (St. Gallen, Switzerland) – doragon sports",
    "url": "https://doragonsports.com/2025/07/02/stadium-guide-kybunpark-st-gallen-switzerland/",
    "snippet": "Welcome to Kybunpark, the energetic heart of Swiss football in the country’s northeast. Nestled between St. Gallen and Gossau, this modern, multi-use stadium is home to FC St. Gallen, Switzerland’s…",
    "published": "July 2, 2025"
  },
  {
    "title": "Name game for FC St Gallen’s stadium - Coliseum",
    "url": "https://www.coliseum-online.com/name-game-for-fc-st-gallens-stadium/",
    "snippet": "<strong>The Kybunpark, formerly known as AFG Arena</strong>, is a multi-use stadium in St. Gallen, Switzerland, completed in 2008. It is used mostly for football matches and hosts the home matches of FC St.",
    "published": "October 1, 2025"
  }
]