[
  {
    "title": "Jean-Luc Mélenchon - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jean-Luc_M%C3%A9lenchon",
    "snippet": "He rejects the labels of radical left or far-left that the press has often ascribed to his political positions. According to historian Jean-Numa Ducange, Mélenchon became for many the main representative of the historical French left during the 2017 presidential election, scoring 20%, far ahead of the Socialist Party candidate Benoît Hamon, and was not a radical leftist, having unconditionally supported the Plural Left that was in power between 1997 and 2002, and having himself been a minister in this government between 2000 and 2002.",
    "published": "2 days ago"
  },
  {
    "title": "Who Is Jean-Luc Melenchon? All About The New Popular Front Leader | Europe - Times Now",
    "url": "https://www.timesnownews.com/world/europe/who-is-jean-luc-melenchon-age-family-daughter-net-worth-controversies-new-popular-union-article-111560066",
    "snippet": "Jean-Luc Melenchon, born on August 19, 1951, in Tangier, Morocco, is the son of a postmaster and a primary school teacher.After working as a teacher for a while, Melenchon entered politics in September 1976 and joined the <strong>Socialist Party (PS).</strong>",
    "published": "July 7, 2024"
  },
  {
    "title": "Jean-Luc Mélenchon facts for kids",
    "url": "https://kids.kiddle.co/Jean-Luc_M%C3%A9lenchon",
    "snippet": "In 1976, Mélenchon joined the <strong>Socialist Party</strong>. He quickly became involved in local politics. He was elected as a town councillor in Massy in 1983. In 1986, he was elected to the Senate, the upper house of the French parliament.",
    "published": null
  },
  {
    "title": "Who is Jean-Luc Melenchon, the hard left-leader dubbed 'France's Jeremy Corbyn'? | World News | Sky News",
    "url": "https://news.sky.com/story/who-is-jean-luc-melenchon-the-hard-left-leader-dubbed-frances-jeremy-corbyn-13174952",
    "snippet": "Mr Melenchon has been a fixture in French left-wing politics for decades. He spent 30 years in the <strong>Socialist Party</strong> and held ministerial posts before breaking with the party in 2008.",
    "published": "July 8, 2024"
  },
  {
    "title": "7th parliamentary term | Jean-Luc MÉLENCHON | MEPs | European Parliament",
    "url": "https://www.europarl.europa.eu/meps/en/96742/JEAN-LUC_MELENCHON/history/7",
    "snippet": "Jean-Luc MÉLENCHON · France · Date of birth : 19-08-1951, Tanger · 14-07-2009 / 30-06-2014 : Confederal Group of the European United Left - Nordic Green Left - Member · 14-07-2009 / 30-06-2014 : <strong>Front de gauche</strong> pour changer d’Europe (France) ...",
    "published": null
  }
]