[
  {
    "title": "Fiat Chrysler Automobiles - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fiat_Chrysler_Automobiles",
    "snippet": "<strong>Its corporate headquarters were domiciled in Amsterdam and its financial headquarters were in London</strong>. The holding company was listed on the New York Stock Exchange and Milan&#x27;s Borsa Italiana. Exor, an Italian investment group controlled by the Agnelli family, owned 29% of FCA and controlled ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Fellowship of Christian Athletes - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fellowship_of_Christian_Athletes",
    "snippet": "<strong>After two years in Oklahoma, McClanen moved FCA&#x27;s headquarters to Kansas City, Missouri</strong>. That year (1956), FCA also conducted its first national camp‚ then referred to as a national conference‚ which drew 256 athletes and coaches to Estes Park, Colorado. The ministry continued its expansion ...",
    "published": "June 16, 2025"
  },
  {
    "title": "Chrysler World Headquarters and Technology Center - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Chrysler_World_Headquarters_and_Technology_Center",
    "snippet": "<strong>Completed between 1993 and 1996 for the Chrysler Corporation</strong>, the building has followed the company as it changed hands several times since, serving as the North American headquarters for DaimlerChrysler, Fiat Chrysler Automobiles (FCA) and now Stellantis North America.",
    "published": "1 week ago"
  },
  {
    "title": "Fellowship of Christian Athletes | FCA TimelineFellowship of Christian Athletes | FCA Timeline",
    "url": "https://timeline.fca.org/",
    "snippet": "Vice presidential Dick Cheney visited FCA’s World Headquarters (now National Support Center) in 2000 to endorse the One Way 2 Play – Drug Free!",
    "published": null
  },
  {
    "title": "FCA History",
    "url": "https://www.fcabv.org/history",
    "snippet": "History · <strong>1954 - FCA incorporated by its founder, Don McClanen. Paul Benedum, Branch Rickey and other Pittsburgh businessmen underwrite the first year’s budget. Charter members included Otto Graham, Carl Erskine, Donn Moomaw and Rickey. 1956 - First National Camp at Estes Park, Colo., with 256 athletes and coaches attending. FCA moves its national headquarters from Norman, Okla., to Kansas City, Mo</strong>...",
    "published": null
  }
]