[
  {
    "title": "Justin Trudeau - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Justin_Trudeau",
    "snippet": "In 2025, it was reported that Trudeau was dating American singer <strong>Katy Perry</strong>. On December 6, the two confirmed their relationship on Instagram.",
    "published": "4 days ago"
  },
  {
    "title": "Opinion | Justin Trudeau and Katy Perry Are Worth Rooting For - The New York Times",
    "url": "https://www.nytimes.com/2025/12/18/opinion/justin-trudeau-katy-perry-couple.html",
    "snippet": "Marche is the author, most recently, of “The Next Civil War: Dispatches From the American Future.” · The former Canadian prime minister Justin Trudeau and the pop star Katy Perry are now <strong>publicly a couple</strong>: They acknowledged it, naturally ...",
    "published": "8 hours ago"
  },
  {
    "title": "Justin Trudeau Confirms Relationship With Katy Perry. \"Craziest Hard Launch In History,\" Says Internet",
    "url": "https://www.ndtv.com/entertainment/justin-trudeau-confirms-relationship-with-katy-perry-craziest-hard-launch-in-history-says-internet-9755141",
    "snippet": "Katy and I were so glad to have the chance to sit down with you and Yuko. Thank you, Fumio, for your friendship and your continued commitment to both the international rules-based order and to a better future for everyone. https://t.co/zLEuppHNST— Justin Trudeau (@JustinTrudeau) December 4, 2025",
    "published": "3 weeks ago"
  },
  {
    "title": "Canadian Prime Minister Justin Trudeau and his wife announce their separation : NPR",
    "url": "https://www.npr.org/2023/08/03/1191789443/canadian-prime-minister-justin-trudeau-and-his-wife-announce-their-separation",
    "snippet": "TORONTO — Canadian Prime Minister Justin Trudeau and his wife, Sophie Gregoire Trudeau, announced Wednesday that they are <strong>separating after 18 years of marriage</strong>.",
    "published": "August 3, 2023"
  },
  {
    "title": "Is Justin Trudeau dating? What PM said in Quebec year-end interviews | National Post",
    "url": "https://nationalpost.com/news/politics/justin-trudeau-french-year-end-interviews",
    "snippet": "OTTAWA – The end of the year is always prone to some self-reflection from our political leaders, and Prime Minister Justin Trudeau has been making the rounds to a number of media outlets.",
    "published": "December 22, 2023"
  }
]