[
  {
    "title": "Biography - Elly Schlein",
    "url": "https://www.ellyschlein.it/en/biography",
    "snippet": "Elena Schlein, Elly, was <strong>born in Lugano (Switzerland) to an Italian mother and an American father</strong>.",
    "published": "February 16, 2022"
  },
  {
    "title": "Elly Schlein - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Elly_Schlein",
    "snippet": "Elena Ethel &quot;Elly&quot; Schlein (Italian: [ˈɛlli ˈʃlain]; born 4 May 1985) is an <strong>Italian politician who has been serving as the secretary of the Democratic Party (PD) since 12 March 2023</strong>. She is a member of Italy&#x27;s Chamber of Deputies and was previously the vice president of Emilia-Romagna and ...",
    "published": "1 week ago"
  },
  {
    "title": "Elly Schlein Biography: Age, Net Worth, Career - Mabumbe",
    "url": "https://mabumbe.com/people/elly-schlein-biography-age-net-worth-career/",
    "snippet": "Elly Schlein’s early years were steeped in a blend of cultures that would later inform her worldview. <strong>Born in Lugano, Switzerland, to an American father of Jewish descent and an Italian mother</strong>, she navigated multiple identities from a young age.",
    "published": "August 29, 2025"
  },
  {
    "title": "4 Things to Know About Elly Schlein, Face of Italy's Largest Opposition Party | ITALY Magazine",
    "url": "https://www.italymagazine.com/featured-story/4-things-know-about-elly-schlein-face-italys-largest-opposition-party",
    "snippet": "Here’s a rundown of who this ... in the future. Elena Ethel “Elly” Schlein was <strong>born in 1985 in Lugano, Switzerland to an Italian mother and Jewish-American father</strong>....",
    "published": "March 9, 2023"
  },
  {
    "title": "Elena Ethel \"Elly\" Schlein - UJE - Ukrainian Jewish Encounter",
    "url": "https://ukrainianjewishencounter.org/en/elena-ethel-elly-schlein/",
    "snippet": "Elena Ethel (Elly) Schlein is an Italian politician. She was <strong>born in 1985 in Lugano, Switzerland</strong>. Her father, Melvin Schlein, is an American academic and",
    "published": "April 8, 2025"
  }
]