[
  {
    "title": "Katy Perry and Justin Trudeau: A Complete Relationship Timeline | Glamour",
    "url": "https://www.glamour.com/story/katy-perry-justin-trudeau-timeline",
    "snippet": "Here’s a complete timeline of ... December 5, 2025: <strong>Perry posts a few moments with Trudeau in her Instagram roundup from her trip to Japan for her global Lifetimes Tour concert on December 3.</strong>...",
    "published": "August 3, 2025"
  },
  {
    "title": "Katy Perry and Justin Trudeau make their relationship Instagram official | Justin Trudeau | The Guardian",
    "url": "https://www.theguardian.com/world/2025/dec/08/katy-perry-justin-trudeau-instagram-relationship-official",
    "snippet": "<strong>Katy Perry and Justin Trudeau have launched their relationship on Instagram</strong>, after the singer posted a photo of the pair smiling cheek to cheek and a video of them eating sushi together while in Japan.",
    "published": "2 weeks ago"
  },
  {
    "title": "Katy Perry and Justin Trudeau make it official on social media",
    "url": "https://www.nbcnews.com/pop-culture/celebrity/katy-perry-justin-trudeau-make-official-social-media-rcna247955",
    "snippet": "The public confirmation of their relationship during a trip to Japan is the culmination of months of speculation that began when the couple were first spotted together in July. Former Canadian Prime Minister Justin Trudeau and American singer Katy Perry.@katyperry / via Instagram ... Dec. 8, 2025, 6:17 AM EST",
    "published": "2 weeks ago"
  },
  {
    "title": "Katy Perry and Justin Trudeau go Instagram official",
    "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/12/07/katy-perry-justin-trudeau-dating-photos/87659189007/",
    "snippet": "Katy Perry and former Canadian Prime Minister Justin Trudeau are <strong>Instagram official</strong>.",
    "published": "2 weeks ago"
  },
  {
    "title": "Katy Perry and Justin Trudeau publicly share relationship in social media post | Fox News",
    "url": "https://www.foxnews.com/entertainment/katy-perry-romance-justin-trudeau-intimate-japan-photos-world-tour",
    "snippet": "Katy Perry shares Instagram photos with Canadian Prime Minister Justin Trudeau during their Japan visit, officially revealing their relationship to fans.",
    "published": "2 weeks ago"
  }
]