[
  {
    "title": "Angela Merkel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Angela_Merkel",
    "snippet": "In 1977, at the age of 23, Merkel, then Angela Kasner, <strong>married physics student Ulrich Merkel (born 1953) and took his surname</strong>. The couple divorced in 1982. Her second and current husband is quantum chemist and professor Joachim Sauer, who has largely avoided media attention during and after ...",
    "published": "1 week ago"
  },
  {
    "title": "Angela Merkel | Book, Biography, Putin, Education, Freedom, & Facts | Britannica",
    "url": "https://www.britannica.com/biography/Angela-Merkel",
    "snippet": "Merkel was elected secretary-general of the CDU on November 7. <strong>She married her longtime companion, chemistry professor Joachim Sauer, on December 30 of that year</strong>. ... BBC - Witness History - Angela Merkel&#x27;s Rise to Power (Nov.",
    "published": "December 7, 2005"
  },
  {
    "title": "Angela Merkel: The Authorized Biography | Wilson Center",
    "url": "https://www.wilsoncenter.org/event/angela-merkel-the-authorized-biography",
    "snippet": "As well as explaining how Angela Merkel&#x27;s world view was shaped and influenced by her background and ideology, this lively account discusses her personal relations with international counterparts such as David Cameron, Barack Obama, and Vladimir Putin, as well as her attitude towards the countries and cultures over which they rule.",
    "published": null
  },
  {
    "title": "7 things you probably didn’t know about Angela Merkel",
    "url": "https://www.iamexpat.de/expat-info/germany-news/7-things-you-probably-didnt-know-about-angela-merkel",
    "snippet": "She then wandered across the border ... to sag at my desk,” she apparently said. <strong>Born Angela Kasner, she became Angela Merkel when she married physicist Ulrich Merkel in 1977</strong>....",
    "published": "July 17, 2020"
  },
  {
    "title": "A look inside the daily life of German Chancellor Angela Merkel, a former chemist who has been Forbes' most powerful woman in the world for 9 straight years and can get by on only 4 hours of sleep",
    "url": "https://www.businessinsider.com/angela-merkel-daily-routine-2017-7",
    "snippet": "Since becoming chancellor in 2005, the former chemist has managed to cultivate an &quot;image of <strong>deep personal integrity and a tightly guarded private life</strong>,&quot; writes Melissa Eddy in the New York Times.",
    "published": "December 13, 2019"
  }
]