[
  {
    "title": "Saudi Arabia’s Next Era: From King Salman to CP Mohammad and Beyond",
    "url": "https://www.tacticalreport.com/landing/topic/saudi-arabias-next-era-from-king-salman-to-cp-mohammad-and-beyond",
    "snippet": "As Saudi Arabia anticipates the transition of power <strong>from King Salman to Crown Prince Mohammad</strong>, the Kingdom is poised for a new era of leadership.",
    "published": null
  },
  {
    "title": "The Saudi shift: laying the groundwork for a clean energy future | United Nations Development Programme",
    "url": "https://www.undp.org/arab-states/blog/saudi-shift-laying-groundwork-clean-energy-future",
    "snippet": "But operating a robust electricity grid safely and reliably adds a layer of complexity to the energy transition that is often underappreciated. Saudi Arabia is now complementing its healthy pipeline of renewable energy projects with a renewables integration plan that aims to leapfrog the world’s ...",
    "published": null
  },
  {
    "title": "Saudi Arabia at 90: Ushering in a Neo-Saudi state? | Middle East Institute",
    "url": "https://www.mei.edu/publications/saudi-arabia-90-ushering-neo-saudi-state",
    "snippet": "For most of Saudi Arabia’s existence, succession to the throne has followed a horizontal trajectory: <strong>the kingdom was ruled by Ibn Saud for just over two decades and then, in a sequence, by six of his sons</strong>.",
    "published": null
  },
  {
    "title": "Saudi Arabia’s Vision 2030 and a Nation in Transition | Baker Institute",
    "url": "https://www.bakerinstitute.org/research/saudi-arabias-vision-2030-and-nation-transition",
    "snippet": "Annelle Sheline and Kristian Coates Ulrichsen, “Saudi Arabia’s Vision 2030 and a Nation in Transition,” Rice University’s Baker Institute for Public Policy, July 24, 2025, https://doi.org/10.25613/F7J4-6X14. Copy Citation ... Ten years have passed since Salman bin Abdulaziz Al Saud became King of Saudi Arabia on Jan.",
    "published": "July 24, 2025"
  },
  {
    "title": "Saudi MBS on transition of power, and possibilities surrounding the CP position",
    "url": "https://www.tacticalreport.com/daily/63811-saudi-mbs-on-transition-of-power-and-possibilities-surrounding-the-cp-position",
    "snippet": "&gt; Saudi King Salman&gt; Crown Prince Mohammad&gt; Saudi transition of power&gt; Al Saud ruling family&gt; Al Saud princesBrowse all published reports &gt;&gt; ... Join our community to receive regular updates on the latest developments in the region and stay ahead of the curve.subscribe for Free &gt;&gt; ... Uncertainty is growing over the succession in Saudi Arabia, as Crown Prince Mohammad Bin Salman (MBS)’ circle maintains secrecy on the matter.",
    "published": "September 3, 2025"
  }
]