[
  {
    "title": "Organisation | Campus France",
    "url": "https://www.campusfrance.org/en/organisation-conseils-organigramme",
    "snippet": "<strong>President of the Université Bretagne Sud (UBS) from 2012 to 2020, he currently holds the &quot;cyber and digital sovereignty&quot; chair of the endowment fund of the Institute of Higher Studies in National Defence (IHEDN)</strong> and is the elected President ...",
    "published": null
  },
  {
    "title": "Faculty of Sciences | Université Paris Cité",
    "url": "https://u-paris.fr/en/faculty-of-sciences/",
    "snippet": "The Faculty of Sciences combines, among its training and research, experimental sciences with the exact sciences, fundamental research with applied research in various disciplines: Chemistry, Computer Science, Engineering, Mathematics, Physics, Biomedical Sciences and Life Sciences",
    "published": null
  },
  {
    "title": "Paris-Sud University - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Paris-Sud_University",
    "snippet": "Pierre-Gilles de Gennes and Albert Fert, two Nobel Prize winners of physics, were affiliated to the University of Paris-Sud. A number of the most renowned French mathematicians were affiliated with the University of Paris-Sud as well.",
    "published": "October 7, 2025"
  },
  {
    "title": "Governance | PSL",
    "url": "https://www.psl.eu/en/comex-et-directoire",
    "snippet": "Petit was appointed Chairman and CEO of the CNRS in 2018. After earning a teaching degree and a PhD in computer science from the Université Paris Diderot, he specialized in formal methods, mostly based on transition systems, for the specification and verification of parallel systems in real time. An academic from 1984 to 2004, he served at the Université d&#x27;Orléans, the Université Paris-Sud and at the ENS Cachan (near Paris) from 1994.",
    "published": null
  },
  {
    "title": "86 Notable Alumni of Paris-Sud University [Sorted List]",
    "url": "https://edurank.org/uni/paris-sud-university/alumni/",
    "snippet": "<strong>Sylvie Retailleau</strong> is a French physicist and politician who has been serving as Minister of Higher Education in the government of successive Prime Ministers Élisabeth Borne and Gabriel Attal since 20 May 2022.",
    "published": "March 2, 2025"
  }
]