[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "The Democratic Party (Italian: Partito Democratico, PD) is a social democratic political party in Italy. <strong>The party&#x27;s secretary is Elly Schlein, elected in the 2023 leadership election, while the party&#x27;s president is Stefano Bonaccini</strong>.",
    "published": "1 day ago"
  },
  {
    "title": "Democratic Party – Democratic and Progressive Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_–_Democratic_and_Progressive_Italy",
    "snippet": "Prior to the formation of the group, its name was that of the lead electoral list of the centre-left coalition in the 2022 Italian general election. In July 2022, the centre-right coalition was forecast to win a parliamentary absolute majority under the Rosatellum electoral law of 2017, which was pushed by the Democratic Party (PD) under Matteo Renzi&#x27;s leadership and was now rejected by the party under the leadership of Enrico Letta.",
    "published": "August 9, 2025"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "Italy’s Democrats have often posed as a guarantor of institutional stability and Rome’s Atlanticist line. Current leader Elly Schlein has tacked left, but it’s done little to change the party’s identity as a force for steadying Italian capitalism.",
    "published": null
  },
  {
    "title": "The Democrats (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Democrats_(Italy)",
    "snippet": "After being ousted as Prime Minister and replaced by Massimo D&#x27;Alema (leader of the Democrats of the Left) in November 1998, Prodi launched the new party in February 1999. The Democrats were joined by PPI splinters, grassroots activists, the UD (leader: Antonio Maccanico), The Network (leader: Leoluca Orlando), Italy of Values (leader: Antonio Di Pietro) – which would be re-established as an independent party in May 2000 –, and the so-called &quot;Movement of Mayors&quot; (leaders: Francesco Rutelli, a former Green, and Massimo Cacciari, a former Democrat of the Left).",
    "published": "October 26, 2024"
  },
  {
    "title": "Democratic Party | political party, Italy | Britannica",
    "url": "https://www.britannica.com/topic/Democratic-Party-political-party-Italy",
    "snippet": "…party, known simply as the Democratic Party (Partito Democratico), emerged when the DS merged with the centrist Daisy (Margherita) party. Soon afterward the FI joined with the AN to create the new center-right People of Freedom (Popolo della Libertà; PdL) party.",
    "published": null
  }
]