[
  {
    "title": "Stacey Abrams - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stacey_Abrams",
    "snippet": "Abrams <strong>ran for governor of Georgia in 2018</strong>. In the Democratic primary she ran against Stacey Evans, another member of the Georgia House of Representatives, in what some called &quot;the battle of the Staceys&quot;. Abrams was endorsed by Bernie Sanders and Our Revolution.",
    "published": "2 weeks ago"
  },
  {
    "title": "Stacey Abrams - Ballotpedia",
    "url": "https://ballotpedia.org/Stacey_Abrams",
    "snippet": "Stacey Abrams (Democratic Party) was a member of the Georgia House of Representatives, representing District 89. She <strong>assumed office on January 8, 2007.</strong> She left office on August 25, 2017. Abrams (Democratic Party) ran for election for Governor of Georgia.",
    "published": null
  },
  {
    "title": "Stacey Abrams | Archives of Women's Political Communication",
    "url": "https://awpc.cattcenter.iastate.edu/directory/stacey-abrams/",
    "snippet": "Stacey Abrams was the <strong>2018 and 2022 Democratic nominee</strong> for governor of Georgia, losing in the general election both times. She was the first African-American female major-party gubernatorial nominee in the United States, and the first ...",
    "published": null
  },
  {
    "title": "The rise and fall of Stacey Abrams’s political machine",
    "url": "https://www.economist.com/united-states/2025/11/03/the-rise-and-fall-of-stacey-abramss-political-machine",
    "snippet": "It was January 2021 and voters had not only elected Joe Biden—the first victory this century for a Democratic presidential candidate in the state—but had also flipped the Senate by choosing two Democrats in run-off races. All eyes fell on an activist and politician who had long promised she could pull Georgia away from Republicans, and who was credited this time with rallying just enough voters to make it happen: Stacey Abrams.",
    "published": "November 3, 2025"
  },
  {
    "title": "Stacey Abrams",
    "url": "https://www.staceyabrams.com/",
    "snippet": "It All Starts With Doing Good Photo Credit: Annie Leibovitz · Opening Doors for Future Generations",
    "published": null
  }
]