[
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "The common roots of the founding components of the party reside in <strong>the Italian resistance movement, the writing of Italian Constitution and the Historic Compromise</strong>, all three events which saw the Italian Communist Party and Christian Democracy (the two major forerunners of the Democrats of the ...",
    "published": "1 day ago"
  },
  {
    "title": "How the Democrats Became Italy’s Establishment Party",
    "url": "https://jacobin.com/2024/05/italy-democratic-party-history",
    "snippet": "The party was <strong>founded in 2007 as a result of the convergence of the Democrats of the Left (direct heirs of the Italian Communist Party) and the Margherita (heir to part of Christian Democracy).</strong>",
    "published": null
  },
  {
    "title": "Democratic Party – Democratic and Progressive Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_–_Democratic_and_Progressive_Italy",
    "snippet": "On 29 July, Letta announced the formation of a joint list between the PD, Article One (Art.1), the Italian Socialist Party (PSI), and Solidary Democracy (DemoS) in the upcoming general election, and was officially founded that same day. Other minor parties joined later.",
    "published": "August 9, 2025"
  },
  {
    "title": "Democratic Party | political party, Italy | Britannica",
    "url": "https://www.britannica.com/topic/Democratic-Party-political-party-Italy",
    "snippet": "Ask the Chatbot Games &amp; Quizzes ... simply as the Democratic Party (Partito Democratico), <strong>emerged when the DS merged with the centrist Daisy (Margherita) party</strong>....",
    "published": null
  },
  {
    "title": "Democrats of the Left | Political Party, Italy, Ideology, History | Britannica",
    "url": "https://www.britannica.com/topic/Democrats-of-the-Left",
    "snippet": "The party was originally founded in <strong>January 1921</strong> as the Italian Communist Party (Partito Comunista Italiano; PCI) by dissidents of the extreme left wing of the Italian Socialist Party (Partito Socialista Italiano).",
    "published": "July 20, 1998"
  }
]