[
  {
    "title": "Juventus Manager History | Past & Present | Soccer Base",
    "url": "https://www.soccerbase.com/teams/team.sd?team_id=1408&teamTabs=managers",
    "snippet": "Juventus Football Club Managers, full history, past and present. Provided courtesy of Soccerbase.com, the Football Betting Site.",
    "published": null
  },
  {
    "title": "List of Juventus FC managers - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_Juventus_FC_managers",
    "snippet": "The most successful person to manage Juventus is <strong>Giovanni Trapattoni</strong>, who won six Football League titles (Scudetto), two Coppa Italias, one European Champions Clubs&#x27; Cup, one UEFA Cup Winners&#x27; Cup, two UEFA Cups, one UEFA Super Cup and one Intercontinental Cup in two periods from 1976 and 1986 ...",
    "published": "November 2, 2025"
  },
  {
    "title": "Massimiliano Allegri - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Massimiliano_Allegri",
    "snippet": "He returned to Juventus in 2021, following two years away from management. In his second period at the club, he won another Coppa Italia in 2024, but was sacked only a couple days later, largely due to his behaviour during and after the final, which the club deemed incompatible with its values. He returned as manager of AC Milan in May 2025. Individually, Allegri won the Panchina d&#x27;Oro (Golden Bench) four times (2009, 2015, 2017 and 2018) and was four times Serie A Coach of the Year (2011, 2015, 2016 and 2018), as well as being awarded the Enzo Bearzot Award (2015) and inducted into the Italian Football Hall of Fame (2018).",
    "published": "4 days ago"
  },
  {
    "title": "Juventus FC - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/juventus-fc/mitarbeiterhistorie/verein/506",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  },
  {
    "title": "Luciano Spalletti - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Luciano_Spalletti",
    "snippet": "Following two seasons in charge ... in 2021, where he won the Serie A in the 2022–23 season before leaving the club in June 2023. In August 2023, he was appointed as coach of the Italy national team and led the team to qualify for UEFA Euro 2024, where they were eliminated in the round of 16. He was sacked as Italy coach in June 2025. In October of that year, he returned to club management as head coach of Juventus...",
    "published": "2 days ago"
  }
]