[
  {
    "title": "| International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/",
    "snippet": "The book &quot;Mathematicians of the World, Unite!&quot; by G. Curbera is now electronically available on the IMU website. For more information click here · If you want to subscribe to IMU News, please click on the button. ... In preparation for the IMU General Assembly in July 2026, the Adhering Organizations of IMU Members are asked to appoint and certify their delegations to the Secretary General. See AO CL 9/2025.",
    "published": null
  },
  {
    "title": "International Mathematical Union - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/International_Mathematical_Union",
    "snippet": "The International Mathematical Union is administered by an executive committee (EC) which conducts the business of the Union. The EC consists of the President, two vice-presidents, the Secretary, six Members-at-Large, all elected for a term of four years, and the Past President.",
    "published": "February 24, 2025"
  },
  {
    "title": "ICMI Newsletter - March 2023 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/icmi/icmi-newsletter-march-2023",
    "snippet": "The International Commission on Mathematical Instruction (ICMI) launches the first two steps of the Process of Election of the ICMI Executive Committee (EC) for the 2025-2028 term in office: <strong>Professor Abraham Arcavi</strong> was appointed as the Chairperson of the Nominating Committee (NC) that is in ...",
    "published": null
  },
  {
    "title": "IMU News 132: July 2025 | International Mathematical Union (IMU)",
    "url": "https://www.mathunion.org/imu-news/archive/2025/imu-news-132-july-2025",
    "snippet": "From 1991 to 1998 <strong>Jacob Palis</strong> served as the Secretary General of the International Mathematical Union (IMU) and later, from 1999 to 2002, as its President. He vigorously promoted international collaboration and capacity-building efforts. His leadership extended well beyond the IMU: he headed ...",
    "published": null
  },
  {
    "title": "IMU Leadership 2023 – 2026 | International Mathematical Union",
    "url": "https://www.mathunion.org/organization/imu-leadership-2023-2026",
    "snippet": "COSPAR, International Scientific Union Representative · 2025 – 2026 · <strong>Mihalis Dafermos</strong> · Gruber Foundation, Cosmology Prize, Selection Advisory Board · 2024 – 2026 · JongHae Keum · ISC · 2025 – 2026 · Mouhammed Moustapha Fall · UNESCO · 2023 – 2026 ·",
    "published": null
  }
]