[
  {
    "title": "Welcome, Coach Luciano Spalletti - Juventus",
    "url": "https://www.juventus.com/en/news/articles/welcome-coach-luciano-spalletti",
    "snippet": "Luciano Spalletti is the new head coach of Juventus, signing an agreement with the Club until <strong>June 30, 2026</strong>. Born in Certaldo, in the province of...",
    "published": null
  },
  {
    "title": "Luciano Spalletti on the Verge of Becoming Juventus’ New Head Coach | beIN SPORTS",
    "url": "https://www.beinsports.com/en-us/soccer/serie-a/articles/luciano-spalletti-on-the-verge-of-becoming-juventus-new-head-coach-2025-10-29",
    "snippet": "Spalletti, 65, is <strong>reportedly set to accept a contract running until June 2026</strong>, with an automatic extension clause if the club qualifies for the Champions League. According to Italian reports, he has already met with Damien Comolli, Juventus’ ...",
    "published": null
  },
  {
    "title": "Juventus appoint Luciano Spalletti as manager until end of season - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cy7epp72ek0o",
    "snippet": "Juventus have appointed former Italy head coach Luciano Spalletti as their manager <strong>until the end of the season</strong>.",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus appoint ex-Napoli, Italy coach Spalletti",
    "url": "https://www.espn.com/soccer/story/_/id/46781628/ex-napoli-italy-manager-spalletti-juventus-deal",
    "snippet": "Former Napoli and Italy coach Luciano Spalletti was <strong>confirmed as Juventus&#x27; new head coach on Thursday</strong>, replacing the fired Igor Tudor.",
    "published": "October 30, 2025"
  },
  {
    "title": "Juventus appoint former Italy boss Luciano Spalletti after Igor Tudor sacking as Serie A winner signs eight-month contract with major clause | Goal.com US",
    "url": "https://www.goal.com/en-us/lists/juventus-appoint-luciano-spalletti-after-igor-tudor-sacking-serie-a-winner-signs-eight-month-contract-with-major-clause/blte22644d7ece7d8b4",
    "snippet": "<strong>Juventus have confirmed the appointment of Luciano Spalletti following Igor Tudor&#x27;s dismissal earlier this week</strong>. Tudor succeeded Thiago Motta in Turin in March and was handed a three-year contract after guiding Juventus to the Champions League.",
    "published": "October 30, 2025"
  }
]