[
  {
    "title": "European Film Academy Announces New Board Appointments - FilmNewEurope.com",
    "url": "https://www.filmneweurope.com/press-releases/item/127510-european-film-academy-announces-new-board-appointments",
    "snippet": "Solomon is no newcomer to the Academy board, since she served for 6 years as deputy chair herself alongside outgoing chair Mike Downey, and was a regular board member before. Leontine Petit has been a regular board member since 2021. Darras has been elected without previous experience within the board of the European Film Academy, but has been an active Academy member and brings extensive industry know-how with him into his new position.",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy announces new board appointments",
    "url": "https://britishcinematographer.co.uk/european-film-academy-announces-new-board-appointments/",
    "snippet": "Solomon has served on the Academy board for six years as deputy chair herself alongside outgoing chair Mike Downey, and was a regular board member before. Petit has been a regular board member since 2021, while Darras has been elected without previous experience within the board of the European Film Academy, but has been an active Academy member and brings “extensive industry knowhow with him into his new position”, the EFA said.",
    "published": "2 weeks ago"
  },
  {
    "title": "European Film Academy Announces New Board Appointments - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/press/european-film-academy-announces-new-board-appointments/",
    "snippet": "Solomon is no newcomer to the Academy board, since she served for 6 years as deputy chair herself alongside outgoing chair Mike Downey, and was a regular board member before. Leontine Petit has been a regular board member since 2021. Darras has been elected without previous experience within the board of the European Film Academy, but has been an active Academy member and brings extensive industry know-how with him into his new position.",
    "published": "2 weeks ago"
  },
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "Mike first joined the board of ... film makers including <strong>Istvan Szabo, Volker Schloendorff, Wim Wenders, Nikita Mikhalkov, Pawel Pawlikowski, Agnes Jaoui, Krzystof Zanussi, and David Mackenzie</strong> ....",
    "published": null
  },
  {
    "title": "Mike Downey elected new EFA chairman - Cineuropa",
    "url": "https://cineuropa.org/en/newsdetail/382667",
    "snippet": "Taking over from Polish director <strong>Agnieszka Holland</strong> who has chaired the EFA board for the past six years, Downey pointed out at Saturday’s European Film Awards that he wants his mandate to be marked by a continuation of the EFA’s “campaigning ...",
    "published": "November 12, 2019"
  }
]