[
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "A season later, he was signed by Premier League club Liverpool for £9.75 million where he made over 150 appearances across all tiers of competition and would join Juventus in 2018. <strong>In 2020 he was loaned to Borussia Dortmund; a few weeks later he moved to the team under a permanent deal</strong>.",
    "published": "2 days ago"
  },
  {
    "title": "Emre Can: Borussia Dortmund complete permanent transfer with Juventus | Football News | Sky Sports",
    "url": "https://www.skysports.com/football/news/11899/11937316/emre-can-borussia-dortmund-complete-permanent-transfer-with-juventus",
    "snippet": "<strong>Borussia Dortmund have signed Emre Can on a four-year deal after activating an option to make the midfielder&#x27;s loan from Juventus permanent. Can has made just three appearances since joining the Bundesliga side on January 31, but the Germany international has made a sufficient impression in that time to persuade Dortmund to take up their £21m option to sign him. The 26-year-old joined Juventus on a free transfer from Liverpool in June 2018,</strong> ...",
    "published": "February 18, 2020"
  },
  {
    "title": "Emre Can stats and transfer history - AiScore",
    "url": "https://m.aiscore.com/player-emre-can/oj7x9iw0oltg7g3",
    "snippet": "<strong>2020/06/29, from Borussia Dortmund to Juventus, End of loan transfer fee</strong>. 2020/01/30, from Juventus to Borussia Dortmund, Loan transfer fee. 2018/06/30, from Liverpool to Juventus, Signed transfer fee. 2014/06/30, from Bayer 04 Leverkusen to Liverpool, Transfer transfer fee.",
    "published": null
  },
  {
    "title": "Emre Can - Transfer history | Transfermarkt",
    "url": "https://www.transfermarkt.com/emre-can/transfers/spieler/119296",
    "snippet": "Emre Can, 31, from Germany ➤ Borussia Dortmund, since 2020 ➤ Centre-Back ➤ Market value: €7.00m ➤ * 12/01/1994 in Frankfurt am Main, Germany",
    "published": null
  },
  {
    "title": "Emre Can (Dortmund) Stats - Flashscore.com",
    "url": "https://www.flashscore.com/player/can-emre/YJu3hSpk/",
    "snippet": "Help: You are on the player profile of Emre Can, Dortmund. View Emre Can stats in detail (appearances, goals, cards / leagues, cups, national team), transfer value, contract length, transfer history including transfer fees, injury updates or unique player ratings from previous matches.",
    "published": null
  }
]