[
  {
    "title": "Nicholas Burns | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty/nicholas-burns",
    "snippet": "Ambassador Nicholas Burns is the <strong>Roy and Barbara Goodman Family Professor of the Practice of Diplomacy and International Relations</strong> at Harvard University’s Kennedy School of Government.",
    "published": null
  },
  {
    "title": "Longtime Harvard Kennedy School faculty member Nicholas Burns to return to HKS after serving as U.S. envoy to China | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/announcements/nicholas-burns-returns-to-hks",
    "snippet": "— Nicholas Burns, who until recently served as the United States ambassador to the People’s Republic of China, <strong>will rejoin the Harvard Kennedy School faculty in April</strong>, Dean Jeremy M. Weinstein announced today.",
    "published": null
  },
  {
    "title": "Ambassador (ret.) R. Nicholas Burns - Harvard Kennedy School",
    "url": "https://appext.hks.harvard.edu/faculty/cv/nicholasburns.pdf",
    "snippet": "R. Nicholas Burns · CURRENT ... of Diplomacy and · International Relations · Cambridge, Massachusetts (2008–Present) ­ <strong>Founder and Faculty Chair, Future of Diplomacy Project</strong> ·...",
    "published": null
  },
  {
    "title": "Rise to the enormous challenges before you, Ambassador Nicholas Burns urges HKS Class of 2024 | Harvard Kennedy School",
    "url": "https://www.hks.harvard.edu/faculty-research/policy-topics/public-leadership-management/rise-enormous-challenges-you-ambassador",
    "snippet": "Public service is written into Harvard Kennedy School’s DNA, Nicholas Burns, <strong>U.S. ambassador to China and a former HKS professor</strong>, told the crowd of graduating HKS students and their families on Wednesday as the speaker for the HKS Graduation ...",
    "published": null
  },
  {
    "title": "Nicholas Burns | The Belfer Center for Science and International Affairs",
    "url": "https://www.belfercenter.org/person/nicholas-burns",
    "snippet": "Roy and Barbara Goodman Family <strong>Professor of the Practice of Diplomacy and International Relations</strong>, Harvard Kennedy School Former United States Ambassador to the People’s Republic of China Member of the Board, Belfer Center Faculty Affiliate, ...",
    "published": null
  }
]