[
  {
    "title": "Vincent Kompany - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Vincent_Kompany",
    "snippet": "Vincent Jean Mpoy Kompany (born ... head coach of Bundesliga club Bayern Munich. As a player, he is best known for his <strong>eleven seasons at Manchester City, eight of which he served as captain</strong>....",
    "published": "2 days ago"
  },
  {
    "title": "From Zlatko Čajkovski to Vincent Kompany: A history of Bayern Munich coaches | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/a-history-of-bayern-munich-s-coaches-nagelsmann-flick-guardiola-heynckes-15694",
    "snippet": "Vincent Kompany Tenure: 1 July 2024 - present Record: 72 games - W54, D9, L9 Trophies: 2 (Bundesliga, Franz Beckenbauer Supercup) Given his lack of top-level experience, Kompany&#x27;s appointment as head coach came as something of a surprise. However, he was hugely successful as a player and, having played under previous Bayern boss Pep Guardiola at Manchester City, was recommended by the Spaniard for the role.",
    "published": "November 4, 2025"
  },
  {
    "title": "Vincent Kompany: 10 things on the Bayern Munich head coach | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/news/10-things-vincent-kompany-bayern-munich-coach-guardiola-man-city-27605",
    "snippet": "Kompany (l.) was just 20 when he joined Hamburg from Anderlecht. - imago sportfotodienst ... Kompany&#x27;s coaching career <strong>began back at boyhood club Anderlecht, where he won two Jupiler Pro League titles as a player</strong>.",
    "published": "April 2, 2025"
  },
  {
    "title": "How Vincent Kompany defied his sceptics and quietly rebuilt Bayern Munich - The Athletic",
    "url": "https://www.nytimes.com/athletic/6835954/2025/11/26/vincent-kompany-bayern-munich-manager/",
    "snippet": "He took his seat for the post-match press conference that day in Wolfsburg and it was then, perhaps, that he started to become Bayern’s head coach for real. He pivoted smartly between German and English, evaluating the game, and directing the gathered reporters towards what he felt were the real talking points. “I want to put forward the outstanding mentality of the team,” he said, “because I didn’t feel like they ever felt sorry for themselves.” · Vincent Kompany in his first Bundesliga game as Bayern head coach, away to Wolfsburg, in August 2024 (Stuart Franklin/Getty Images)",
    "published": "3 weeks ago"
  },
  {
    "title": "The origins of Bayern Munich manager Vincent Kompany - BBC Sport",
    "url": "https://www.bbc.com/sport/football/articles/cwye2169wxvo",
    "snippet": "Six months into his role as Bayern ... last season. The 38-year-old coach was <strong>brought in after Bayern ended the 2023-24 season 18 points off the top spot in third under Thomas Tuchel</strong> - their worst league finish since ...",
    "published": "February 12, 2025"
  }
]