[
  {
    "title": "Leadership - IAU",
    "url": "https://www.iau-aiu.net/Leadership",
    "snippet": "About the Executive Leadership Program (ELP) The IAU is pleased to announce that <strong>the third edition of the IAU Executive Leadership Programme (ELP), scheduled to run from Autumn 2025 to 2026</strong>, is now accepting applications.",
    "published": null
  },
  {
    "title": "Executive Leadership Programme — International Association of Universities",
    "url": "https://iau.global/elp",
    "snippet": "<strong>Develop Effective Teams</strong>: Explore leadership expectations and improve interpersonal management skills to unlock the full potential of diverse high-performing teams. Build a Global Network of Peers: Create long-term partnerships, connect with ...",
    "published": null
  },
  {
    "title": "Apply Now: Executive Leadership Programme (ELP) — International Association of Universities",
    "url": "https://iau.global/news/executive-leadership-programme-elp24-25",
    "snippet": "The IAU is pleased to open applications for the IAU Executive Leadership Programme (ELP) 2024-2025 Cohort.",
    "published": "August 8, 2025"
  },
  {
    "title": "IAU Executive Leadership Programme (ELP) Syllabus 2025-2026",
    "url": "https://static1.squarespace.com/static/67347be6f630e36cbb1eaf1a/t/68f2538fa1337375683678ec/1760711567270/Syllabus+25-26+Planning.pdf",
    "snippet": "IAU Executive Leadership Programme (ELP) Syllabus 2025-2026 · Introduction to the ELP · 1. The Changing Mission of Universities – Chris Brink · <strong>Universities are increasingly expected to engage more in the betterment of society</strong> · and clearly communicate not only what they are good at, ...",
    "published": null
  },
  {
    "title": "Leadership — International Association of Universities",
    "url": "https://iau.global/leadership",
    "snippet": "The IAU endeavours to strengthen the capacities of university leaders and enhance cooperation among HEIs around the world, whilst also invigorating university leadership to maximise their impact on communities at all levels. News · IAU at the 2025 Magna Charta Observatory Conference ·",
    "published": null
  }
]