[
  {
    "title": "Seb Coe is dating Lionel Richie's glamorous ex-wife: Twice-married World Athletics boss, 69, has found love again with US model and fashion designer Diane Richie, 58 | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/tvshowbiz/article-15375063/Seb-Coe-dating-Lionel-Richie-ex-wife-Diane-Richie.html",
    "snippet": "But Sebastian Coe turned more than a few heads when he arrived at the World Athletics Awards 2025 in Monaco with Lionel Richie’s glamorous ex-wife, Diane.",
    "published": "1 week ago"
  },
  {
    "title": "Who is Sebastian Coe dating? Sebastian Coe girlfriend, wife",
    "url": "https://www.whosdatedwho.com/dating/sebastian-coe",
    "snippet": "6 July 2025... Sebastian Coe news, gossip, photos of Sebastian Coe, biography, Sebastian Coe girlfriend list 2025. Relationship history. Sebastian Coe relationship list. Sebastian Coe dating history, 2025, 2024, list of Sebastian Coe relationships.",
    "published": null
  },
  {
    "title": "Olympic legend unveils romance to Lionel Richie’s ex-wife whose divorce cost singer £15m",
    "url": "https://www.gbnews.com/sport/olympics/olympic-legend-unveils-romance-lionel-richies-ex-wife",
    "snippet": "Olympic legend <strong>Sebastian Coe has unveiled his new romance with Diane Alexander</strong> | ... Despite the divorce, Alexander is understood to maintain a positive relationship with the All Night Long hitmaker as they continue to co-parent their children ...",
    "published": "1 week ago"
  },
  {
    "title": "Back on track after break-up, Seb Coe and his glamorous Los Angeles fiancee - as 68-year-old Olympian is set to wed for the third time | Daily Mail Online",
    "url": "https://www.dailymail.co.uk/news/article-14878961/Back-track-break-Seb-Coe-glamorous-Los-Angeles-fiancee-68-year-old-Olympian-set-wed-time.html",
    "snippet": "Published: 20:15 EDT, 5 July 2025 | Updated: 20:42 EDT, 5 July 2025 · e-mail · 9 · View comments · <strong>Sebastian Coe is back on track to wed for the third time</strong>. The 68-year-old Olympian has ‘quietly reunited’ with glamorous Los Angeles PR ...",
    "published": "July 6, 2025"
  },
  {
    "title": "Sebastian Coe publicly appeared for the first time with his new partner Diana Alexander - all the latest news today – 112.ua",
    "url": "https://112.ua/en/olympic-legend-sebastian-coe-69-is-dating-lionel-richies-ex-wife-diane-alexander-58-whose-divorce-cost-singer-15m-121095",
    "snippet": "Olympic legend Sebastian Coe openly admitted to his relationship with <strong>Diana Alexander</strong>. Coe, 69, attended the World Athletics Awards Ceremony 2025 in Monaco with the American model and fashion designer.Diana, 58, was married to pop singer Lionel ...",
    "published": null
  }
]