[
  {
    "title": "Death in Russia: Navalny, morality, and politics by other means | ECFR",
    "url": "https://ecfr.eu/article/death-in-russia-navalny-morality-and-politics-by-other-means/",
    "snippet": "In doing so, he rejected the basic principle on which the Russian system functions: that individuals prioritise their own personal safety over political rights and moral standards. His cause – the fight against corruption – was always more popular than Navalny himself. His approval rating peaked at 20 per cent in September 2020, just after he was poisoned, but over the years most Russians consistently disapproved of his activities.",
    "published": "February 19, 2024"
  },
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "Soon afterwards, some of Navalny&#x27;s personal emails were posted online by a pro-government blogger. On 26 June 2012, it was announced that Navalny&#x27;s comrades would establish a new political party based on e-democracy; Navalny declared he did not plan to participate in this project at the moment.",
    "published": "1 day ago"
  },
  {
    "title": "Navalny’s Future Russia Did Not Include Everyone | Davis Center",
    "url": "https://daviscenter.fas.harvard.edu/insights/navalnys-future-russia-did-not-include-everyone",
    "snippet": "16 death in prison as a political murder while also recognizing how the forgotten or overlooked nationalism of his politics negatively affected them. At various points, Navalny was a staunch <strong>Russian nationalist</strong> who engaged in far-right discourse ...",
    "published": null
  },
  {
    "title": "How Navalny became Putin's biggest political foe and an advocate for a \"normal\" Russia",
    "url": "https://www.axios.com/2024/02/16/navalny-death-putin-russia",
    "snippet": "The big picture: Navalny&#x27;s death solidifies the uncertain future of the Russian opposition movement he helped organize to transform Russia into what he described in 2018 as &quot;a normal country.&quot; It also adds to a growing list of prominent Putin opponents who have died under suspicious circumstances, echoing the 2015 killing of Boris Nemtsov, a liberal politician and the most vocal critic of Putin at the time.",
    "published": "February 16, 2024"
  },
  {
    "title": "A year after Navalny's death, Russian opposition demoralized",
    "url": "https://www.dw.com/en/a-year-after-navalnys-death-russian-opposition-demoralized/a-71617836",
    "snippet": "Speaking with DW, Kynev said the ACF was once a figurehead of the opposition, an organization that influenced political life in Russia. &quot;The ACF was always worth reporting on; it was an event in itself.&quot; Thousands of people turned out for Navalny&#x27;s funeral in Moscow in March 2024.",
    "published": "February 15, 2025"
  }
]