[
  {
    "title": "Aníbal Fernández - Simple English Wikipedia, the free encyclopedia",
    "url": "https://simple.wikipedia.org/wiki/Aníbal_Fernández",
    "snippet": "Aníbal Domingo Fernández (born January 9, 1957) is an Argentine politician, public accountant and lawyer affiliated and militant of the Justicialist Party, Since 2021 to 2023, he has served as <strong>Argentina&#x27;s Minister of Security</strong>, in the cabinet of Alberto Fernández.",
    "published": "August 13, 2025"
  },
  {
    "title": "Aníbal Fernández facts for kids",
    "url": "https://kids.kiddle.co/Aníbal_Fernández",
    "snippet": "He worked in these roles for more than nine years in total. He was the <strong>Minister of Production, Interior Minister, and Minister of Justice</strong>. He also served as the President&#x27;s Cabinet Chief.",
    "published": null
  },
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Aníbal Fernández is a candidate for <strong>governor of the Province of Buenos Aires</strong> and currently chief of staff of the Minister’s Cabinet for the presidency. Previously, he served in the National Senate as representative for the province of Buenos ...",
    "published": null
  },
  {
    "title": "Buenos Aires Times | Aníbal Fernández: ‘I understand and share the president’s view on re-election’",
    "url": "https://www.batimes.com.ar/news/argentina/anibal-fernandez-there-will-be-a-guarantee-of-everybody-being-able-to-compete-so-that-there-are-no-complications.phtml",
    "snippet": "<strong>Security Minister</strong> Aníbal Fernández, who has won the confidence of both Alberto Fernández and Cristina Fernández de Krichner in his lengthy political career occupying posts of key importance in different Peronist governments, gave an interview ...",
    "published": "April 28, 2023"
  },
  {
    "title": "Aníbal Fernández - Wikidata",
    "url": "https://www.wikidata.org/wiki/Q2857937",
    "snippet": "https://tn.com.ar/politica/ani... Cristóbal López: lo defenderá en las causas civiles (Spanish) position held · <strong>Minister of Security</strong> ·...",
    "published": null
  }
]