[
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "Zaza Pachulia (Georgian: ზაზა ... [zaza patʃʰulia] born Zaur Pachulia; 10 February 1984) is a Georgian professional basketball executive and former player who is a basketball operations consultant for the Golden State Warriors of the National Basketball Association (NBA). Beginning his professional career in Turkey as a teenager, Pachulia was drafted in the second round of the 2003 NBA draft by the Orlando Magic. He played for seven teams in his 16-year ...",
    "published": "November 6, 2025"
  },
  {
    "title": "Zaza Pachulia on what lured him to join Golden State Warriors - Basketball Network",
    "url": "https://www.basketballnetwork.net/latest-news/zaza-pachulia-on-what-lured-him-to-join-the-golden-state-warriors",
    "snippet": "Throughout his career, Pachulia was known in the NBA as a great backup center who brought toughness and energy to teams like the <strong>Orlando Magic, Atlanta Hawks, Milwaukee Bucks, and Dallas Mavericks</strong> before coming to the Bay.",
    "published": "April 17, 2025"
  },
  {
    "title": "Zaza Pachulia facts for kids",
    "url": "https://kids.kiddle.co/Zaza_Pachulia",
    "snippet": "He scored 22 points and grabbed 21 rebounds, which was a record for the Bucks team. In 2015, Zaza was traded to the <strong>Dallas Mavericks</strong>. In his first game with them, he scored 10 points and had 10 rebounds.",
    "published": null
  },
  {
    "title": "Zaza Pachulia Stats, Height, Weight, Position, Draft Status and more | Basketball-Reference.com",
    "url": "https://www.basketball-reference.com/players/p/pachuza01.html",
    "snippet": "Checkout the latest stats of Zaza Pachulia. Get info about his position, age, height, weight, draft status, shoots, school and more on Basketball-Reference.com",
    "published": null
  },
  {
    "title": "Zaza Pachulia - Golden State Warriors | LinkedIn",
    "url": "https://www.linkedin.com/in/zazapachulia/",
    "snippet": "Experience: Golden State Warriors · Education: Stanford University · Location: San Francisco · 500+ connections on LinkedIn. View Zaza Pachulia’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": "1 week ago"
  }
]