[
  {
    "title": "Yulia Svyrydenko - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Yulia_Svyrydenko",
    "snippet": "Before that, she was the first deputy prime minister and Minister of Economic Development and Trade from 2021, until she replaced <strong>Denys Shmyhal</strong> as prime minister as part of a government reshuffle proposed by President Volodymyr Zelenskyy. Yulia Anatoliivna Svyrydenko was born on 25 December ...",
    "published": "1 month ago"
  },
  {
    "title": "Yuliia Svyrydenko | Cabinet of Ministers of Ukraine",
    "url": "https://www.kmu.gov.ua/en/profile/yuliya-sviridenko",
    "snippet": "By the Decree of the President of Ukraine on December 22, 2020, she was appointed Deputy Head of the Office of the President of Ukraine. On November 4, 2021, she was appointed First Deputy Prime Minister of Ukraine - Minister of Economy of Ukraine.",
    "published": null
  },
  {
    "title": "Minister of Economy, Environment and Agriculture of Ukraine | Ministry of Economy, Environment and Agriculture of Ukraine",
    "url": "https://me.gov.ua/Documents/Detail?lang=en-GB&id=3c5cb542-2ce5-4240-bab3-7c6a7e616cfd&title=Minister",
    "snippet": "Minister of Economy, Environment and Agriculture of Ukraine | Міністерство економіки України – державний орган виконавчої влади України, який здійснює функції з вироблення та реалізації ...",
    "published": null
  },
  {
    "title": "Viktor Yanukovych - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Viktor_Yanukovych",
    "snippet": "The decision was approved by the Constitutional Court of Ukraine and accepted by Western governments and the Ukrainian opposition, with the previous prime minister <strong>Yulia Tymoshenko</strong> agreeing to step down.",
    "published": "1 week ago"
  },
  {
    "title": "Yulia Svyrydenko: Ukraine’s new Prime Minister - The Hindu",
    "url": "https://www.thehindu.com/news/international/yulia-svyrydenko-ukraine-new-prime-minister/article69826906.ece",
    "snippet": "Svyrydenko replaces <strong>Denys Shmyhal</strong>, who has held the Prime Minister’s post since 2020. The 39-year-old economist and technocrat is expected to infuse fresh vigour into Ukraine’s economy, and spearhead the development of its military.",
    "published": "July 19, 2025"
  }
]