[
  {
    "title": "List of prime ministers of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_prime_ministers_of_Spain",
    "snippet": "Since the reign of Philip V, prime ... such as <strong>First Secretary of State (until 1834), President of the Council of Ministers (1834–1868; 1874–1923; 1925–1939), President of the Executive Power (1874) or President of the Government (1973–present),</strong> among ...",
    "published": "5 days ago"
  },
  {
    "title": "Prime Minister of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Spain",
    "snippet": "While this term of address was not incorrect, it could be misleading to English speakers so prime minister is commonly used as a culturally equivalent term to ensure clarity. Use of the term &quot;president&quot; dates back to 1834 and the regency of Maria Christina when, styled after the head of government of the French July Monarchy (1830), the official title was the &quot;President of the Council of Ministers&quot; (Presidente del Consejo de Ministros). This remained until 1939, when the Second Spanish Republic ended.",
    "published": "3 weeks ago"
  },
  {
    "title": "List Of Prime Ministers Of Spain",
    "url": "https://www.worldatlas.com/articles/list-of-prime-ministers-of-spain.html",
    "snippet": "Therefore, it is not clear who the first prime minister was. However, below are the officeholders of this position since 1975. Carlos Arias Navaro, born in December 1908, was a vocal and popular politician, especially during the rule of Francisco Franco. Although he was a moderate leader at the beginning of the transition to democracy, Navaro turned into a hard-liner and was involved in the White Terror, signing many death warrants during the dismantling of the Spanish Republic, earning the name “Butcher of Malaga.” Following the assassination of Luis Carrero Blanco, Navara was appointed Prime minister in 1973, a position he retained during the transition to democracy.",
    "published": "December 22, 2020"
  },
  {
    "title": "List of Prime Ministers of Spain (A United Kingdom of Scandinavia) | Alternative History | Fandom",
    "url": "https://althistory.fandom.com/wiki/List_of_Prime_Ministers_of_Spain_(A_United_Kingdom_of_Scandinavia)",
    "snippet": "Alternative History · Sign In · Don&#x27;t have an account · Register · Skip to content · 110,333 · pages · in: A United Kingdom of Scandinavia",
    "published": null
  },
  {
    "title": "La Moncloa. Presidents of the Government of Spain since 1978 [Presidents since 1978]",
    "url": "https://www.lamoncloa.gob.es/lang/en/presidente/presidents/paginas/index.aspx",
    "snippet": "List of democratic presidents of the Government of Spain, since 1978.",
    "published": null
  }
]