[
  {
    "title": "Power Relations in Sudan after the Fall of Bashir - Stiftung Wissenschaft und Politik",
    "url": "https://www.swp-berlin.org/10.18449/2024RP05/",
    "snippet": "The war between the SAF and RSF thus also symbolises fundamental changes in Sudan’s political system. This study analyses how these shifts in political power came about and culminated in a war that calls into question Sudan’s social, political and economic integrity. The analysis focuses on the power resources of the main groups and their negotiation behaviour after the fall of Bashir in April 2019.",
    "published": null
  },
  {
    "title": "Sudan - Global Centre for the Responsibility to Protect",
    "url": "https://www.globalr2p.org/countries/sudan/",
    "snippet": "<strong>Leadership was initially transferred to a joint civilian-military transitional Sovereign Council</strong> but the military – led by General Abdel Fattah al-Burhan and supported by Mohamed Hamdan “Hemedti” Dagalo – seized power on 25 October 2021.",
    "published": "6 days ago"
  },
  {
    "title": "Sudanese revolution - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sudanese_revolution",
    "snippet": "The Sudanese revolution (Arabic: ... sustained civil disobedience for about eight months, during which <strong>the 2019 Sudanese coup d&#x27;état deposed President Omar al-Bashir on 11 April after thirty years in</strong> power....",
    "published": "1 week ago"
  },
  {
    "title": "Sudan war: A simple guide to what is happening",
    "url": "https://www.bbc.com/news/articles/cjel2nn22z9o",
    "snippet": "It has led to a famine and claims of a genocide in the western Darfur region - with fears for the residents of city of el-Fasher after it was recently captured by the RSF. More than 150,000 people have died in the conflict across the country, and about 12 million have fled their homes in what the United Nations has called the world&#x27;s largest humanitarian crisis. Here is what you need to know. It is the latest episode in bouts of tension that followed the 2019 ousting of long-serving President Omar al-Bashir, who came to power in a coup in 1989.",
    "published": "October 25, 2021"
  },
  {
    "title": "The Washington Post - Breaking news and latest headlines, U.S. ...",
    "url": "https://washingtonpost.com/business/energy/how-sudan-is-moving-on-after-brutal-leaders-ouster/2019/07/05/3e5a7ba2-9f32-11e9-83e3-45fded8e8d2e_story.html",
    "snippet": "Breaking news, live coverage, investigations, analysis, video, photos and opinions from The Washington Post. Subscribe for the latest on U.S. and international news, politics, business, technology, climate change, health and wellness, sports, science, weather, lifestyle and more.",
    "published": null
  }
]