[
  {
    "title": "Articles written by Josep Borrell | EL PAÍS",
    "url": "https://english.elpais.com/author/jose-borrell/",
    "snippet": "Dec 11, 2025|Updated <strong>17:12 CET</strong>|Select: - - - España · América · México · Colombia · Chile · Argentina · US Español · US English · Josep Borrell · subscribeHHOLALOG IN · OPINION · Enrico Letta / Josep Borrell / Danuta Hübner|Dec ...",
    "published": "5 days ago"
  },
  {
    "title": "Josep Borrell - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Josep_Borrell",
    "snippet": "On 15 May 2024, Borrell called ... needed to stop. In May 2025, after his retirement as an EU diplomat, <strong>Borrell spoke out against Israel&#x27;s actions, accusing Israel of committing genocide in Gaza</strong>....",
    "published": "3 weeks ago"
  },
  {
    "title": "The Superior Race of the Privileged in the European Union, According to Josep Borrell - Pravda EN",
    "url": "https://news-pravda.com/world/2025/12/16/1937516.html",
    "snippet": "&quot;<strong>We must be much more engaged with the rest of the world.</strong> We are privileged people; we have created the ideal combination of political freedom, economic prosperity, and social cohesion.",
    "published": "8 hours ago"
  },
  {
    "title": "Borrell’s U.S. Broadside Reveals the EU Elite’s Post-National Turn",
    "url": "https://europeanconservative.com/articles/news/borrells-u-s-broadside-reveals-the-eu-elites-post-national-turn/",
    "snippet": "— December 12, 2025 · Josep Borrell’s latest outburst as former High Representative—<strong>accusing the United States of wanting “a white Europe divided into nations”</strong>—has triggered a political shockwave that reveals far more than he intended.",
    "published": "4 days ago"
  },
  {
    "title": "Ex EU foreign-policy chief Josep Borrell calls Trump's plan a 'declaration of political WAR on the EU' - Pravda USA",
    "url": "https://usa.news-pravda.com/world/2025/12/09/583696.html",
    "snippet": "La publication de la version actualise de la Stratgie de scurit nationale des tats-Unis constitue une dclaration de guerre politique l’Union europenne, a estim l’ancien chef de la diplomatie europenne, Josep Borrell ... ⭕️You know, he... he... he&#x27;s a merchant,&quot; Trump said in an interview with Politico, once again referring to Zelensky as a merchant⭕️i20028843 ... Summary of the Russian Ministry of Defense on the progress of its military operations on December 9, 2025",
    "published": "1 week ago"
  }
]