[
  {
    "title": "De Havilland Canada - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland_Canada",
    "snippet": "The original de Havilland Aircraft of Canada, Limited was <strong>created in 1928 by the British de Havilland Aircraft Company to build Moth aircraft for the training of Canadian airmen</strong>, and subsequently after the Second World War, designed and produced indigenous designs.",
    "published": "3 days ago"
  },
  {
    "title": "de Havilland - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/De_Havilland",
    "snippet": "<strong>The de Havilland company became a member of the Hawker Siddeley group in 1960, but lost its separate identity in 1963</strong>. Later, Hawker Siddeley merged into what is eventually known today as BAE Systems, the British aerospace and defence business. The de Havilland name lives on in De Havilland ...",
    "published": "November 1, 2025"
  },
  {
    "title": "De Havilland Aircraft of Canada Limited | The Canadian Encyclopedia",
    "url": "https://www.thecanadianencyclopedia.ca/en/article/de-havilland-aircraft-of-canada-limited",
    "snippet": "De Havilland Aircraft of Canada Limited, with head offices in Toronto, Ontario, is an aircraft manufacturer <strong>incorporated in 1928</strong>. It has designed and built iconic Canadian bush planes such as the Beaver, the Otter and the Twin Otter, as well ...",
    "published": null
  },
  {
    "title": "The Rise and Fall (and Rise Again) of De Havilland Canada",
    "url": "https://simpleflying.com/de-havilland-canada-rise-and-fall/",
    "snippet": "Longview&#x27;s acquisition of the Dash 8 program led to rebranding De Havilland Canada and uniting its aviation assets. De Havilland Canada was <strong>founded nearly 96 years ago, in August 1928</strong>, as a subsidiary of the United Kingdom aircraft manufacturer ...",
    "published": "February 21, 2024"
  },
  {
    "title": "About - De Havilland Canada",
    "url": "https://dehavilland.com/about/",
    "snippet": "From our aviation roots with legendary aircraft like the Beaver, Buffalo, Caribou and Otter; to today’s fleet of Dash 8s, Twin Otters and Aerial Firefighters, including the new De Havilland Canadair 515, that help protect and move people around the world, De Havilland Canada is dedicated to advancing our near-100-year reputation of excellence in innovation, production, and customer support, while manufacturing aircraft that get the job done.",
    "published": "March 15, 2023"
  }
]