[
  {
    "title": "Sepp Blatter - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Sepp_Blatter",
    "snippet": "FIFA president Sepp Blatter was cleared of any misconduct, but his predecessor, Brazilian João Havelange, resigned as FIFA&#x27;s honorary president over his part in the scandal, since Havelange along with former FIFA Executive Committee members Ricardo Teixeira and Dr.",
    "published": "February 28, 2002"
  },
  {
    "title": "Sepp Blatter | PBS News",
    "url": "https://www.pbs.org/newshour/tag/sepp-blatter",
    "snippet": "Less than a week after a corruption scandal rocked the soccer world, FIFA president Sepp Blatter, who maintained he was the man to lead soccer&#x27;s international governing body, has stepped down.",
    "published": null
  },
  {
    "title": "US drops bid to preserve FIFA bribery convictions | National | kpcnews.com",
    "url": "https://www.kpcnews.com/news/national/article_8a8495c1-24b9-5fcb-846c-a228df09d529.html",
    "snippet": "<strong>The case was one of several to emerge from a sweeping 2015 corruption probe by the US Department of Justice (DOJ), which ultimately led to the downfall of then-FIFA president Sepp Blatter.</strong>",
    "published": "3 days ago"
  },
  {
    "title": "Sepp Blatter and Michel Platini cleared of corruption by Swiss court",
    "url": "https://www.bbc.com/news/articles/cx298rz985eo",
    "snippet": "Tuesday&#x27;s ruling is the second time the two men have been acquitted over payment made in 2011.",
    "published": "March 25, 2025"
  },
  {
    "title": "FIFA president Sepp Blatter announces resignation amidst corruption scandal | June 2, 2015 | HISTORY",
    "url": "https://www.history.com/this-day-in-history/june-2/sepp-blatter-announces-resignation-fifa-corruption",
    "snippet": "On <strong>June 2, 2015,</strong> Sepp Blatter, president of international soccer’s governing body FIFA, steps down, just a few days after he had been re-elected to a fifth four-year term. His resignation came amid rumors that he would soon be under investigation ...",
    "published": "May 27, 2025"
  }
]