[
  {
    "title": "Leadership - IAU",
    "url": "https://www.iau-aiu.net/Leadership",
    "snippet": "About the Executive Leadership Program (ELP) The IAU is pleased to announce that the third edition of the IAU Executive Leadership Programme (ELP), scheduled to run from Autumn 2025 to 2026, is now accepting applications.",
    "published": null
  },
  {
    "title": "Leadership — International Association of Universities",
    "url": "https://iau.global/leadership",
    "snippet": "IAU at the 2025 Magna Charta Observatory Conference · Executive Leadership Programme (ELP) Meeting in Kigali · Advancing Fair, Transparent, and Cross-border Recognition of Higher Education Qualifications · What Role for Universities in Democracy? Application Deadline Extended: ELP 2025-2026 ·",
    "published": null
  },
  {
    "title": "Executive Leadership Programme — International Association of Universities",
    "url": "https://iau.global/elp",
    "snippet": "<strong>Develop Effective Teams</strong>: Explore leadership expectations and improve interpersonal management skills to unlock the full potential of diverse high-performing teams. Build a Global Network of Peers: Create long-term partnerships, connect with ...",
    "published": null
  },
  {
    "title": "Apply for IAU Membership in 2025 by 15 December | American Astronomical Society",
    "url": "https://aas.org/posts/news/2024/10/apply-iau-membership-2025-15-december",
    "snippet": "The membership of individual scientists in the IAU offers access to travel grants to the IAU-sponsored meetings, opportunities for leadership positions on committees and working groups, eligibility for IAU awards, possibilities for outreach and development funding and training, and access to regular email newsletters from the IAU and its Divisions, Commissions, and Working Groups.",
    "published": null
  },
  {
    "title": "IAU represented at events - IAU",
    "url": "https://www.iau-aiu.net/IAU-at-events",
    "snippet": "IAU Secretary General Hilligje van’t Land and Programme Officer Isabel Toman used this unique opportunity to also meet with the Leadership and the International Office at the University of Cape Town and the leadership at IAU Members Durban University of Technology (DUT) and University of KwaZulu-Natal (UKZN). ... 16 December Higher Education at a Crossroads: Envisioning Future Scenarios for the Field and for Society IAU Secretary General Hilligje van’t Land was invited to be the first speaker opening the Tokyo College series Higher Education at a Crossroads: Envisioning Future Scenarios for the Field and for Society on 16 December 2022.",
    "published": null
  }
]