[
  {
    "title": "Alexei Navalny - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Alexei_Navalny",
    "snippet": "In August 2005, Navalny was admitted to the Social Council of the Central Administrative Okrug of Moscow, created before the Moscow City Duma election held later that year, in which he took part as a candidate. In November, he was one of the initiators of the Youth Public Chamber, intended to help younger politicians take part in legislative initiatives. At the same time, in 2005, Navalny started another youth social movement, named &quot;DA! – Democratic Alternative&quot;. The project was not connected to Yabloko or any other political party.",
    "published": "1 week ago"
  },
  {
    "title": "The Two Layers of Alexei Navalny | Wilson Center",
    "url": "https://www.wilsoncenter.org/blog-post/two-layers-alexei-navalny",
    "snippet": "Nor did they pursue clear and actionable political programs. The Slavophiles romanticized the communal ideals of a largely imagined peasant Russia, while the vanguardists were collectivists who prioritized utopian visions of the future over personal liberty. Both were rooted in their era’s authoritarian realities, making Navalny’s combination of faith and a commitment to democratic principles all the more extraordinary in Russia’s historical context.",
    "published": null
  },
  {
    "title": "True Beliefs and Opportunism: Navalny’s Tangled Political Development - The Moscow Times",
    "url": "https://www.themoscowtimes.com/2021/02/01/true-beliefs-and-opportunism-navalnys-tangled-political-development-a72797",
    "snippet": "In 1999, Navalny made his first foray into formal politics, joining the <strong>center-left pro-European liberal party</strong>, Yabloko.",
    "published": "February 1, 2021"
  },
  {
    "title": "Aleksey Navalny | Facts, Biography, Poisoning, Death, & Imprisonment | Britannica",
    "url": "https://www.britannica.com/biography/Aleksey-Navalny",
    "snippet": "He remained in Moscow to practice law and to continue his studies, and in 2001 he earned an economics degree from the Financial University under the Government of the Russian Federation. In 2000, while he was still a student, Navalny joined Yabloko, a political party that promoted liberal democracy and a market economy.",
    "published": "March 7, 2023"
  },
  {
    "title": "Alexei Navalny: A Pivotal Figure in Russian Political History – The Science Survey",
    "url": "https://thesciencesurvey.com/news/2024/05/14/alexei-navalny-a-pivotal-figure-in-russian-political-history/",
    "snippet": "Navalny joined the <strong>Russian United Democratic Party</strong>, also known as “Yabloko.” It was immediately clear to him that the new law was directed at Yabloko, encouraging him to take a more active role in the party, despite him claiming in an interview ...",
    "published": null
  }
]