[
  {
    "title": "Homepage 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/",
    "snippet": "Join Richard Dawkins on a Voyage From Athens to Istanbul Exploring the Fabled Greek Islands on This Fantastic Cruise of a Lifetime September 7 – 17, 2025",
    "published": "July 17, 2025"
  },
  {
    "title": "Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Richard_Dawkins",
    "snippet": "In particular, Dawkins and Gould have been prominent commentators in the controversy over sociobiology and evolutionary psychology, with Dawkins generally approving and Gould generally being critical. A typical example of Dawkins&#x27;s position is his scathing review of Not in Our Genes by Steven Rose, Leon J. Kamin and Richard C.",
    "published": "1 week ago"
  },
  {
    "title": "OPEN DISCUSSION MARCH 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/2025/03/open-discussion-march-2025/",
    "snippet": "There is also of course Zeuglodon Beta’s encouragement to follow the science news as well as current affairs – too long to reproduce in full here, but it can be found at https://richarddawkins.net/2025/02/open-discussion-february-2025/#comment-217547",
    "published": "April 1, 2025"
  },
  {
    "title": "Views of Richard Dawkins - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Views_of_Richard_Dawkins",
    "snippet": "Dawkins himself has stated that his political views are <strong>left-leaning</strong>. However, many of Dawkins&#x27;s political statements have created controversy among left-wing and atheist communities.",
    "published": "September 22, 2025"
  },
  {
    "title": "OPEN DISCUSSION JULY 2025 | Richard Dawkins Foundation for Reason and Science",
    "url": "https://richarddawkins.net/2025/07/open-discussion-july-2025/",
    "snippet": "This thread has been created for thoughtful, rational discussion on subjects for which there are not currently any dedicated threads. Please note that our C ...",
    "published": "August 1, 2025"
  }
]