[
  {
    "title": "Stanford",
    "url": "https://hai.stanford.edu/",
    "snippet": "Through evidence-based research and global convenings, our policy work equips decision-makers with key insights into AI governance’s challenges and opportunities. ... We have a historical opportunity and responsibility to establish a human-centered frameworkfor AI research, education, practice and policy.",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/company/stanfordhai",
    "snippet": "Stanford HAI faculty affiliate James Zou co-developed SyntheMol, a model that creates recipes for chemists to synthesize drugs in the lab. https://stan.md/43Wv0qs ... How do we navigate the competing visions for global AI governance? Experts will unpack the intentions, technical specifics, and core tensions of each approach in this AI+Policy symposium next Tuesday, April 16.",
    "published": null
  },
  {
    "title": "Stanford Institute for Human-Centered Artificial Intelligence (HAI) | Stanford Online",
    "url": "https://online.stanford.edu/schools-centers/stanford-institute-human-centered-artificial-intelligence-hai",
    "snippet": "<strong>Stanford founded the Institute for Human-Centered AI in 2019 to guide and build the future of AI</strong>.HAI advances AI research, education, policy and practice to improve the human condition.",
    "published": "October 17, 2024"
  },
  {
    "title": "Twitter",
    "url": "https://twitter.com/StanfordHAI",
    "snippet": "JavaScript is not available · We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center · Help Center · Terms of Service Privacy Policy ...",
    "published": null
  },
  {
    "title": "Annual Report 2023 Stanford Institute for Human-Centered",
    "url": "https://hai-production.s3.amazonaws.com/files/2024-04/2023-Annual-Report.pdf",
    "snippet": "partnership grants enable the institute to quickly initiate · new research in key areas as AI advancements continue · to accelerate. For example, in February 2023, after the · launch of ChatGPT, in collaboration with the Stanford ... Daniel E. Ho, Faculty Director | Christine Tsang, Executive Director · Stanford RegLab builds high-impact partnerships for data science and AI in · the public sector. RegLab envisions a future where government can leverage",
    "published": null
  }
]