[
  {
    "title": "Stade Josy Barthel - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stade_Josy_Barthel",
    "snippet": "The Luxembourg national football team played its last official game at the <strong>Josy Barthel Stadium</strong> on 27 March 2021, a 3–1 defeat to Portugal in the 2022 World Cup qualifiers.",
    "published": "September 26, 2025"
  },
  {
    "title": "Luxembourg - Stadium - Stade de Luxembourg | Transfermarkt",
    "url": "https://www.transfermarkt.com/luxembourg/stadion/verein/3580",
    "snippet": "Luxembourg U21 · Luxembourg U19 · Luxembourg U18 · Luxembourg U17 · Luxembourg U16 · Luxembourg B · Luxembourg U15 · Luxemburg Olympia · This page provides you with information about the stadium of the selected club. In addition to the basic facts, you can find the address of the stadium, access information, special features, prices in the stadium and name rights.",
    "published": null
  },
  {
    "title": "Explore the stadium | Stade de Luxembourg",
    "url": "https://www.stadedeluxembourg.lu/en/explore-stadium",
    "snippet": "&quot;<strong>Stade de Luxembourg</strong>&quot; – Luxembourg&#x27;s brand new national football and rugby stadium – is fully compliant with the latest standards in terms of comfort, technology and safety, and features an adjoining multi-purpose space designed to accommodate ...",
    "published": null
  },
  {
    "title": "Stade de Luxembourg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Stade_de_Luxembourg",
    "snippet": "The <strong>Stade de Luxembourg</strong> is the national stadium of the Grand Duchy of Luxembourg, located in the Luxembourg City quarter of Gasperich. The stadium is host to Luxembourg&#x27;s national football and rugby teams, as well as the final of the Coupe de ...",
    "published": "December 23, 2024"
  },
  {
    "title": "List of football stadiums in Luxembourg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_football_stadiums_in_Luxembourg",
    "snippet": "The following is a list of football stadiums in Luxembourg. The list includes total stadium capacity not just seating capacity. Football venues with a capacity of 1,000 or higher are included.",
    "published": "August 13, 2025"
  }
]