[
  {
    "title": "Aníbal Fernández | AS/COA",
    "url": "https://www.as-coa.org/speakers/anibal-fernandez",
    "snippet": "Aníbal Fernández is a candidate for governor of the Province of Buenos Aires and currently chief of staff of the Minister’s Cabinet for the presidency. Previously, he served in the National Senate as representative for the province of Buenos Aires. Fernández initiated his career as consultant to the Budget Committee for the Senators Chambers of the province of Buenos Aires in 1983.",
    "published": null
  },
  {
    "title": "Argentina - Politics",
    "url": "https://www.globalsecurity.org/military/world/argentina/president-fernandez-a.htm",
    "snippet": "After months of rumors of his impending departure, Argentine Cabinet Chief Alberto Fernandez <strong>stepped down 23 July 2008.</strong>",
    "published": null
  },
  {
    "title": "Aníbal Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/An%C3%ADbal_Fern%C3%A1ndez",
    "snippet": "He has held several cabinet positions under three presidents, serving in these offices for a total of over nine years. He served as Minister of Production under Eduardo Duhalde, as Interior Minister under Néstor Kirchner, as Minister of Justice under Cristina Fernández de Kirchner, and as the President&#x27;s Cabinet Chief from 2009 to 2011.",
    "published": "November 15, 2025"
  },
  {
    "title": "Presidency of Alberto Fernández - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Presidency_of_Alberto_Fern%C3%A1ndez",
    "snippet": "Fernández himself stated that the Malvinas are &quot;a territory [Argentina] will never give up&quot;. The Fernández administration gave back <strong>secretariat-level status to the Secretariat of Malvinas Affairs</strong>, which had been demoted to an undersecretariat ...",
    "published": "November 7, 2025"
  },
  {
    "title": "Chief of the Cabinet of Ministers",
    "url": "https://en-academic.com/dic.nsf/enwiki/11529349",
    "snippet": "The Chief of the Cabinet of Ministers is a political office of Argentina, created by the 1994 amendment of the Argentine Constitution. <strong>The current office holder</strong> is Aníbal Fernández.",
    "published": null
  }
]