[
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://grokipedia.com/page/Anke_Domscheit-Berg",
    "snippet": "Yes, YouTube: <strong>Member of the Bundestag, 2017-2025</strong>.[6] Anke Domscheit-Berg was born on February 17, 1968, in Premnitz, a town in the German Democratic Republic (GDR), during the period of communist rule in East Germany.[7][2] Her father, Wolfgang ...",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Anke_Domscheit-Berg",
    "snippet": "She joined the party in 2021 following her nomination to the top female position on the party election list in the state of Brandenburg. <strong>Her mandate ended in 2025 because she did not run for re-election</strong>. Previously, she was a member of the Pirate Party Germany and the Greens.",
    "published": "August 13, 2025"
  },
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://sawadee.wiki/wiki/Anke_Domscheit-Berg",
    "snippet": "She has been a member of the Bundestag since 2017, when she was elected on the party list of The Left, <strong>without being a party member. She joined the party in 2021</strong> following her nomination to the top female position on the party election list ...",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg | The Guardian",
    "url": "https://www.theguardian.com/profile/anke-domscheit-berg",
    "snippet": "Anke Domscheit-Berg is chairwoman of the State of Brandenburg Pirate Party and a candidate for the Bundestag at the upcoming elections. She is an open government activist, consultant and writer",
    "published": null
  },
  {
    "title": "Anke Domscheit-Berg",
    "url": "https://alem.dynip.sapo.pt/wiki/content/wikipedia/A/Anke_Domscheit-Berg",
    "snippet": "She has been a member of the Bundestag since 2017, when she was elected on the party list of The Left, <strong>without being a party member. She joined the party in 2021</strong> following her nomination to the top female position on the party election list in the state of Brandenburg.[1] Previously, she was ...",
    "published": null
  }
]