[
  {
    "title": "Mary Earps - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mary_Earps",
    "snippet": "On 27 May 2025, after making 53 ... football, saying: &quot;This is the right time for me to step aside and give the younger generation an opportunity to thrive.&quot; Shortly before Earps&#x27; announcement, Wiegman had stated that Hannah Hampton had moved ahead of Earps for the number one goalkeeper spot for England as they prepared for the UEFA Women&#x27;s Euro 2025 tournament. In June 2023, Earps launched her own clothing and apparel business called MAE27. Earps published her autobiography, Mary Earps: All ...",
    "published": "4 days ago"
  },
  {
    "title": "England Women's player profile: Mary Earps | England Football",
    "url": "https://www.englandfootball.com/england/womens-senior-team/squad/mary-earps",
    "snippet": "After five years at Old Trafford and helping the club to their first ever Women&#x27;s FA Cup title in 2024, Mary took on a new challenge by joining French giants <strong>Paris Saint-Germain</strong>. Earps called time on her spell with the Lionesses in May 2025, after collecting a total of 53 caps.",
    "published": null
  },
  {
    "title": "Mary Earps MBE (@maryearps) - Instagram",
    "url": "https://www.instagram.com/maryearps/",
    "snippet": "See Instagram photos and videos from <strong>Mary</strong> <strong>Earps</strong> MBE (@maryearps)",
    "published": null
  },
  {
    "title": "Mary Earps has announced her decision to retire from international football",
    "url": "https://www.englandfootball.com/articles/2025/May/27/mary-earps-retires-from-international-football-20252705",
    "snippet": "The decision marks the end of a memorable eight-year international career and comes as <strong>the Lionesses</strong> prepare for the culmination of their UEFA Women’s Nations League group stage campaign.",
    "published": null
  },
  {
    "title": "Mary Earps’ Manchester United return: Jeers, cheers, selfies and a painful defeat - The Athletic",
    "url": "https://www.nytimes.com/athletic/6802703/2025/11/13/mary-earps-manchester-united-psg/",
    "snippet": "“Nothing has changed in Mary’s day-to-day,” he told reporters in a press conference before the game. The story did not even register in the French media but PSG have set up Earps with Bodyguard, an application which monitors hate speech on social media and hides toxic comments. Old Trafford should be a happy place for Earps. It was here, as a child, that she watched her team, Liverpool, live and in the flesh for the first time.",
    "published": "November 13, 2025"
  }
]