[
  {
    "title": "Odion Ighalo - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Odion_Ighalo",
    "snippet": "On 15 August 2023, Ighalo joined Al-Wehda on a free transfer. On 24 March 2015, after a series of strong performances for Watford, newly appointed Nigeria interim coach <strong>Daniel Amokachi</strong> selected Ighalo for the first time, and the latter stated, &quot;I feel good because it is my dream to play for ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Odion Ighalo: Saudi Professional League Player Watch - Coaches' Voice",
    "url": "https://learning.coachesvoice.com/cv/odion-ighalo-al-shabab-manchester-united-ole-gunnar-solskjaer/",
    "snippet": "Manchester United loaned Odion Ighalo from Shanghai Shenhua, and the striker has since moved on to Al Shabab of the Saudi Professional League",
    "published": "October 28, 2021"
  },
  {
    "title": "Al-Shabab FC - Current and former staff | Transfermarkt",
    "url": "https://www.transfermarkt.com/al-shabab-riad/mitarbeiterhistorie/verein/9840",
    "snippet": "The record of current and former staff lists all coaches, presidents, athletic directors, etc. who have ever worked for the selected club, along.",
    "published": null
  },
  {
    "title": "Nigeria’s Afcon-bound Ighalo on target as Al Shabab edge out Al Ahli Saudi | Goal.com",
    "url": "https://www.goal.com/en/news/nigeria-afcon-bound-ighalo-on-target-al-shabab-edge-out-al-ahli-saudi/blt8a5fd43b2d468d53",
    "snippet": "This could be Ighalo’s last match for Al Shabab for a while as he is among the players summoned by Nigeria interim coach <strong>Augustine Eguavoen</strong> for the Africa Cup of Nations set to kick off on January 9 in Cameroon.",
    "published": "January 2, 2022"
  },
  {
    "title": "Former Man United striker Ighalo joins Saudi side Al Shabab | Reuters",
    "url": "https://www.reuters.com/article/uk-soccer-saudi-ighalo/former-man-united-striker-ighalo-joins-saudi-side-al-shabab-idUSKBN2A50VF/",
    "snippet": "He is the latest high-profile foreigner to leave the Chinese Super League following the departure of Brazilian striker Hulk from Shanghai SIPG and coach <strong>Rafa Benitez</strong> from Dalian Pro.",
    "published": "February 5, 2021"
  }
]