[
  {
    "title": "Igor Tudor - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Igor_Tudor",
    "snippet": "On <strong>23 March 2025</strong>, Tudor replaced Thiago Motta as head coach of Serie A club Juventus. This appointment marked the first time Juventus had appointed a foreign manager since Didier Deschamps in the 2006–07 season. He eventually guided the club to the fourth place of league table and Champions ...",
    "published": "October 30, 2025"
  },
  {
    "title": "r/soccer on Reddit: Igor Tudor is no longer Juventus' head coach",
    "url": "https://www.reddit.com/r/soccer/comments/1ohc7qk/igor_tudor_is_no_longer_juventus_head_coach/",
    "snippet": "[Romano] Juventus are on the verge of sacking head coach Igor Tudor after recent poor results. The club has decided to change with formal steps to follow on new manager soon ... <strong>Juventus are set to appoint Igor Tudor as the new head coach</strong>, confirmed.",
    "published": "October 27, 2025"
  },
  {
    "title": "Igor Tudor to remain as Juventus head coach for 2025-26 season - The Athletic",
    "url": "https://www.nytimes.com/athletic/6415592/2025/06/10/igor-tudor-juventus-next-season/",
    "snippet": "Juventus have confirmed that head coach Igor Tudor will stay with the club for the <strong>2025-26 season</strong>. The 47-year-old was appointed by the club in March, replacing Thiago Motta, who only lasted nine months in the role.",
    "published": "June 19, 2025"
  },
  {
    "title": "Back in Bianconero | All you need to know about new Juventus coach Igor Tudor - Juventus",
    "url": "https://www.juventus.com/en/news/articles/back-in-bianconero-all-you-need-to-know-about-new-juventus-coach-igor-tudor",
    "snippet": "Igor Tudor’s Juventus history is set to have a new chapter written. A solid defender at first, and then a coach later, Igor is back with the...",
    "published": null
  },
  {
    "title": "Igor Tudor Juventus: Player, Coach, and Now Manager - Italian Football",
    "url": "https://www.italian-football.org/igor-tudor-juventus/",
    "snippet": "Igor Tudor was appointed Juventus manager in <strong>March 2025</strong> after the sacking of Thiago Motta.",
    "published": "June 4, 2025"
  }
]