[
  {
    "title": "The Progress With Unity Stadium - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Progress_With_Unity_Stadium",
    "snippet": "<strong>The Progress With Unity Stadium</strong> is a multi-use sports, retail and housing development in Leigh, Greater Manchester, England. The centrepiece of the development is a 12,000-capacity stadium which is home to professional rugby league team Leigh Leopards, the Manchester United Women&#x27;s senior team, ...",
    "published": "1 week ago"
  },
  {
    "title": "Manchester United W.F.C. - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manchester_United_W.F.C.",
    "snippet": "Following the club&#x27;s acceptance into the 2018–19 FA Women&#x27;s Championship, it was revealed that the women&#x27;s team would be based in Broughton, Salford at The Cliff training ground; subject to completion of redevelopment work. United were to play their fixtures at <strong>Leigh Sports Village</strong> until this ...",
    "published": "2 days ago"
  },
  {
    "title": "Leigh Sports Village Venue Hire | Manchester United WFC Stadium",
    "url": "https://stadiumexperience.com/clubs/manchester-united-women-football-club/",
    "snippet": "<strong>Leigh Sports Village</strong> provides a state-of-the-art facility for health, education, sport and events that serves the whole community. The centrepiece of the development is a 12,000-capacity stadium, home to professional rugby league team Leigh ...",
    "published": "August 7, 2025"
  },
  {
    "title": "Manchester United Women | Leigh Sports Village",
    "url": "https://www.leighsportsvillage.co.uk/matchdays/manchester-united-women/",
    "snippet": "Manchester United Women have played all their home games at <strong>Leigh Sports Village</strong> since their inception, starting with their title-winning FA Women’s",
    "published": "August 6, 2024"
  },
  {
    "title": "The Progress With Unity Stadium",
    "url": "https://en.wikipedia.org/wiki/Leigh_Sports_Village",
    "snippet": "<strong>Leigh Sports Village</strong> is a multi-use sports, retail and housing development in Leigh, Greater Manchester, England. The centrepiece of the development is a 12,000-capacity stadium which is home to professional rugby league team Leigh Leopards, ...",
    "published": "September 5, 2025"
  }
]