[
  {
    "title": "Old Trafford - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Old_Trafford",
    "snippet": "<strong>Old Trafford</strong> (/ˈtræfərd/) is a football stadium in <strong>Old Trafford</strong>, Greater Manchester, England, and is the home of Manchester United. With a capacity of 74,197, it is the largest club football stadium (and second-largest football stadium overall after Wembley Stadium) in the United Kingdom, ...",
    "published": "1 day ago"
  },
  {
    "title": "Visit Old Trafford | Man Utd Museum, Stadium Tour, Red Cafe, Conferences, Business and Corporate Events | Manchester United",
    "url": "https://www.manutd.com/en/visit-old-trafford",
    "snippet": "<strong>Old Trafford Stadium</strong> is the world-famous home of Manchester United, and there&#x27;s plenty to do when you visit.",
    "published": null
  },
  {
    "title": "Man Utd’s New Record-Breaking Stadium Given Official Timeline",
    "url": "https://www.si.com/soccer/man-utd-new-record-breaking-stadium-official-timeline",
    "snippet": "United’s chief operating officer Collette Roche added: “Our ambition is to build a new 100,000-seater stadium fit to host the biggest international football games. This will be part of a wider regeneration of the area around <strong>Old Trafford</strong>, with ...",
    "published": "4 weeks ago"
  },
  {
    "title": "Man United want new Old Trafford ready for 2035 World Cup - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/47126318/man-united-want-new-old-trafford-ready-2035-world-cup",
    "snippet": "In March, United announced their plan to leave Old Trafford, their home for more than 100 years, and move into a new 100,000-seater stadium.",
    "published": "4 weeks ago"
  },
  {
    "title": "Man United to leave Old Trafford for 100,000-seat stadium - ESPN",
    "url": "https://www.espn.com/soccer/story/_/id/44203117/man-united-leave-old-trafford-100000-seater-stadium",
    "snippet": "<strong>Old Trafford</strong>, which has a capacity of 76,000 after the last expansion in 2006, was opened in 1910. United&#x27;s plan would see a new stadium built on the same site in Manchester with a potential capacity of 100,000, making it the biggest stadium ...",
    "published": "March 11, 2025"
  }
]