[
  {
    "title": "Manmohan Singh Education: Former PM Schooling, Colleges, Degrees and Academic Achievements",
    "url": "https://www.jagranjosh.com/articles/manmohan-singh-education-qualification-1735280163-1",
    "snippet": "Explore the education journey of former Prime Minister Dr. Manmohan Singh. Learn about his schooling, colleges, degrees, and remarkable academic achievements that shaped his political career.",
    "published": "December 27, 2024"
  },
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Singh was initially educated at a local gurdwara, where he began studying Urdu and Punjabi. On 17 April 1937, he was enrolled in the <strong>local Government Primary School</strong>, where he continued his Urdu-medium education until the age of 10 (Class 4), after which he and his family moved to Peshawar.",
    "published": "2 days ago"
  },
  {
    "title": "CURRICULUM VITAE DR. MANMOHAN SINGH PRIME MINISTER OF INDIA ACADEMIC RECORD",
    "url": "https://www.visvabharati.ac.in/files/6340200114_Manmohan.pdf",
    "snippet": "DR. MANMOHAN SINGH",
    "published": null
  },
  {
    "title": "Passing of alumnus Prime Minister Manmohan Singh | Faculty of Economics",
    "url": "https://www.econ.cam.ac.uk/news/2025/passing-alumnus-prime-minister-manmohan-singh",
    "snippet": "Manmohan Singh was born in 1932, in a village in the Punjab province of the then undivided India. Dr. Singh’s academic credentials were burnished by the years he spent on the faculty of Punjab University and the prestigious <strong>Delhi School of Economics</strong>. He had a brief stint at the UNCTAD Secretariat ...",
    "published": null
  },
  {
    "title": "What are the educational degrees of former Prime Minister Dr. Manmohan Singh? - Quora",
    "url": "https://www.quora.com/What-are-the-educational-degrees-of-former-Prime-Minister-Dr-Manmohan-Singh",
    "snippet": "Manmohan Singh, the ex-Prime Minister of India had attended <strong>Punjab University</strong>, then in Hoshiarpur, Punjab, studying Economics and got his bachelor&#x27;s and master&#x27;s degrees in 1952 and 1954, respectively, standing first throughout his academic career.",
    "published": null
  }
]