[
  {
    "title": "Official website of the President of Ukraine",
    "url": "https://www.president.gov.ua/en",
    "snippet": "The First Lady of Ukraine, <strong>Olena Zelenska</strong>, summarized this year’s results of implementing the All-Ukrainian Mental Health Program “How Are You?”. 19 December 2025 - 16:07 · The Head of State honored the memory of Poles who, at different ...",
    "published": "4 days ago"
  },
  {
    "title": "President of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_Ukraine",
    "snippet": "The Government of Ukraine utilizes ... nation&#x27;s head of government. The prime minister serves as the head of government, a role currently filled by <strong>Yulia Svyrydenko</strong>, who took office on 17 July 2025....",
    "published": "November 10, 2025"
  },
  {
    "title": "Zelenskyy appoints Yulia Svyrydenko as new prime minister for war-weary Ukraine | PBS News",
    "url": "https://www.pbs.org/newshour/world/zelenskyy-appoints-yulia-svyrydenko-as-new-prime-minister-for-war-weary-ukraine",
    "snippet": "Left: Newly appointed Ukrainian Prime Minister <strong>Yulia Svyrydenko</strong> attends a session of Ukrainian parliament, amid Russia&#x27;s attack on Ukraine, in Kyiv, Ukraine July 17, 2025.",
    "published": "July 17, 2025"
  },
  {
    "title": "Prime Minister of Ukraine - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_Ukraine",
    "snippet": "The current prime minister is <strong>Yulia Svyrydenko</strong>, who was confirmed by the Verkhovna Rada on 17 July 2025. She replaced Denys Shmyhal, who had been sworn in on 4 March 2020 following the resignation of Oleksiy Honcharuk.",
    "published": "3 weeks ago"
  },
  {
    "title": "About the President of Ukraine — Official web site of the President of Ukraine",
    "url": "https://www.president.gov.ua/en/president/about-president",
    "snippet": "18 December 2025 - 15:48 Go to all galleries · Home · President · The status and powers of the President of Ukraine, as well as the election procedure are stipulated by the Constitution of Ukraine., which defines the rights and responsibilities of the President as Head of State, the election procedure, and provides for the possibility of his/her dismissal from office and termination of his/her powers.",
    "published": "5 days ago"
  }
]