[
  {
    "title": "Zaza Pachulia - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Zaza_Pachulia",
    "snippet": "Zaza Pachulia (Georgian: ზაზა ფაჩულია; Georgian pronunciation: [zaza patʃʰulia] born Zaur Pachulia; 10 February 1984) is a Georgian professional basketball executive and former player who is a basketball operations consultant for the Golden State Warriors of the National Basketball Association (NBA).",
    "published": "November 6, 2025"
  },
  {
    "title": "Zaza Pachulia Stats, Height, Weight, Position, Draft Status and more | Basketball-Reference.com",
    "url": "https://www.basketball-reference.com/players/p/pachuza01.html",
    "snippet": "&gt; Zaza Pachulia · Welcome · Your Account · Logout · Ad-Free Login · Create Account · The most viewed basketball player and team in your state is here! Check it out. Pronunciation: \\Za-Za Pa-CHUL-e-ya\\ Zaur Pachulia · Position: Center ▪ Shoots: Right ·",
    "published": null
  },
  {
    "title": "Warriors bring back Pachulia as consultant, make promotions - NBA - ESPN",
    "url": "https://www.espn.com/espn/wire?section=nba&id=27495175",
    "snippet": "SAN FRANCISCO -- Former Golden State center Zaza Pachulia has re-joined the Warriors, no longer as a player but working as <strong>a consultant</strong>. The team announced Pachulia&#x27;s hiring Thursday along with naming Steve Kerr&#x27;s entire coaching staff and the ...",
    "published": null
  },
  {
    "title": "Zaza Pachulia NBA Stats & News",
    "url": "https://www.rotowire.com/basketball/player/zaza-pachulia-2391",
    "snippet": "However, with the Warriors also retaining JaVale McGee -- who provided a more athletic, rim-protecting change of pace at center -- and Draymond Green still around to man the position when coach Steve Kerr rolls out smaller lineups, Pachulia could once again be held to under 20 minutes per game, which would significantly limit his Fantasy appeal.",
    "published": null
  },
  {
    "title": "Zaza Pachulia Basketball Academy - Overview, News & Similar companies | ZoomInfo.com",
    "url": "https://www.zoominfo.com/c/zaza-pachulia-basketball-academy/557557074",
    "snippet": "Zaza Pachulia Basketball Academy is expanding and recently hired new employees. Here are the latest additions to the team. Filter by hire date · Past 12 months · Sort by · Newest · <strong>Lasha Javakhishvili</strong> · Basketball Coach · Joined Sep 1, 2025 · Phone · Email ·",
    "published": null
  }
]