[
  {
    "title": "Jennifer Westacott AC - KPMG Australia | LinkedIn",
    "url": "https://www.linkedin.com/in/jennifer-westacott-ac-9aa853146/",
    "snippet": "The Business Council of Australia is the nation’s premier business organisation… · Experience: KPMG Australia · Education: UNSW · Location: Sydney · 500+ connections on LinkedIn. View Jennifer Westacott AC’s profile on LinkedIn, a professional community of 1 billion members.",
    "published": "November 17, 2021"
  },
  {
    "title": "Jennifer Westacott AC rejoins KPMG to champion inclusion and innovation",
    "url": "https://kpmg.com/au/en/about/impact-plan/jennifer-westacott-ac-rejoins-kpmg-inclusion-innovation.html",
    "snippet": "Almost 12 months after rejoining KPMG Australia, the <strong>former Business Council of Australia CEO was made a Companion of the Order of Australia (AC) – the nation’s highest civilian accolade. It was formal recognition of her outstanding contributions to business, education, public policy and community development – all of which have been driven by her passion for driving success through inclusivity. &quot;A key part of my role here at KPMG Australia is to ensure our workplace is a beacon of equity</strong>...",
    "published": "August 9, 2025"
  },
  {
    "title": "Jennifer Westacott - Business Council of Australia",
    "url": "https://www.bca.com.au/jennifer_westacott2",
    "snippet": "As a senior partner at KPMG, Jennifer <strong>advised major corporations on climate change and sustainability and advised governments across Australia on significant reform priorities</strong>.",
    "published": null
  },
  {
    "title": "Jennifer Westacott | BoardLinks",
    "url": "https://www.boardlinks.gov.au/our-champions/jennifer-westacott",
    "snippet": "From 2005 to 2011 Jennifer was <strong>senior partner at KPMG</strong>, heading up the firm’s Sustainability, Climate Change and Water practice and its NSW State Government practice.",
    "published": null
  },
  {
    "title": "KPMG announces three senior appointments | Media release",
    "url": "https://kpmg.com/au/en/media/media-releases/2024/07/kpmg-announces-three-senior-appointments.html",
    "snippet": "<strong>3 July 2025</strong> – David Bradbury, Jennifer Westacott AO and Michael Ebeid AM join KPMG Australia.",
    "published": "July 29, 2025"
  }
]