[
  {
    "title": "List of heads of state of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_heads_of_state_of_Spain",
    "snippet": "The forerunners of the Spanish ... marriage of the Catholic Monarchs, <strong>Ferdinand II of Aragon (king of the Crown of Aragon) and Isabella I of Castile (queen of the Crown of Castile).</strong>...",
    "published": "October 18, 2025"
  },
  {
    "title": "Politics of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Politics_of_Spain",
    "snippet": "Outlawed during Franco&#x27;s dictatorship, it gained recognition during the Spanish transition to democracy period, when it officially renounced Marxism, under the leadership of <strong>Felipe González</strong>. It played a key role during the transition and the Constituent Assembly that wrote the Spanish current ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Heads of Spanish Government: The Spanish President & Council of Ministers - Lesson | Study.com",
    "url": "https://study.com/academy/lesson/heads-of-spanish-government-the-spanish-president-council-of-ministers.html",
    "snippet": "The heads of the Spanish government include the nation&#x27;s president and a group of advisers called the Council of Ministers who help them to run the country. Learn the history of the Spanish presidency and the Council of Ministers, and compare and contrast the roles of the Spanish and American presidents. Updated: 03/26/2025 ... When was the last time you were the leader of something?",
    "published": "September 9, 2014"
  },
  {
    "title": "Spain - Autonomous Regions, Constitution, Monarchy | Britannica",
    "url": "https://www.britannica.com/place/Spain/Government-and-society",
    "snippet": "<strong>Francisco Franco</strong>. The principles on which his regime was based were embodied in a series of Fundamental Laws (passed between 1942 and 1967) that declared Spain a monarchy and established a legislature known as the Cortes.",
    "published": "October 1, 1998"
  },
  {
    "title": "Government of Spain - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Government_of_Spain",
    "snippet": "According to Article 97 of the ... &quot;the Government directs domestic and foreign policy, the civil and military administration and the defense of the State. It exercises the executive function and the regulatory regulation according to the Constitution and the laws&quot;. Pedro Sánchez, took office as prime minister on 2 June 2018. He is the leader of the Socialist ...",
    "published": "October 22, 2025"
  }
]