[
  {
    "title": "PUBLIC EUROPEAN BANK FOR RECONSTRUCTION AND DEVELOPMENT",
    "url": "https://www.ebrd.com/content/dam/ebrd_dxp/assets/pdfs/office-of-the-general-counsel/annual-meetings/annual-meeting-2025/am2025-proceedings-english.pdf",
    "snippet": "Şimşek, were the Vice Chairs. ... Procedures Committee that had been circulated to all Governors. The Board was then addressed by The Rt Hon Rachel Reeves MP (Chancellor of the Exchequer of · the United Kingdom), Mr Klemen Boštjančič (Chair of the Board of Governors), and Ms Odile",
    "published": null
  },
  {
    "title": "Slovenia's Finance Minister Klemen Boštjančič Assumes Chairmanship of EBRD Board - The Region",
    "url": "https://connectingregion.com/news/slovenias-finance-minister-klemen-bostjancic-assumes-chairmanship-of-ebrd-board/",
    "snippet": "The Board of Governors, representing 73 EBRD members, holds significant authority over the Bank’s operations, including strategic decisions and membership considerations. Boštjančič’s tenure as chair for the 2024-2025 period signifies an important phase in the Bank’s ongoing initiatives, with vice chairs elected from Iceland and Turkey joining in the leadership role.",
    "published": "May 20, 2024"
  },
  {
    "title": "EBRD holds its 2025 Annual Meeting and Business Forum in London",
    "url": "https://www.ebrd.com/home/news-and-events/news/2025/ebrd-holds-its-2025-annual-meeting-and-business-forum-in-london.html",
    "snippet": "The Board of Governors’ opening session for the event will take place at Westminster Central Hall on Wednesday 14 May. The Chair of the Board of Governors, Slovenia’s Klemen Boštjančič, and EBRD President Odile Renaud-Basso will deliver speeches at the session.",
    "published": null
  },
  {
    "title": "Minister Boštjančič bo predsedoval Svetu guvernerjev ...",
    "url": "https://www.gov.si/en/",
    "snippet": "The central website for easy access to comprehensive information on the organisation and functioning of the state administration · Birth, parenthood, foster care, guardianship, adoption, family rights and benefits, prevention of domestic violence, marriage and partnership",
    "published": null
  },
  {
    "title": "EBRD Board of Directors visits Slovenia",
    "url": "https://www.ebrd.com/home/news-and-events/news/2023/ebrd-board-of-directors-visits-slovenia.html",
    "snippet": "The EBRD Board Directors is meeting with government representatives, including Minister of Finance Klemen Boštjančič, private-sector companies and members of the diplomatic community.",
    "published": null
  }
]