[
  {
    "title": "TF1 Group - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TF1_Group",
    "snippet": "TF1 Group (French: Groupe TF1) is a French media holding company. Its best-known property is the broadcast network TF1. The group was formed after TF1 was privatized in April 1987 in which the channel was launched back on 6 January 1975 twelve years prior.",
    "published": "2 weeks ago"
  },
  {
    "title": "TF1 Group - Overview, News & Similar companies | ZoomInfo.com",
    "url": "https://www.zoominfo.com/c/tf1-sa/160399507",
    "snippet": "View TF1 Group (www.groupe-tf1.fr) location in <strong>Ile-de-France, France</strong> , revenue, industry and description. Find related and similar companies as well as employees by title and much more.",
    "published": null
  },
  {
    "title": "TF1 GROUP - Bouygues",
    "url": "https://www.bouygues.com/en/tf1-group/",
    "snippet": "As France’s leading media group and a global player in content, TF1 wants to positively inspire society. It is present across the entire value chain through its three complementary core businesses – Production and Broadcasting – which provide it with the resources to create and innovate each day, and thereby showcase the most inspiring content for the widest audience possible.",
    "published": null
  },
  {
    "title": "TF1 Group - Crunchbase Company Profile & Funding",
    "url": "https://www.crunchbase.com/organization/tf1-group",
    "snippet": "TF1 is a private national <strong>French</strong> TV channel, controlled by TF1 Group, whose major share-holder is Bouygues.",
    "published": null
  },
  {
    "title": "Groupe TF1 : actualités, communiqués, agenda, événements, publications",
    "url": "https://groupe-tf1.fr/en",
    "snippet": "While television is our historic core business, the development of our digital and production activities has strengthened the presence of our content in the daily lives of French people. This development allows us today to be present across the entire value chain and to imagine new ways of producing, distributing and monetizing excellent content. ... With our free-to-air and theme channels, our TF1+ digital platform and our leading digital brands, we have built a unique ecosystem in France, able to meet the needs of all audiences.",
    "published": null
  }
]