[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "Micheál Martin (Irish: [ˈmʲiːçaːl̪ˠ]; born 16 August 1960) is an Irish Fianna Fáil politician serving as Taoiseach since January 2025, having previously held the position from 2020 to 2022. Martin served as <strong>Tánaiste, Minister for Foreign Affairs and Minister for Defence</strong> from December ...",
    "published": "2 weeks ago"
  },
  {
    "title": "Martin 'absolutely' confident he will remain FF leader",
    "url": "https://www.rte.ie/news/politics/2025/1216/1549211-fianna-fail-review/",
    "snippet": "Taoiseach Micheál Martin has said he has absolute confidence in remaining as <strong>Fianna Fáil leader</strong> after receiving the review of his party&#x27;s presidential election campaign.",
    "published": "21 minutes ago"
  },
  {
    "title": "Micheál Martin",
    "url": "https://schedule.sxsw.com/2025/speakers/2218628",
    "snippet": "Micheál Martin is an Irish Fianna Fáil politician serving as Taoiseach since January 2025, having previously held the position from 2020 to 2022. Martin served as <strong>Tánaiste, Minister for Foreign Affairs and Minister for Defence</strong> from December ...",
    "published": null
  },
  {
    "title": "Micheál Martin",
    "url": "https://grokipedia.com/page/Miche%C3%A1l_Martin",
    "snippet": "Micheál Martin is an Irish politician who has served as <strong>Taoiseach (prime minister) of Ireland</strong> since January 2025, having previously held the office from June 2020 to December 2022.",
    "published": null
  },
  {
    "title": "Fianna Fáil: Micheál Martin 'confident over leadership' amid review tensions",
    "url": "https://www.bbc.com/news/articles/cn7k1dxnk63o",
    "snippet": "<strong>Taoiseach (Irish Prime Minister)</strong> Micheál Martin has said he is &quot;absolutely&quot; confident he will remain as leader of Fianna Fáil, despite criticism within the party over a review into its handling of the presidential election.",
    "published": "6 hours ago"
  }
]