[
  {
    "title": "Possible (political party) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Possible_(political_party)",
    "snippet": "Possible (Italian: Possibile, Pos) is a left-wing political party in Italy, launched in Rome on 21 June 2015. The party&#x27;s founder is <strong>Giuseppe Civati</strong>, a former prominent member of the Democratic Party (PD).",
    "published": "April 4, 2025"
  },
  {
    "title": "Possible (political party) WikiZero",
    "url": "https://www.wikizero.org/wiki/en/Possible_(Italy)",
    "snippet": "Possible (Italian: Possibile, Pos) is a left-wing political party in Italy, launched in Rome on 21 June 2015.[1] The party&#x27;s founder is <strong>Giuseppe Civati</strong>, a former prominent member of the Democratic Party (PD).",
    "published": null
  },
  {
    "title": "List of political parties in Italy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/List_of_political_parties_in_Italy",
    "snippet": "Since World War II no party has ever gained enough support to govern alone; thus, parties form political alliances and coalition governments. In the 2022 general election, four groupings obtained most of the votes and most of the seats in the two houses of the Italian Parliament: the &quot;centre-right coalition&quot; composed of the Brothers of Italy, Lega, Forza Italia and minor allies; the &quot;centre-left coalition&quot; composed of the Democratic Party and minor allies; the populist Five Star Movement; and the liberal Action – Italia Viva (also known as &quot;Third Pole&quot;).",
    "published": "October 18, 2025"
  },
  {
    "title": "Democratic Party (Italy) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Democratic_Party_(Italy)",
    "snippet": "In 1995, <strong>Romano Prodi</strong>, a former minister of Industry on behalf of the left-wing faction of Christian Democracy (DC), entered politics and founded The Olive Tree (L&#x27;Ulivo), a centre-left coalition including the PDS, the Italian People&#x27;s Party ...",
    "published": "1 day ago"
  },
  {
    "title": "Fascist Party (PNF) | Definition, Italy, Mussolini, & Symbol | Britannica",
    "url": "https://www.britannica.com/topic/Fascist-Party",
    "snippet": "As early as February 1918, Mussolini advocated the emergence of a dictator—“a man who is ruthless and energetic enough to make a clean sweep”—to confront the economic and political crisis then gripping Italy. Three months later, in a widely reported speech in Bologna, he hinted that he himself might prove to be such a man. The following year the nucleus of a party prepared to support his ambitious idea was formed in Milan.",
    "published": "April 24, 2023"
  }
]