[
  {
    "title": "Google Brain co-founder Samy Bengio joins Apple | AI Business",
    "url": "https://aibusiness.com/companies/google-brain-co-founder-samy-bengio-joins-apple",
    "snippet": "Samy Bengio, Canadian computer scientist and <strong>Google Brain</strong> co-founder, has joined Apple as the company’s research director.",
    "published": "November 7, 2024"
  },
  {
    "title": "Samy Bengio",
    "url": "https://bengio.abracadoudou.com/",
    "snippet": "Keynote talk on &quot;Recent results towards reasoning with LLMs&quot;, Ithaca, NY, USA, September 2025.",
    "published": null
  },
  {
    "title": "Ex-Google AI Scientist Samy Bengio Finds Job at Apple",
    "url": "https://www.techtimes.com/articles/259852/20210504/ex-google-ai-scientist-samy-bengio-job-apple.htm",
    "snippet": "Bengio, who will reportedly lead a new AI research team at <strong>Apple</strong>, ended his 14-year tenure with Google over ethics woes.",
    "published": "May 4, 2021"
  },
  {
    "title": "r/MachineLearning on Reddit: [D] Samy Bengio resigns from Google",
    "url": "https://www.reddit.com/r/MachineLearning/comments/mloj16/d_samy_bengio_resigns_from_google/",
    "snippet": "Apple has hired Samy Bengio, a former AI scientist who resigned in protest of Google&#x27;s firing of two employees, to lead a new AI team under <strong>John Giannandrea</strong>. ... An unofficial community about Apple and all of its devices and software.",
    "published": "April 7, 2021"
  },
  {
    "title": "Fame | Samy Bengio net worth and salary income estimation Oct, 2025 | People Ai",
    "url": "https://peopleai.com/fame/identities/samy-bengio",
    "snippet": "Samy Bengio is a Canadian computer scientist, Senior Director of AI and Machine Learning Research at Apple, and a former long-time scientist at Google known for leading a large group of researchers working in machine learning including adversarial settings. Bengio left Google shortly after the company fired his report, Timnit Gebru, without first notifying him.",
    "published": null
  }
]