[
  {
    "title": "Prime Minister of India - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "snippet": "After Indira Gandhi&#x27;s assassination, her son Rajiv Gandhi took charge until 1989, when a decade with five unstable governments began. This was followed by the full terms of P. V. Narasimha Rao, Atal Bihari Vajpayee, Manmohan Singh, and <strong>Narendra Modi</strong>, who is the current prime minister of India, ...",
    "published": "3 days ago"
  },
  {
    "title": "Narendra Modi - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
    "snippet": "<strong>Narendra Damodardas Modi</strong> (born 17 September 1950) is an Indian politician who has served as the prime minister of India since 2014. Modi was the chief minister of Gujarat from 2001 to 2014 and is the member of parliament (MP) for Varanasi. He is a member of the Bharatiya Janata Party (BJP) ...",
    "published": "2 days ago"
  },
  {
    "title": "Shri Narendra Modi | Bharatiya Janata Party",
    "url": "https://www.bjp.org/shri-narendra-modi",
    "snippet": "On 26th May 2014 <strong>Narendra Modi</strong> took oath as the Prime Minister of India, becoming the first ever PM to be born after India attained Independence. Dynamic, dedicated and determined, <strong>Narendra Modi</strong> reflects the aspiration and hope of over a billion ...",
    "published": "October 30, 2025"
  },
  {
    "title": "Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/",
    "snippet": "<strong>Shri Narendra Modi</strong> was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership.",
    "published": "12 hours ago"
  },
  {
    "title": "Hon'ble Prime Minister of India",
    "url": "https://pmindiawebcast.nic.in/",
    "snippet": "Address at the Inauguration of Sonamarg Tunnel Project · सोनमर्ग सुरंग परियोजना का उद्घाटन ... Inaugurate of Various Railway.. ग्रामीण भारत महोत्सव 2025 ... इस वेबसाईट का निर्माण, विकास, होस्टिंग एवं रख-रखाव द्वारा · Ministry of Electronics and Information Technology",
    "published": "2 weeks ago"
  }
]