[
  {
    "title": "Die Linke - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Die_Linke",
    "snippet": "Through the PDS, the party is the direct descendant of the Marxist–Leninist ruling party of former East Germany, the Socialist Unity Party of Germany (SED). Since October 2024, Die Linke&#x27;s co-chairpersons have been <strong>Ines Schwerdtner and Jan van Aken</strong>. The party holds 64 seats out of 630 in ...",
    "published": "January 7, 2007"
  },
  {
    "title": "Inside Die Linke’s Resurgence",
    "url": "https://jacobin.com/2025/03/die-linke-resurgence-germany-left",
    "snippet": "<strong>Jan van Aken</strong>, Die Linke party leader; Ines Schwerdtner; Heidi Reichinnek; and Gregor Gysi, direct candidate in Berlin, stand under the motto &quot;Everyone wants to govern, we want to change&quot; in Berlin on February 21, 2025.",
    "published": null
  },
  {
    "title": "Who is Heidi Reichinnek, the hard-left ‘Queen of TikTok’ shaking up German politics before election?",
    "url": "https://www.firstpost.com/explainers/heidi-reichinnek-the-hard-left-queen-of-tiktok-german-politics-13864797.html",
    "snippet": "German The Left (Die Linke) party leader <strong>Heidi Reichinnek</strong> speaks during a session of the lower house of parliament Bundestag in Berlin, Germany, January 31, 2025.",
    "published": "February 20, 2025"
  },
  {
    "title": "The Improbable Resurgence of Die Linke",
    "url": "https://jacobin.com/2025/02/die-linke-germany-renewal-strategy/",
    "snippet": "But becoming a party of the working class will take a lot more than a last-minute turnaround at the polls. <strong>Jan van Aken</strong> (L), federal chairman of Die Linke, and member of the Bundestag Gregor Gysi speak at a press conference in Berlin on February ...",
    "published": null
  },
  {
    "title": "After Germany’s Election, the Left Can Hope Again",
    "url": "https://jacobin.com/2025/02/germany-election-die-linke-left",
    "snippet": "Leading the way alongside Reichinnek were confident new faces in the party leadership: <strong>Ines Schwerdtner (formerly editor in chief of the German-language Jacobin) as well as Jan van Aken</strong>.",
    "published": null
  }
]