[
  {
    "title": "Arnon Milchan - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Arnon_Milchan",
    "snippet": "Arnon Milchan (Hebrew: ארנון מילצ&#x27;ן; December 6, 1944) is an Israeli billionaire businessman, film producer and former spy. He has been involved in over 130 full-length motion pictures and is the founder of production company Regency Enterprises. Regency&#x27;s film credits include 12 Years a Slave, JFK, Heat, Fight Club, and Mr.",
    "published": "3 weeks ago"
  },
  {
    "title": "Arnon Milchan",
    "url": "https://www.forbes.com/profile/arnon-milchan/",
    "snippet": "Arnon Milchan owns film and TV production company New Regency Enterprises.",
    "published": null
  },
  {
    "title": "Can Yariv Milchan Revive New Regency? - Puck",
    "url": "https://puck.news/can-yariv-milchan-revive-new-regency/",
    "snippet": "For decades, Arnon Milchan was the sort of Hollywood player that the town made movies about—a longtime spy and Murdoch pal who was the driving force behind auteur-driven classics and populist hits at Regency. Now, years after a Netanyahu-connected scandal, it’s up to his son to reimagine the company in a much-changed Hollywood.",
    "published": "April 29, 2025"
  },
  {
    "title": "About | Regency Enterprises",
    "url": "https://www.newregency.com/about",
    "snippet": "Milchan has also successfully diversified his company’s activities within the sphere of entertainment, most specifically in the realm of television through Regency Television (“Malcom in the Middle” and “The Bernie Mac Show”), and sports where the company was once the largest shareholder of PUMA, the worldwide athletic apparel and show conglomerate based in Germany, which was later sold after a successful re-branding in 2003.",
    "published": null
  },
  {
    "title": "Arnon MILCHAN personal appointments - Find and update company information - GOV.UK",
    "url": "https://find-and-update.company-information.service.gov.uk/officers/RSG4lJ4sJKNhVQjGSGkYibophaQ/appointments",
    "snippet": "Free company information from Companies House including registered office address, filing history, accounts, annual return, officers, charges, business activity",
    "published": null
  }
]