[
  {
    "title": "Jacques Brunel (rugby union) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Jacques_Brunel_(rugby_union)",
    "snippet": "During the 1979–80 French Rugby ... until his retirement at the end of 1987–88 season. He <strong>started coaching immediately after he retired from playing rugby in 1988, where he became the head coach of Auch until 1995</strong>. During his time as coach at the club, he led the team to ...",
    "published": "January 1, 2025"
  },
  {
    "title": "Jacques Brunel | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/12984",
    "snippet": "Brunel <strong>joined the Bordeaux coaching staff in 2016 where he worked as an assistant coach before taking over as the head coach the next season</strong>. After Guy Noves sacking December 2017 Brunel was named as the France national coach.",
    "published": null
  },
  {
    "title": "France rugby coach: Who has led the men's team over the years? - Rugby World",
    "url": "https://www.rugbyworld.com/countries/france-countries/france-rugby-coach-over-the-years-172332",
    "snippet": "This could no more be seen than ... fashion. ... France’s head coach Jacques Brunel (L) <strong>before the Japan 2019 Rugby World Cup quarter-final match against Wales</strong>....",
    "published": "May 30, 2025"
  },
  {
    "title": "Jacques Brunel named new coach of France's national rugby team",
    "url": "https://www.france24.com/en/20171227-rugby-jacques-brunel-named-new-coach-france-national-team",
    "snippet": "Brunel, 63, joins the national set-up from Top 14 side Bordeaux-Begles <strong>just five weeks before France face Ireland in their Six Nations opener</strong>. His contract stretches to the 2019 World Cup in Japan, Laporte told a press conference at a Paris ...",
    "published": "December 27, 2017"
  },
  {
    "title": "France national rugby union team coaches - FamousFix.com list",
    "url": "https://m.famousfix.com/list/france-national-rugby-union-team-coaches",
    "snippet": "Overview: Marc Lièvremont (born ... back-row forward for France, gaining 25 caps from ... ... Overview: Jacques Brunel (<strong>born 14 January 1954</strong>) is a French rugby union coach and former player....",
    "published": null
  }
]