[
  {
    "title": "Manmohan Singh - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Manmohan_Singh",
    "snippet": "Manmohan Singh (26 September 1932 – 26 December 2024) was an Indian economist and statesman who served as the prime minister of India from <strong>2004 to 2014.</strong> He was the fourth longest-serving prime minister after Jawaharlal Nehru, Indira Gandhi, and Narendra Modi.",
    "published": "2 days ago"
  },
  {
    "title": "Dr. Manmohan Singh | Prime Minister of India",
    "url": "https://www.pmindia.gov.in/en/former_pm/dr-manmohan-singh-2/",
    "snippet": "From <strong>1991 to 1996</strong>, Dr. Singh served as India’s Finance Minister, marking a turning point in the nation’s economic history. His role in ushering in a comprehensive policy of economic reforms remains globally celebrated.",
    "published": null
  },
  {
    "title": "Manmohan Singh | Biography, Reforms, Political Career, & Death | Britannica",
    "url": "https://www.britannica.com/biography/Manmohan-Singh",
    "snippet": "Manmohan Singh (born September 26, 1932, Gah, West Punjab [now in Pakistan]—died December 26, 2024, New Delhi, India) was an Indian economist and politician who served as prime minister of India from <strong>2004 to 2014.</strong>",
    "published": "February 24, 2005"
  },
  {
    "title": "DR. MANMOHAN SINGH",
    "url": "https://inc.in/our-inspiration/dr-manmohan-singh",
    "snippet": "This story of unprecedented growth and prosperity is the story of Dr Singh’s premiership from <strong>2004-2014</strong>. But it began during his tenure as Finance Minister from 1991-1996 when the script first began to take shape.",
    "published": null
  },
  {
    "title": "Manmohan Singh: Former Indian Prime Minister dies at 92",
    "url": "https://www.bbc.com/news/articles/cyrrd4nlr0yo",
    "snippet": "Manmohan Singh was a man acutely aware of his lack of a political base. &quot;It is nice to be a statesman, but in order to be a statesman in a democracy you first have to win elections,&quot; he once said. When he tried to win election to India&#x27;s lower house in 1999, he was defeated. He sat instead in the upper house, chosen by his own Congress party. The same happened in 2004, when Singh was first appointed prime minister after Congress president Sonia Gandhi turned down the post - apparently to protect the party from damaging attacks over her Italian origins.",
    "published": "December 26, 2024"
  }
]