[
  {
    "title": "Micheál Martin - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Miche%C3%A1l_Martin",
    "snippet": "Martin was awarded &quot;Politician of the Year&quot; by the Journal for his performance and election result. <strong>He was elected again as Taoiseach in a 95–76 vote by the Dáil on 23 January 2025</strong> following a coalition agreement between Fianna Fáil, Fine Gael and with the support of several independent TDs.",
    "published": "2 weeks ago"
  },
  {
    "title": "Fianna Fáil presidential election review could be ‘resignation territory’ for Micheál Martin",
    "url": "https://www.irishexaminer.com/news/politics/arid-41760008.html",
    "snippet": "Taoiseach’s leadership comes under further pressure as Fianna Fáil TDs and senators demand to know when the party first heard about Jim Gavin&#x27;s issue with a former tenant · Taoiseach Micheál Martin TD with Fianna Fáil&#x27;s presidential candidate Jim Gavin speaking to the media at the National Ploughing Championships in Co Offaly in September. File picture: Dan Linehan · Mon, 15 Dec, 2025 - 01:00 ·",
    "published": "1 day ago"
  },
  {
    "title": "Taoiseach denies leadership in trouble as FF presidential election review to be finally shared",
    "url": "https://www.irishexaminer.com/news/politics/arid-41760875.html",
    "snippet": "Tue, 16 Dec, 2025 - 09:44 · Louise ... Martin has confirmed that <strong>he has finally received the Fianna Fáil presidential election review and that it will be shared with the parliamentary party</strong>....",
    "published": "2 hours ago"
  },
  {
    "title": "Micheál Martin confident he will remain as Fianna Fáil leader as he receives presidential report - Irish Mirror",
    "url": "https://www.irishmirror.ie/news/irish-news/politics/micheal-martin-confident-remain-fianna-36408836",
    "snippet": "11:17, 16 Dec 2025 · View Image · Taoiseach Micheal Martin speaking to reporters before a Cabinet meeting at Government Buildings, Dublin. Photo by: Cillian Sherlock/PA Wire(Image: PA) Taoiseach Micheál Martin said he isn’t concerned his leadership is in trouble after receiving a review into his party’s failed presidential campaign.",
    "published": "26 minutes ago"
  },
  {
    "title": "FF presidential election review submitted to Micheál Martin for consideration",
    "url": "https://www.thejournal.ie/ff-presidential-review-submitted-to-micheal-martin-for-consideration-6904862-Dec2025/",
    "snippet": "Martin championed Jim Gavin’s presidential run, which ended in the ex-Dublin football manager dramatically withdrawing from the race. 8.25am, 16 Dec 2025 · 450 · Share options · Copy link · Email · Facebook · X · MICHEÁL MARTIN HAS received a report on the review into his party’s presidential pick.",
    "published": "3 hours ago"
  }
]