[
  {
    "title": "Besiktas, Fenerbahce, Galatasaray to race for Dortmund's Emre Can: Report - Türkiye Today",
    "url": "https://www.turkiyetoday.com/sports/besiktas-fenerbahce-galatasaray-to-race-for-dortmunds-emre-can-report-3211118",
    "snippet": "German international midfielder of Turkish origin Emre Can, currently playing for Borussia Dortmund in the Bundesliga, has reportedly drawn interest from Türkiye’s three leading football clubs: <strong>Besiktas, Fenerbahce and Galatasaray</strong>, according ...",
    "published": "1 week ago"
  },
  {
    "title": "Emre Can - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Emre_Can",
    "snippet": "On 29 October 2016, Can scored ... to 1st position in the Premier League for the first time under Jürgen Klopp. <strong>On 4 December, Can scored in Liverpool&#x27;s 4–3 defeat to Bournemouth</strong>....",
    "published": "5 days ago"
  },
  {
    "title": "Emre Can prepares his farewell to Borussia Dortmund | Fichajes.net",
    "url": "https://www.fichajes.net/en/news/emre-can-prepares-his-farewell-to-borussia-dortmund-20251207.html",
    "snippet": "▪️The three Turkish giants are preparing official bids in January for the 31‑year‑old defender. pic.twitter.com/ZdqEpJkHi2 — Ekrem KONUR (@Ekremkonur) December 7, 2025 · Within Borussia Dortmund, the renewal of the player is not ruled out, but it also does not seem to be a priority. The continuity of Emre Can depends largely on the club&#x27;s sports objectives, especially regarding their qualification for European competitions. If the team fails to secure international presence for the next season, the management could opt to reduce the wage bill and rejuvenate the squad, decisions that would directly impact the captain&#x27;s future.",
    "published": "1 week ago"
  },
  {
    "title": "Emre Can | Borussia Dortmund | Player Profile | Bundesliga",
    "url": "https://www.bundesliga.com/en/bundesliga/player/emre-can",
    "snippet": "All official season statistics and career data on Emre Can. With news, videos and goals from Emre Can in the Bundesliga this season",
    "published": null
  },
  {
    "title": "Emre Can Borussia Dortmund Midfielder, Profile & Stats | Premier League",
    "url": "https://www.premierleague.com/players/5001/Emre-Can/overview",
    "snippet": "View the player profile of Borussia Dortmund Midfielder Emre Can, including stats and videos, on the official website of the Premier League.",
    "published": null
  }
]