[
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (EXCLUSIVE)",
    "url": "https://variety.com/2025/film/global/mike-downey-downey-ink-berlin-slate-1236306279/",
    "snippet": "Producer Mike Downey, who is chair of the European Film Academy and whose co-production “Girls on Wire” is in Berlin competition, has <strong>unveiled a diverse slate of films from his production company Downey Ink at the European Film Market</strong>.",
    "published": "February 16, 2025"
  },
  {
    "title": "Mike Downey, European Film Academy Chair, Unveils Slate of Projects Under Downey Ink Banner (Exclusive) - IMDb",
    "url": "https://www.imdb.com/news/ni65127703/",
    "snippet": "Producer Mike Downey, who is chair of the European Film Academy and whose co-production “Girls on Wire” is in Berlin competition, has <strong>unveiled a diverse slate of films from his production company Downey Ink at the European Film Market</strong>.",
    "published": null
  },
  {
    "title": "Board Membership — Official website of Mike Downey, a film producer, writer, director, commentator and activist",
    "url": "http://www.mikedowney.eu/board-membership/",
    "snippet": "Founded in 1988, the European Film Academy now unites more than 3,000 European film professionals with the common aim of promoting Europe’s film culture. Mike first joined the board of the European Film Academy 15 years ago and has served alongside a broad range of European film makers including Istvan Szabo, Volker Schloendorff, Wim Wenders, Nikita Mikhalkov, Pawel Pawlikowski, Agnes Jaoui, Krzystof Zanussi, and David Mackenzie .",
    "published": null
  },
  {
    "title": "Mike Downey • Producer and chairman of the European Film Academy - Cineuropa",
    "url": "https://cineuropa.org/en/interview/440528/",
    "snippet": "Mike Downey OBE is a producer and the chairman of the European Film Academy, as well as being one of the founding board members of the International Coalition for Filmmakers at Risk (ICFR).",
    "published": null
  },
  {
    "title": "Board Members - European Film Academy",
    "url": "https://www.europeanfilmacademy.org/about/board/board-members/",
    "snippet": "Mike Downey, producer, and CEO of Film and Music Entertainment (F&amp;ME), launched his independent UK production company on the Frankfurt DAX in 2009. Since then, he has <strong>produced more than 40 feature films</strong>, with producing partner Sam Taylor and company chairman Stephen Daldry.",
    "published": "June 20, 2025"
  }
]