[
  {
    "title": "Mauricio Pochettino - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Mauricio_Pochettino",
    "snippet": "On 29 May 2023, it was announced Pochettino would be appointed as head coach of Chelsea on 1 July 2023, on a <strong>two-year contract with an option to extend for another year</strong>. His first match in charge was against Liverpool at Stamford Bridge on 13 August 2023, which ended in a 1–1 draw.",
    "published": "2 weeks ago"
  },
  {
    "title": "Mauricio Pochettino Manager Profile, Record & Stats | Premier League",
    "url": "https://www.premierleague.com/managers/4632/Mauricio-Pochettino/overview",
    "snippet": "After a difficult start to the 2019/20 Premier League campaign, Pochettino <strong>departed the club in November 2019.</strong> After a spell in charge of his former club Paris Saint-Germain, he returned to the Premier League at Chelsea ahead of the 2023/24 season.",
    "published": null
  },
  {
    "title": "Mauricio Pochettino leaves Chelsea after one year as manager of the Premier League club | AP News",
    "url": "https://apnews.com/article/mauricio-pochettino-chelsea-manager-36f9f445d312598f9963484ee52de493",
    "snippet": "FILE - Newly appointed Chelsea manager Mauricio Pochettino addresses the media during a press conference at Stamford Bridge Stadium in London, Friday, July 7, 2023. (AP Photo/Kirsty Wigglesworth, File) ... Chelsea’s head coach Mauricio Pochettino, left, reacts during the English Premier League soccer match between Arsenal and Chelsea at Emirates Stadium in London, Tuesday, April 23, 2024.",
    "published": "May 21, 2024"
  },
  {
    "title": "\"Things happen\" - Mauricio Pochettino opens up on 'different reasons' for Chelsea exit",
    "url": "https://www.si.com/onsi/soccer/chelsea/news/things-happen-mauricio-pochettino-opens-up-on-different-reasons-for-chelsea-exit-01jp8dyd67s7",
    "snippet": "Mauricio Pochettino has reflected on his time as Chelsea head coach after leaving the club last summer after just <strong>one season</strong>.",
    "published": "March 14, 2025"
  },
  {
    "title": "Mauricio Pochettino leaves Chelsea by mutual consent - The Athletic",
    "url": "https://www.nytimes.com/athletic/5495869/2024/05/21/mauricio-pochettino-leaves-chelsea/",
    "snippet": "Mauricio Pochettino has left his position as Chelsea head coach by mutual consent after <strong>less than 11 months</strong> in charge. Chelsea’s decision to part ways with the 52-year-old Argentine comes following the conclusion of an internal review into ...",
    "published": "May 22, 2024"
  }
]