[
  {
    "title": "Peter Norvig: Today's Most Pressing Questions in AI Are ...",
    "url": "https://hai.stanford.edu/news/peter-norvig-todays-most-pressing-questions-ai-are-human-centered",
    "snippet": "The AI expert, who joins Stanford HAI as a Distinguished Education Fellow, discusses building inclusive education and broadening access to students. Artificial intelligence expert Peter Norvig is <strong>joining the Stanford Institute for Human-Centered AI this fall as a Distinguished Education Fellow</strong>, ...",
    "published": null
  },
  {
    "title": "Peter Norvig - Stanford Institute for Human-Centered Artificial Intelligence (HAI) | LinkedIn",
    "url": "https://www.linkedin.com/in/pnorvig",
    "snippet": "In this next episode of AI in Motion, I ride with longtime friend Greg Corrado, co-founder of the Google Brain team. We talk about neuroscience… ... By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. ... By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. ... “Peter is well known to most in this field as a great visionary.",
    "published": "1 week ago"
  },
  {
    "title": "Peter Norvig Redefines AI Success with Call For Human-Centered Solutions | Institute for Experiential AI",
    "url": "https://ai.northeastern.edu/news/peter-norvig-redefines-ai-success-with-call-for-human-centered-solutions",
    "snippet": "Norvig, who is a distinguished ... into a presentation that was mainly pragmatic: <strong>Organizations that focus too narrowly on metrics like model accuracy may lose sight of the</strong> ......",
    "published": null
  },
  {
    "title": "Peter Norvig - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Peter_Norvig",
    "snippet": "Peter Norvig (born 14 December 1956) is an American computer scientist and <strong>Distinguished Education Fellow</strong> at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google.",
    "published": "3 weeks ago"
  },
  {
    "title": "\"What is Human-Centered AI?\" - Valuable Insights from Peter Norvig from Google and Stanford HAI - YouTube",
    "url": "https://www.youtube.com/watch?v=G5BRhZIAl_Q",
    "snippet": "An incredible opportunity to have Peter Norvig, a Researcher at Google and Education Fellow at the Stanford Institute for Human-Centered Artificial Intellige...",
    "published": "November 10, 2023"
  }
]