[
  {
    "title": "Draft EU resolution wants ECB to stop focusing on climate issues - Green Central Banking",
    "url": "https://greencentralbanking.com/2025/12/15/draft-eu-resolution-wants-ecb-to-stop-focusing-on-climate-issues/",
    "snippet": "European Central Bank (ECB) President <strong>Christine Lagarde</strong> announced the creation of a new climate change centre to coordinate work on climate change across the Bank. “Climate change affects all of our policy areas,” she said.",
    "published": "16 hours ago"
  },
  {
    "title": "'Europe's existential crisis': ECB's Lagarde calls for urgent reforms | Euronews",
    "url": "https://www.euronews.com/business/2025/12/10/europes-existential-crisis-ecbs-lagarde-calls-for-urgent-reforms",
    "snippet": "European Central Bank (ECB) President <strong>Christine Lagarde</strong> has issued a stark warning over the European Union’s competitiveness, calling on the European Commission to urgently dismantle internal barriers that are stifling innovation, productivity, ...",
    "published": "1 week ago"
  },
  {
    "title": "President of the European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/President_of_the_European_Central_Bank",
    "snippet": "In his final appearance (his 35th) before the European Parliament, Trichet called for more political unity, including; significant new powers to be granted to the ECB, the establishment of an executive branch with a European Finance Ministry and greater oversight powers for the European Parliament. He also asserted that the ECB&#x27;s role in maintaining price stability throughout the financial crisis and the oil price rises should not be overlooked. He stated, in response to a question from a German newspaper attacking the ECB&#x27;s credibility following its bond-buying;",
    "published": "September 25, 2025"
  },
  {
    "title": "European Central Bank",
    "url": "https://www.ecb.europa.eu/",
    "snippet": "Speech by <strong>Christine Lagarde</strong>, President of the ECB, at the Hearing of the Committee on Economic and Monetary Affairs of the European Parliament ... Philip R. Lane: Inflation deviations and monetary policy · Keynote speech by Philip R. Lane, ...",
    "published": null
  },
  {
    "title": "European Central Bank - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/European_Central_Bank",
    "snippet": "In May 2025, the European Central Bank launched a platform involving around 70 market participants to test digital euro payment functionalities and use cases. The initiative includes banks, fintechs, and merchants, aiming to simulate a digital euro ecosystem and support the development of future payment solutions. As of August 2025, enabling legislation has not been passed by European lawmakers to enable the digital euro to become operational. Bank president Lagarde has urged lawmakers to &quot;seize the &#x27;euro moment&#x27;&quot; and rapidly put in place a legislative framework to &quot;pave the way for the potential introduction of a digital euro,&quot; in order to address the considerable risk posed by U.S.",
    "published": "2 days ago"
  }
]