[
  {
    "title": "Fabien Galthié - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Fabien_Galthi%C3%A9",
    "snippet": "Galthié <strong>became the coach of Stade Français in 2004 after head coach Nick Mallet departed the Paris club</strong>. Galthié was contacted by Max Guazzini to take up the coaching job. In the first season, Stade Français made it to the final of both the Top 14 and Heineken Cup finals, but were beaten ...",
    "published": "1 month ago"
  },
  {
    "title": "Fabien Galthie: Ten things you should know about the France head coach",
    "url": "https://www.rugbyworld.com/countries/france-countries/fabien-galthie-ten-things-you-should-know-about-the-france-head-coach-134810",
    "snippet": "Fabien Galthie has overseen significant improvements in the France side since taking over as head coach following the 2019 Rugby World Cup.",
    "published": "January 12, 2024"
  },
  {
    "title": "Fabien Galthié",
    "url": "https://grokipedia.com/page/Fabien_Galthi%C3%A9",
    "snippet": "<strong>In 2004, Galthié was appointed head coach of Stade Français in Paris, a role he held until 2008</strong>, succeeding Nick Mallett and leveraging his prior playing experience with the club to implement a structured approach.[30] Under his leadership, ...",
    "published": null
  },
  {
    "title": "Fabien Galthié | Ultimate Rugby Players, News, Fixtures and Live Results",
    "url": "https://www.ultimaterugby.com/player/view/11932",
    "snippet": "<strong>In 2004, he became the coach of Stade Francais after Nick Mallet departed the club</strong>. In his first season, SF made it to the final of both the Top 14 and Heineken Cup finals, but were beaten in both finals.The following season SF were beaten by ...",
    "published": null
  },
  {
    "title": "Fabien Galthié, the perfectionist masterminding France's Rugby World Cup tilt",
    "url": "https://www.france24.com/en/sport/20230921-fabien-galthi%C3%A9-the-perfectionist-masterminding-france-s-rugby-world-cup-tilt",
    "snippet": "<strong>Having played for France in four Rugby World Cups, and lost a final, Fabien Galthié is now focused on coaching the home nation to its maiden Webb Ellis Cup</strong>. In his three years at the helm, the former…",
    "published": "September 21, 2023"
  }
]