[
  {
    "title": "Katerina Sakellaropoulou - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Katerina_Sakellaropoulou",
    "snippet": "Katerina N. Sakellaropoulou (Greek: Κατερίνα Ν. Σακελλαροπούλου [kateˈrina sacelaroˈpulu]; born 30 May 1956) is a Greek retired judge who served as the <strong>president of Greece from 2020 to 2025</strong>. She was elected by the Hellenic Parliament to succeed Prokopis Pavlopoulos ...",
    "published": "October 2, 2025"
  },
  {
    "title": "Katerina Sakellaropoulou — Council of Women World Leaders",
    "url": "https://www.councilwomenworldleaders.org/katerina-sakellaropoulou",
    "snippet": "Katerina Sakellaropoulou was <strong>elected President of Greece and assumed the office in 2020 until 2025</strong>.She was the first female president of Greece.",
    "published": null
  },
  {
    "title": "KATERINA SAKELLAROPOULOU - Aρχική",
    "url": "https://www.presidency.gr/en/katerina-sakellaropoulou-en/",
    "snippet": "KATERINA SAKELLAROPOULOU Back to Former Presidents Katerina Sakellaropoulou (2020-2025) biography Katerina N. Sakellaropoulou was born in Thessaloniki in 1956. She is a graduate of the Arsakeio School and has earned a degree from the University of Athens Law School (1978).",
    "published": "March 23, 2025"
  },
  {
    "title": "Katerina Sakellaropoulou – POLITICO",
    "url": "https://www.politico.eu/person/katerina-sakellaropoulou/",
    "snippet": "<strong>Katerina Sakellaropoulou will take up the post of president in March</strong>.",
    "published": null
  },
  {
    "title": "Katerina Sakellaropoulou: first-elect female President of the Hellenic Republic - International Alliance of Women",
    "url": "https://womenalliance.org/katerina-sakellaropoulou-first-elect-female-president-of-the-hellenic-republic/",
    "snippet": "International Alliance of Women congratulates Katerina Sakellaropoulou, a high court judge, a human rights advocate and an expert in environmental and constitutional law for being the <strong>first-elect female President of Greece</strong>.",
    "published": "February 26, 2020"
  }
]