[
  {
    "title": "Morena (political party) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Morena_(political_party)",
    "snippet": "The National Regeneration Movement ... ([moˈɾena]), is a left-wing political party in Mexico. <strong>Founded in 2011 by Andrés Manuel López Obrador as a civil association and registered as a political party in 2014</strong>, it emerged from López Obrador&#x27;s break with the Party of the ...",
    "published": "5 days ago"
  },
  {
    "title": "Morena | Political Party, Mexico, Andrés Manuel López Obrador, & Claudia Sheinbaum | Britannica",
    "url": "https://www.britannica.com/topic/Morena-political-party",
    "snippet": "The party <strong>made its electoral debut in 2015,</strong> earning more than 8 percent of the vote. That year Morena won 14 district seats and 21 proportional representation seats, forming the first Morenista parliamentary group, with 35 members, in the 63rd ...",
    "published": "February 25, 2025"
  },
  {
    "title": "How Morena Broke Mexico’s Glass Ceiling — International Relations Review",
    "url": "https://www.irreview.org/articles/2025/3/7/how-morena-broke-mexicos-glass-ceilingnbsp",
    "snippet": "Claudia Sheinbaum of the far-left ... Obrador, widely known by his initials AMLO, <strong>founded the Morena party as a personal campaign vehicle for himself and his allies in 2012.</strong>...",
    "published": "March 8, 2025"
  },
  {
    "title": "Movimiento de Regeneración Nacional (Morena) - Explainer | Wilson Center",
    "url": "https://www.wilsoncenter.org/article/movimiento-de-regeneracion-nacional-morena-explainer",
    "snippet": "Morena, Movimiento de Regeneración Nacional (National Regeneration Movement), was <strong>created in 2014 as Andrés Manuel López Obrador (AMLO) led an exodus of politicians from across the entire political spectrum into a new political party</strong>.",
    "published": null
  },
  {
    "title": "A Look Inside Mexico’s Ruling Party",
    "url": "https://www.americasquarterly.org/article/a-look-inside-mexicos-ruling-party/",
    "snippet": "There’s a history of this kind of in-person activity at the party. It is understood that López Obrador went from being a perennial presidential election loser to an unstoppable force by spending his years in the political wilderness visiting each of Mexico’s 2,477 municipalities at least once. Sheinbaum and the Morena leadership have instructed officials, legislators, and party members to continue this kind of permanent campaigning.",
    "published": "November 18, 2024"
  }
]